[{"link":"https://nmac.to/blog/caret-1-1-0/","image":"https://nmac.to/wp-content/uploads/2016/03/Caret.png","title":"Caret 1.1.0 – Markdown Editor for Mac","content":"Caret is a Markdown editor with a beautifully simple interface that focuses on usability while still providing advanced features for power users.   FEATURES Code highlighting for fenced code blocks. Auto-completion of repetitive formatting tasks. Context Commands: Hit + Space to see context commands or spelling suggestions. Preview: Hit + P to see a preview […]"},{"link":"https://nmac.to/blog/warhammer-arcane-magic-1-0/","image":"https://nmac.to/wp-content/uploads/2016/03/Warhammer.Arcane.Magic_.png","title":"Warhammer: Arcane Magic 1.0 – A turn-based tactical digital board game","content":"Warhammer: Arcane Magic is a turn-based tactical digital boardgame that will challenge even the most veteran gamers. Made by the independent Norwegian developer “Turbo Tape Games”, our game development history has roots from the very beginning of PC gaming.   Arcane Magic is set in the Warhammer Fantasy Battles world, and will see you journey […]"},{"link":"https://nmac.to/blog/soul-axiom-1-0/","image":"https://nmac.to/wp-content/uploads/2016/03/Soul.Axiom_.png","title":"Soul Axiom 1.0 – A first-person story-driven adventure puzzle game","content":"Explore Soul Axiom’s rich environments and immersive story to unravel the mystery of your life, and your digital afterlife. You will be taken on an intriguing voyage of discovery, through beautiful, haunting locations, facing challenges that will lead you into danger on your mission to unlock your identity, your story, your mystery. But beware: some […]"},{"link":"https://nmac.to/blog/gaget-1-2-1/","image":"https://nmac.to/wp-content/uploads/2015/11/GAget.png","title":"GAget 1.2.1 – A simple widget for Google Analyics","content":"GAget lets you check your Google Analytics stats in seconds! Your most important numbers are just a swipe away: GAget puts your Analytics data in the Notification Center.   GAget contains the following information about your profiles: Sessions Users Page views Bounce rate Percent of new visitors Average time on site Top 8 countries your […]"},{"link":"https://nmac.to/blog/antetype-1-7-2/","image":"https://nmac.to/wp-content/uploads/2014/09/Antetype.png","title":"Antetype 1.7.2 – Interface design tool","content":"Antetype UI designer is a brand new, ground-breaking design application that supports user-interface designers at every step of their work. Design beautiful interfaces, invent new widgets, style them, and put it all together in an interactive prototype!   Features: Multiple Looks and Feels: Looks and feels are stored globally in the shared library and can […]"},{"link":"https://nmac.to/blog/akvis-makeup-4-0-547/","image":"https://nmac.to/wp-content/uploads/2016/03/AKVIS.MakeUp.png","title":"AKVIS MakeUp 4.0.547 – Automatically retouch skin-tone defects","content":"AKVIS MakeUp automatically smoothes small defects on the skin, making it radiant, beautiful, pure and even, as you can see on artistic images. The software is ideal for processing marriage photographs or graduation party photos. AKVIS MakeUp can be useful to the fans of social networks and blogs to improve their profile pictures and add […]"},{"link":"https://nmac.to/blog/ssh-tunnel-16-03/","image":"https://nmac.to/wp-content/uploads/2015/03/SSH.Tunnel.png","title":"SSH Tunnel 16.03 – Easily manage and control ssh tunnels","content":"SSH Tunnel allows you to easily manage and precisely control your ssh tunnels.   SSH Tunnel is able to remember the ssh login password and save it to OS X’s keychain. Furthermore, SSH Tunnel is designed to automatically reconnect when your Mac is waking up from sleep.   Notable Features: Auto launch when log in […]"},{"link":"https://nmac.to/blog/franz-0-9-6/","image":"https://nmac.to/wp-content/uploads/2016/03/Franz.png","title":"Franz 0.9.6 – A free messaging app for Slack, Facebook Messenger, WhatsApp and more","content":"Franz is a free messaging app/former Emperor of Austria and combines chat & messaging services into one application. He currently supports Slack, HipChat, Facebook Messenger, Telegram, WhatsApp, Google Hangouts, Skype and Grape. You can download Franz for Mac and he is soon coming to Windows as well.   Franz allows you to add every service several […]"},{"link":"https://nmac.to/blog/x-rebirth-home-of-light-4-0/","image":"https://nmac.to/wp-content/uploads/2016/03/X-REBIRTH.png","title":"X REBIRTH: HOME OF LIGHT 4.0 – Explore and challenges Simulation & Action Game","content":"In the distant future, the X universe faces a period of profound and irrevocable change. While the universe stumbles towards an uncertain future, countless adventures await as new enemies rise in search of power. Enter a young adventurer and his unlikely female ally traveling in an old, battered ship with a glorious past – two […]"},{"link":"https://nmac.to/blog/we-are-the-dwarves/","image":"https://nmac.to/wp-content/uploads/2016/03/We-Are-The-Dwarves.png","title":"We Are The Dwarves 1.0 – An action-based tactical adventure game","content":"The Dwarven stars are slowly dying– putting the race at the edge of extinction. Deliverance is poised upon three Dwarven astronauts who are sent on an expedition to find a new star in the depths of the Endless Stone. Take control of Forcer, Smashfist, and Shadow as they explore the unknown territories of the stone […]"}]