[{"link":"https://nmac.to/blog/desk-1-4-1/","image":"https://nmac.to/wp-content/uploads/2015/02/Desk.png","title":"Desk 1.4.1 – A Writing, Blogging, and Notetaking App","content":"Desk is a premium writing experience for all types of writers.   Whether you’re a casual enthusiast, the weekend writer, blogger, or digital publishing professional, you’ll find Desk to be a much-needed breath of fresh air.   Designed to marry both function and form, it is the desktop publishing client that you’ve always wanted: Simple, […]"},{"link":"https://nmac.to/blog/blogtouch-1-3-0/","image":"https://nmac.to/wp-content/uploads/2015/08/BlogTouch.png","title":"BlogTouch 1.3.0 – Blogger/Blogspot editor for your Mac","content":"BlogTouch is a friendly Blogger/Blogspot editor for your Mac. It’s equipped with everything you need to manage your blogs: write, publish, update or share posts and moderate comments.   Be more productive and efficient with this powerful and straightforward tool – because at the end of the day, we all have something to share.   […]"},{"link":"https://nmac.to/blog/alphamail-1-0/","image":"https://nmac.to/wp-content/uploads/2015/08/AlphaMail.png","title":"AlphaMail 1.0 – Read and Send Mail from the Menu Bar (SMTP and IMAP)","content":"Tired of the hassle of checking your emails? Sick of having to go through 30 steps to send an email? Then this app is for you! AlphaMail is a small, lightweight email client that presents your emails in a popover from the menu bar.   It’s a major hassle and takes loads of time to […]"},{"link":"https://nmac.to/blog/whispering-willows-1-0/","image":"https://nmac.to/wp-content/uploads/2015/08/Whispering.Willows.png","title":"Whispering Willows 1.0 – Help Elena find her father in the horror/adventure puzzle game","content":"Young Elena Elkhorn embarks on a harrowing journey to find her missing father and discover the secrets of the Willows Mansion. Aiding her journey is a unique amulet, she received from her father, which allows her to astral project her spirit into a ghostly-realm and communicate with the dead. Play as Elena to find her […]"},{"link":"https://nmac.to/blog/voila-3-9-1/","image":"https://nmac.to/wp-content/uploads/2014/02/Voila.png","title":"Voila 3.9.1 – Capture, annotate, organize, and share media","content":"Voila is a screen-capture, recording, and annotation tool that is a full-featured replacement for Mac’s screen-capture and screen-recording capabilities. It has a large and robust set of editing, organizing, annotation, and effects tools that allows the user to create and add details to screenshots, tutorials, videos, and presentations.   Voila lets you capture any shape, […]"},{"link":"https://nmac.to/blog/source-1-3-2/","image":"https://nmac.to/wp-content/uploads/2015/07/Source.png","title":"Source 1.3.2 – System-wide code-snippet manager","content":"Source is a powerful code-snippet manager that stores the most valuable pieces of code for reuse in different projects many times.   Source uses syntax highlighting for over 110 languages.   Languages: Abap, Abc, ActionScript, Ada, Apache Conf, Applescript, Ascii Doc, Assembly x86, Autohotkey, Batchfile, C/C++, C9 Search, Cirru, Clojure, Cobol, Coffee, Coldfusion, C#, CSS, […]"},{"link":"https://nmac.to/blog/pinegrow-web-designer-2-2/","image":"https://nmac.to/wp-content/uploads/2015/04/Pinegrow.Web_.Designer.png","title":"Pinegrow Web Designer 2.2 – Mockup and design webpages faster","content":"Pinegrow Web Designer is desktop app that lets you mockup and design webpages faster with multi-page editing, CSS and LESS styling, and smart components for Bootstrap, Foundation, Angular JS, and WordPress.   Version 2.2: Bootstrap and WordPress Blocks The biggest news is that Pinegrow now has a set of ready-made Bootstrap blocks for quickly building […]"},{"link":"https://nmac.to/blog/pdfexplode-1-1/","image":"https://nmac.to/wp-content/uploads/2015/08/PDFExplode.png","title":"PDFExplode 1.1 – Extract chapters and sections from PDF documents using the Table of Contents","content":"PDFExplode lets you explode your large PDF into many PDFs. Extract pages corresponding to any Table of Contents (TOC) entry in your PDF. For example, extract PDF of any or each chapter in a long PDF text or manual.   Features: Store these exploded PDFs in database apps like DevonThink for faster & more precise […]"},{"link":"https://nmac.to/blog/grays-anatomy-premium-edition-1-5/","image":"https://nmac.to/wp-content/uploads/2015/08/Grays-Anatomy-Premium-Edition.png","title":"Gray’s Anatomy Premium Edition 1.5 – The renowned classic anatomical book by Henry Gray","content":"‘Gray’s Anatomy‘, the renowned classic anatomical book by Henry Gray was first published in 1858 and is considered by many to be one of the most iconic and significant medical books of all time. Gray’s Anatomy is now available on the Mac using the highest resolution images possible. (This version of Gray’s Anatomy has been […]"},{"link":"https://nmac.to/blog/fractured-empire-1-0/","image":"https://nmac.to/wp-content/uploads/2015/08/Fractured.Empire.png","title":"Fractured Empire 1.0 – 3D turn-based strategy wargame","content":"Fractured Empire is a 3D turn-based strategy wargame that puts you in brigade-level control of futuristic infantry and armored companies, as well as huge super-vehicles. This is warfare on a massive scale that will appeal to those who enjoy games that provide both a strategic and tactical challenge, such as the Total War PC game […]"}]