[{"link":"https://nmac.to/blog/cisdem-documentreader/","image":"https://nmac.to/wp-content/uploads/2016/02/DocumentReader.png","title":"Cisdem DocumentReader 5.5.1 – Read, print, and save WPD, WPS, XPS, VISIO, and PDF files","content":"Cisdem DocumentReader enables you to read WPD, WPS, XPS, VISIO, PDF and gives you a fantastic reading experience using different viewing styles with toolbar consisting view mode, searching pane, page navigation, zoom, rotate, save, copy, etc. You can even personalize the toolbar according to your mind. Also it lets you easily print WPD, WPS, XPS, […]"},{"link":"https://nmac.to/blog/cisdem-pdfmaster/","image":"https://nmac.to/wp-content/uploads/2020/08/Cisdem-PDFMaster.png","title":"Cisdem PDFMaster 4.1.0 – Edit and Convert PDF","content":"PDFMaster is a complete PDF software solution that lets you edit PDF files, convert normal or scanned PDF files, sign, split, merge, compress, extract, and encrypt PDF files. Comes with an intuitive interface, which places commonly-used functionality at your fingertips, you’ll be a PDF Master in no time.   Convert and OCR PDF for Easy […]"},{"link":"https://nmac.to/blog/url-extractor/","image":"https://nmac.to/wp-content/uploads/2021/03/URL_Extractor_4.png","title":"URL Extractor 4.8 – Batch process files, extract URLs","content":"URL Extractor is a Cocoa application to extract email addresses and URLs from files, from the Web, and also looking via search engines. It can start from a single Web page and navigate all the links inside looking for emails or URLs to extract, and save all on the user HD. It can also extract […]"},{"link":"https://nmac.to/blog/color-palette-from-image/","image":"https://nmac.to/wp-content/uploads/2015/02/Color.Palette.png","title":"Color Palette from Image 2.1 – Create a color palette from an image","content":"Color Palette from Image allows you to create a color palette of an image.   Just drag and drop the image on the window, and save the palette in the Color Panel. You can to save the color palette to a file and use it on another Mac too.   Features: Generates a color palette […]"},{"link":"https://nmac.to/blog/versatil-markdown/","image":"https://nmac.to/wp-content/uploads/2017/09/Versatil-Markdown.png","title":"Versatil Markdown 2.1.4 – Markdown/CommonMark Hypernotebook editor","content":"Versatil Markdown is a hypernotebook built around Markdown/CommonMark, with 1Password integration, HTML/CSS support, syntax highlighting, frictionless keyboard flow, smart drag-n-drop insertion, multiple themes, document aliasing, and more.   Version 2.1.4: “File -> Export” now works again Fix possible crash when parsing front matter   Intel, 64-bit processor macOS 10.14 or later    "},{"link":"https://nmac.to/blog/cleanup-my-system/","image":"https://nmac.to/wp-content/uploads/2021/08/Cleanup-My-System.png","title":"Cleanup My System 1.13 – Cleans Your System Effectively","content":"Restore system speed, improve productivity, free up storage space & get the best performance from your Mac.   Cleanup My System : Speed up your Mac & improve its performance   Struggling with a slow and sluggish Mac performance? Cleanup My System is the best way to make the Mac run faster. Using this professional […]"},{"link":"https://nmac.to/blog/instabro/","image":"https://nmac.to/wp-content/uploads/2016/04/InstaBro.png","title":"InstaBro 5.3.7 – Browser for Instagram","content":"InstaBro is a simple Instagram browser that allows you to explore and download media by user, hashtag or location in a most convenient way. You can also export all data to a CSV file.   Yay, the app was featured on Product Hunt!   Main features: no sign-in required (for public accounts) search for users, […]"},{"link":"https://nmac.to/blog/network-battery/","image":"https://nmac.to/wp-content/uploads/2021/01/Network-Battery.png","title":"Network & Battery 12.4.2 – Realtime Network Speeds","content":"See real time network speeds right in menu bar, see your daily data usage & get to know your MacBook battery health.   Great Features: NETWORK: see real time upload/download speeds right in menu bar, you can also change styles. FLOAT WINDOW: keep an eye on your network status & CPU usage right on a […]"},{"link":"https://nmac.to/blog/nifty-file-lists/","image":"https://nmac.to/wp-content/uploads/2021/08/Nifty-File-Lists.png","title":"Nifty File Lists 1.13 – Powerful File List Creation","content":"Nifty File Lists allows you to save file lists in MS Excel, Numbers & Pages-friendly CSV (Comma-Separated Values), TSV (Tab-Separated Values) and even HTML formats.   Features: Comprehensive Meta-Data Support – The powerful multi-threaded meta-data extraction system covers everything from basic file information, such as file name, path, size, creation and modification dates, as well […]"},{"link":"https://nmac.to/blog/moment/","image":"https://nmac.to/wp-content/uploads/2020/09/Moment.png","title":"Moment 1.3.1 – A Menu Bar and Notification Center","content":"Moment is a Menu Bar and Notification Center based countdown app to help you remember the most memorable days of your life. Countdown and Past Event Create countdown events for all kinds of moment in your life: Birthday, Exam, Appointment, Wedding, Holiday, Events festival, Christmas, Your favorite game release day. Looking back on the memory […]"}]