[{"link":"https://nmac.to/blog/bluenote-1-29/","image":"https://nmac.to/wp-content/uploads/2014/05/Bluenote.png","title":"Bluenote 1.29 – Easily keep track of notes, tasks, and passwords","content":"Bluenote is one place for jotting down notes, keeping track of your tasks, and accessing your passwords. A beautiful interface separates your info, lets you assign labels and icons, and search with ease.   Bluenote automatically encrypts, saves, and syncs on the fly. It’s a fantastic app, exclusively for Mac.   Features: Notes are easy […]"},{"link":"https://nmac.to/blog/aurora-5-0-3/","image":"https://nmac.to/wp-content/uploads/2014/05/Aurora.png","title":"Aurora 5.0.3 – iTunes alarm clock; wakes your Mac and plays music","content":"Let Aurora wake you and your Mac. Wake up every morning to the sound of your favorite iTunes playlist instead of that annoying alarm clock.   Aurora is an alarm clock for your Mac that lets you wake up to your favorite iTunes playlist or any TV or radio channel from EyeTV. Other features include […]"},{"link":"https://nmac.to/blog/archive-expert-5-03/","image":"https://nmac.to/wp-content/uploads/2014/03/Archive.Expert.png","title":"Archive Expert 5.03 – File archive manager tool","content":"Archive Expert is a professional, full-featured file archive manager tool. It help you to Browse, Extract, Create, Modify, Split multiple file archives. View, preview files, show advanced file information inside archives.   EXTRACTION FORMATS zip, rar, 7z, lha, zipx, stufflt, hqx, bin, gzip, gz, tgz, tar-gz, bz2, bzip2, bz, txz, tar, iso, cdi, nrg, mdf, […]"},{"link":"https://nmac.to/blog/sorenson-squeeze-pro-9-0-3-11/","image":"https://nmac.to/wp-content/uploads/2014/05/Sorenson.Squeeze.Pro_.png","title":"Sorenson Squeeze Pro 9.0.3.11 – Compress QuickTime/MPEG-4/Flash for the web","content":"Sorenson Squeeze is the latest version of Sorenson Media’s award-winning compression and encoding software. In only three quick steps users can select, pre-process, and compress video for output in a variety of formats and publish directly to websites or burn to DVD. Offering best in class workflows, the highest quality audio & video codecs, simultaneous […]"},{"link":"https://nmac.to/blog/macprofit-2-2-7/","image":"https://nmac.to/wp-content/uploads/2014/05/macProfit.png","title":"macProfit 2.2.7 – Easiest way to keep your business organized","content":"macProfit is the easiest way to keep your business organized and running smoothly without spending endless hours on bookkeeping.  Not only does macProfit generate professional looking invoices, but it also allows you to easily add and manage clients, monitor your accounts, keep track of inventory, and generate detailed reports so you can spend more time increasing […]"},{"link":"https://nmac.to/blog/fastcommander-1-6/","image":"https://nmac.to/wp-content/uploads/2014/05/FastCommander.png","title":"FastCommander 1.6 – Dual-pane file manager","content":"FastCommander is an easy-to-use native Cocoa application with a dual-pane interface, support for all file operations, keyboard shortcuts, and themes. It was created with a strong focus on user experience, a responsive utility with a clear interface. FastCommander was created with a Cocoa OS X framework, written in Objective-C. It is fast, light, and has […]"},{"link":"https://nmac.to/blog/throng-1-11/","image":"https://nmac.to/wp-content/uploads/2014/05/Throng.png","title":"Throng 1.11 – Stress-test your web server","content":"Throng is a tool to stress-test your web server.    Features: Create requests (method, header, basic auth …) Adjust how many concurrent users will stress test your server Test over time or defined number of requests See a live chart how your server is doing Inspect the best “Nerd Log” ever View a history of […]"},{"link":"https://nmac.to/blog/metanota-pro-2-4-1/","image":"https://nmac.to/wp-content/uploads/2014/05/Metanota.png","title":"Metanota Pro 2.4.1 – Smart, organized note taker","content":"Metanota Pro is a beautiful OS X client and editor for creating and managing notes using well known cloud based services like SimpleNote and Evernote or simply local notes on your Mac. Other note-taking cloud providers will be added constantly.   The Pro version is advertising-free and all options are activated by default.   All […]"},{"link":"https://nmac.to/blog/dayspring-1-0-9/","image":"https://nmac.to/wp-content/uploads/2014/05/Dayspring.png","title":"Dayspring 1.0.9 – Personal RSS feed reader","content":"Meet Dayspring, your personal RSS feed reader.   The only RSS reading client on the Mac with tabs Fully customizable font (use any font that you have installed on your Mac) Save your favorite articles for later Simple and clean design Organize your feeds into folders   Other cool enhancements: Designed for OS X Mavericks […]"},{"link":"https://nmac.to/blog/business-tasks-1-1/","image":"https://nmac.to/wp-content/uploads/2014/05/Business.Tasks_.png","title":"Business Tasks 1.1 – Simple and elegant task manager","content":"Business Tasks is a simple and elegant task manager which helps you organize your tasks utilizing a very intuitive interface enabling you to get things done on time.   If you are a business owner, employee, office manager, student who wants to organize yourself then, Business Tasks is a must have app for you. Keep […]"}]