[{"link":"https://nmac.to/blog/easy-voice-changer-1-0-3/","image":"https://nmac.to/wp-content/uploads/2015/11/Easy.Voice_.Changer.png","title":"Easy Voice Changer 1.0.3 – Simply Voice Changer Software","content":"Adding sound effects to your voice has never been easier. Simply turn on your microphone and your speakers, pick one or more audio filters and press Record or Listen Live. Easy Voice Changer makes your voice sound higher (like a “chipmunk”, for instance) or lower and lets you apply effects like echo, reverberation and more, […]"},{"link":"https://nmac.to/blog/timing-1-5-3/","image":"https://nmac.to/wp-content/uploads/2014/09/Timing.png","title":"Timing 1.5.3 – Discover how you spend time on your Mac","content":"Timing is the best way to keep track of the time you spend with your Mac. Find out where your time goes — without ever having to start a timer again!   Timing automatically tracks which documents you are editing, which applications you use, and the domains of the websites you visit. You’ll never have […]"},{"link":"https://nmac.to/blog/moneywiz-2-2-1/","image":"https://nmac.to/wp-content/uploads/2015/02/MoneyWiz2.png","title":"MoneyWiz 2.2.1 – Personal finance solution","content":"All your accounts, budgets and bills in one place! With powerful reports, worldwide online banking and instant sync between all your devices!   That’s MoneyWiz – the world’s most powerful and beautiful finance software.   HOW CAN MONEYWIZ HELP YOU? GET OUT OF DEBT : We’ve built MoneyWiz in a way that makes it easy […]"},{"link":"https://nmac.to/blog/chocolat-3-1-7/","image":"https://nmac.to/wp-content/uploads/2014/12/Chocolat3.png","title":"Chocolat 3.1.7 – Native Cocoa text editor","content":"Chocolat is a new text editor that combines native Cocoa with powerful text editing tools.    Features: Split editing Code completion Live errors Folding Symbol list Blockedit Vim mode Jump to definition Project find Go to file Web preview Documentation   Version 3.1.7: Bug: Oops, remove a few nonsense CSS properties that got worked their […]"},{"link":"https://nmac.to/blog/el-capitan-cache-cleaner-10-0-1/","image":"https://nmac.to/wp-content/uploads/2015/11/El.Capitan.Cache_.Cleaner.png","title":"El Capitan Cache Cleaner 10.0.1 – Clear caches, access hidden OS X settings, and more","content":"El Capitan Cache Cleaner is an award-winning general purpose tool for OS X. ElCC makes system maintenance simple with an easy point-and-click interface to many OS X functions. Novice and expert users alike will appreciate the powerful toolset ElCC provides. El Capitan Cache Cleaner is one of the world’s leading maintenance tools, with millions of […]"},{"link":"https://nmac.to/blog/pinegrow-web-designer-2-3/","image":"https://nmac.to/wp-content/uploads/2015/04/Pinegrow.Web_.Designer.png","title":"Pinegrow Web Designer 2.3 – Mockup and design webpages faster","content":"Pinegrow Web Designer is desktop app that lets you mockup and design webpages faster with multi-page editing, CSS and LESS styling, and smart components for Bootstrap, Foundation, Angular JS, and WordPress.   Version 2.3: Editing code – With Pinegrow you can either edit the HTML code of the whole page or the code of the […]"},{"link":"https://nmac.to/blog/on1-photo-10-0-2241/","image":"https://nmac.to/wp-content/uploads/2015/11/On1.Photo_.png","title":"ON1 Photo 10.0.2241 – Collection of ON1 digital photo products for Photoshop and more","content":"ON1 Photo 10 is a full-featured photo editor that works as a plug-in to Adobe Photoshop and Lightroom, or as a standalone application. Browse and manage your photos where they are stored; local, external, and network drives or cloud service. Version 10 includes the necessary tools to manage and edit your photos with non-destructive Smart […]"},{"link":"https://nmac.to/blog/print-window-5-2-2/","image":"https://nmac.to/wp-content/uploads/2015/11/Print-Window5.png","title":"Print Window 5.2.2 – Print folder listings from the Finder","content":"Print Window offers the ability to print a file listing directly from within the Mac OS X Finder. No more taking screenshots of windows or settling for text-only printouts of filenames only. Print Window provides the works: icons, file information, sorting and so much more!   The Standard edition is free but does not have […]"},{"link":"https://nmac.to/blog/window-tidy-2-1-2/","image":"https://nmac.to/wp-content/uploads/2014/12/Window.Tidy_.png","title":"Window Tidy 2.1.2 – Manage windows with ease","content":"Window Tidy lets you quickly and easily arrange your application windows on your Desktop onto a customizable grid using nothing but drag and drop! When you want to reposition a window, there are no hot-keys to remember or menus to click, you simply drag and drop the window onto customisable pop-up Layout Icon and it […]"},{"link":"https://nmac.to/blog/iphone-care-pro-2-2-0-0/","image":"https://nmac.to/wp-content/uploads/2015/06/iPhone.Care_.Pro_.png","title":"iPhone Care Pro 2.2.0.0 – Fix all iOS Problems and Tuneup iPhone, iPad and iPod","content":"You can easily transfer files on your iPhone, iPad and iPod to PC for free. Simply connect your device with PC and all the rest can be done within several clicks.   Manage 8 types of files: Contacts, Notes, Calendar, APP, Video, Bookmark, Photo and Music. Directly add items to iOS devices. Detect & delete […]"}]