[{"link":"https://nmac.to/blog/ultimate-rivals-the-rink/","image":"https://nmac.to/wp-content/uploads/2021/05/Ultimate-Rivals.png","title":"Ultimate Rivals: The Rink 1.0.4 – Crossover Action Hockey","content":"Set in a digital world of the near future, Ultimate Rivals: The Rink is a hockey experience that, for the first time, gives fans the ability to play as their favorite athletes wherever and however they choose.   Electrifying, end-to-end arcade action hockey: Play 3-on-3 hockey at break-neck speeds! Choose your team and then pass, […]"},{"link":"https://nmac.to/blog/godhood/","image":"https://nmac.to/wp-content/uploads/2020/08/Godhood.png","title":"Godhood 1.2.4 – RPG Simulation & Strategy Game","content":"Guide your Disciples, create your own Religion, and obtain glory! Inspire growth in your Disciples so they may challenge the false gods and convert their followers. Defeat your rivals, and become the One Truth!   Key Features Create your Own Religion: From peaceful meditative monks to savage warrior-priests drenched in the blood of human sacrifice, […]"},{"link":"https://nmac.to/blog/the-church-in-the-darkness/","image":"https://nmac.to/wp-content/uploads/2021/05/The-Church-in-the-Darkness.png","title":"The Church in the Darkness 1.2 – An action/stealth game","content":"An action/stealth game where you infiltrate a realistic cult in the 1970s, see if your nephew is safe, and try to get the best ending for everyone.   No one is forced to join a cult. It welcomes you. It understands you. It envelops you until the words become more than truth—they make you whole. […]"},{"link":"https://nmac.to/blog/infinifactory/","image":"https://nmac.to/wp-content/uploads/2021/05/Infinifactory.png","title":"Infinifactory 11.14.2020 – A sandbox puzzle game","content":"Infinifactory is a sandbox puzzle game by Zachtronics, the creators of SpaceChem and Infiniminer. Build factories that assemble products for your alien overlords, and try not to die in the process.   LIKE SPACECHEM… IN 3D! Design and run factories in a first-person, fully 3D environment.   HISTOGRAMS ARE BACK! Optimize your solutions, and then […]"},{"link":"https://nmac.to/blog/ticket-to-ride/","image":"https://nmac.to/wp-content/uploads/2020/08/Ticket-to-Ride.png","title":"Ticket to Ride 2.7.11 – Strategy Board Game","content":"Set off with your friends and family to re(discover) Ticket to Ride, the classic boardgame. In this railway adventure, you’ll need to be the quickest to link up your cities and reach your destinations.   In this strategy game for all ages, try out different tactics, block your competitors’ lines and take over routes before […]"},{"link":"https://nmac.to/blog/discolored/","image":"https://nmac.to/wp-content/uploads/2021/05/Discolored.png","title":"Discolored 1.1.1 – Restore the missing colors","content":"A lonely roadside diner in the middle of the desert. The locals say it’s lost all its color. You are sent to investigate.   Discolored is a strange and surreal puzzle adventure, taking place over a single desolate location. Your mission: restore the color to this once-vibrant world. What caused the colors to disappear? How […]"},{"link":"https://nmac.to/blog/john-wick-hex/","image":"https://nmac.to/wp-content/uploads/2021/05/John-Wick-Hex.png","title":"John Wick Hex 1.03 – A fast-paced, action-oriented strategy game","content":"John Wick Hex is a fast-paced, action-oriented strategy game that makes you think and strike like John Wick, the professional hitman of the critically acclaimed film franchise. Created in close cooperation with the creative teams behind the films, John Wick Hex is fight-choreographed chess brought to life as a video game, capturing the series’ signature […]"},{"link":"https://nmac.to/blog/battlesky-brigade-harpooner/","image":"https://nmac.to/wp-content/uploads/2021/05/BattleSky-Brigade-Harpooner.png","title":"BattleSky Brigade Harpooner 1.4.4 – Shoot’em up and reel’em in","content":"BattleSky Brigade Harpooner is a shoot’em up and “fishing” game. Shoot open barrels and enemies and avoid obstacles on the way up, like a classic vertical shoot em’ up! Reel yourself back in when you run out of rope and collect what you shot open! Set in the adorable world of BattleSky Brigade, help Pim […]"},{"link":"https://nmac.to/blog/duck-life/","image":"https://nmac.to/wp-content/uploads/2021/05/Duck-Life.png","title":"Duck Life 26112020 – Raise your duckling into a champion racer!","content":"Are you ready to play the ultimate duck training game? The award-winning online sensation, racking up over 150 million plays internationally is finally available on Steam!   Train your duck in 15 mini-games featuring running, swimming, flying, climbing and jumping. Watch proudly as it competes in tournaments against rival ducks, discovering exciting worlds and learning new skills. Ultimately, […]"},{"link":"https://nmac.to/blog/perfect-horizon/","image":"https://nmac.to/wp-content/uploads/2019/10/Perfect_Horizon_1.png","title":"Perfect Horizon 1.2 – Straighten and rotate your videos","content":"Perfect Horizon helps you to straighten and rotate your videos just like you are used to do with photos in the Photos app. You can even do it from within the Photos app using the included extension. The rotation is permanent and isn’t accomplished just by changing metadata. Perfect Horizon is available as a separate […]"}]