[{"link":"https://nmac.to/blog/face-for-facebook-2-2/","image":"https://nmac.to/wp-content/uploads/2013/12/Face_for_Facebook_icon.175x175-751.jpg","title":"Face for Facebook v2.2 – Access Facebook from your menu bar","content":"Share and stay connected with your friends with Facebook. Face for Facebook helps you connect with your friends and share on the go. Rest you already know… Please enjoy with Love…   WHAT’S NEW Version 2.2: Improved UI and Some important stability issues fixed…   REQUIREMENTS OS X 10.6.6 or later ScreenShots :     […]"},{"link":"https://nmac.to/blog/newslife-2-1/","image":"https://nmac.to/wp-content/uploads/2013/03/NewsLife.png","title":"NewsLife 2.1 – Streamline your RSS viewing","content":"NewsLife is a super easy to use RSS news aggregator for Mac OS X. NewsLife’s simple interface, composed of three panes is intuitive and easy to use. The source list lets you organise your feeds how ever you want. The content area presents each article to you complete with thumbnails, quick navigation links and more. […]"},{"link":"https://nmac.to/blog/karaoketube-1-1/","image":"https://nmac.to/wp-content/uploads/2013/12/icon.175x175-7545.jpg","title":"KaraokeTube 1.1 – Sing your favorite songs right from your Mac","content":"Sing your favorite songs right from your Mac. KaraokeTube is the world’s first and only fully featured Mac karaoke application with a streaming library of over thousands of songs with lyrics! What you get:- Access to over 7000 songs from around the world – High and HD quality of all the videos – Intuitive song […]"},{"link":"https://nmac.to/blog/autodesk-smoke-2013-sp2/","image":"https://nmac.to/wp-content/uploads/2013/12/smoke.jpg","title":"Autodesk Smoke 2013 SP2 – Professional video editing and effects software","content":"Autodesk Smoke 2013 Mac video editing software combines the nonlinear creative workflow of a video editor with 3D visual effects and post-production tools in a single application. Manage entire projects from first cut to final delivery with the powerful and connected set of video editing and effects tools in Smoke. The Video Editing Tools You […]"},{"link":"https://nmac.to/blog/notebook-3-1-7/","image":"https://nmac.to/wp-content/uploads/2013/07/NoteBook.png","title":"NoteBook 3.1.7 – Organize photos, email, documents and more","content":"NoteBook is an ideal solution for users who are sick and tired of spending their time trying to stay organized. From simple tasks to massive projects, Circus Ponies NoteBook handles it all, so you can stop spending hours doing what should take just minutes.   Here are four ways NoteBook will save you time every day: […]"},{"link":"https://nmac.to/blog/multimon-2-0/","image":"https://nmac.to/wp-content/uploads/2013/12/multimonIcon.175x175-751.jpg","title":"Multimon v2.0 – Solution for dealing with multiple monitors","content":"Multimon is the perfect solution for dealing with a multiple-monitor setup on your Mac.  Features: – Multiple menu bars on any number of screens. – Advanced window management for quickly dealing with multiple windows. – Automatic window resizing for monitors of different sizes. – Customizable hotkeys for quick management of your monitors. – Looking to […]"},{"link":"https://nmac.to/blog/watermarkspell-1-5/","image":"https://nmac.to/wp-content/uploads/2013/12/43786.jpg","title":"WatermarkSpell v1.5 – Digital watermarker","content":"WatermarkSpell is a comprehensive and professional image watermark solution to protect and brand your digital photographs and artworks. It allows you to overlay a visible digital watermark or a logo of your identity and edit copyright info to your images without losing your original color profile and metadata. Unique Features: Batch watermark images without losing […]"},{"link":"https://nmac.to/blog/1keyboard-1-0/","image":"https://nmac.to/wp-content/uploads/2013/12/keyboard_hd.jpg","title":"1Keyboard 1.0 – Virtual bluetooth keyboard","content":"1Keyboard is a virtual bluetooth keyboard application for OS X.Turn your Mac into a Bluetooth keyboard that works with all of your devices, comfortably type on your iPhone, iPad, Apple TV or game console.   Text much faster on your phone iPhone and Android mobile devices are supported   Easily edit long documents on your […]"},{"link":"https://nmac.to/blog/socialite-1-5-3/","image":"https://nmac.to/wp-content/uploads/2013/12/Socialite.175x175-751.jpg","title":"Socialite v1.5.3 – Creates a single interface for multiple social websites","content":"Socialite is a revolutionary social application. It seamlessly integrates many social websites, including Flickr, Facebook, Twitter, Reddit, RSS and Google Reader. It allows you to interact with them and receive notifications, all from a stunning user interface. WHAT’S NEW Version 1.5.3: Everyone who uses Twitter should download this release before March 5. Twitter switches to […]"},{"link":"https://nmac.to/blog/robopostman-1-2-3/","image":"https://nmac.to/wp-content/uploads/2013/12/RoboPostman.175x175-751.jpg","title":"RoboPostman 1.2.3 – Simplify the process of customizing email messages","content":"RoboPostman lets you create a personal look and feel to every message you send out, without the extra effort! RoboPostman allows you to custom tailor messages to include dynamic content specific to each recipient. Include birthdays, custom notes, links with rotating affiliate codes, and more. Use the “Visual” editor to create brilliant messages with fonts, […]"}]