[{"link":"https://nmac.to/blog/pear-note-3-0-3/","image":"https://nmac.to/wp-content/uploads/2013/12/PEARAppIcon.175x175-75.jpg","title":"Pear Note v3.0.3 – Integrates audio, video, and slides with traditional text notes","content":"Pear Note integrates audio, video, and slides with traditional text notes. By recording all activity, Pear Note keeps track of what’s going on while taking notes as well as what the user has to say about it. This makes Pear Note incredibly useful for important meetings, class settings, or speeches.   Recording Notes   Pear […]"},{"link":"https://nmac.to/blog/markdown-pro-1-0-8/","image":"https://nmac.to/wp-content/uploads/2013/12/markdown_icon.175x175-75.png","title":"Markdown Pro v1.0.8 – Create documentation, notes, essays and more","content":"With Markdown Pro, you can write beautiful documentation, notes, essays, term papers all by using plain text to tag your formatting such as bold, italic, lists and others. Need a heading? add # before your text; need to make a text bold? add * around your *text*. Using the plain text formatting, it is really […]"},{"link":"https://nmac.to/blog/folderwatch-2-0-5/","image":"https://nmac.to/wp-content/uploads/2013/12/icon-release.175x175-75.png","title":"FolderWatch v2.0.5 – Sync folders between multiple Macs","content":"FolderWatch is the only utility that syncs files while you work. Let it perform that tedious work for you. Keep a copy of your project mirrored on an external drive or a file server. FolderWatch syncs your project while you work, making sure your copy stays up-to-date at all times. Simply have FolderWatch monitor a folder […]"},{"link":"https://nmac.to/blog/caffeinated-1-3-1/","image":"https://nmac.to/wp-content/uploads/2013/12/icons.175x175-755.png","title":"Caffeinated 1.3.1 – An aesthetically pleasing Google Reader client","content":"Caffeinated is a beautiful Google Reader client that seamlessly syncs with your Google Reader account. Caffeinated supports sending to your favourite social networks, such as Facebook and Twitter and also bookmarking / read it later services such as Instapaper and Read It Later. Other features: Plugin architecture for developers Find and subscribe to feeds Basic […]"},{"link":"https://nmac.to/blog/iwork09/","image":"https://nmac.to/wp-content/uploads/2013/02/iWork09.png","title":"iWork09 – Productivity software suite","content":"iWork is Apple’s answer to Microsoft Office and by all accounts, it’s a pretty decent answer indeed. If you’re thinking of buying MS Office, then you’re strongly advised to give iWork a try first.   What’s included The iWork suite comprises of the Pages text editor (the equivalent to MS Word) Numbers (equivalent to Excel) […]"},{"link":"https://nmac.to/blog/flint-v1-2-2/","image":"https://nmac.to/wp-content/uploads/2013/12/Flint.175x175-75.png","title":"Flint v1.2.2 – Minimalist Campfire client","content":"Flint is a brand new client for CampfireTM. A beautiful and minimal app, designed to let you do what you need and get out of your way. Features: Growl notifications, dock badges, and sound notifications for messages Shows user avatars for a more friendly experience Supports multiple Campfire sites Uses streaming API for instant notifications […]"},{"link":"https://nmac.to/blog/im-away-1-3-1/","image":"https://nmac.to/wp-content/uploads/2013/12/icon.175x175-7520.png","title":"I’m Away v1.3.1 – Change all your IM statuses with one click","content":"I’m Away is a simple utility that helps you change your statuses in the most popular Instant Messengers on Mac with one click only. Change your status in Skype, iChat, and Adium with one hotkey you choose yourself. Features: Changes statuses simultaneously; Compatible with iChat, Skype and Adium; Supports customizable hotkeys. Control your statuses with […]"},{"link":"https://nmac.to/blog/garbage-truck-1-4/","image":"https://nmac.to/wp-content/uploads/2013/12/Garbage_Truck.175x175-75.png","title":"Garbage Truck v1.4 – The Mac’s most elegant trash solution","content":"Garbage Truck automatically empties your trash for you, saving your time and stopping piles of rubbish from filling your hard drive. Garbage Truck keeps things beautifully simple, but still allowing perfect control over your trash. With Garbage Truck you will never need to empty your trash again. Simply choose when you want Garbage Truck to […]"},{"link":"https://nmac.to/blog/ondesoft-audio-recorder-v3-20-2/","image":"https://nmac.to/wp-content/uploads/2013/12/38924.png","title":"Ondesoft Audio Recorder v3.20.2 – Record sound from numerous sources","content":"Ondesoft Audio Recorder, a sound recording program for Mac, allows you to record sound directly from microphone, CD player, line-in devices or sound being played by other applications including Skype, iTunes, or DVD Player, etc. Recording files are saved as WAV, ACC, AIFF and so on. It can also extract music from movie. Advanced recording […]"},{"link":"https://nmac.to/blog/fidelia-v1-1-2/","image":"https://nmac.to/wp-content/uploads/2013/12/icon.175x175-7521.png","title":"Fidelia 1.1.2 – Music player","content":"Fidelia is a high-definition audio player for sophisticated music lovers. With support for all contemporary audio file formats and an elegant interface that focuses exclusively on music, it gives users the power and the freedom to organize, customize and savor their digital music collection at the highest possible fidelity in any circumstance. If you’ve invested […]"}]