[{"link":"https://nmac.to/blog/ilock/","image":"https://nmac.to/wp-content/uploads/2017/04/iLock3.png","title":"iLock 3.0.2 – Password-protect any OS X application","content":"iLock password-protects any OS X application from unauthorized usage without modifying anything in your system settings and/or applications. It is safe to use!   Version 3.0.2: New Features: iLock is now compatible with macOS 10.15 Improved logging information. Bug fixes: Fixed issue creating photos. Fixed issue showing the evidence photos. Fixed several GUI glitches. Fixed […]"},{"link":"https://nmac.to/blog/imac-cleaner/","image":"https://nmac.to/wp-content/uploads/2019/01/iMac-Cleaner2.png","title":"iMac Cleaner 2.9 – Mac Cleaner & Software Uninstaller","content":"iMac Cleaner offers Disk Cleaning, App Removal, Memory Optimization, Duplicate Finder, File Shredder, Manage Login Items, Extension, Extract RAR and Winmail.Dat to keep your mac best performance. Fully compatible with macOS High Sierra on your Mac.   Features: Smart Clean: clean application junk files, app caches, logs, system caches, system logs, mail attachments, iTunes junk […]"},{"link":"https://nmac.to/blog/gone-home/","image":"https://nmac.to/wp-content/uploads/2017/02/Gone-Home1.png","title":"Gone Home 1.3.2 – Interactive exploration simulation game","content":"June 7th, 1995. 1:15 AM You arrive home after a year abroad. You expect your family to greet you, but the house is empty. Something’s not right. Where is everyone? And what’s happened here? Unravel the mystery for yourself in Gone Home, a story exploration game from The Fullbright Company.   Gone Home is an […]"},{"link":"https://nmac.to/blog/the-pedestrian/","image":"https://nmac.to/wp-content/uploads/2020/02/The-Pedestrian.png","title":"The Pedestrian 1.0.8 – Adventure & Puzzle Platformer Game","content":"The Pedestrian is a 2.5D side scrolling puzzle platformer. You are The Pedestrian! Enter into a dynamic 3D world with stunning graphics and challenging puzzles.   You play by rearranging and reconnecting public signs in order to explore and advance through each engaging environment.   Minimum System Requirements: Processor: Intel i3 Memory: 4 GB RAM […]"},{"link":"https://nmac.to/blog/pinball-arcade/","image":"https://nmac.to/wp-content/uploads/2016/04/Pinball-Arcade7.png","title":"Pinball Arcade 8.1.10 – Pinball arcade game","content":"Pinball Arcade lets you play exact recreations of the all-time greatest pinball tables. Every flipper, bumper, sound effect, and display pixel has been painstakingly emulated in astonishing detail.   Four tables are included in the app. Other great pinball tables are available as in-app purchases along with online tournaments and additional modes to challenge yourself […]"},{"link":"https://nmac.to/blog/phoenix-point/","image":"https://nmac.to/wp-content/uploads/2020/02/Phoenix-Point.png","title":"Phoenix Point 1.0 – A new strategy game from the creator of X-COM","content":"Phoenix Point is the new strategy game from the creator of the original X-COM series. It features turn based tactics and world based strategy in a fight against a terrifying, alien menace.   A mutating alien threat. The Pandoravirus can mutate living forms, and it can incorporate DNA from multiple species and clone them rapidly. […]"},{"link":"https://nmac.to/blog/paste/","image":"https://nmac.to/wp-content/uploads/2016/06/Paste2.png","title":"Paste 2.5.6 – Smart clipboard history & snippets manager","content":"Paste is a new way to copy and paste for your Mac. It keeps everything you’ve ever copied and lets you use your clipboard history anytime you need it. It recognizes and stores text, images, links, files, and any other type of content, and generates informative previews for easy browsing.   Paste works in the […]"},{"link":"https://nmac.to/blog/tinyalarm/","image":"https://nmac.to/wp-content/uploads/2017/10/TinyAlarm.png","title":"TinyAlarm 1.9.7 – Tiny alarm clock for your menubar","content":"TinyAlarm is a an alarm clock for your menu bar. Create customizable alarms in the menubar that will play a chosen sound (system sound, spoken by siri or recorded by you). Simple, no manual needed. Good for gaming, programming, not missing an appointment or timing the cooking of dinner so it doesn’t burn. Create alarms […]"},{"link":"https://nmac.to/blog/mousepose/","image":"https://nmac.to/wp-content/uploads/2013/07/Mousepose4.png","title":"Mouseposé 4.1 – Spotlight your mouse movement for presentations and training","content":"Mouseposé dims the screen and puts a spotlight on the area around the mouse pointer, easily guiding the audiences attention or to quickly locate the mouse pointer. Color, size, etc. can be customized.   It is an essential tool for everyone doing demos at tradeshows, presentations, trainings or those individuals with huge and high resolution […]"},{"link":"https://nmac.to/blog/image-crop/","image":"https://nmac.to/wp-content/uploads/2017/09/Image-Crop.png","title":"Image Crop 1.3.1 – Batch crop and convert photos","content":"Image Crop allows you to crop, convert and rename thousands of image files in batch mode. Crop your images to remove unwanted areas or to give them a specific aspect ratio. Also, if your original image files are poorly named, you can use Image Crop to give them meaningful names so they are easier to […]"}]