[{"link":"https://nmac.to/blog/art-effect-pro-1-0/","image":"https://nmac.to/wp-content/uploads/2016/08/Art.Effect.Pro_.png","title":"Art Effect Pro 1.0 – Process the image and output a beautiful art effect","content":"Art Effect Pro is an amazing software to process the image and output the surprise and beautiful art effect.   Easy to use. You can easily obtain a beautiful image by using Art Effect Pro.   Support for 81 kinds of amazing and beautiful art effects.   Feature: Amazing art effect processing using machine learning […]"},{"link":"https://nmac.to/blog/9-clues-2-the-ward-1-0/","image":"https://nmac.to/wp-content/uploads/2016/08/9-Clues-2-The-Ward.png","title":"9 Clues 2: The Ward 1.0 – Solve the mystery of Mnemosyne Asylum!","content":"“The Ward” is the second installment in the 9 Clues series, in which a young detective and her partner respond to a distress call from a psychiatric hospital on a secluded island.   The island is isolated by freezing waters and constant, brutal storms. Upon the detectives’ arrival, one of the hospital’s therapists falls out […]"},{"link":"https://nmac.to/blog/doorways-holy-mountains-of-flesh-1-0/","image":"https://nmac.to/wp-content/uploads/2016/08/Doorways.png","title":"Doorways: Holy Mountains of Flesh 1.0 – An Immersive Horror Adventure Game","content":"Juan Torres and his family were the target of an uncountable number of rumors and several disappearances that took place in El Chacal, a small village of around 4,800 inhabitants, located in the arid mountainous region of Salta, a province of Argentina.   Among the stories spread around the surrounding villages, legends involving cannibalism, black […]"},{"link":"https://nmac.to/blog/regextor-1-0-2/","image":"https://nmac.to/wp-content/uploads/2016/08/Regextor.png","title":"Regextor 1.0.2 – Polish your regular expressions","content":"Regextor lets you tune-up your regexps! See exactly what your regular expression matches in the sample text.   Version 1.0.2: Fixing an inifinite-regex bug   Intel, 64-bit processor OS X 10.10 or later    "},{"link":"https://nmac.to/blog/menutab-pro-for-facebook-6-9/","image":"https://nmac.to/wp-content/uploads/2015/01/MenuTab.Pro_.for_.Facebook.png","title":"MenuTab Pro for Facebook 6.9 – The Ultimate Facebook App for you Mac","content":"MenuTab Pro for Facebook is the Pro version of the best Mac app for Facebook with these amazing extra features: Color-coded menubar alerts, Desktop mode with chat, Popup notifications, Stealth mode, Full screen support and much more!   MenuTab Pro for Facebook is an incredibly slick and gorgeous app for quickly accessing your Facebook account […]"},{"link":"https://nmac.to/blog/matchbook-1-1-1/","image":"https://nmac.to/wp-content/uploads/2016/08/Matchbook.png","title":"Matchbook 1.1.1 – Bring Tinder to the Mac/OS X platform","content":"Matchbook, written using the latest technology from Apple, offers users a desktop based client for both searching, ‘liking’ or ‘passing’ potential matches and messaging any matches made.   Over the course of the products life cycle, we aim to replicate, like for like, the features available on Tinder’s native iOS platform. The application should, whilst […]"},{"link":"https://nmac.to/blog/emulsion-1-4-0/","image":"https://nmac.to/wp-content/uploads/2015/06/Emulsion.png","title":"Emulsion 1.4.0 – Photo library catalog","content":"Emulsion is a new photo catalog app. Emulsion can adjust exposure, colors, and almost everything else. You can also add gradients to your images to darken skies, or even add dust and scratches for a cool retro look. Emulsion can apply adjustments, effects, and metadata changes to one or hundreds of images at once. Want […]"},{"link":"https://nmac.to/blog/acronis-true-image-2016-2-0-6077/","image":"https://nmac.to/wp-content/uploads/2015/07/Acronis.True_.Image_.png","title":"Acronis True Image 2016 2.0.6077 – Backup and disk management","content":"With Acronis True Image 2016 you can assure your Mac is protected by having a full system image backup. Keep all your data safe even if your computer is lost, stolen or damaged. Backup locally or to the cloud, and access your files anytime, anywhere.   Version 2.0.6077: What’s new: Timing of the product notifications […]"},{"link":"https://nmac.to/blog/worms-3/","image":"https://nmac.to/wp-content/uploads/2016/08/worms3.png","title":"Worms 3 1.16 – Classic turn-based strategy game","content":"Worms 3 has been developed for OSX and allows Mac gamers to challenge friends on iOS devices.   Deal yourself the advantage with a new, game-changing enhancement. Turn on the card mode and alter the start and end of each turn by the playing of strategic cards.   Collect in-game rewards that allow you to […]"},{"link":"https://nmac.to/blog/q-u-b-e-directors-cut-2-0-0-2/","image":"https://nmac.to/wp-content/uploads/2016/08/Q.U.B.E-Directors-Cut.png","title":"Q.U.B.E: Director’s Cut 2.0.0.2 – First-Person Puzzle & Adventure Game","content":"A new Director’s Cut of classic indie puzzler Q.U.B.E is here, and this time the mind bending gameplay will be accompanied by a completely new story by award-winning writer Rob Yescombe.   Q.U.B.E: Director’s Cut is the definitive version of the brain-twisting first-person puzzler. Using special high-tech gloves to manipulate cubes in the environment, the […]"}]