[{"link":"https://nmac.to/blog/datagenerator-for-excel/","image":"https://nmac.to/wp-content/uploads/2022/05/DataGenerator-for-Excel.png","title":"DataGenerator for Excel 3.2.0 – Convert your datas from excel document into .plist file or .sqlite","content":"To help developers to improve development efficiency. You can convert your datas or configuration from excel(.xls and .xlsx) document into .plist file or .sqlite database   DataGenerator for Excel is a lightweight conversion tool to help developers to improve development efficiency. You can convert your datas or configuration from excel(.xls and .xlsx) document into .plist […]"},{"link":"https://nmac.to/blog/photo-sketch/","image":"https://nmac.to/wp-content/uploads/2022/05/Photo-Sketch-1.png","title":"Photo Sketch 1.8.1 – Pencil sketchbook&photo artist","content":"Photo sketch is a professional software that uses state-of-the-art algorithms to turn your photos into high-quality pencil sketches, it can also generate pencil strokes with transparent backgrounds for further free creation based on your ideas.   Easy: To sketch a photo, you just need drag and drop your photo into Photo Sketch window.   Key […]"},{"link":"https://nmac.to/blog/previewcode/","image":"https://nmac.to/wp-content/uploads/2022/05/PreviewCode.png","title":"PreviewCode 1.2.0 – Easy source code file previews","content":"Easy source code QuickLook previews and icon thumbnails.   PreviewCode provides QuickLook file previews and Finder file icon thumbnails for source code documents and data files for a wide variety of programming languages.   The app provides two app extensions: Code Previewer and Code Thumbnailer, which can be viewed and managed in macOS’ System Preferences […]"},{"link":"https://nmac.to/blog/deliver-express/","image":"https://nmac.to/wp-content/uploads/2020/03/Deliver-Express.png","title":"Deliver Express 2.7.2 – Automated file delivery with hot folder processing","content":"Deliver Express is an automated solution to send and share files easily across the Internet and local networks. Deliver Express Enterprise lets you send files to up to an unlimited number of locations. Deliver Express processes files automatically from hot folders and offers automatic e-mail notifications, multi-destination transfer, detailed delivery history and much more. Deliver […]"},{"link":"https://nmac.to/blog/rar-extractor-max/","image":"https://nmac.to/wp-content/uploads/2021/05/RAR_Extractor_Max_7.png","title":"RAR Extractor Max 9.0.0 – Zip,7z,tar,winmail file opener","content":"RAR Extractor Max inherited the advantages of “RAR Extractor Pro”, we redesigned the UI and added more powerful functionalities. Support unarchive RAR, winmail.dat, ZIP, 7z, tbz, sti, tar, xar, lha, lzh, hqx, bin, bz2, bzip2, bz, xz, iso, cid, nrg, mdf, taz, lzma, exe, msi, cpio, lzx, jar, swf, xip, ace, arj, pak, pkg, apk, […]"},{"link":"https://nmac.to/blog/the-unarchiver-unzip-rar-zip/","image":"https://nmac.to/wp-content/uploads/2020/12/The-Unarchiver-Unzip-RAR-ZIP.png","title":"RAR Unarchiver – Unzip RAR ZIP 3.3.1 – Decompress & compress files","content":"RAR Unarchiver – Unzip RAR ZIP is a very easy-to-use app that allows you to decompress dozens of archive formats. such as: Rar, Zip, 7z, Tar, Xz, Iso, Lha, bz2, Lzh, cab, cpio, jar, exe, pkg, dms, tbz, swf, Gzip, Bzip2…  and it can also compress and encrypt any files to make private files more […]"},{"link":"https://nmac.to/blog/checksum-thing/","image":"https://nmac.to/wp-content/uploads/2022/01/Checksum-Thing.png","title":"Checksum Thing 2.1.1 – Creates checksum/digest values of files and directory content","content":"A menu bar application that watches a designated directory, such as your downloads folder, automatically recording and storing the checksum/digest values of arriving files. A simple context click displays the checksum value, another click conveniently copies that value to the clipboard. The checksum/digest algorithm used is selectable, supporting MD5, SHA1, and various others. Uses hardware […]"},{"link":"https://nmac.to/blog/previewmarkdown/","image":"https://nmac.to/wp-content/uploads/2022/05/PreviewMarkdown.png","title":"PreviewMarkdown 1.4.1 – Easy Markdown file previews","content":"Easy Markdown QuickLook previews and icon thumbnails.   PreviewMarkdown provides QuickLook file previews and file icon thumbnails for documents created using the popular markdown markup format.   The app provides two app extensions: Previewer and Thumbnailer, which can be viewed and managed in macOS’ System Preferences > Extensions. The app itself is simply a container […]"},{"link":"https://nmac.to/blog/previewyaml/","image":"https://nmac.to/wp-content/uploads/2022/05/PreviewYaml.png","title":"PreviewYaml 1.1.1 – Easy YAML QuickLook previews","content":"Easy YAML file QuickLook previews and icon thumbnails.   PreviewYaml provides QuickLook file previews and file icon thumbnails for documents created using the popular YAML structured data format.   The app provides two app extensions: Yaml Previewer and Yaml Thumbnailer, which can be viewed and managed in macOS’ System Preferences > Extensions > QuickLook. The […]"},{"link":"https://nmac.to/blog/zee-timer/","image":"https://nmac.to/wp-content/uploads/2021/02/Zee_Timer_8.png","title":"Chain Timer 8.8 – Convenient multi timer for every day","content":"Convenient multi timer for every day.   Version 8.8: Thank you for using our app! In this update: New theme   Intel, 64-bit processor macOS 11.0 or later    "}]