[{"link":"https://nmac.to/blog/playr/","image":"https://nmac.to/wp-content/uploads/2020/08/Playr_2.png","title":"Playr 2.7 – Video playback simplified","content":"Playr was made solely to focus on your video viewing experience. It’s not crammed with extra features for organizing files or to make playlists and such. You don’t need to install any extras or plug-ins to view your favorite movies, it just works.   Playr has been carefully developed using the latest available technologies with […]"},{"link":"https://nmac.to/blog/broken-age/","image":"https://nmac.to/wp-content/uploads/2014/02/Broken-Age1.png","title":"Broken Age 2.5.0.18 – Graphical adventure Game","content":"Broken Age is a timeless coming-of-age story of barfing trees and talking spoons. Vella Tartine and Shay Volta are two teenagers in strangely similar situations, but radically different worlds. The player can freely switch between their stories, helping them take control of their own lives, and dealing with the unexpected adventures that follow.   They […]"},{"link":"https://nmac.to/blog/frostpunk/","image":"https://nmac.to/wp-content/uploads/2021/03/Frostpunk.png","title":"Frostpunk 1927 – Survival City Builder & Strategy Game","content":"Frostpunk, the newest title from the creators of This War of Mine, is a society survival game where heat means life and every decision comes at a price. In an entirely frozen world, people develop steam-powered technology to oppose the overwhelming cold. You face the task of building the last city on Earth and securing […]"},{"link":"https://nmac.to/blog/name-mangler/","image":"https://nmac.to/wp-content/uploads/2019/11/Name_Mangler_3.png","title":"Name Mangler 3.7.3 – Easy-to-use batch file re-namer","content":"Name Mangler (was File List) is an easy-to-use batch file re-namer.   If you need to rename several files at once, this is the application you have always been looking for. Name Mangler is a batch file renamer that supports the following renaming tasks: Find and Replace (including support for regular expressions); Number Sequentially; Change […]"},{"link":"https://nmac.to/blog/sizemypics/","image":"https://nmac.to/wp-content/uploads/2020/08/SizeMyPics_1.png","title":"SizeMyPics 1.8.0 – Conveniently convert multiple images","content":"SizeMyPics will support you in converting a lot of pictures to another format and size in a convenience way. Read all about the features SizeMyPics has to offer and how it can make your work easier.   Version 1.8.0: New: MarkupTable now natively supports Apple Silicon-processors Improvements: some user interface changes for macOS Big Sur […]"},{"link":"https://nmac.to/blog/photoninja/","image":"https://nmac.to/wp-content/uploads/2016/06/PhotoNinja.png","title":"PhotoNinja 1.4.0d – High-quality Raw image converter","content":"PhotoNinja (formerly Noise Ninja) is a professional-grade raw converter and image editor that gives you powerful new tools to get the best possible results from your digital camera. Built from the ground up with world-class image processing technology, it delivers exceptional image quality, quickly and easily.   Detail is crisp and impressive, and images have […]"},{"link":"https://nmac.to/blog/cocktail/","image":"https://nmac.to/wp-content/uploads/2013/08/Cocktail.png","title":"Cocktail 14.3.1 – General maintenance and optimization utility","content":"Cocktail is a general purpose utility for OS X that lets you clean, repair and optimize your Mac. It is a powerful digital toolset that helps hundreds of thousands of Mac users around the world get the most out of their computers every day.   The application serves up a perfect mix of maintenance tools […]"},{"link":"https://nmac.to/blog/adobe-prelude-cc/","image":"https://nmac.to/wp-content/uploads/2019/11/Adobe-Prelude-2020.png","title":"Adobe Prelude CC 2021 10.1 – Logging tool for various file formats","content":"Adobe Prelude CC software streamlines your production tasks. Ingest nearly any file-based format and begin logging immediately, creating searchable markers and other temporal metadata that flow through post-production, so you can work faster and stay organized. Adobe Prelude is included in Production Premium, Master Collection, and Creative Cloud.   Ingest and log footage quickly and easily […]"},{"link":"https://nmac.to/blog/adobe-after-effects-cc/","image":"https://nmac.to/wp-content/uploads/2020/06/Adobe-After-Effects-2020.png","title":"Adobe After Effects CC 2021 18.4 – Create pro motion graphics and visual effects","content":"The new, more connected After Effects CC can make the impossible possible. Get powerful new features like a Live 3D Pipeline that brings CINEMA 4D scenes in as layers – without intermediate rendering. Share work directly from within the application and get access to new features the moment they’re released. Your entire creative world, together in […]"},{"link":"https://nmac.to/blog/adobe-substance-3d-stager/","image":"https://nmac.to/wp-content/uploads/2021/06/Adobe-Substance-3D-Stager.png","title":"Adobe Substance 3D Stager 1.0.1 – Build and assemble 3D scenes in this intuitive staging tool","content":"Build and assemble 3D scenes in this intuitive staging tool. Set up assets, materials, lights, and cameras. Export and share media, from images to web and AR experiences.   Work on your final image. Substance 3D Stager lets you make creative decisions in context. Refine and adjust your composition in real time. Visualize and edit […]"}]