[{"link":"https://nmac.to/blog/sketchode-1-3-0/","image":"https://nmac.to/wp-content/uploads/2016/12/Sketchode.png","title":"Sketchode 1.3.0 – Graphical representation of a design project created in Sketch","content":"Sketchode is a graphical representation of a design project created in Sketch that helps you optimize mobile and desktop applications development. It has significantly improved the process of creating designs and web-based interfaces. Sketchode is a software solution that can restore in its graphical user interface any design project created with the help of Sketch, […]"},{"link":"https://nmac.to/blog/pdf-compress-expert-3-0-0/","image":"https://nmac.to/wp-content/uploads/2016/12/PDF-Compress-Expert.png","title":"PDF Compress Expert 3.0.0 – Reduce the size of your PDF documents","content":"PDF Compress Expert is a Mac OS X utility for reducing the size of PDF files, which compresses PDF file size by optimizing the resolution and compression method of images, removing unused thumbnails and metadata, stripping dead-object and compressing other parts of PDF files. Just drop your file on the panel and it will quickly […]"},{"link":"https://nmac.to/blog/livequartz-2-5-13/","image":"https://nmac.to/wp-content/uploads/2014/05/lq.png","title":"LiveQuartz 2.5.13 – Simple image editor","content":"LiveQuartz is a simple and powerful photo editor for the Mac. It is based on non-destructive layers and filters. The layers are at the left and the filters are at the right of the window.   To edit a photo, just drag it into the window (or layers list) and it will be added as […]"},{"link":"https://nmac.to/blog/home-design-3d-4-0-5/","image":"https://nmac.to/wp-content/uploads/2016/11/Home-Design-3D.png","title":"Home Design 3D 4.0.5 – Design and change your home","content":"With Home Design 3D, designing and remodeling your house in 3D has never been so quick and intuitive!   Accessible to everyone, Home Design 3D is the reference interior design application for a professional result at your fingertips!   CREATE, DESIGN, FURNISH AND DECORATE EASILY YOUR HOME AND SHARE IT WITH A COMMUNITY OF MORE […]"},{"link":"https://nmac.to/blog/ultimate-chicken-horse-1-0/","image":"https://nmac.to/wp-content/uploads/2016/11/Ultimate-Chicken-Horse.png","title":"Ultimate Chicken Horse 1.0 – A party platformer 2d game","content":"Ever wish you were a wall-jumping, arrow-dodging, trap-setting horse, besting your animal pals in a race through a peril-laden obstacle course that you all built together?   Wish Granted!   Ultimate Chicken Horse is a party platformer where you and your friends build the level as you play, placing deadly traps before trying to reach […]"},{"link":"https://nmac.to/blog/the-final-station-1-0/","image":"https://nmac.to/wp-content/uploads/2016/11/The.Final_.Station.png","title":"The Final Station 1.0 – 2D Pixel Graphics Action & Adventure Game","content":"The world is over. But it’s not quite over for you… at least, not yet. And now that you’ve got thousands of tonnes of locomotive at your disposal, you’ve got the definite advantage over the infected hordes. This is The Final Station.   The real question is whether or not you’ll help the survivors get […]"},{"link":"https://nmac.to/blog/super-mov-converter-6-2-7/","image":"https://nmac.to/wp-content/uploads/2015/07/Super.MOV.Converter.png","title":"Super MOV Converter 6.2.7 – Convert any HD video and common video to MOV format","content":"Super MOV Converter lets you convert any HD video and common video to MOV format for playback on QuickTime, Apple TV, iPhone 6/6 plus/5S/5C/5/4S, iPad Air 2/ Air/mini 3/mini 2/mini/4, iPod with absolutely faultless performance. Converting AVCHD videos (M2TS, MTS), HD videos (TS, HD MP4, HD WMV, HD MPG, HD MPEG), and common videos like […]"},{"link":"https://nmac.to/blog/shortcuts-2-1-1/","image":"https://nmac.to/wp-content/uploads/2016/11/Shortcuts.png","title":"Shortcuts 2.1.1 – Create keyboard shortcuts for routine activities","content":"Shortcuts will make your everyday tasks easier and help you to save time by creating keyboard shortcuts for routine things like launching applications and opening websites.   Set shortcuts for: Applications: – You can launch applications like iCal, iTunes, and Mail by pressing a keystroke. You can easily reconfigure shortcuts and choose other apps or […]"},{"link":"https://nmac.to/blog/planar-conquest-1-3-1/","image":"https://nmac.to/wp-content/uploads/2016/11/Planar-Conquest.png","title":"Planar Conquest 1.3.1 – A 4X turn-based strategy game inspired by Master of Magic","content":"Planar Conquest is a 4X turn-based strategy game inspired by Master of Magic. Created to give you that awesome feeling of the gameplay of the past, wrapped into modern look. “eXplore, eXpand, eXploit, and eXterminate” are the four words which are here to provide fun and challenge.   Customize your character and become all powerful […]"},{"link":"https://nmac.to/blog/anima-gate-of-memories-1-0/","image":"https://nmac.to/wp-content/uploads/2016/11/Anima.Gate_.Of_.Memories.png","title":"Anima Gate of Memories 1.0 – Third person action RPG Game","content":"Anima: Gate of Memories is a third person action RPG that tells the story of two beings bound by an unwilling pact, an ancient monster and a girl who lost her past…   Forced to stay together, their lives will take a unexpected turn when both discover that something darker than they could imagine is […]"}]