[{"link":"https://nmac.to/blog/blackguards-2-1-0/","image":"https://nmac.to/wp-content/uploads/2015/02/Blackguards.2.png","title":"Blackguards 2 1.0 – Turn-based strategy-RPG Game","content":"Blackguards 2 is a turn-based strategy-RPG and will deliver challenging hexfield battles and a gritty story filled with violence and crime.   Choose your playstyle: no matter if front line combat monster, mage or ranged fighter it’s in your hands how you want to develop your character. Every action has consequences, so make your decisions […]"},{"link":"https://nmac.to/blog/microsoft-outlook-15-6/","image":"https://nmac.to/wp-content/uploads/2015/02/Outlook.png","title":"Microsoft Outlook 15.6 – The new mailbox—Exchange on mac","content":"Online Archive support so you can browse and search your archive mailbox—Exchange Online or on-premises.   Master Category List, enabling you to access category lists and sync between Outlook clients—Mac, OWA, and Win.   Push mail support, an overall superior syncing performance, and more improvements to Exchange Web Services.   Enhanced support for email signatures, […]"},{"link":"https://nmac.to/blog/macaw-1-5-13/","image":"https://nmac.to/wp-content/uploads/2014/04/Macaw1.png","title":"Macaw 1.5.13 – The code-savvy web design tool","content":"Stop writing code. Start drawing it.   Macaw provides the same flexibility as your favorite image editor but also writes semantic HTML and remarkably succinct CSS. It’s time to expect more from a web design tool.   Fluid canvas and grid Macaw is engineered for fluid widths. Resize the canvas and your grids and elements […]"},{"link":"https://nmac.to/blog/videobox-4-1-5/","image":"https://nmac.to/wp-content/uploads/2014/04/Videobox.png","title":"Videobox 4.1.5 – Download Flash video through your browser","content":"Videobox allows you to quickly and easily download Flash video from most all of the popular video sites on the internet. Videobox will convert the video into a native Quicktime format so it’s ready to view on your Mac, iPod, iPhone or iTunes.   Version 4.1.5: Release notes were unavailable when this listing was updated. […]"},{"link":"https://nmac.to/blog/mcolordesigner-1-5/","image":"https://nmac.to/wp-content/uploads/2015/02/mColorDesigner.png","title":"mColorDesigner 1.5 – Smart color scheme / palette generator","content":"mColorDesigner is a smart color scheme / palette generator.   Features: Unique Color Picker lets you locate and pick colors from Munsell color space Instantly created harmonious color schemes based on: Munsell color system related color harmony rules; Hue-Tone systems (JIS/ISCC) related color harmony rules; General color harmony rules such as Analogous/Complementary/Split-Complementary/Triad/Tetrad/Pentad/Hexad Interactive Color Wheel […]"},{"link":"https://nmac.to/blog/hd-cleaner-1-1-2/","image":"https://nmac.to/wp-content/uploads/2014/06/HDCleaner.png","title":"HD Cleaner 1.1.2 – Remove gigabytes from your hard drive in just one click","content":"HD Cleaner helps you get rid of those useless files so you can have more room on your hard drive. Scan your home folder and free up your hard drive space for the important things.   Features Include: Overview Graph: visualize how much space you have available and how much you can clean up. Quick […]"},{"link":"https://nmac.to/blog/shortcuts-2-1/","image":"https://nmac.to/wp-content/uploads/2015/02/Shortcuts.png","title":"Shortcuts 2.1 – Create keyboard shortcuts for routine things","content":"Shortcuts will make your everyday tasks easier and help you save time by creating keyboard shortcuts for routine things like launching applications and opening websites.   Set Shortcuts for:   Applications   You can launch applications like iCal, iTunes, and Mail by pressing a keystroke. You can easily reconfigure shortcuts and choose other apps or […]"},{"link":"https://nmac.to/blog/instafeed-2-0-1/","image":"https://nmac.to/wp-content/uploads/2015/02/InstaFeed.png","title":"InstaFeed 2.0.1 – Desktop Instagram viewer","content":"InstaFeed lets you experience the best of Instagram today. A sleek interface and a huge set of features make Instagram faster and easier to use than ever before!   Features: Optimized for the Mac with an intuitive UI makes browsing Instagram a seamless experience. InstaFeed is the quickest and easiest Instagram browser. An intuitive design […]"},{"link":"https://nmac.to/blog/goodtimes-1-3/","image":"https://nmac.to/wp-content/uploads/2015/02/GoodTimes.png","title":"GoodTimes 1.3 – Collage-making app","content":"GoodTimes is a worldwide unique collage solution for all occasions. With other apps a collage is just a collection of pictures, with GoodTimes your photos get a full environment, so the situation can impress even before you look at the first photo. It’s also not just a theme based, app, it brings all the objects, […]"},{"link":"https://nmac.to/blog/idraw-2-5-1/","image":"https://nmac.to/wp-content/uploads/2014/01/iDraw.png","title":"iDraw 2.5.1 – Powerful vector drawing and illustration tool","content":"iDraw is a powerful, feature-packed vector-drawing and illustration application for OS X. It has all the tools you need to create everything from detailed technical illustrations to beautiful works of art. Create intricate designs quickly and easily, and continue working on the go with iDraw for the iPad.   Create resolution-independent illustrations that can be […]"}]