[{"link":"https://nmac.to/blog/mountain-duck/","image":"https://nmac.to/wp-content/uploads/2016/09/Mountain-Duck.png","title":"Mountain Duck 4.5.0.17823 – Mount server and cloud storage as a local disk","content":"Mountain Duck, based on the solid open-source foundation of Cyberduck, allows you to mount remote volumes in Finder on OS X and File Explorer on Windows. Access remote files as if they were on a local disk, and edit them with your preferred applications. A minimalist user interface in the menu bar allows you to […]"},{"link":"https://nmac.to/blog/zoommy/","image":"https://nmac.to/wp-content/uploads/2015/08/Zoommy_3.png","title":"Zoommy 3.2.1 – Find awesome free stock photos for your creative product or inspiration","content":"Zoommy helps you find awesome free stock photos for your creative product or inspiration. Zoommy has more than 50,000 photos licensed under Creative Commons Zero and Public Domain from 50 sources.   Version 3.2.1: Release notes were unavailable when this listing was updated.   Intel, 64-bit processor OS X 10.9 or later    "},{"link":"https://nmac.to/blog/portrait-painter/","image":"https://nmac.to/wp-content/uploads/2014/02/Portrait.Painter.png","title":"Portrait Painter 1.37 – Automatically turns a picture into a finely painted gallery","content":"Portrait Painter is a professional painting tool that automatically creates a finely painted gallery-style portrait from any image or snapshot then adds color, light and texture, which harmonize intelligently. Artists, photographers, and hobbyists will love watching their subjects transcend from the living to become immortalized in a timeless masterpiece.   Features Choose between a natural […]"},{"link":"https://nmac.to/blog/datebook/","image":"https://nmac.to/wp-content/uploads/2018/01/DateBook.png","title":"DateBook 2.1 – A simple journal app","content":"DateBook is a simple journal app for everyone who likes to write journals. It lets you write daily journals on a distraction free and beautiful interface. It saves all your journals with information like date, time, word count and presents them on a beautiful interface from where you can scroll through all your journal entries […]"},{"link":"https://nmac.to/blog/clipboard-mini/","image":"https://nmac.to/wp-content/uploads/2021/03/Clipboard-mini.png","title":"Clipboard mini 3.0.1 – Clipboard in the Cloud","content":"Clipboard mini is a full featured clipboard management application. It’s lightweight, it’s easy to use.   Features Search with keywords combination Filters by keywords or applications System-wide shortcuts System notification Menubar app Cloud sync to web app   Advanced Features For advanced users, we recommend our web service https://clipboard.airwolfspace.com * which is fully based on […]"},{"link":"https://nmac.to/blog/snapndrag-pro/","image":"https://nmac.to/wp-content/uploads/2016/02/SnapNDrag.Pro_.png","title":"SnapNDrag Pro 4.5.1 – Click-and-drag screenshot utility","content":"SnapNDrag Pro is screen capture made ridiculously easy.   SnapNDrag started off as a simple app that lets you snap a screenshot with one click and then drag the result off to Mail, Finder, or any other app that accepts an image. It has since matured into a powerful screenshot tool that helps you annotate, […]"},{"link":"https://nmac.to/blog/currency-converter/","image":"https://nmac.to/wp-content/uploads/2016/07/Currency-Converter.png","title":"Currency Converter 1.0 – The world’s major currencies converter App","content":"Currency Converter is a reliable and beautifully designed app that will help you figure out how much your money is worth around the world. It supports most of the world currencies so all you have to do is choose your base and quote currencies, enter the amount you want to convert and voila!   Features: […]"},{"link":"https://nmac.to/blog/firewall/","image":"https://nmac.to/wp-content/uploads/2021/03/Firewall.png","title":"Firewall 2.0 – Network Monito‪r","content":"The Firewall – Network Monitor application gives you the full control over your Mac, protects the privacy of your computer, prevents unwanted network connections.   Network Monitor discloses outgoing, incoming connections to your Mac keeps records of the applications’ actions reveals hidden services running on the computer   Network Filter Protects your Mac with Firewall […]"},{"link":"https://nmac.to/blog/easy-translation/","image":"https://nmac.to/wp-content/uploads/2016/07/Easy.Translation.png","title":"Easy Translation 1.5.1 – An easy to use yet powerful full-text translation tool","content":"Easy Translation, as its name suggests, is an easy to use yet powerful full-text translation tool for Mac users. With support of around 32 languages, this top-of-the-line app, offers the best possible translation for your text.   Need to translate your text? No problem. Pick your source and target languages, type your text and click […]"},{"link":"https://nmac.to/blog/translator-pro/","image":"https://nmac.to/wp-content/uploads/2021/03/Translator-Pro.png","title":"Translator Pro 1.0.1 – Instant translation app","content":"Our app supports the following languages: Afrikaans Albanian Arabic Basque Belarusian Bulgarian Catalan Chinese Chinese (traditional) Croatian Czech Danish Dutch English Estonian Filipino Finnish French German Greek Hindi Hungarian Indonesian Irish Italian Japanese Korean Malay Norwegian Polish Portuguese Romanian Russian Slovak Spanish Swedish Thai Turkish Ukrainian Vietnamese   This app requires an internet connection.   […]"}]