[{"link":"https://nmac.to/blog/picture-in-picture-1-1/","image":"https://nmac.to/wp-content/uploads/2016/05/Picture.in_.Picture.png","title":"Picture in Picture 1.1 – Floating video window","content":"Picture in Picture (PiP) allows watching videos from the internet while working at a computer. Using unique algorithms, the program finds videos on web pages and allows to open them in a floating window, that remains in the front.   Picture in Picture supports viewing any video from web pages opened in Safari and Chrome […]"},{"link":"https://nmac.to/blog/newsbar-3-8/","image":"https://nmac.to/wp-content/uploads/2016/05/NewsBar.png","title":"NewsBar 3.8 – Display RSS news feeds on your desktop","content":"NewsBar is built with a fresh concept: news feeds delivered with a smooth animation, right to your desktop with automatic iCloud sync across all Apple devices. Converts plain old RSS feeds into a live news stream with keyword watching and alerts. Works fine without Google Reader, syncing with Feedly.   All of your RSS feeds […]"},{"link":"https://nmac.to/blog/forecast-2-1/","image":"https://nmac.to/wp-content/uploads/2016/05/Forecast.png","title":"Forecast 2.1 – Weather info in your menu bar","content":"Forecast (was SimplyWeather) simply puts the weather in your menu bar. Just glance up and you’ll see the current temperature outside. Click on it to get a more detailed view of what the current conditions are and what the next four days will be. Hover your mouse over the information to get a quick forecast […]"},{"link":"https://nmac.to/blog/pdf-converter-pro-5-0-6/","image":"https://nmac.to/wp-content/uploads/2016/04/PDF-Converter-Pro.png","title":"PDF Converter Pro 5.0.6 – Convert PDFs to Offices files, HTML, and more","content":"PDF Converter Pro offers the best converter from PDF to editable Microsoft Word, Excel, PowerPoint, Plain Text, Rich Text Format, and images. It is a must for people who want to work more smartly in the office or who need to get PDF content quickly. Wondershare PDF Converter Pro adds advanced OCR technology that allows […]"},{"link":"https://nmac.to/blog/eyetv-3-6-9/","image":"https://nmac.to/wp-content/uploads/2016/04/EyeTV.png","title":"EyeTV 3.6.9 – Watch and record TV on your Mac","content":"EyeTV brings a rich TV experience to your Mac. Watch live TV on your Mac. Pause, rewind, and record whenever you want. EyeTV gives you powerful control over what you watch and how you watch it.   Put down the remote. Grab your Mac.   A Smarter interface. Find your favorite shows using a convenient […]"},{"link":"https://nmac.to/blog/disc-cover-3-1-3/","image":"https://nmac.to/wp-content/uploads/2014/11/Disc-Cover.png","title":"Disc Cover 3.1.3 – Design and print CD/DVD labels","content":"Disc Cover is slick and intuitive software to create CD and DVD labels, covers, tray inserts, folding booklets, slim cases, super jewel boxes as well as mini-CD labels, business card CDs, VHS wraps and more.   Over 250 template sets and 1,000+ clipart imahes (40,000+ with Extras Pack) provide a great help for a quick […]"},{"link":"https://nmac.to/blog/the-walking-dead-michonne/","image":"https://nmac.to/wp-content/uploads/2016/02/The.Walking.Dead-Michonne.png","title":"The Walking Dead: Michonne Episode 3 1.0 – A Telltale Miniseries","content":"    The Walking Dead: Michonne – A Telltale Miniseries stars the iconic, blade-wielding character from Robert Kirkman’s best-selling comic books. Haunted by her past, and coping with unimaginable loss and regret, the story explores Michonne’s absence between issues #126 and #139 of the comic book.   Includes access to all three episodes (all episodes […]"},{"link":"https://nmac.to/blog/chaos-reborn-1-0/","image":"https://nmac.to/wp-content/uploads/2016/04/Chaos-Reborn.png","title":"Chaos Reborn 1.0 – Fast paced wizard combat with the tactical positioning of chess","content":"From Julian Gollop, the designer of the original, award-winning XCOM game comes Chaos Reborn – a fast paced, turn-based wizard combat game with strategic Realm Quests. Between 2 and 4 players can challenge each other to magical duels in a variety of arenas using a spell deck of interesting spells and creatures – including the […]"},{"link":"https://nmac.to/blog/pin-pro-for-pinterest-1-9/","image":"https://nmac.to/wp-content/uploads/2014/08/Pin-Pro-for-Pinterest.png","title":"Pin Pro for Pinterest 1.9 – Browse Pinterest from your menu bar","content":"Pin Pro takes your Pinterest addiction to a whole new level. It is the best app for instantly browsing and uploading to your Pinterest account without ever having to open your web browser! Browse through the latest pinned images from your friends and the wider Pinterest community. With Pin Pro, you can also upload images to […]"},{"link":"https://nmac.to/blog/blogtouch-2-0-0/","image":"https://nmac.to/wp-content/uploads/2016/04/BlogTouch2.png","title":"BlogTouch 2.0.0 – Blogger/Blogspot editor for your Mac","content":"BlogTouch is a friendly Blogger/Blogspot editor for your Mac. It’s equipped with everything you need to manage your blogs: write, publish, update or share posts and moderate comments.   Be more productive and efficient with this powerful and straightforward tool – because at the end of the day, we all have something to share.   […]"}]