[{"link":"https://nmac.to/blog/macpilot/","image":"https://nmac.to/wp-content/uploads/2021/10/MacPilot_13.png","title":"MacPilot 13.0.6 – Enable over 1,200 hidden features in OS X and other apps","content":"MacPilot gives you the power of UNIX and the simplicity of Macintosh, which means a phenomenal amount of untapped power in your hands! Use MacPilot to unlock over 1,200 features, and access them all with the easy and familiar Macintosh user interface. No command line tools or complicated file operations!   Display hidden files in […]"},{"link":"https://nmac.to/blog/fonelab/","image":"https://nmac.to/wp-content/uploads/2017/09/FoneLab9.png","title":"FoneLab 10.2.82 – iPhone, iPad, and iPod Touch data recovery software","content":"FoneLab is a data recovery utility for iPhone, iPad & iPod Touch. It helps you recover the lost or deleted data due to jailbreak, iOS upgrade, etc. from iTunes and iOS devices directly.   Features: Support iOS 8.1 and the latest iPhone 6 Plus/6, iPad Air 2/mini 3 Retrieve and backup 19 types of data […]"},{"link":"https://nmac.to/blog/aiseesoft-dvd-creator/","image":"https://nmac.to/wp-content/uploads/2014/12/Aiseesoft-DVD-Creator5.png","title":"Aiseesoft DVD Creator 5.2.22 – Convert video file in any formats to a DVD format","content":"Aiseesoft DVD Creator lets you easily convert video file in any formats to a DVD format and burn it to a DVD disc that can be played on any home DVD player. It gives you lightning fast creating speed. It has never been easier to enjoy the videos you collected or recorded on a DVD […]"},{"link":"https://nmac.to/blog/total-video-converter-pro/","image":"https://nmac.to/wp-content/uploads/2015/11/Total.Video_.Converter.Pro_.png","title":"Total Video Converter Pro 4.7.2 – Audio and video converter","content":"Total Video Converter Pro is a full-featured and complete video toolbox that lets you convert, trim, edit, burn, enhance and watch videos. It supports to convert videos to and from almost all video and audio formats with 30X times faster conversion speed.   Total Video Converter Pro is the best Video Converter to convert videos […]"},{"link":"https://nmac.to/blog/total-video-player/","image":"https://nmac.to/wp-content/uploads/2018/08/Total-Video-Player-Pro.png","title":"Total Video Player Pro 3.1.1 – Video player with extended functionality","content":"Total Video Player is a powerful, full-featured HD media player, supporting 1080p, 3GP, MP4, H264, MOV, FLV, and all other popular video files together with any audio formats (MP3, WMA, Ogg, MPEG-1,MPEG-2, etc.) as well as DVDs and audio CDs. With a perfect playlists manager and pinned-screen feature, it is really a very convenient media […]"},{"link":"https://nmac.to/blog/eon/","image":"https://nmac.to/wp-content/uploads/2020/12/Eon_Timer.png","title":"Eon 2.9 – Simple and elegant time tracking","content":"Eon helps you easily track time on your Mac. Eon allows you to easily post time to several services to make invoicing as painless as possible.   Version 2.9: Fixed: Issues with Zoho Invoice and Zoho Books authentication.   Intel, 64-bit processor macOS 10.12 or later    "},{"link":"https://nmac.to/blog/clipsy/","image":"https://nmac.to/wp-content/uploads/2020/01/Clipsy.png","title":"Clipsy 1.7 – Store all that you have copied","content":"Clipsy stores all that you have copied text, files and allows you to quickly find text or image or doc from the clipboard history you have been looking for.   Access the clipboard history from the menu bar or can search with shortcut and retrieve back the data. Just enable shortcut to search and make […]"},{"link":"https://nmac.to/blog/ebookbinder/","image":"https://nmac.to/wp-content/uploads/2020/08/eBookBinder_1.png","title":"eBookBinder 1.11.0 – Create your own ebooks using existing documents","content":"eBookBinder is the super-easy tool to create your own ebooks using your existing documents. When compiling your book project, eBookBinder creates an epub file. There are just three major steps to your very own eBook: Enter book details. Name of the book and its author, add an image for the book-cover, webpage of the publisher […]"},{"link":"https://nmac.to/blog/mic-drop/","image":"https://nmac.to/wp-content/uploads/2020/12/Mic-Drop.png","title":"Mic Drop 1.4.2 – Mute your mic with a hotkey","content":"Mic Drop allows users to mute and unmute their microphone using a customizable, global keyboard shortcut. With Mic Drop, you always know whether your mic is on or not, helping to avoid those embarrassing situations. It is ideally suited for remote workers, teachers, podcasters, user researchers, or anyone spending lots of time in video meetings. […]"},{"link":"https://nmac.to/blog/ethernet-status/","image":"https://nmac.to/wp-content/uploads/2018/11/Ethernet-Status.png","title":"Ethernet Status 5.4 – Menu-bar icon indicates connection status","content":"See the status of your LAN/Ethernet connection right from the menu bar. This utility adds a neat icon on the menu bar which lets you know the status of the connection and IP address.   Features: See the Status, IP address and speed of the Ethernet Adaptors Get the public IP address of your computer […]"}]