[{"link":"https://nmac.to/blog/antivirus-cyber-byte-pro/","image":"https://nmac.to/wp-content/uploads/2019/07/Antivirus-Cyber-Byte-Pro.png","title":"Antivirus Cyber Byte Pro 3.7.1 – Antivirus for Mac OS X","content":"The Mac is generally considered to be safe and secure, and there are a number of reasons why Macs are considered more secure than PCs, but there are plenty of risks that Macs haven’t managed to completely avoid.   We, at CyberByte, besides our security consultancy expertise, we study the malware evolution and we had […]"},{"link":"https://nmac.to/blog/cookbook-author/","image":"https://nmac.to/wp-content/uploads/2018/11/Cookbook-Author.png","title":"Cookbook Author 2.0.4 – A collection of more than 30 compelling templates for iBooks Author","content":"Cookbook Author – Templates is a collection of more than 30 compelling templates for Apple’s new application for food book creation and publishing. Find the perfect look, add your text and images and publish your own book to iBookstore!   The emphasis of Cookbook Author – Templates is put on entertaining writing, so it is […]"},{"link":"https://nmac.to/blog/softraid/","image":"https://nmac.to/wp-content/uploads/2016/05/SoftRAID5.png","title":"SoftRAID 5.8.1 – High-quality RAID management","content":"SoftRAID allows you to create and manage disk arrays to increase performance and reliability. SoftRAID allows the user to create and manage RAID 4 and 5 volumes, RAID 1+0, and RAID 1 (Mirror) and RAID 0 (Stripe) volumes. SoftRAID also provides “predictive disk failure”, where users are alerted to potential disk failures even before they fail. […]"},{"link":"https://nmac.to/blog/nice-clipboard/","image":"https://nmac.to/wp-content/uploads/2017/10/Nice-Clipboard1.png","title":"Nice Clipboard 1.6.1 – A cloud synced clipboard manager","content":"Nice Clipboard is a clipboard history manager that is always waiting for you under menubar icon. It is synced via iCloud between your Macs and iOS devices and is built using newest Apple technologies to be lightweight and superfast. These features make your clipboard much more useful tool in your everyday life.   Features: automatically […]"},{"link":"https://nmac.to/blog/papers/","image":"https://nmac.to/wp-content/uploads/2017/03/Papers3.png","title":"Papers 3.4.23 – Your personal library of scientific resources","content":"Papers is your personal library of science.   Read, Write, Cite. Your research will never be the same with Papers and Magic Manuscripts.   Papers revolutionizes the way you deal with your research documents. It allows you to search for them, download and organize them together with supplementary material, allows you to read them full […]"},{"link":"https://nmac.to/blog/image-ascii/","image":"https://nmac.to/wp-content/uploads/2019/11/Image-Ascii.png","title":"Image-Ascii 2.3 – Convert images to color or monochrome Ascii Art","content":"Image-Ascii allows you to convert images to color or monochrome Ascii Art. You can also convert text to Ascii Banners.   The app works as an ASCII Generator, it converts an image to text. To generate a JPEG, GIF or PNG select file and click on “convert”.   Version 2.3: fix bug and improve stability […]"},{"link":"https://nmac.to/blog/hazeover/","image":"https://nmac.to/wp-content/uploads/2016/08/HazeOver1.png","title":"HazeOver 1.8.5 – Get rid of interferences and focus on your current task","content":"HazeOver … Get rid of interferences and focus on your current task. Let this small application accentuate the active window by dimming inactive ones.   Version 1.8.5: Added: shortcuts for changing dimming intensity Fixed: unresponsive tab switching in HazeOver preferences when using macOS Catalina   OS X 10.11 or later, 64-bit processor    "},{"link":"https://nmac.to/blog/vectoraster-7/","image":"https://nmac.to/wp-content/uploads/2016/10/Vectoraster7.png","title":"Vectoraster 7.4.6 – Creating vector-based raster patterns from bitmap images","content":"Vectoraster is a graphics utility for creating vector-based raster patterns and halftones based on images or gradients. The raster patterns and point shapes can be changed and varied across the pattern to produce many different styles. The resulting raster is always shown, updating in real time as you change parameters. The result can then easily […]"},{"link":"https://nmac.to/blog/metamovie/","image":"https://nmac.to/wp-content/uploads/2016/03/MetaMovie.png","title":"MetaMovie 2.4.3 – Add Metadata to your videos","content":"MetaMovie finds all the data necessary to make your iTunes movie library perfect: actors, release date, directors, overview, even poster art. Just search for the movie name, and then one click will bring all the information to your movie. The tagged movies look great in iTunes and on your Apple TV.   MetaMovie supports the […]"},{"link":"https://nmac.to/blog/news-explorer/","image":"https://nmac.to/wp-content/uploads/2016/08/News-Explorer.png","title":"News Explorer 1.9.7 – Newsreader with cloud-based sync","content":"News Explorer is an innovative easy-to-use news reader exclusively built for the Apple’s ecosystem, with iCloud based synchronisation between Mac, iPhone, iPad, iPod touch, Apple Watch, and Apple TV.   Full Sync Across All Your Devices News Explorer syncs your subscriptions, folder setup, news items, read statuses and favorites across all your Apple devices. Synchronisation […]"}]