[{"link":"https://nmac.to/blog/transistor/","image":"https://nmac.to/wp-content/uploads/2019/02/Transistor.png","title":"Transistor 1.50440 – A sci-fi-themed action RPG Game","content":"From the creators of Bastion, Transistor is a sci-fi themed action RPG that invites you to wield an extraordinary weapon of unknown origin as you fight through a stunning futuristic city. Transistor seamlessly integrates thoughtful strategic planning into a fast-paced action experience, melding responsive gameplay and rich atmospheric storytelling. During the course of the adventure, […]"},{"link":"https://nmac.to/blog/the-witcher-2/","image":"https://nmac.to/wp-content/uploads/2017/08/The.Witcher.2.png","title":"The Witcher 2: Assassins of Kings Enhanced Edition 1.1 – RPG Fantasy Game","content":"Play a game where your choices really matter and where you affect the fate of individuals, communities, and entire kingdoms. Fight blood-thirsty monsters and navigate a web of schemes, lies, and political intrigue in one of the best looking games ever to come to Mac.   You are Geralt of Rivia, a witcher, a member […]"},{"link":"https://nmac.to/blog/the-witcher/","image":"https://nmac.to/wp-content/uploads/2019/02/The-Witcher.png","title":"The Witcher: Enhanced Edition Directors Cut 1.0 – RPG Fantasy Game","content":"The Witcher is a role-playing game set in a dark fantasy world where moral ambiguity reigns. Shattering the line between good and evil, the game emphasizes story and character development, while incorporating a tactically-deep, real-time combat system.   Become The Witcher, Geralt of Rivia, and get caught in a web of intrigue woven by forces […]"},{"link":"https://nmac.to/blog/video-gif-creator/","image":"https://nmac.to/wp-content/uploads/2017/09/Video-GIF-Creator.png","title":"Video GIF Creator 1.2 – Convert video or images to an animated GIF","content":"Video GIF Creator is the complete solution for converting videos and images to animated GIFs. Designed to satisfy the needs of both casual users and professional web designers, and featuring an impressive set of editing options, Video GIF Creator gives you unlimited creative freedom when it comes to creating animated GIF images. But here is […]"},{"link":"https://nmac.to/blog/focuslist/","image":"https://nmac.to/wp-content/uploads/2017/04/FocusList.png","title":"FocusList 1.0.11 – Focus timer and daily planner","content":"FocusList allows you to get more deep work done. FocusList is your one app to plan the day and be more productive using 25 minutes intervals, timeboxing and retrospective.   Features: Plan: Start the day by planning your activities throughout the day. Give each task an estimate. Plan your entire day, and try to get […]"},{"link":"https://nmac.to/blog/balsamiq-mockups/","image":"https://nmac.to/wp-content/uploads/2017/07/Balsamiq-Mockups3.png","title":"Balsamiq Mockups 3.5.17 – Collaborative wireframing for app development","content":"Using Balsamiq Mockups feels like drawing, but because it’s digital, you can tweak and rearrange easily. Teams can come up with a design and iterate over it in real-time in the course of a meeting. Product managers, designers, developers, and even clients can now work together in the same tool to quickly iterate over wireframes, […]"},{"link":"https://nmac.to/blog/sherlock/","image":"https://nmac.to/wp-content/uploads/2019/01/Sherlock.png","title":"Sherlock 1.1.1 – Give your iOS Simulator superpowers","content":"Give your iOS Simulator superpowers. Edit views and layout constraints in real time, simulate running on other devices, and jump straight to the source code, all from your Simulator – zero configuration required.   View Edit properties on your view and it’s layer in real time – so you can create the perfect shadow or […]"},{"link":"https://nmac.to/blog/undistracted/","image":"https://nmac.to/wp-content/uploads/2016/07/UnDistracted.png","title":"UnDistracted 1.78 – Turn off everything that distracts you","content":"UnDistracted is a simple app developed to help you stay concentrated on the task at hand. The utility has settings that will eliminate distractions and promotes activation of a “Focus Mode” that will make all the necessary adjustments without too much user interference.   Features Turn everything off–with one click – There are a lot […]"},{"link":"https://nmac.to/blog/the-incredible-adventures-of-van-helsing/","image":"https://nmac.to/wp-content/uploads/2015/08/The.Incredible.Adventures.F.C.png","title":"The Incredible Adventures of Van Helsing: Final Cut 1.1.0 – RPG, Action & Adventure game","content":"Grab your weapons and embark on an incredible adventure in the gothic-noir world of Borgovia, where mad science threatens the peace between monsters and mortals. Save the day with your charming companion, Lady Katarina (who happens to be a ghost). Explore the wilderness and the grim districts of a metropolis twisted by weird science, and […]"},{"link":"https://nmac.to/blog/firewatch/","image":"https://nmac.to/wp-content/uploads/2016/12/Firewatch2.png","title":"Firewatch 1.09 – First-person mystery game set in the Wyoming wilderness","content":"Firewatch is a single-player first-person mystery set in the Wyoming wilderness.   The year is 1989. You are a man named Henry who has retreated from his messy life to work as a fire lookout in the Wyoming wilderness. Perched high atop a mountain, it’s your job to look for smoke and keep the wilderness […]"}]