[{"link":"https://nmac.to/blog/fly-and-destroy-1-0/","image":"https://nmac.to/wp-content/uploads/2017/05/Fly-And-Destroy.png","title":"Fly and Destroy 1.0 – A space arcade unlike anything you’ve experienced before","content":"Fly and destroy is a hectic bullet hell shoot em up. Strap yourself into the cockpit of your fighter and get ready to blow up some asteroids! The onslaught of asteroids that awaits you would make anyone tremble in fear, but don’t worry – your trusty ship can suck up random power ups to help […]"},{"link":"https://nmac.to/blog/books-mill-themes-for-ibooks-author-4-8/","image":"https://nmac.to/wp-content/uploads/2016/09/Themes-for-iBooks-Author4.png","title":"Books Mill – Themes for iBooks Author 4.8 – Professionally templates for iBooks Author","content":"Themes for iBooks Author is a collection of compelling templates for Apple’s new application for book creation and publishing. Browse the wide range of designs to find the perfect look, add your text and images, and publish your own book to iBookstore!   The available templates cover various book categories, from business and travel, to […]"},{"link":"https://nmac.to/blog/video-editor-robot-2-2/","image":"https://nmac.to/wp-content/uploads/2017/02/Video.Editor.Robot_.png","title":"Video Editor Robot 2.2 – Edit video, audio, image, titles using fabulous tools","content":"Video Editor Robot editing video is only three-step: Step 1, Import media; Step 2, Edit video, audio, image, titles using fabulous tools Step 3, Export video.   Supported Input Formats Support high-resolution videos such as 4K, 3D, 8K Video formats: MPG, MPEG, MPEG 2, VOB, DAT, MP4, M4V, TS, MTS, M2TS, RM, RMVB, WMV, ASF, […]"},{"link":"https://nmac.to/blog/steamworld-dig/","image":"https://nmac.to/wp-content/uploads/2017/05/SteamWorld-Dig.png","title":"SteamWorld Dig 1.1.0 – A platform mining adventure game","content":"SteamWorld Dig is a platform mining adventure with strong Metroidvanian influences. Take the role of Rusty, a lone mining steambot, as he arrives at an old mining town in great need. Dig your way through the old earth, gaining riches while uncovering the ancient threat that lurks below…   Features: A rich world of steam-driven […]"},{"link":"https://nmac.to/blog/dragon-responsive-email-designer-2-60/","image":"https://nmac.to/wp-content/uploads/2017/05/Dragon-Responsive-Email-Designer2.png","title":"Dragon Responsive Email Designer 2.60 – Create emails with responsive design","content":"Dragon Responsive Email Designer helps you create beautiful emails for any device! Intuitive drag-and-drop designer with zero coding, fabulous responsive emails made simple.   Features Intuitive drag-and-drop designer: Create and send beautiful responsive emails in minutes. Zero coding required. Simple and powerful: Perfect for both beginners and experienced email designers. Jump start with any of […]"},{"link":"https://nmac.to/blog/business-template-lab-1-0-2/","image":"https://nmac.to/wp-content/uploads/2017/05/Business-Template-Lab.png","title":"Business Template Lab 1.0.2 – Templates for MS Word","content":"Convince your clients, impress your peers – Business Template Lab for MS Word by Jumsoft makes creating gripping Microsoft Word documents easier and quicker than ever before! Hundreds of professional templates and near-infinite customization opportunities make it the most powerful tool available to unleash your creativity in business documents.   Business Template Lab for MS […]"},{"link":"https://nmac.to/blog/bills-1-10-8/","image":"https://nmac.to/wp-content/uploads/2013/03/Bills.png","title":"Bills 1.10.8 – Plan and track your expenses every month","content":"Bills is an application that can help you plan and track your expenses every month. Brilliant interface will remind you of a real-life office room (check the screenshots). Clear, simple and quick (a MUST HAVE) financial planning!   You always need a simple tool to control how much you want to spend this month. Essentially […]"},{"link":"https://nmac.to/blog/scrollstickies-3-20/","image":"https://nmac.to/wp-content/uploads/2016/07/ScrollStickies.png","title":"ScrollStickies 3.20 – Resizable Reminders, notes, clippings stickies on your desktop","content":"A sticker/post it app with a teleprompter-like text scrolling mode!   Leave as many colorful, resizable stickies on your desktop with reminders, notes, clippings as you want. Contents are automatically saved with backups and can be restored at startup. Includes a very useful teleprompter mode that allows single line scrolling text.   Version 3.20: Preferences […]"},{"link":"https://nmac.to/blog/photosign-2-1-4/","image":"https://nmac.to/wp-content/uploads/2017/05/Photosign.png","title":"Photosign 2.1.4 – Batch watermark","content":"Photosign is an image signing application which allows users to append text on multiple images in a fast way. It automatically locates texts and adjusts their font size in any image using a single reference image   Features One arrangement and thousands of text added image Applying filters to images Using exif information as a […]"},{"link":"https://nmac.to/blog/greeting-cards-mill-1-9-3/","image":"https://nmac.to/wp-content/uploads/2016/07/Greeting-Cards.png","title":"Greeting Cards Mill 1.9.3 – A collection of 500 Pages templates for cheerful celebrations","content":"Greeting Cards Mill – Graphic Node presents a holidays card application offering a collection of 500 Pages templates for cheerful celebrations.   Buy it now if you: Want to congratulate your friends or loved ones Do it like a professional designer Want to get regular updates Like free things and holidays   Nearly all objects […]"}]