[{"link":"https://nmac.to/blog/formz/","image":"https://nmac.to/wp-content/uploads/2017/12/formZ.png","title":"formZ 8.6 – Solid and surface modeler","content":"formZ pro is a powerful 3D design application featuring a variety of modeling personalities and tools with an easy to use interface to express and communicate your imagination. It is based on advanced 3D solid and surface modeling methods that maintain accurate representations as you progress from design to visualization, layout, animation and fabrication.   […]"},{"link":"https://nmac.to/blog/shadowhand/","image":"https://nmac.to/wp-content/uploads/2017/12/Shadowhand.png","title":"Shadowhand 0.94 – A strategic RPG card game","content":"Shadowhand is a strategic RPG card game. Duel powerful enemies with unique solitaire-style turn-based combat. Equip your character strategically to sneak, slice and blast through foes!   SET IN LATE 18TH CENTURY ENGLAND We follow the story of Lady Cornelia Darkmoor, a beguiling young aristocrat who masquerades as the notorious highwaywoman, Shadowhand. Fleeing a crime […]"},{"link":"https://nmac.to/blog/hold-on-for-dear-life/","image":"https://nmac.to/wp-content/uploads/2017/11/Hold-On-for-Dear-Life.png","title":"Hold On for Dear Life 1.5.1 – Crypto stock widget with a menu bar ticker","content":"Apple stock widget meets crypto. With a Menu Bar ticker.   FEATURES: Today Widget in the Notification Center. Real-time (literally) price updates in the Menu Bar. Histograms charts of recent market performance.   SUPPORTS: Thousands of cryptos. Dozens of “from” currencies. Various exchanges.   Version 1.5.1: Many bug fixes. Custom Font!   macOS 10.12 or […]"},{"link":"https://nmac.to/blog/cpu-speed-accelerator/","image":"https://nmac.to/wp-content/uploads/2017/12/CPU-Speed-Accelerator.png","title":"CPU Speed Accelerator 8.0 – Increase the CPU allocated to your foreground applications","content":"CPU Speed Accelerator will help you increase the power of your Ma, at very low cost. You want to increase by 20% to 30% the speed of your applications without spending money in new hardware? You want to automatically always make the most of the power of your CPU to the foreground application you are […]"},{"link":"https://nmac.to/blog/rank-tracker/","image":"https://nmac.to/wp-content/uploads/2016/06/Rank-Tracker.png","title":"Rank Tracker 8.20 – SEO software for researching keywords and tracking rankings","content":"RankTracker is a piece of SEO software to both research keywords and track rankings.   RankTracker allows you to unearth unending number of niche-specific keywords in a matter of minutes! It uses 19 different keyword suggestion methods, including Google AdWords Keyword tool, competition research, etc. Moreover, workspace filters allow you to easily manage your keyword […]"},{"link":"https://nmac.to/blog/templates-expert/","image":"https://nmac.to/wp-content/uploads/2017/12/Templates-Expert.png","title":"Templates Expert 6.0 – Templates for Pages, Keynote","content":"Templates for iWork – Templates Guru is an excellent pot-pourri of 1000+ designs of symbol images and for Keynote & Apple’s Mail.   Save time and achieve more with Templates Guru!   Suite for Pages 2016 The collection of 190 easy-to-use templates for producing business and personal content with Apple’s Pages covers a wide selection […]"},{"link":"https://nmac.to/blog/print-selection/","image":"https://nmac.to/wp-content/uploads/2015/12/Print-Selection.png","title":"Print Selection 1.3.3 – Save ink, paper, and time by printing only what you want","content":"Print Selection integrates with OS X so you can selectively print snippets from the Web, email, and documents. Stop wasting ink and paper printing off banner ads or comments from websites!   Accessible from the menubar or as a service, it is super easy to paste text and images into the app to print. Power […]"},{"link":"https://nmac.to/blog/whatsapp-recovery/","image":"https://nmac.to/wp-content/uploads/2016/08/WhatsApp-Recovery.png","title":"WhatsApp Recovery 3.2.0 – Easily and efficiently recover deleted, lost WhatsApp messages","content":"Tenorshare WhatsApp Recovery for Mac can easily and efficiently recover deleted, lost WhatsApp messages (text, photos, videos and audios included) on iPhone/iPad/iPod for free. No matter you have backup or not.   Top 6 Reasons to Have Free WhatsApp Recovery for Mac   For whatever reasons you lost your WhatsApp chats, this freeware can retrieve them […]"},{"link":"https://nmac.to/blog/muvee-360-video-stitcher/","image":"https://nmac.to/wp-content/uploads/2017/12/muvee-360-Video-Stitcher.png","title":"muvee 360 Video Stitcher 2.0.1 – Software for the Samsung Gear 360 Cameras","content":"The most powerful Mac Software for the Samsung Gear 360 Cameras   STITCH  Automatically stitches 360 Videos captured with your Samsung Gear 360 Camera.   PHOTOS  Comfortably browse your 360 Photos taken with the Samsung Gear 360 cameras on your Mac.   TRIM  Quick and easy trimming. Just set start and end points, and there […]"},{"link":"https://nmac.to/blog/mad-games-tycoon/","image":"https://nmac.to/wp-content/uploads/2017/12/Mad.Games_.Tycoon.png","title":"Mad Games Tycoon 1.0 – Build up your own games empire","content":"Form your own game studio in the early 1980s starting in a small garage. Develop your own game concepts, create a team and develop megahit video games. Research new technologies, train your staff, upgrade your offices, moving up to bigger and better locations. Expand your business and dominate the world market for video games!   […]"}]