[{"link":"https://nmac.to/blog/picframe-2-8/","image":"https://nmac.to/wp-content/uploads/2014/09/PicFrame.png","title":"PicFrame 2.8 – Combine multiple photos into frames","content":"PicFrame helps you combine multiple photos into amazing looking frames that you can save to your computer or share to Facebook. With 67 adjustable frames, rounded corners and plenty of patterns, you will always have a unique look.   Since PicFrame was released on the iPhone and iPad we have often been requested to create […]"},{"link":"https://nmac.to/blog/browserism-2-3-1/","image":"https://nmac.to/wp-content/uploads/2016/08/Browserism.png","title":"Browserism 2.3.1 – Easily switch your default browser","content":"Browserism is a little app that helps you quickly switch your Mac’s default web browser. Out of the box it supports Safari, Chrome, Firefox, and Opera. You can add up to 4 additional browsers as well.   Use a different browser at work than you do at home? Browserism can schedule your work browser to […]"},{"link":"https://nmac.to/blog/imposition-wizard-2-8-1/","image":"https://nmac.to/wp-content/uploads/2016/11/Imposition-Wizard2.png","title":"Imposition Wizard for Acrobat 2.8.1 – Create books, booklets and brochures","content":"Imposition Wizard is imposition software for Mac OS X. It reads PDF files, applies transformations to pages and saves the results to another PDF file. You can create booklets and books, prepare business cards for print and much, much more. All the power is packed into a simple user interface that allows you to see […]"},{"link":"https://nmac.to/blog/coverage-1-1/","image":"https://nmac.to/wp-content/uploads/2016/02/Coverage.png","title":"Coverage 1.1 – Ink usage and cost calculator for printing","content":"Coverage is an advanced printing costs calculator which shows a detailed document statistics and estimates the printing costs taking into account ink, paper and other expenses. Coverage saves you money by showing how much it costs to print absolutely every page of the document.   Version 1.1: This update fixes some minor issues with specific […]"},{"link":"https://nmac.to/blog/vector-magic/","image":"https://nmac.to/wp-content/uploads/2016/11/Vector-Magic.png","title":"Vector Magic 1.20 – Convert bitmap images to vector art","content":"Vector Magic converts bitmap images like JPEGs, GIFs and PNGs to the crisp, clean, scalable vector art of EPS, SVG, and PDF with the world’s best auto-tracing software.   Vector images are images described by shapes such as circles and squares, as opposed to bitmap images which are described by pixels – squares of color […]"},{"link":"https://nmac.to/blog/cinema-4d-18-0/","image":"https://nmac.to/wp-content/uploads/2016/07/Cinema-4D.png","title":"Cinema 4D 18.0 – Create 3D videos and animation","content":"CINEMA 4D offers you all you need to create high-end 3D pictures and animations – right out of the box. And CINEMA 4D’s modular design – with a total of 8 modules that you can buy individually – allows you to custom fit the application to suit your needs and your budget. The XL and […]"},{"link":"https://nmac.to/blog/liquivid-1-6-0/","image":"https://nmac.to/wp-content/uploads/2016/08/liquivid.png","title":"liquivid 1.6.0 – Easy-to-use video and photo correction","content":"liquivid is an intuitive, easy-to-use editor for your videos and photos. Clean up and improve all your captures with a single click, and have more fun viewing and sharing your memories. liquivid fixes lens distortion caused by wide angle lenses (as in most action-cams), removes camera shake and image noise, and improves colors and sharpness. […]"},{"link":"https://nmac.to/blog/home-design-3d-4-0-4/","image":"https://nmac.to/wp-content/uploads/2016/11/Home-Design-3D.png","title":"Home Design 3D 4.0.4 – Design and change your home","content":"With Home Design 3D, designing and remodeling your house in 3D has never been so quick and intuitive!   Accessible to everyone, Home Design 3D is the reference interior design application for a professional result at your fingertips!   CREATE, DESIGN, FURNISH AND DECORATE EASILY YOUR HOME AND SHARE IT WITH A COMMUNITY OF MORE […]"},{"link":"https://nmac.to/blog/world-ship-simulator-1-0/","image":"https://nmac.to/wp-content/uploads/2016/11/World.Ship_.Simulator.png","title":"World Ship Simulator 1.0 – Ships simulation game","content":"Set in a fictitious environment inspired by ports and landmarks from around the globe, in World Ship Simulator you can captain magnificent vessels on the high seas in an expansive open world and begin your career in the maritime industry.   Start from humble beginnings with a single ship and successfully complete a selection of […]"},{"link":"https://nmac.to/blog/org-chart-designer-pro-4-1/","image":"https://nmac.to/wp-content/uploads/2016/06/Org-Chart-Designer-Pro.png","title":"Org Chart Designer Pro 4.1 – Drag-and-drop designer for org charts and network diagrams","content":"Org Chart Designer Pro makes it simple to create and publish professional org charts and network diagrams.   Features Intuitive drag and drop designer Supports shapes, textboxes, photos, image slideshows and table grids Supports multiple layerings with full layer arrangement and grouping features Supports advanced “Auto Branch Generation”, allows you to quickly add new levels […]"}]