[{"link":"https://nmac.to/blog/dr-fone-for-android-1-4-1/","image":"https://nmac.to/wp-content/uploads/2016/10/Dr.Fone-for-Android.png","title":"Dr.Fone for Android 1.4.1 – Android Data Recovery Software","content":"Dr.Fone for Android – World’s 1st Android smartphone and tablet recovery software. Highest recovery rate in the industry. Recover photos, videos, contacts, messaging, call logs, and more. Compatible with 6000+ Android devices.   Other Scenarios Lost data after factory restore Lost data due to OS update Device stuck and not responding Data missing after Rooting […]"},{"link":"https://nmac.to/blog/the-storm-guard-darkness-is-coming-1-0/","image":"https://nmac.to/wp-content/uploads/2016/10/The.Storm_.Guard_.png","title":"The Storm Guard: Darkness is Coming 1.0 – A challenging turn-based strategy game","content":"The Storm Guard is a challenging turn-based roguelike role-playing game inspired by the Night’s Watch in the Game of Thrones.   You assume the role of the Lord Commander of the Storm Guard leading the order during difficult times. An ancient dragon and its minions have returned, threatening the realm of men. While in your […]"},{"link":"https://nmac.to/blog/bestcrypt-2-0-27/","image":"https://nmac.to/wp-content/uploads/2016/10/BestCrypt.png","title":"BestCrypt 2.0.27 – Take command of storing confidential data","content":"BestCrypt Container Encryption provides painless encryption to store any selected files or folders on:   Active computers. Shared workstations. Removable storage. Network storage.   Encrypted containers work like virtual drives – intuitively easy with transparent use and access to files. File encryption by Jetico delivers cross-platform compatibility: BestCrypt container files may be moved to any […]"},{"link":"https://nmac.to/blog/jaksta-media-recorder-1-5-0/","image":"https://nmac.to/wp-content/uploads/2015/12/Jaksta-Media-Recorder.png","title":"Jaksta Media Recorder 1.5.0 – The Best Video and Music Downloader","content":"More than just an ordinary video and music downloader, Jaksta Media Recorder makes it incredibly easy to save and convert videos and music from thousands of web sites directly to your mac.   THE BEST YOUTUBE DOWNLOADER Jaksta Media Recorder can download YouTube videos. Use Jaksta Media Recorder for your YouTube downloads as it is […]"},{"link":"https://nmac.to/blog/disk-mounter-1-1/","image":"https://nmac.to/wp-content/uploads/2016/10/Disk-Mounter.png","title":"Disk Mounter 1.1 – The easier way to manage external disks & volumes","content":"Disk Mounter is simple utility that gives you easier way to manage external disks & volumes. You can mount, unmount and eject disk volume by just one-click. When disk gets mounted, unmounted or ejected it notifies you in the way you want (system notification or notification panel)   Version 1.1: Release notes were unavailable when this listing […]"},{"link":"https://nmac.to/blog/battery-time-indicator-1-2/","image":"https://nmac.to/wp-content/uploads/2015/12/Battery.Time_.Indicator.png","title":"Battery Time Indicator 1.2 – Useful battery remaining time indicator","content":"This Battery Indicator looks like a default one, but it combines the battery icon and the remaining time indicator, hence saves some space in the status bar   Version 1.2: Added percentage view New B/W icons   OS X 10.10 or later, 64-bit processor    "},{"link":"https://nmac.to/blog/12c-financial-calculator-2-4/","image":"https://nmac.to/wp-content/uploads/2016/10/12C-Financial-Calculator.png","title":"12C Financial Calculator 2.4 – Powerful emulator of HP 12C RPN financial calculator","content":"12C Financial Calculator is the most powerful emulator of HP 12C RPN financial calculator on Mac. Built with identical mathematics and algorithms of the original, it gives you exactly same capabilities with better performance and more functions.   Features: Time value of money TVM Cash flow analysis NPV, IRR Amortization Bonds Depreciation Loan payments calculation […]"},{"link":"https://nmac.to/blog/valley-1-0/","image":"https://nmac.to/wp-content/uploads/2016/10/Valley.png","title":"Valley 1.0 – First-Person Adventure & Action Game","content":"Explore the vast and beautiful world of Valley using the power of the L.E.A.F. suit: a fierce exoskeleton that grants exceptional speed and agility along with the phenomenal ability to manipulate the life and death of all living things.   Experience the adventure of a lifetime  Valley is a First-Person adventure unlike any other. Hidden […]"},{"link":"https://nmac.to/blog/pankapu-1-0-3/","image":"https://nmac.to/wp-content/uploads/2016/10/pankapu.png","title":"pankapu 1.0.3 – A narrative and episodic platform/action game","content":"Pankapu is a narrative and episodic platform/action game that takes place in the dreams of Djaha’rell, a child once troubled by a tragic incident. Play Pankapu, the tiny warrior chosen by The God of Dreams, to rid the Dreamworld of the Nightmare invasion.   Discovering the dreamlike world of Omnia, the player controls Pankapu. This […]"},{"link":"https://nmac.to/blog/wheels-of-aurelia-1-0/","image":"https://nmac.to/wp-content/uploads/2016/10/Wheels.Of_.Aurelia.png","title":"Wheels of Aurelia 1.0 – A narrative road trip game","content":"A narrative road trip game set in the roaring Italian 70s, it tells the story of Lella, a restless woman driving on the roads of the western coast of Italy, the famous “Via Aurelia”.   This is an interactive fiction game in the shape of an isometric racer and with a focus on replayability: every […]"}]