[{"link":"https://nmac.to/blog/zcloud-1-2/","image":"https://nmac.to/wp-content/uploads/2015/12/zCloud.png","title":"zCloud 1.2 – Quick and efficient sharing of files and screenshots","content":"zCloud is the simplest way to share your screenshots and files. Seamlessly send a quick link to your friends, coworkers, or other contacts with ease. Just drag a file to the zCloud icon in the menubar, take a screenshot with customizable keyboard shortcuts, or designate a folder on your hard drive that will automatically upload […]"},{"link":"https://nmac.to/blog/rainbow-1-16/","image":"https://nmac.to/wp-content/uploads/2012/12/Rainbow.png","title":"Rainbow 1.16 – Set wonderful effects for your photos","content":"Rainbow is a graphic application that allow you to set wonderful effects in a fast and easy way.   It’s possible to apply the effects in sequence, getting amazing results.   Available effects: reflection shadow border glass miniature spotLight bloom sketch splash zoom curl perspective distort stretch pinch bump rotation resize crop trim blend convolution […]"},{"link":"https://nmac.to/blog/quickshot-2-1/","image":"https://nmac.to/wp-content/uploads/2015/11/QuickShot.png","title":"QuickShot 2.1 – Manage all your images right from your menubar!","content":"QuickShot is the ultimate image menubar manager.   “The utility you never knew you needed, but now you love”   With QuickShot, you can now view, filter, and share your images straight from your menubar!   The new quick-grab feature is also a game changer, now whenever a new image is added to a folder […]"},{"link":"https://nmac.to/blog/supertab-for-whatsapp-1-1/","image":"https://nmac.to/wp-content/uploads/2015/12/Supertab.for_.WhatsApp.png","title":"Supertab for WhatsApp 1.1 – Access WhatsApp from your desktop","content":"Now you can use WhatsApp from your desktop. Absolutely essential!! Native and custom notifications and drag and drop to send media. Fully revised to Yosemite and El Capitan.   Supertab for WhatsApp requires WhatsApp for mobile. Access WhatsApp directly from your desktop Maximum security to safeguard your data Upload pictures to send to your contacts […]"},{"link":"https://nmac.to/blog/hangouts-plus-1-5/","image":"https://nmac.to/wp-content/uploads/2015/12/Hangouts.Plus_.png","title":"Hangouts Plus 1.5 – Native desktop Mac client for Google Hangouts","content":"Hangouts Plus is beautiful, native desktop Mac client for Google Hangouts that support Hangouts Video / Hangouts on Air & Chat.   Features: Apple Messages UI style for Hangouts. All-in-One design. Buddies, conversations and Chat in a single window. Support Hangouts Video Call & Hangouts on Air video. Support Group Conversations. Support multi Chat groups […]"},{"link":"https://nmac.to/blog/befunky-express-2-1/","image":"https://nmac.to/wp-content/uploads/2015/12/BeFunky-Express.png","title":"BeFunky Express 2.1 – Quick, easy photo retouching, even in Apple Photos","content":"BeFunky Express has all the tools you need to quickly and easily create stunning selfies, fix family photos, liven up landscapes, and more! Developed specifically for Mac and OS X 10.11 El Capitan, BeFunky Express pairs perfectly with your Photos App for an unparalleled photo editing experience.   Power Features Auto Fix – Tired of […]"},{"link":"https://nmac.to/blog/briefs-1-3-3/","image":"https://nmac.to/wp-content/uploads/2014/04/Briefs.png","title":"Briefs 1.3.3 – Create mobile interactive design prototypes","content":"Briefs is the essential app design tool built for a professional design workflow. Lifeless mockups don’t tell the entire story, but you don’t have time to build a prototype. We’ve been there, too. Your clients needed a clearer picture, so give them something to touch.   With Briefs, you can deliver iterations of your design […]"},{"link":"https://nmac.to/blog/unity-pro-5-2-0/","image":"https://nmac.to/wp-content/uploads/2015/06/Unity3D.png","title":"Unity Pro 5.2.0 – High-end game development app","content":"Unity delivers a stable and scalable platform for creating captivating content. Content that is efficient to create, and that works on low as well as high-end hardware.   Unity is the only Mac-based high-end game development tool sporting a stylish pro-app GUI, no-friction workflow and top-of-the-line technical features such as extensible graphics, great particle effects, […]"},{"link":"https://nmac.to/blog/the-bureau-xcom-declassified-1-3/","image":"https://nmac.to/wp-content/uploads/2015/12/The.Bureau-XCOM.png","title":"The Bureau – XCOM Declassified 1.3 – Sci-Fi Tactical Shooter Game","content":"The year is 1962. JFK is President and the Cold War has the nation gripped by fear – but a far more powerful and insidious enemy than communism is threatening America. Known only to a select few, a top-secret government unit called The Bureau begins investigating and concealing a series of mysterious attacks by an […]"},{"link":"https://nmac.to/blog/up-3-5/","image":"https://nmac.to/wp-content/uploads/2015/12/Up.png","title":"Up 3.5 – Uploader for Instagram","content":"Up, a feature-rich Instagram client and uploader for OS X.   Drag, drop, upload and have fun.   Features: Upload images of any shape or videos with captions directly from your Mac, by simply drag and drop them to the window. Make photos into a 3 by 3 matrix formed large photo on your timeline. […]"}]