[{"link":"https://nmac.to/blog/noteplan/","image":"https://nmac.to/wp-content/uploads/2018/04/NotePlan1.png","title":"NotePlan 1.6.30 – Lean Markdown Calendar, Todos and Notes","content":"NotePlan is designed to make your task planning more productive. It solves problems like bloated, ever-growing to-do lists. Modern Writing – Enjoy a full writing area with Markdown and injected flavour for productivity. Calendar Notes – A calendar shows you where the action is. Jump right into a day to manage it by writing notes […]"},{"link":"https://nmac.to/blog/fluid/","image":"https://nmac.to/wp-content/uploads/2016/03/Fluid.png","title":"Fluid 2.1.2 – Create site-specific browsers for your favorite Web apps","content":"Fluid gives your favorite Web apps a home on your Mac OS X Desktop.   Are you a Gmail, Facebook, Campfire or an insert-your-favorite-webapp-here fanatic? Do you have 20 or more browser tabs open at all times? Are you tired of some random site crashing your browser and causing you to lose your (say) Google […]"},{"link":"https://nmac.to/blog/clipboards/","image":"https://nmac.to/wp-content/uploads/2018/10/Clipboards.png","title":"Clipboards 1.1.8 – Clipboard history for your macOS","content":"CLIPBOARD HISTORY for your macOS.   Record clipboard history from images, links, files and text, and copy or paste it when you needed them.   Create labels for organize items.   Use Swift Shortcuts for quick pasting clipboard items in apps.   Pinboard make easier find and sort items by labels, applications and type.   […]"},{"link":"https://nmac.to/blog/vernissage/","image":"https://nmac.to/wp-content/uploads/2017/12/Vernissage.png","title":"Vernissage 1.3.5 – Mockup generator","content":"Vernissage mockup generator, wraps app screenshots in device mockups.   Features: Share your app designs with clients or colleagues via Email or iMessage Create screens for online application stores Create screen matrices for technical specification Create app screens for your presentations Create UI/UX screen overviews Print Add context to your app screens with rich text […]"},{"link":"https://nmac.to/blog/sqlpro-for-oracle/","image":"https://nmac.to/wp-content/uploads/2016/02/SQLPro-for-Oracle.png","title":"SQLPro for Oracle 1.0.302 – A lightweight Oracle database client","content":"SQLPro for Oracle is a lightweight Oracle database client, allowing quick and simple access to Oracle Servers.   Features include: Syntax highlighting (including customizable themes). Intellisense. Tabbed based interface. Support for executing multiple queries at once. Quick access to tables, columns and more. Stored procedure execution.   This SQL Client does NOT work with MySQL […]"},{"link":"https://nmac.to/blog/sqlpro-for-postgres/","image":"https://nmac.to/wp-content/uploads/2017/05/SQLPro-for-Postgres.png","title":"SQLPro for Postgres 1.0.302 – Database management studio for Postgres","content":"SQLPro for Postgres is an advanced but lightweight Postgres database-management studio. It allows quick and simple access to Postgres SQL servers, with advanced time-saving features.   Features Syntax highlighting Intellisense Tab-based interface Support for executing multiple queries at once Quick access to tables, columns, and more Stored procedure execution   Version 1.0.302: Support for Mojave […]"},{"link":"https://nmac.to/blog/super-eraser-pro/","image":"https://nmac.to/wp-content/uploads/2017/02/Super-Eraser-Pro.png","title":"Super Eraser Pro 2.5.1 – Scale Photo and Erase Unwanted","content":"Super Eraser Pro is a powerful image processing software to erase unwanted objects, scale, denoise and remove haze for images. Super Eraser Pro magically scales an image or removes unwanted elements such as watermark, date, people, building, etc. without changing important visual content. Powered by the latest revolutionary image restoration algorithm, Super Eraser Pro only […]"},{"link":"https://nmac.to/blog/distance/","image":"https://nmac.to/wp-content/uploads/2018/02/Distance.png","title":"Distance 1.0 – An atmospheric racing platformer game","content":"Distance is an atmospheric racing platformer. Fusing futuristic arcade racing with parkour, survive a deadly, mysterious, neon-drenched city by jumping, rotating, and flying.   The roads are treacherous with obstacles around every corner. Instead of doing laps on a loop, survive to the end in the quickest time. Your car has abilities that not only […]"},{"link":"https://nmac.to/blog/monit/","image":"https://nmac.to/wp-content/uploads/2016/11/MONIT.png","title":"MONIT 1.2.2 – Key performance data widget for your Mac","content":"Slide out Notification Center to quickly see key performance data for your Mac, such as CPU, Memory, Disk, Network and Battery. Click the charts to drill down and reveal more details. Click the Network and Disk Icons to view even more data.   Monit Widget is a modest, but ambitious, Notification Center Widget for monitoring […]"},{"link":"https://nmac.to/blog/exporter/","image":"https://nmac.to/wp-content/uploads/2018/10/Exporter.png","title":"Exporter 1.4.1 – Export notes from the notes app","content":"Exporter allows you to export notes from the Notes app   Features Notes are converted to markdown & store in plaint-text format. Creation & modification dates of notes are preserved. Notes are stored in directories named after the notebooks in which they are stored in Notes.app. Notes in same notebook having same name are renamed […]"}]