[{"link":"https://nmac.to/blog/wifi-check-2-1-2/","image":"https://nmac.to/wp-content/uploads/2017/04/WiFi-Check.png","title":"WiFi Check 2.1.2 – scanner, test speed, tools","content":"WiFi Check will allow you to test and troubleshoot your wifi network. It will be very useful when you want to test bandwidth of your wifi, ethernet or mixed network, but your internet connection is too slow(for example 10 Megabits per second), and your router can provide much faster speed between devices in local network. […]"},{"link":"https://nmac.to/blog/wells-1-0/","image":"https://nmac.to/wp-content/uploads/2017/04/Wells.png","title":"Wells 1.0 – An action side-scrolling game with 3D graphics","content":"Wells is an action side-scrolling game with 3D graphics, its style is a direct reference to a classic subgenre of games that was popular in the 90’s, the Run and Gun. Prepare yourself for facing hordes of enemies, explosions, gigantic bosses and a dangerous and fascinating journey into a steampunk universe.   Play as Wells, […]"},{"link":"https://nmac.to/blog/iboysoft-drive-manager-2-6/","image":"https://nmac.to/wp-content/uploads/2017/04/iBoysoft-Drive-Manager.png","title":"iBoysoft Drive Manager 2.6 – For External/Network Drive","content":"iBoysoft Drive Manager can manage external drive and network drive with ease: Mount, unmount, eject external drives Map network drives Map a file share (FTP, SFTP) server storage as a local disk in the Finder, open remote files with any application and work like on a local volume. Safely and automatically eject all external drives […]"},{"link":"https://nmac.to/blog/falcon-1-5-1/","image":"https://nmac.to/wp-content/uploads/2016/06/Falcon.png","title":"Falcon 1.5.1 – A simple, markdown based note-taking app","content":"Falcon is a simple, markdown based note-taking app.   Features Write notes, journals and research Organise notes in multiple notebooks for various topics Supports adding images to your notes Search notes easily by their title, content or tags Editor-only and Preview-only modes allow to edit and read notes in an uncluttered and focused way. Backup […]"},{"link":"https://nmac.to/blog/code-collector-pro-1-7-4/","image":"https://nmac.to/wp-content/uploads/2014/04/Code.Collector.Pro_.png","title":"Code Collector Pro 1.7.4 – Store code snippets with ease","content":"Code Collector Pro is a storage app for code snippets. From HTML to Cocoa, C++ to Ruby, Code Collector Pro looks after all your code snippets, letting you quickly reference them whenever you want. With support for Smart Groups, Tagging, TextMate Bundles, integration with codecollector.net and more. Code Collector Pro is the best way to […]"},{"link":"https://nmac.to/blog/business-templates-3-0/","image":"https://nmac.to/wp-content/uploads/2017/04/Business-Templates3.png","title":"Business Templates 3.0 – Add-on for Apple’s Pages, Keynote & Numbers","content":"Business Templates (for Pages, Keynote & Numbers) is a valuable add-on for Apple’s Pages, Keynote and Numbers apps. It provides 90 professional business-oriented templates, in a coherent design.   DIFFERENT PAPER SIZES  All Pages and Numbers templates are available in US Letter and A4, except the envelope (6 common envelope sizes). The Keynote template is […]"},{"link":"https://nmac.to/blog/bee-2-4-10/","image":"https://nmac.to/wp-content/uploads/2015/03/Bee.png","title":"Bee 2.4.10 – Client for tracking in FogBugz, GitHub, and JIRA","content":"Bee syncs with GitHub Issues, JIRA, and FogBugz. You can also use Bee to keep track of your plain text notes.   Features: Flight Path. Flight Path lives in your menu bar and helps you by intelligently selecting the task you should be working on next. Notifications. Bee uses Notification Center to inform you of […]"},{"link":"https://nmac.to/blog/autopano-giga-4-4/","image":"https://nmac.to/wp-content/uploads/2017/04/Autopano.Giga_.png","title":"Autopano Giga 4.4 – Stitch multiple images (release candidate)","content":"Autopano Giga allows you to stitch 2, 20, or 2,000 images.   Version 3.0 integrates impressive new features that will definitely make you adopt Autopano Pro or Autopano Giga: Choose between 9 projection modes the one that best suits your image, including Little-Planet, Panini, Hammer, Mirror Ball, Orthographic and more. Edit your panoramas with an […]"},{"link":"https://nmac.to/blog/narcosis-1-0/","image":"https://nmac.to/wp-content/uploads/2017/03/Narcosis.png","title":"Narcosis 1.0 – Survival, horror at the sunless depths of the Pacific Ocean","content":"Stranded on the seafloor with low light and few tools, an industrial diver takes desperate steps to surface before his oxygen — and sanity — give out.   Conceived as a student project, this first person survival story unfolds following an industrial catastrophe, from inside a half-ton, high-tech dive suit — a “walking coffin.” Influenced and […]"},{"link":"https://nmac.to/blog/eventide-2-the-sorcerers-mirror-ce-1-4/","image":"https://nmac.to/wp-content/uploads/2017/03/Eventide-2.png","title":"Eventide 2 – The Sorcerers Mirror CE 1.4 – Hidden Object Adventure & Horror Game","content":"Embark on a mystical adventure in a forgotten mountain village ruled by an immortal sorcerer. Can you unravel his secret?   INSPIRED BY ACTUAL SLAVIC LEGENDS! Explore an enchanted world full of imps, apparitions, magical animals, and other mysterious creatures taken directly from Eastern European folk and fairy tales.   SHAPE THE STORY WITH YOUR […]"}]