[{"link":"https://nmac.to/blog/near-death/","image":"https://nmac.to/wp-content/uploads/2018/03/Near-Death.png","title":"Near Death 1.0 – First-Person Adventure & Survival Game","content":"After your plane crash-lands in Antarctica, you find yourself stranded and alone at an abandoned research facility in the midst of a deadly blizzard. Plunged into utter darkness, temperatures 100 degrees below zero, and conditions far too harsh to allow for rescue, you must explore Sutro Station and and use the tools at your disposal […]"},{"link":"https://nmac.to/blog/maple/","image":"https://nmac.to/wp-content/uploads/2016/06/Maple2015.png","title":"Maple 2018.0 – Solve math problems and create interactive technical apps","content":"Maple is the ultimate productivity tool for solving mathematical problems and creating interactive technical applications.   Intuitive and easy to use, it delivers the most advanced, complete, reliable mathematical capabilities that can only come from a market-leading tool that has been developed and tested over 25 years.   Maple allows you to create rich, executable […]"},{"link":"https://nmac.to/blog/toddler-simulator/","image":"https://nmac.to/wp-content/uploads/2018/03/Toddler-Simulator.png","title":"Toddler Simulator 1.0 – Enter the world of toddlers","content":"Have you ever wanted to re-live your days as toddler? The carefree joy of bringing your pain to those around you? The destruction? The chaos? The anarchy? This is your chance.   Trash the bedroom, mess up the bathroom, then discover what lays beyond the front door as you roam freely in a vast world. […]"},{"link":"https://nmac.to/blog/starmoney/","image":"https://nmac.to/wp-content/uploads/2018/03/StarMoney.png","title":"StarMoney 3.3 – Manage your budget the easy way","content":"StarMoney shows you where your money goes. It puts all your finances in one place, automatically categorized and presented in a clear and understandable way. Set and reach financial goals and cut your spending.   Exceptional online banking: Different kinds of accounts at various German banks and Sparkassen in only one place Integration of more […]"},{"link":"https://nmac.to/blog/iart-for-ms-word/","image":"https://nmac.to/wp-content/uploads/2018/03/iArt-for-MS-Word.png","title":"iArt for MS Word 1.2 – A collections of MS Word templates","content":"Convince your clients, impress your peers – iArt for MS Word – Templates makes creating gripping Microsoft Word documents easier and quicker than ever before! Hundreds of professional templates and near-infinite customization opportunities make it the most powerful tool available to unleash your creativity in business documents.   iArt for MS Word – Templates offers […]"},{"link":"https://nmac.to/blog/kpvid-pro/","image":"https://nmac.to/wp-content/uploads/2017/03/KeepVid-Pro.png","title":"KeepVid Pro 7.2.0.2 – Ultimate Video Downloader from YouTube and 10,000 Other Sites","content":"Although watching videos or listening to music online can be an excellent way to unwind after a stressful day at work, sometimes you might not be connected to the Internet, which prevents you from accessing your favorite content.   However, you can be one step ahead of this unfortunate situation and save the audio tracks […]"},{"link":"https://nmac.to/blog/the-raven-legacy-of-a-master-thief/","image":"https://nmac.to/wp-content/uploads/2018/03/The-Raven.png","title":"The Raven – Legacy of a Master Thief 1.0.0.4 – A thrilling crime adventure game","content":"‘The Raven – Legacy of a Master Thief‘ is a thrilling crime adventure in three chapters from the creators of ‘The Book of Unwritten Tales’. Full of twists and turns, it immerses you in both sides of the story, combining thrill-of-the-chase whodunit with the risk and reward of a heist story.   Paris, 1960. Europe […]"},{"link":"https://nmac.to/blog/arcsoft-website-builder/","image":"https://nmac.to/wp-content/uploads/2017/10/ARCSOFT1.png","title":"ARCSOFT – Website Builder 1.4 – Visual interface for creating and editing websites","content":"ARCSOFT web design software for the macOS platform provides a visual interface for creating and editing websites and mobile web apps, as well as previewing and publishing options on the go. All of this packaged up into a single application for a professional way to manage and share your creations on Mac.   Features Drag-and-drop […]"},{"link":"https://nmac.to/blog/game-dev-tycoon/","image":"https://nmac.to/wp-content/uploads/2016/03/Game-Dev-Tycoon.png","title":"Game Dev Tycoon 1.6.11 – Become the leader of the market and gain worldwide fans","content":"Game Dev Tycoon is a business simulation game available for Windows, Mac and Linux as well as on the Windows 8 Store. In Game Dev Tycoon you replay the history of the gaming industry by starting your own video game development company in the 80s. Create best selling games. Research new technologies and invent new […]"},{"link":"https://nmac.to/blog/redshift-premium/","image":"https://nmac.to/wp-content/uploads/2018/03/Redshift-Premium.png","title":"Redshift Premium 1.0.2 – Explore space with professional planetarium software","content":"View the night sky in unparalleled clarity, travel right through our galaxy and beyond, and look at planets, moons, asteroids, nebulae and other celestial bodies from close range. Explore the night sky from any desired viewpoint on the Earth or from moons and planets, travel into the past or into the future and discover first […]"}]