[{"link":"https://nmac.to/blog/browser-care-3-1-2/","image":"https://nmac.to/wp-content/uploads/2016/07/Browser-Care3.png","title":"Browser Care 3.1.2 – Browser maintenance app","content":"Browser Care is a powerful application that allows you to keep your browsers clean and under control since navigating accumulates files on your Mac.   Features Care. A button for everything. Take Care of your browser to recover space on your Mac. Simple presets. Convenient presets that are fast and easy (even for beginners). Items […]"},{"link":"https://nmac.to/blog/timelime-1-4-5/","image":"https://nmac.to/wp-content/uploads/2014/01/Timelime.png","title":"Timelime 1.4.5 – Track and visualize your working hours","content":"Timelime is the easiest and most beautiful way to track and visualize your working hours.   Timelime is the perfect assistant for:   Freelancers and independent contractors who have to track their time spent on projects Students who want to spend more time studying by monitoring their daily/weekly/monthly workload Individuals who are interested in how […]"},{"link":"https://nmac.to/blog/movavi-mac-cleaner-2-4-2/","image":"https://nmac.to/wp-content/uploads/2016/07/Movavi.Mac_.Cleaner.png","title":"Movavi Mac Cleaner 2.4.2 – Easy-to-use tool to clean up and speed up your Mac","content":"Movavi Mac Cleaner is an effective and easy-to-use tool for OS X systems that will help you clean up and speed up your MacBook, iMac or other Apple computer. One of the main reasons for a Mac to run slowly is the gradual accumulation of unnecessary files on the hard drive that clog up the […]"},{"link":"https://nmac.to/blog/json-wizard-1-3/","image":"https://nmac.to/wp-content/uploads/2016/07/JSON.Wizard.png","title":"JSON Wizard 1.3 – View, edit, and export your JSON","content":"JSON Wizard is the perfect tool for you if you simply want to view and edit your JSON files. Or perhaps you want to be able to import XML/YAML/PLIST/CSV files. Perhaps you even want to be able to export to all those formats as well. JSON Wizard provides both easy visual editing and direct access […]"},{"link":"https://nmac.to/blog/indigo-renderer-4-0-38/","image":"https://nmac.to/wp-content/uploads/2016/07/Indigo.Renderer.png","title":"Indigo Renderer 4.0.38 – Powerful Rendering App For Architects, Product Designers and more","content":"Indigo is a very easy to use photorealistic renderer that is able to simulate the physics of light to achieve near-perfect image realism.   With an advanced physical camera model, a super-realistic materials system and the ability to simulate complex lighting situations through Metropolis Light Transport, Indigo Renderer is capable of producing the highest levels […]"},{"link":"https://nmac.to/blog/dslrbooth-photo-booth-2-2-2/","image":"https://nmac.to/wp-content/uploads/2016/07/dslrBooth.png","title":"dslrBooth Photo Booth 2.2.2 – Awesome photo booth software","content":"dslrBooth Photo Booth – Automate your workflow from capture to printing. Hook up your camera, start a session and everything else is fully automated.   Customizable Prints Customize prints with text, graphics, and logo with our built-in template editor. Photoshop experience not required.   Green Screen Replacement Automatically remove background green screen and add any […]"},{"link":"https://nmac.to/blog/command-center-1-0-5/","image":"https://nmac.to/wp-content/uploads/2016/07/Command.Center.png","title":"Command Center 1.0.5 – Minimalist multi-utility app","content":"Command Center (was Control Center) is a new utility app for macOS, inspired by Control Center. We’ve created a beautiful tool designed to let you control and monitor most aspects of your Mac. It is a panel that auto-hides on the side of the screen, and is activated by mouse (like the Dock). The panel […]"},{"link":"https://nmac.to/blog/capture-gif-1-4-2/","image":"https://nmac.to/wp-content/uploads/2016/06/Capture.Gif.png","title":"Capture Gif 1.4.2 – Record your screen as an animated GIF","content":"With Capture Gif, you can easily record your entire screen or just an area as an animated GIF image. Capture Gif has support for multiple displays, is Retina-ready, and always generates clear GIF images.   Features Record any connected display Optionally capture the mouse cursor Can record OS X menu bar area (or anywhere on […]"},{"link":"https://nmac.to/blog/better-battery-1-2/","image":"https://nmac.to/wp-content/uploads/2016/07/Better-Battery.png","title":"Better Battery 1.2 – Keeps your Battery healthy","content":"Better Battery is a menubar app, helps to improve the battery lifetime of your MacBook (Air/Pro) and shows useful informations and stats about the battery and daily usage time of your notebook.   It also tracks the status of your MacBook (Air/Pro) battery over time – so it’s easy to keep an eye on the […]"},{"link":"https://nmac.to/blog/lego-star-wars-the-force-awakens-1-0/","image":"https://nmac.to/wp-content/uploads/2016/07/LEGO-Star-Wars.png","title":"LEGO STAR WARS : The Force Awakens 1.0 – Family-friendly action-adventure game","content":"The Force is strong with this one… The No. 1 LEGO® videogame franchise triumphantly returns with a fun-filled, humorous journey through the new Star Wars adventure. Play as all of the characters from the movie, including Rey, Finn, Poe Dameron, Han Solo, Chewbacca, C-3PO, and BB-8, as well as Kylo Ren, General Hux and Captain […]"}]