[{"link":"https://nmac.to/blog/houdahgeo/","image":"https://nmac.to/wp-content/uploads/2013/06/HoudahGeo.png","title":"HoudahGeo 5.4.2 / 6.0.1 – Photo geocoding and geotagging","content":"HoudahGeo is a one-stop photo geocoding solution for OS X. Export geotags to EXIF, XMP and IPTC. GPS device optional.   Just like a GPS-enabled camera, HoudahGeo records latitude, longitude, and altitude information right to your image data file. Don’t have a GPS device? No problem! Just drop a pin on the map where you […]"},{"link":"https://nmac.to/blog/ember/","image":"https://nmac.to/wp-content/uploads/2015/10/Ember1.png","title":"Ember 1.8.5 – Versatile digital scrapbook","content":"Ember (was LittleSnapper) is your digital scrapbook of things that inspire you: websites, photos, apps or other things. Just drag in images that you want to keep, organize them into relevant collections, annotate the images you need to give feedback on, and share your images to your favorite web services.   Organise your ideas and […]"},{"link":"https://nmac.to/blog/kyoobik-photo/","image":"https://nmac.to/wp-content/uploads/2020/02/Kyoobik-Photo.png","title":"Kyoobik Photo 1.34 – Turn a mundane photo into 3d popping geometric tiles","content":"The exploration into photo editing has led you to Kyoobik Photo (pronounced cubic), the photo app that turns your mundane photo into a geometric gridded tiled image. Gridded image? Sounds straight to the point, but the amazing turns and slides you can take with this app will not only turn your photo into a custom […]"},{"link":"https://nmac.to/blog/nir-color/","image":"https://nmac.to/wp-content/uploads/2014/01/NIR-Color.png","title":"NIR Color 1.27 – Convert photos into faux-infrared images","content":"NIR Color lets you convert a photo into a magical and surreal infrared scene.    Photography is the art of capturing light. Infrared photography, on the other hand, is the art of capturing invisible light. If you’re looking for something new and unique to add to your photography arsenal, then you came to the right […]"},{"link":"https://nmac.to/blog/sd-clone/","image":"https://nmac.to/wp-content/uploads/2018/05/SD-Clone.png","title":"SD Clone 3.2 – Clone, Shrink and Verify SD Cards","content":"SD Clone is the ultimate tool for cloning SD Cards right on your Mac. Easily make backups of any data on SD Cards and easily restore them other SD Cards. If you creating lots of SD Cards with the same data, SD Clone can write to multiple SD cards at once making it the fastest tool […]"},{"link":"https://nmac.to/blog/graphic/","image":"https://nmac.to/wp-content/uploads/2020/02/Graphic.png","title":"Graphic 3.1 – Powerful vector drawing app","content":"Graphic is a powerful feature-packed vector drawing and illustration application for macOS.   Graphic has all of the tools you need to create everything from detailed technical illustrations to beautiful works of art. Create intricate designs quickly and easily, and continue working on the go with Graphic for the iPad.   Create resolution-independent illustrations that […]"},{"link":"https://nmac.to/blog/fold-defy/","image":"https://nmac.to/wp-content/uploads/2015/01/Fold.Defy_.png","title":"Fold Defy 1.3 – Apply folds and creases to images","content":"Fold Defy renders 3D popping folds with their perspective distortions and a realistic shadow for an amazing high-end result!   Fold Defy not only folds your image, using two types of bending options: FOLD and CREASE, but also distresses it with a CRUMPLE effect to give the appearance of crunched paper smoothed flat. Oriented in […]"},{"link":"https://nmac.to/blog/aiseesoft-iphone-ringtone-maker/","image":"https://nmac.to/wp-content/uploads/2020/02/Aiseesoft-iPhone-Ringtone-Maker.png","title":"Aiseesoft iPhone Ringtone Maker 7.1.10 – Convert any video and audio to iPhone ringtone","content":"Aiseesoft iPhone Ringtone Maker for Mac – Convert any video and audio to iPhone ringtone M4R format and upload M4R files to iPhone, iTunes and Mac.   As the professional Mac iPhone ringtone creator and manager for Mac users, this software can convert almost all the video and audio formats to iPhone ringtone M4R and […]"},{"link":"https://nmac.to/blog/dvdfab-aio/","image":"https://nmac.to/wp-content/uploads/2017/08/DVDFab10.png","title":"DVDFab All-In-One 11.0.7.5 – Complete solution for ripping and converting DVD and Blu-ray discs","content":"DVDFab All-In-One is the universal solution to all DVD/Blu-ray/video issues.   The following are for perpetual (lifetime) licenses. DVDFab All-In-One DVDFab DVD Copy Removes all known DVD protections and makes backup DVDs in an easy and fast manner. Copy, rip, clone, split, merge, burn, customize, and more. DVDFab DVD Ripper Rips or converts any DVD […]"},{"link":"https://nmac.to/blog/patina/","image":"https://nmac.to/wp-content/uploads/2016/11/Patina.png","title":"Patina 1.2 – Simple drawing app","content":"Patina is a great way to draw sketches, diagrams, and simple illustrations on your Mac. As a Mac user accustomed to attractive, well-designed software, you’ll appreciate Patina’s elegant and intuitive interface. And if you’ve used Windows before, you’ll find that Patina not only offers the simplicity you like about Microsoft Paint, but also has some […]"}]