[{"link":"https://nmac.to/blog/angry-birds-seasons/","image":"https://nmac.to/wp-content/uploads/2014/01/Angry-Birds-Seasons4.png","title":"Angry Birds Seasons 4.1.0 – Seasonally-themed physics-based puzzle game","content":"Angry Birds Seasons takes the captivating gameplay of the original to a whole new level! From Halloween to Chinese New Year, the birds are celebrating different festive seasons around the world! With more than 260 levels and regular free updates, these special episodes offer more challenging levels of pig-popping action and golden eggs to discover. […]"},{"link":"https://nmac.to/blog/angry-birds-star-wars/","image":"https://nmac.to/wp-content/uploads/2014/01/Angry-Birds-Star-Wars.png","title":"Angry Birds Star Wars 1.5.0 – Star Wars-themed installment of the popular game series","content":"Angry Birds Star Wars brings the record-breaking game series into the Star Wars universe, setting the stage for a whole new episode of bird-launching fun!   A long time ago in a galaxy far, far away… a group of desperate rebel birds faced off against a galactic menace: the Empire’s evil Pigtroopers!   Rebel birds, striking […]"},{"link":"https://nmac.to/blog/tab-launcher-2-4-2/","image":"https://nmac.to/wp-content/uploads/2013/12/Tab-Launcher.png","title":"Tab Launcher 2.4.2 – Clean up and organize the Dock","content":"The idea of Tab Launcher is not to replace the system’s dock, but to help keep it clean, with only the applications that are currently running.   By removing all the application from the dock and organizing them on tabs, you can quickly find and run any application you want.   Apart from that, you […]"},{"link":"https://nmac.to/blog/raskin-1-8-4/","image":"https://nmac.to/wp-content/uploads/2013/12/Raskin.png","title":"Raskin 1.8.4 – Alternate desktop interface for OS X","content":"Raskin is an alternative desktop interface for OS X. It simplifies interaction with your computer by placing your documents on a zoomable surface, avoiding the clutter of multiple windows. Raskin makes finding, organizing, previewing, and opening documents seamless and time-saving. Raskin is named after and inspired by the work of Mac visionary Jef Raskin.   […]"},{"link":"https://nmac.to/blog/snapheal-pro-1-2/","image":"https://nmac.to/wp-content/uploads/2013/12/Snapheal-Pro.png","title":"Snapheal Pro 1.2 – Professional-quality image enhancement utility","content":"SnapHeal Pro offers a fast and easy way to enhance and remove objects from photos.    Features: Easily erase unwanted objects Quickly and easily remove distracting objects like wires, people, signs, scratches, and more to make your favorite images better. Proprietary CleanPics technology Get our most powerful engine ever for removing unwanted objects, skin blemishes, […]"},{"link":"https://nmac.to/blog/phoneview-2-9-5/","image":"https://nmac.to/wp-content/uploads/2013/12/25347.png","title":"PhoneView 2.9.5 – Use your iPhone for file storage, data syncing, and much more","content":"PhoneView is the Mac companion for iPhone, iPad and iPod Touch. Access voicemail, SMS/MMS, call history, photos, App Store app data, notes, file storage, iTunes media, voice memos and contacts with one click. PhoneView also automatically archives your messages, call history and voicemails, so you can access them even when your iPhone is not available. […]"},{"link":"https://nmac.to/blog/smartday-3-0-0/","image":"https://nmac.to/wp-content/uploads/2013/12/SmartDay.png","title":"SmartDay 3.0.0 – Integrated organizer with automatic scheduling","content":"SmartDay is an integrated organizer that automatically schedules tasks into the free time in your calendar. SmartDay uses adaptive logic to organize your projects, tasks, appointments and check-lists. The included Cloud hub (free) keeps you connected across all of your Macs and PC’s, and syncs with our iPad organizer, SmartPad.   Beauty in Simplicity… SmartDay […]"},{"link":"https://nmac.to/blog/notesuite-1-2/","image":"https://nmac.to/wp-content/uploads/2013/12/NoteSuite.175x175-751.jpg","title":"NoteSuite 1.2 – Stay on top of everything that matters in one organized place","content":"NoteSuite helps you stay on top of everything that matters in one organized place. Macworld rates NoteSuite 4 stars and TUAW calls NoteSuite “one of the most powerful, well thought out applications we’ve seen on Mac and iPad.”   Take notes, manage to-dos, clip web pages, and read and search documents together in one app. […]"},{"link":"https://nmac.to/blog/intensify-1-0-1/","image":"https://nmac.to/wp-content/uploads/2013/12/ICON_INTENSIFY.175x175-751.png","title":"Intensify 1.0.1 – Create clarity and intensity in your photos","content":"Intensify lets discerning photographers of all skill levels create powerful photographic images with unprecedented drama and detail. Precise control of contrast, structure, detail and sharpening across different tonal ranges delivers high quality results every time.   Special algorithms to prevent image artifacts, image layer stacking with opacity control, dozens of professionally created presets, adjustment brushes, RAW […]"},{"link":"https://nmac.to/blog/markdrop-1-0/","image":"https://nmac.to/wp-content/uploads/2013/12/MarkDrop.png","title":"MarkDrop 1.0 – Markdown editor built with sharing in mind","content":"MarkDrop is a gorgeous, powerful Markdown editor built with sharing in mind. Every MarkDrop document has a secure URL that is viewable in any browser. Markdown is a simple syntax built for writers who want to compose in an easy-to-write, easy-to-read format that can be converted to HTML. But the missing component up until now […]"}]