[{"link":"https://nmac.to/blog/ibackup-viewer-pro-2-70/","image":"https://nmac.to/wp-content/uploads/2014/04/iBackup+Viewer.png","title":"iBackup Viewer Pro 2.70 – Browse and manage iOS backups","content":"iBackup Viewer manages to extract information from iPhone / iPad backups, including contacts, call history, SMS messages, Web visits, website bookmarks, photos, and iPhone Apps.   How does it work? iTunes backs up iPhone and iPad contents into unreadable database and files. This makes it difficult to get necessary information for the backed up files. […]"},{"link":"https://nmac.to/blog/carousel-1-5-1/","image":"https://nmac.to/wp-content/uploads/2014/04/Carousel.png","title":"Carousel 1.5.1 – Experience Instagram on your Mac","content":"Carousel is a desktop app for the Mac devoted to viewing your Instagram feeds. We made Carousel because we wanted a simple, beautiful way to browse Instagram on the desktop in a minimal footprint. We’ve implemented a full set set of keyboard commands to make operation flawless and four wonderful themes to personalize Carousel to […]"},{"link":"https://nmac.to/blog/macaw-1-0-3/","image":"https://nmac.to/wp-content/uploads/2014/04/Macaw1.png","title":"Macaw 1.0.3 – The code-savvy web design tool","content":"Stop writing code. Start drawing it.   Macaw provides the same flexibility as your favorite image editor but also writes semantic HTML and remarkably succinct CSS. It’s time to expect more from a web design tool.   Fluid canvas and grid Macaw is engineered for fluid widths. Resize the canvas and your grids and elements […]"},{"link":"https://nmac.to/blog/antetype-1-4-1/","image":"https://nmac.to/wp-content/uploads/2014/01/Antetype.png","title":"Antetype 1.4.1 – Interface design tool","content":"Antetype UI designer is a brand new, ground-breaking design application that supports user-interface designers at every step of their work. Design beautiful interfaces, invent new widgets, style them, and put it all together in an interactive prototype!   Features: Multiple Looks and Feels: Looks and feels are stored globally in the shared library and can […]"},{"link":"https://nmac.to/blog/toast-dvd-1-0-1/","image":"https://nmac.to/wp-content/uploads/2014/04/Toast.DVD_.png","title":"Toast DVD 1.0.1 – Burn discs from the movies you create on your Mac","content":"Toast DVD is the easiest and fastest way to create DVDs on your Mac. Toast DVD is the perfect companion for iMovie, making it easy to share your movies with friends and family.   Toast DVD makes it simple for you to burn discs from the movies you create on your Mac.   Burn standard […]"},{"link":"https://nmac.to/blog/toast-burn-1-0-1/","image":"https://nmac.to/wp-content/uploads/2014/04/Toast.Burn_.png","title":"Toast Burn 1.0.1 – Lightweight version of CD/DVD/Blu-ray disc burning solution","content":"Toast Burn, from the makers of Roxio Toast Titanium–the best-selling Mac digital media app–makes it easier than ever to burn Mac files to disc or copy discs. If you have an optical drive like a recordable CD, DVD, or Blu-ray, Toast Burn is your go-to tool to quickly create and duplicate data discs from the […]"},{"link":"https://nmac.to/blog/mypoint-pro-1-17/","image":"https://nmac.to/wp-content/uploads/2014/04/myPoint-Pro.png","title":"myPoint Pro 1.17 – Coordinates tool for Mac desktop","content":"myPoint Pro combines six tools in one: Crosshair, Grille, Coordinates, Mouse Halo, Mouse Locator and Heavy Shade. All tools are customizable.   myPoint will show its information above all other windows and applications, even when another application is active or in full screen.   Crosshair displays two thin lines across the mouse position. Visible on […]"},{"link":"https://nmac.to/blog/nti-shadow-5-0-0-51/","image":"https://nmac.to/wp-content/uploads/2014/04/NTI-Shadow.png","title":"NTI Shadow 5.0.0.51 – Protect and back-up important data files","content":"NTI Shadow continues on the award-winning easy-to-use backup application that automatically protects your photo, music, video, and various data files. It makes data restoring as easy as dragging and dropping files from one place to another.   Real-time and continuous data backup plus you can set Shadow 4 to save versions of your files/folders every […]"},{"link":"https://nmac.to/blog/isonics-1-6-1/","image":"https://nmac.to/wp-content/uploads/2014/04/iSonics.png","title":"iSonics 1.6.1 – Convert audio files between formats","content":"iSonics makes it easy to convert any audio format and CDs to all popular audio formats: MP3, MP2, AAC, FLAC, ALAC, WMA, OGG Vorbis, AC3, and WAV.   It handles metadata with ease and even enables you to change metadata, including automatically downloading cover pictures.   As a bonus you can import CDs and convert […]"},{"link":"https://nmac.to/blog/automatic-2-4-4/","image":"https://nmac.to/wp-content/uploads/2014/04/Automatic.png","title":"Automatic 2.4.4 – Download content and files from RSS feeds automatically","content":"Automatic allows users to set up subscriptions for virtually any content linked in RSS feeds. Automatic will fetch and deliver the latest content for your subscriptions right to your download folder.   Version 2.4.4: Fixed a crash that could occur opening the “Advanced” options window or adding a new subscription. Improved the way episodes are […]"}]