[{"link":"https://nmac.to/blog/the-final-station/","image":"https://nmac.to/wp-content/uploads/2016/11/The.Final_.Station.png","title":"The Final Station 1.4.5 – 2D Pixel Graphics Action & Adventure Game","content":"The world is over. But it’s not quite over for you… at least, not yet. And now that you’ve got thousands of tonnes of locomotive at your disposal, you’ve got the definite advantage over the infected hordes. This is The Final Station.   The real question is whether or not you’ll help the survivors get […]"},{"link":"https://nmac.to/blog/resample-1-1-5/","image":"https://nmac.to/wp-content/uploads/2017/05/ReSample.png","title":"ReSample 1.1.5 – A sharpened tool for audio editing","content":"Smooth waveform browsing and editing: fast and responsive waveform zooming and editing with your mouse, trackpad (multi-touch gestures) or keyboard.   Vocal removal: straightforward and effective removal or extraction for center vocal sound.   Batch (Multi-core supported): Apply customized jobs to all files. Such as processors, normalize, export, etc.   Multiband compressing: split a sound […]"},{"link":"https://nmac.to/blog/metro-last-light-redux-1-0/","image":"https://nmac.to/wp-content/uploads/2017/05/Metro-Last-Light-Redux.png","title":"Metro: Last Light Redux 1.0 – First-person shooter game in post-apocalyptic Moscow","content":"It is the year 2034. Beneath the ruins of post-apocalyptic Moscow, in the tunnels of the Metro, the remnants of mankind are besieged by deadly threats from outside – and within. Mutants stalk the catacombs beneath the desolate surface, and hunt amidst the poisoned skies above.   But rather than stand united, the station-cities of […]"},{"link":"https://nmac.to/blog/metro-20-33-redux/","image":"https://nmac.to/wp-content/uploads/2015/05/Metro-2033-Redux.png","title":"Metro 2033 Redux 1.0 – First-person shooter game in post-apocalyptic Moscow","content":"Metro 2033 Redux is the definitive version of the cult classic ‘Metro 2033’, rebuilt in the latest and greatest iteration of the 4A Engine for Next Gen. Fans of the original game will find the unique world of Metro transformed with incredible lighting, physics and dynamic weather effects. Newcomers will get the chance to experience […]"},{"link":"https://nmac.to/blog/responsive-photo-grid-2-70-1/","image":"https://nmac.to/wp-content/uploads/2016/10/Responsive-Photo-Grid.png","title":"Responsive Photo Grid 2.70.1 – Web photo-gallery maker","content":"Responsive Photo Grid is a web-gallery designer. It helps you create amazing lightbox photo galleries. This app is designed for both everyday users and advanced web designers.   Key Features efficiently searches input folder for photo files integrated with the Bootstrap frame to create mobile friendly responsive photo galleries divides large galleries into multiple page […]"},{"link":"https://nmac.to/blog/dragon-responsive-email-designer-2-70/","image":"https://nmac.to/wp-content/uploads/2017/05/Dragon-Responsive-Email-Designer2.png","title":"Dragon Responsive Email Designer 2.70 – Create emails with responsive design","content":"Dragon Responsive Email Designer helps you create beautiful emails for any device! Intuitive drag-and-drop designer with zero coding, fabulous responsive emails made simple.   Features Intuitive drag-and-drop designer: Create and send beautiful responsive emails in minutes. Zero coding required. Simple and powerful: Perfect for both beginners and experienced email designers. Jump start with any of […]"},{"link":"https://nmac.to/blog/business-card-expert-2-1/","image":"https://nmac.to/wp-content/uploads/2017/05/Business-Card-Expert.png","title":"Business Card Expert 2.1 – Templates for MS Word","content":"Business Cards Templates for MS Word by GN is a top-quality set of over 180 original templates for Microsoft Word. Whether you choose a tried and tested professional look or opt for a more creative and colorful style, Graphic Node’s templates will help you represent your company the best you can.   Every object in […]"},{"link":"https://nmac.to/blog/old-mans-journey-1-0/","image":"https://nmac.to/wp-content/uploads/2017/05/Old.Mans_.Journey.png","title":"Old Man’s Journey 1.0 – A soul-searching puzzle adventure game","content":"Old Man’s Journey, a soul-searching puzzle adventure, tells a story of life, loss, reconciliation, and hope. Entrenched in a beautifully sunkissed and handcrafted world, embark on a heartfelt journey interwoven with lighthearted and pressure-free puzzle solving.   A visual narrative about life’s precious moments, broken dreams, and changed plans, uncover stories of the old man’s […]"},{"link":"https://nmac.to/blog/brochures-expert-2-1/","image":"https://nmac.to/wp-content/uploads/2017/05/Brochures-Expert.png","title":"Brochures Expert 2.1 – Templates for MS Word","content":"Brochures Templates for MS Word by GN is a top-quality collection of 245 original templates for Microsoft Word processing app. Whether you’re starting a new business, organizing an event, or trying to give your sales a boost, Brochures Templates for MS Word by GN will help you.   Every object in Brochures Templates for MS […]"},{"link":"https://nmac.to/blog/greeting-card-expert-2-1/","image":"https://nmac.to/wp-content/uploads/2017/05/Greeting-Card-Expert.png","title":"Greeting Card Expert 2.1 – Templates for MS Word","content":"Greeting Card Expert – Alungu presents a holidays card application offering a collection of over 540 MS Word templates for cheerful celebrations.   Buy it now if you: Want to congratulate your friends or loved ones Do it like a professional designer Want to get regular updates Like free things and holidays   Nearly all […]"}]