[{"link":"https://nmac.to/blog/a-house-of-many-doors/","image":"https://nmac.to/wp-content/uploads/2019/01/A.House_.of_.Many_.Doors_.png","title":"A House of Many Doors 1.2 – Story Rich Singleplayer RPG Game","content":"Explore the House, a parasite dimension that steals from other worlds, in a train that scuttles on mechanical legs.    Uncover secrets. Open locked doors. Lead a crew of dysfunctional characters. Write procedurally-generated poems. Fight in turn-based combat. Explore a strange new setting, dripping with atmosphere, crusted with lore. Escape. Escape. Escape.   You are […]"},{"link":"https://nmac.to/blog/shadowrun-returns/","image":"https://nmac.to/wp-content/uploads/2013/07/Shadowrun-Returns1.png","title":"Shadowrun Returns 1.2.7 – Tactical combat game 2D turn-based","content":"MAN MEETS MAGIC & MACHINE. The year is 2054. Magic has returned to the world, awakening powerful creatures of myth and legend. Technology merges with flesh and consciousness. Elves, trolls, orks and dwarves walk among us, while ruthless corporations bleed the world dry.   You are a shadowrunner – a mercenary living on the fringes […]"},{"link":"https://nmac.to/blog/shadowrun-hong-kong/","image":"https://nmac.to/wp-content/uploads/2015/08/Shadowrun-Hong-Kong.png","title":"Shadowrun: Hong Kong Extended Edition 3.1.2 – Standalone Shadowrun cRPG series game","content":"Shadowrun: Hong Kong – Extended Edition is the definitive version of Shadowrun: Hong Kong, the third standalone game in Harebrained Schemes’ critically-acclaimed Shadowrun cRPG series. This Extended Edition adds the all-new, 6+ hr Shadows of Hong Kong Bonus Campaign to the game as a free upgrade – delivering on a funding goal achieved by fans […]"},{"link":"https://nmac.to/blog/shadowrun-dragonfall-directors-cut/","image":"https://nmac.to/wp-content/uploads/2019/01/Shadowrun.Dragonfall.DC_.png","title":"Shadowrun: Dragonfall Director’s Cut 2.0.9 – Turn-Based Sci-fi Strategy Game","content":"Shadowrun: Dragonfall – Director’s Cut is a standalone release of Harebrained Schemes’ critically-acclaimed Dragonfall campaign, which first premiered as a major expansion for Shadowrun Returns. The Director’s Cut adds a host of new content and enhancements to the original game: 5 all-new missions, alternate endings, new music, a redesigned interface, team customization options, a revamped […]"},{"link":"https://nmac.to/blog/infographics-maker/","image":"https://nmac.to/wp-content/uploads/2017/12/Infographics-Maker.png","title":"Infographics Maker 3.3.3 – Templates Bundle for Pages","content":"Infographics Maker contains a massive collection of thousands of data visualization tools to illustrate and enhance your Apple Pages documents! Every single item is crafted to perfection to be visually captivating and easily customizable.   Infographics Maker for Pages has items for virtually any occasion, from charts and diagrams to editable city, state, country, and […]"},{"link":"https://nmac.to/blog/business-print-lab/","image":"https://nmac.to/wp-content/uploads/2018/02/Print.Lab-Templates.for_.Pages.png","title":"Business Print Lab 3.3.3 – Templates for Pages","content":"Convince your clients, impress your peers – Business Print Lab for Pages by Jumsoft makes creating gripping Pages documents easier and quicker than ever before! Hundreds of professional templates and near-infinite customization opportunities make it the most powerful tool available to unleash your creativity in business documents.   Business Print Lab for Pages offers a broad […]"},{"link":"https://nmac.to/blog/tropico-3/","image":"https://nmac.to/wp-content/uploads/2019/01/Tropico-3.png","title":"Tropico 3: Gold Edition 1.0.1 – Build and control your own island","content":"Command the Caribbean nation of Tropico in this delicious combination of strategic city builder and humorous political simulator. As an all-powerful “Presidente” with a resource-rich paradise in the palm of your hand, it’s your choice to rule with a velvet glove or an iron fist.   Tropico 3: Gold Edition gives you control over everything […]"},{"link":"https://nmac.to/blog/jpegmini-pro/","image":"https://nmac.to/wp-content/uploads/2017/09/JPEGmini-Pro2.png","title":"JPEGmini Pro 2.2.3 – Compress JPEGs up to 500% while maintaining the original resolution","content":"Everything you’ve loved about JPEGmini -maximum quality, minimum photo file size with enhanced features to lighten your workload. jHigher resolution photos (up to 50MP), Adobe® Lightroom® plugin to fit into your workflow and faster turnaround times (up to 8x).   Maximum Quality, Minimum File Size Using patented image optimization technology, JPEGmini Pro reduces the file […]"},{"link":"https://nmac.to/blog/aquaria/","image":"https://nmac.to/wp-content/uploads/2019/01/Aquaria.png","title":"Aquaria 1.0 – 2D action-adventure game","content":"Aquaria is an award-winning action-adventure game set in a massive underwater world teeming with life and filled with ancient secrets. Join Naija, a lone underwater adventurer, as she travels from hidden caves shrouded in darkness, to beautiful, sunlit oases in search of her past. She’ll uncover hidden treasures, explore uncharted waters, and do battle with […]"},{"link":"https://nmac.to/blog/filesalvage/","image":"https://nmac.to/wp-content/uploads/2019/01/FileSalvage.png","title":"FileSalvage 9.2 – Recover deleted files from a drive","content":"FileSalvage is an extremely powerful Macintosh application for exploring and recovering deleted files from a drive or volume. FileSalvage is designed to restore files that have: been accidentally deleted. become unreadable due to media faults. been stored on a drive before it was re-initialized/formatted.   Use FileSalvage to recover your lost files, music libraries, iPhoto […]"}]