[{"link":"https://nmac.to/blog/frizzix-1-6-23/","image":"https://nmac.to/wp-content/uploads/2014/03/Frizzix.png","title":"Frizzix 1.6.23 – German Fritz!Box call monitor and call manager","content":"Frizzix is a Fritz!Box call monitor and call manager for Mac OS X.   Frizzix shows incoming and outgoing calls managed by a Fritz!Box and the call history of a Fritz!Box on your Mac.   Features: Call Monitor Frizzix shows incoming and outgoing calls in a Growl notification. Frizzix still works after your mac woke […]"},{"link":"https://nmac.to/blog/symantec-encryption-desktop-10-3-2/","image":"https://nmac.to/wp-content/uploads/2014/03/Encryption-Desktop.png","title":"Symantec Encryption Desktop 10.3.2 – Quality security/encryption for email and data","content":"Symantec Encryption Desktop provides individuals a simple, easy-to-use desktop encryption solution to automatically protect confidential communications and digitally stored information with an integrated solution based on strong, broadly accepted security technology.   PGP Desktop incorporates PGP Universal technology to provide automatic encryption, decryption, digital signatures, verification, and recipient key lookup, making it appropriate for both […]"},{"link":"https://nmac.to/blog/hdr-darkroom-3-1-0-2/","image":"https://nmac.to/wp-content/uploads/2014/03/HDRDarkroom.png","title":"HDR Darkroom 3 1.0.2 – High-dynamic-range imaging software","content":"HDR Darkroom is imaging software with a high dynamic range.   Splendid natural scenery and well-thought-out composition are sometimes not enough for a great final image. The final image is either too bright or too dark. Details once seen by the naked eye are completely lost in the shadows or in blown out highlights.   […]"},{"link":"https://nmac.to/blog/folder-icon-maker-1-05/","image":"https://nmac.to/wp-content/uploads/2014/03/Folder.Icon_.Maker_.png","title":"Folder Icon Maker 1.05 – Combine icons and export to different formats","content":"Folder Icon Maker is a tool to customize you Mac OS X folder icon with PNG files. Folder Icon Maker provides an effective way to import your personal and customized icons to create attractive folders.   Folder Icon Maker has 4 different styles of color and 2 options to give you different customized icon effects. […]"},{"link":"https://nmac.to/blog/enolsoft-youtube-converter-hd-4-3-0/","image":"https://nmac.to/wp-content/uploads/2014/03/Enolsoft-YouTube-Converter-HD.png","title":"Enolsoft YouTube Converter HD 4.3.0 – Convert YouTube HD video for iPad, iPhone, ATV on Mac","content":"Enolsoft YouTube Converter HD for Mac is the best YouTube video tool to download and convert YouTube videos iPad, iPhone, Apple TV, Samsung Galaxy Tab, Nexus 7, Kindle Fire, Galaxy S4, Xbox 360 etc on Mac.   Free Download YouTube SD / HD / Ultra HD Videos (1536p, 1080p included) quickly and smoothly on Mac […]"},{"link":"https://nmac.to/blog/chocolat-2-2-1/","image":"https://nmac.to/wp-content/uploads/2014/01/Chocolat.png","title":"Chocolat 2.2.1 – Native Cocoa text editor","content":"Chocolat is a new text editor that combines native Cocoa with powerful text editing tools.    Features: Split editing Code completion Live errors Folding Symbol list Blockedit Vim mode Jump to definition Project find Go to file Web preview Documentation   Version 2.2.1: Feature: Added a dark status bar so that dark themes don’t burn […]"},{"link":"https://nmac.to/blog/iplayer-3-2-3/","image":"https://nmac.to/wp-content/uploads/2014/03/iPlayer.png","title":"iPlayer 3.2.3 – Fully functional media player","content":"iPlayer is a easy-to-use and fully functional media player with powerful playlists manager. It is able to play almost every kind of media file.   Key Features: Support playlist. With playlists you can manage your files. Support Apple Remote. Forget where you stopped playing a file last time. Supported Video Format Extension AVI, WMV, RMVB, […]"},{"link":"https://nmac.to/blog/portrait-3-0-10062/","image":"https://nmac.to/wp-content/uploads/2014/02/portraitplus.png","title":"Portrait+ 3.0.10062 – Retouch the visible skin and enhance facial features in your portraits","content":"With an innovative retouching program like ArcSoft’s Portrait Plus, you can remove blemishes, smooth skin and even manipulate facial features to make your photos look amazing. Filled to the brim with features and tools, Portrait Plus is one of the best photo enhancers available and is our TopTenREVIEWS Gold Award winner.   ArcSoft Portrait+ is […]"},{"link":"https://nmac.to/blog/pdf-nomad-2-3/","image":"https://nmac.to/wp-content/uploads/2014/03/PDF-Nomad.png","title":"PDF Nomad 2.3 – PDF editor built for Mac","content":"PDF Nomad is a modern, carefully styled PDF editor, built from the ground up for OS X 10.7 and later. It features a multitude of ways to take your PDF documents from one place to the next, through an easy-to-use interface. It provides often used operations like merging multiple documents, as well as more exotic […]"},{"link":"https://nmac.to/blog/epic-1-8/","image":"https://nmac.to/wp-content/uploads/2014/03/ePic.png","title":"ePic 1.8 – Create amazing slideshows and manage photos","content":"Use ePic to create amazing slideshow on Mac.   Browse images in full screen mode, show friends the photos from your Mac or your collections from iPhoto and Aperture in amazing 3D mode. Use ePic to view their photos and photos of your friends from popular services like Flickr, Picasa, 500px.   Simple, intuitive interface […]"}]