[{"link":"https://nmac.to/blog/dragthing-5-9-17/","image":"https://nmac.to/wp-content/uploads/2014/01/DragThing.png","title":"DragThing 5.9.17 – Desktop launcher utility","content":"DragThing is a desktop launcher utility that can launch applications, open documents and folders, store text and picture clippings, and do many other customizable actions with a single click or keystroke.   Version 5.9.17: Fixed a problem with badges on application icons not showing Fixed a problem loading colour sets Fixed a problem opening links […]"},{"link":"https://nmac.to/blog/cursorsense-1-3-2/","image":"https://nmac.to/wp-content/uploads/2016/01/CursorSense.png","title":"CursorSense 1.3.2 – Adjust cursor acceleration and sensitivity","content":"CursorSense is the only application that adjusts the cursor acceleration and sensitivity. By adjusting both values, you can move the cursor just like you move your hand. All mice and trackpads are supported.   For Designers: Setting acceleration to 0 will make the cursor movement flat. This is good for drawing, but the cursor will […]"},{"link":"https://nmac.to/blog/anymp4-mod-converter-6-2-1-7/","image":"https://nmac.to/wp-content/uploads/2016/11/AnyMP4-MOD-Converter.png","title":"AnyMP4 MOD Converter 6.2.1.7 – Convert MOD to any popular video format","content":"AnyMP4 MOD Converter can convert MOD to any popular video format like MP4, MOV, M4V, MPEG, AVI, WMV, FLV, WebM and more. With this powerful and professional MOD Converter App, you can convert MOD and other HD/4K videos and general videos like MTS, M2TS, TS, TRP, MP4, 3GP, MOV, M4V, MKV, AVI, WMV, OGM, WTV, […]"},{"link":"https://nmac.to/blog/macjournal-6-2-1/","image":"https://nmac.to/wp-content/uploads/2014/03/MacJournal.png","title":"MacJournal 6.2.1 – Create, maintain, and blog a personal journal","content":"MacJournal is the world’s most popular journaling software for the Mac. MacJournal 6 adds a calendar mode that show entries from any journal, geolocation, word count, and progress tracking, as well as additional blogging support. A Timeline mode has been added to give the journaler the ability to see their writing activity in chronological order. […]"},{"link":"https://nmac.to/blog/rapidclick-1-4/","image":"https://nmac.to/wp-content/uploads/2016/11/RapidClick.png","title":"RapidClick 1.4 – Automatically clicks your mouse at regular intervals","content":"RapidClick automatically clicks your mouse at regular intervals. Use RapidClick to automate simple tasks or to save your hand from getting tired whenever you have to do a lot of clicking.   How to use: Set how fast you want to click Press the Start button to begin clicking Press the Stop button to stop! […]"},{"link":"https://nmac.to/blog/provideoplayer-2-1-2/","image":"https://nmac.to/wp-content/uploads/2014/06/ProVideoPlayer.png","title":"ProVideoPlayer 2.1.2 – Playlist and video manager","content":"ProVideoPlayer was designed to enhanced live staging events such as concerts, trade show booths, conferences, or church services; it manages an unlimited amount of clips in an unlimited number of playlists and gives a tremendous amount of control to the playback of these video clips including Hue, Brightness, Saturation, Start/Stop times, and speed, either on […]"},{"link":"https://nmac.to/blog/lively-logic-1-4-2/","image":"https://nmac.to/wp-content/uploads/2016/11/Lively-Logic.png","title":"Lively Logic 1.4.2 – Analyze data and create graphs and charts","content":"Lively Logic helps you analyze data and present it in beautiful graphs and charts. You can explore your datasets, perform calculations, and create graphs and fine-tune their content and appearance. Change the graph type, choose the data series, and customize axes, fonts, and colors all in seconds.   Features Create line graphs, scatter plots, bar […]"},{"link":"https://nmac.to/blog/joystick-doctor-1-0-1/","image":"https://nmac.to/wp-content/uploads/2016/11/Joystick-Doctor.png","title":"Joystick Doctor 1.0.1 – Perfect tool to help you play your games with a controller","content":"Joystick Doctor is the perfect tool to help you play your games with a controller.   Easily connect Xbox, Playstation and Wii controllers, joysticks and any kind of gamepad.   Highlighted Features: Compatible with wired and wireless game controllers Troubleshooting for connecting and playing with controllers Visualize the full layout of your controller and display […]"},{"link":"https://nmac.to/blog/inmr-6-0-5/","image":"https://nmac.to/wp-content/uploads/2016/11/iNMR.png","title":"iNMR 6.0.5 – Process and visualize Nuclear Magnetic Resonance spectra","content":"iNMR enables you to process and visualize Nuclear Magnetic Resonance spectra.   Have you been longing for an NMR software as stylish as the iMac, as intuitive as the iPod, as resourceful as iLife, and as cheap as iWork? Fast, interactive, and perfectly integrated with OS X? Look no further. iNMR is the only NMR […]"},{"link":"https://nmac.to/blog/ibouquiniste-1-3/","image":"https://nmac.to/wp-content/uploads/2016/11/iBouquiniste.png","title":"iBouquiniste 1.3 – An ebook reader","content":"iBouquiniste is an ebook reader like none you’ve seen before. This app supports FB2, EPUB and offers adjustable fonts. iBouquiniste gives you a reading experience that’s as close as you can get to reading a real book, and it even lets you share your favorite books via email. Click “…More” to learn why you should […]"}]