[{"link":"https://nmac.to/blog/cinemagraph-pro/","image":"https://nmac.to/wp-content/uploads/2019/12/Cinemagraph_2.png","title":"Cinemagraph Pro 2.9 – Create living photos [FIX]","content":"Cinemagraph Pro is the only professional tool specifically designed for the creation of living photos. With its unique “live-masking” technology, artists can preview their living images in real time and output HD (1080) and UHD (4k) quality hybrid photographs.   An intuitive interface enables swift navigation amongst a full suite of editing modes and with […]"},{"link":"https://nmac.to/blog/bandizip/","image":"https://nmac.to/wp-content/uploads/2013/06/Bandizip.png","title":"Bandizip 7.13 – All-in-One Archiver","content":"All-in-One Archiver for your macOS   Main Features All-inclusive compression/decompression/browsing/editing App Supported OS: macOS Sierra(10.12), High Sierra(10.13), Mojave (10.14), Catalina (10.15), Big Sur (11.0) Extraction for 30+ formats, including: RAR/RAR5/7Z/ZIP   Compression ZIP, 7Z, TAR, GZ, TGZ compression ZIP file modification (add/delete/rename) Up to 6 times faster compression than the Finder using multi-core Encrypted archive […]"},{"link":"https://nmac.to/blog/persecond/","image":"https://nmac.to/wp-content/uploads/2018/03/Persecond.png","title":"Persecond 1.5 – Timelapse video made easy [FIX]","content":"Persecond is the easy, fun way to create a beautiful timelapse video. Import an image sequence from any camera, trim the length of your video, adjust the speed and playback direction, and you’re done. Export in broadcast quality or import to Flixel Cinemagraph Pro and create an amazing timelapse+cinemagraph hybrid video. It’s magical visual storytelling […]"},{"link":"https://nmac.to/blog/cascadea/","image":"https://nmac.to/wp-content/uploads/2020/06/Cascadea2.png","title":"Cascadea 2.1.3 – Custom style manager","content":"Introducing Cascadea, the first custom style manager designed as a native Mac application and Safari App Extension. Cascadea makes it easy to install custom styles that change the look and feel of any website you want. Whether you want your social media feed to burst with color, or to give your eyes a break with […]"},{"link":"https://nmac.to/blog/dvdpedia/","image":"https://nmac.to/wp-content/uploads/2020/02/DVDpedia.png","title":"DVDpedia 6.2.1 – DVD cataloging tool with iTunes-like interface","content":"DVDpedia is a powerful movie cataloging application that retrieves all information about your DVDs and videos from the internet.   Search numerous international sites for information about your movies, either by entering keywords or using a webcam or a scanner. You can create smart collections and start a wish list and a borrowed list so […]"},{"link":"https://nmac.to/blog/iconshop/","image":"https://nmac.to/wp-content/uploads/2021/02/IconShop.png","title":"IconShop 1.0.3 – Making Icons Easily","content":"Convert SF Symbols or custom string to icon, export Image Set or App Icon for Xcode.   Convert SF Symbols to Image Do you want to use SF Symbols in iOS13 earlier? IconShop can help you to convert SF Symbols to image easily. You can change ‘color’, ‘scale’, ‘rotation’, ‘background color’ and ‘background radius’ of […]"},{"link":"https://nmac.to/blog/bookpedia/","image":"https://nmac.to/wp-content/uploads/2020/01/Bookpedia.png","title":"Bookpedia 6.2.1 – Book cataloging utility with iTunes-like interface","content":"Bookpedia is book-cataloging software for OS X. To save you time and effort, it retrieves book information from the Internet, either by entering keywords or using a webcam or a scanner. Create smart collections and start a wish list and a borrowed list so you never loose a book again. View your entries as a […]"},{"link":"https://nmac.to/blog/cdpedia/","image":"https://nmac.to/wp-content/uploads/2020/02/CDpedia.png","title":"CDpedia 6.2.1 – CD management system with iTunes-like interface","content":"CDpedia is a music cataloging software. To save you time and effort it retrieves album information from the Internet, either by entering keywords or using a webcam or a scanner. Create smart collections and start a wish list and a borrowed list so you never loose a CD again. View your entries as a standard […]"},{"link":"https://nmac.to/blog/faxbot/","image":"https://nmac.to/wp-content/uploads/2021/01/Faxbot.png","title":"Faxbot 2.6.2 – Send Faxes via FRITZ!Box [FIX]","content":"With Faxbot you can comfortable send faxes on your Mac via your FRITZ!Box.   Faxbot offers you extensive opportunities to integrate faxing into your best workflow.   Aou can open PDF, PNG or JPEG files in Faxbot and send it, create fax documents from any application, which offering you a print dialog, write and formate […]"},{"link":"https://nmac.to/blog/mp3-encoder/","image":"https://nmac.to/wp-content/uploads/2020/07/MP3-Encoder.png","title":"MP3 Encoder 2.18.1 – Convert a variety of audio formats to MP3 [FIX]","content":"MP3 Encoder enables you to convert a variety of audio formats to MP3 using a simple front-end to the high-quality LAME encoder. MP3 Encoder can also be used as a simple MP3 tag editor!   Features Supports Multi-Threading! Encode multiple MP3s at once, up to the number of processor cores your system has. Reads and […]"}]