[{"link":"https://nmac.to/blog/autodesk-smoke-2016/","image":"https://nmac.to/wp-content/uploads/2015/07/smoke.png","title":"Autodesk Smoke 2016 – Powerful video effects software more accessible than ever","content":"Smoke video effects software brings editing and effects together like never before. With the effects tools you need integrated within a standard, easy-to-use timeline environment, Smoke helps you increase your productivity.   Features   3D visual effects tools   3D tracking Composite elements into real-world scenes.   Matchbox Timeline FX Add custom shaders and transitions. […]"},{"link":"https://nmac.to/blog/autodesk-mudbox-2016/","image":"https://nmac.to/wp-content/uploads/2015/07/Mudbox.png","title":"Autodesk Mudbox 2016 – Digital painting and sculpting software","content":"Mudbox digital painting and sculpting software provides 3D artists with an intuitive and tactile toolset for creating and modifying 3D geometry and textures.   Features   Sculpting Falloff options 3D sculpt with Volume or Surface Falloff modes.   Relax Brush Even out spaces between vertices with minimal change to the original mesh.   Twist for […]"},{"link":"https://nmac.to/blog/vssh-1-10/","image":"https://nmac.to/wp-content/uploads/2014/04/vSSH.png","title":"vSSH 1.10 – SSH protocol connectivity tools","content":"VSSH is advanced customizable SSH and Telnet client with iCloud connections, macros and keys sharing.   Key fetaures: SSH and Telnet protocols Username/password and public/private Keys authentication Multi-sessions with tabbed interface iCloud connections, macros and keys sharing with other vSSH apps (for iPhone, iPad and OS X) Key forwarding Port forwarding (support connection without shell: […]"},{"link":"https://nmac.to/blog/set-for-ms-office-2-0/","image":"https://nmac.to/wp-content/uploads/2015/07/Set.for_.MS_.Office2.png","title":"Set for MS Office 2.0 – Bundle of themes and templates for MS Office","content":"Set for MS Office is the ultimate bundle of all designs for Word, PowerPoint, and Excel for Mac offered by Jumsoft. It gives numerous options for producing professional and exciting content ranging from striking themes for your slideshows to smart multi-layout templates for brochures and catalogs. Set for MS Office will make your work more […]"},{"link":"https://nmac.to/blog/jumsoft-clipart-2-0/","image":"https://nmac.to/wp-content/uploads/2015/07/Jumsoft.Clipart.png","title":"Jumsoft Clipart 2.0 – Clipart package for presentations, invitations, Web pages, posters, etc","content":"The Jumsoft Clipart package contains a total of 1580 polished clipart pieces to help you compose thrilling text documents. Spice up your presentations, invitations, Web pages, posters, newsletters, and virtually any text content. Make them uniquely yours!   Jumsoft Clipart features transparent backgrounds that allow putting images on various colors and patterns as well as […]"},{"link":"https://nmac.to/blog/garageband-10-1/","image":"https://nmac.to/wp-content/uploads/2015/07/GarageBand10.png","title":"GarageBand 10.1 – Complete recording studio and more","content":"The new GarageBand is a whole music creation studio right inside your Mac — complete with keyboard, synths, orchestral and percussion instruments, presets for guitar and voice, an entirely redesigned sound library, and virtual session drummers. A beautiful and intuitive interface makes it easy to learn, play, record, and create great-sounding songs. And you can […]"},{"link":"https://nmac.to/blog/current-for-facebook-1-1-2/","image":"https://nmac.to/wp-content/uploads/2015/01/Current-for-Facebook.png","title":"Current for Facebook 1.1.2 – Bring Facebook chat To The Mac Desktop","content":"Current offers THE BEST way to message and browse on Facebook with your Mac! With Current, you can Facebook message friends in their own chat windows and quickly access your inbox, notifications, and online friends right from the menu bar.   Current isn’t just a messaging app. It’s a complete replacement for using Facebook in […]"},{"link":"https://nmac.to/blog/bluestacks-app-player-0-9-21/","image":"https://nmac.to/wp-content/uploads/2013/01/BlueStacks.png","title":"BlueStacks App Player 0.9.21 – Run Android applications on your Mac","content":"BlueStacks App Player lets you run your Android apps fast and fullscreen on your Mac.   Version 0.9.21: Initial stable release, and faster than ever!   Intel, 64-bit processor OS X 10.8 or later                                             "},{"link":"https://nmac.to/blog/business-mix-for-pages-2-0-100-business-templates-for-apple-pages/","image":"https://nmac.to/wp-content/uploads/2015/07/Business.Mix_.for_.Pages2_.png","title":"Business Mix for Pages 2.0 – 100 business templates for Apple Pages","content":"Business Mix Set gives a boost to the chemistry between you and your clients! Pick up 146 professional and stylish business templates for Apple’s Pages application.   Business Mix Set presents an excellent kit of 146 templates for Pages, from business cards and newsletters to proposals and various project management forms. Some of the templates […]"},{"link":"https://nmac.to/blog/blogo-2-3/","image":"https://nmac.to/wp-content/uploads/2014/08/Blogo.png","title":"Blogo 2.3 – Write, publish and manage multiple blogs","content":"Blogo is the easiest and fastest way to write, publish and manage multiple blogs. Blogo gathered features for a powerful solution and helps users to publish and create content easily. It makes it possible to manage multiple blogs at the same time, edit pictures with a built-in image editor, preview your posts on real-time, manage […]"}]