[{"link":"https://nmac.to/blog/notebook-4-0-6/","image":"https://nmac.to/wp-content/uploads/2013/07/NoteBook.png","title":"NoteBook 4.0.6 – Electronic notebook for taking notes, managing and organized","content":"NoteBook stores and organizes your notes and other information in electronic notebooks that look and work just like the paper ones you’ve used all your life. With outlining, diagramming, sketching, voice annotation, even PDF mark-up, NoteBook helps you take great notes whatever your note-taking style.   And NoteBook makes it easy to find anything with […]"},{"link":"https://nmac.to/blog/menu-builder-1-5/","image":"https://nmac.to/wp-content/uploads/2014/11/Menu.Builder.png","title":"Menu Builder 1.5 – Create HTML & CSS3 navigation menus","content":"Menu Builder creates good-looking, standards-compliant menus with simple intuitive visual controls. Developed with HTML & CSS3, all layouts are web-friendly, making them display and function properly on every device. Even create responsive menus that adapt to different web environments, all without any coding necessary.   Version 1.5.: Can now specify hyperlink targets Can now specify […]"},{"link":"https://nmac.to/blog/icircuit-1-7/","image":"https://nmac.to/wp-content/uploads/2014/05/iCircuit.png","title":"iCircuit 1.7 – Design and experiment with circuits","content":"iCircuit is the easiest way to design and experiment with circuits. Its advanced simulation engine can handle both analog and digital circuits and features realtime always-on analysis. It is the perfect companion to students, hobbyists, and engineers.   You use it as you would any CAD program: you add elements, connect them together, and set […]"},{"link":"https://nmac.to/blog/button-builder-1-0/","image":"https://nmac.to/wp-content/uploads/2014/11/Button.Builder.png","title":"Button Builder 1.0 – Create buttons for Web sites and applications","content":"Although buttons make up just a tiny part of most pages, it’s these guys that make the web go ’round. They are key to the ultimate purpose of the web: User Inter Action. And this cool App ladies and lads, can do it all! Making them gorgeous, subtle, noticeable, blend in, stand out and everything […]"},{"link":"https://nmac.to/blog/spooked-2-2/","image":"https://nmac.to/wp-content/uploads/2014/11/Spooked.png","title":"Spooked 2.2 – Virtual poltergeist","content":"Spooked turns your computer into a virtual poltergeist! Choose from six spooky characters that you tell what to say! Great for your Halloween haunted house, or to spook your friends anytime of the year!   Using your computer’s built-in microphone, Spooked can be activated by sound, a mouse-click, or by pressing the space bar. Suddenly […]"},{"link":"https://nmac.to/blog/pdf-toolset-2-2-0/","image":"https://nmac.to/wp-content/uploads/2014/02/PDF.Toolset.png","title":"PDF Toolset 2.2.0 – Powerful PDF document toolkit","content":"Enolsoft PDF Toolset is a ultimate yet powerful PDF document toolkit that allows you to merge multiple PDF files into one, split one big PDF file into smaller ones, compress entire PDF file into smaller size file, extract images out of the PDF, or extract Text out of the PDF file.   Key Features: Quickly […]"},{"link":"https://nmac.to/blog/jpegmini-1-8-7/","image":"https://nmac.to/wp-content/uploads/2014/11/JPEGmini.png","title":"JPEGmini 1.8.7 – Compress JPEGs up to 500% while maintaining the original resolution","content":"JPEGmini is a patent-pending photo recompression technology, which significantly reduces the size of photographs without affecting their perceptual quality. The technology works in the domain of baseline JPEG, resulting in files that are fully compatible with any browser, photo software or device that support the standard JPEG format.   Put your photos on a diet […]"},{"link":"https://nmac.to/blog/youtube-hunter-5-5-0/","image":"https://nmac.to/wp-content/uploads/2014/08/YouTubeHunter.png","title":"YouTube Hunter 5.5.0 – Download and convert YouTube videos","content":"YouTubeHunter is a video downloader and converter.   It takes only seconds to find and download videos from YouTube, Vimeo, DailyMotion, VEVO and others. YouTubeHunter downloads videos 15x faster than real time playing and supports simultaneous downloads. YouTubeHunter has built-in search and preview capabilities. Get video by URL feature is available. YouTubeHunter keeps subtitles for […]"},{"link":"https://nmac.to/blog/templates-for-powerpoint-pro-1-1/","image":"https://nmac.to/wp-content/uploads/2014/11/Templates.for_.PowerPoint.Pro_.png","title":"Templates for PowerPoint Pro 1.1 – PowerPoint Templates designs","content":"Templates for PowerPoint Pro provides 40 carefully designed PowerPoint Templates, over 200 different graphics and more than 725 slides for stunning business presentations. Export them quick and easy to PowerPoint and start working on your presentations in just a few seconds.   SLIDE POOL  Get the largest collection of professional, polished PowerPoint slides available on […]"},{"link":"https://nmac.to/blog/pixa-1-1-7/","image":"https://nmac.to/wp-content/uploads/2014/01/Pixa.png","title":"Pixa 1.1.7 – Quickly and easily organize your images","content":"Pixa is an image-organizing application. The new app functions well, is easy to use, and helps people organize their images quickly and easily on their computers.   For those who prefer not to use the Pixa library, the application can still find images when the user searches for them. So, either way, Pixa makes it […]"}]