[{"link":"https://nmac.to/blog/flamingo-1-1-1/","image":"https://nmac.to/wp-content/uploads/2014/03/Flamingo.png","title":"Flamingo 1.1.1 – Messaging client that supports Hangouts/Gtalk, Facebook, and XMPP","content":"Flamingo is a beautiful, native instant messaging client for OS X that supports Hangouts/Gtalk, Facebook, and XMPP.   Features: All-in-one design: buddies, conversations, and chats in a single window. Multiple, detachable chats in a single window. Inline previews for images, videos, and tweets. Supports CloudApp, Droplr, Instagram, and YouTube. File transfer via direct connection (compatible […]"},{"link":"https://nmac.to/blog/spec-ops-the-line-1-0-0/","image":"https://nmac.to/wp-content/uploads/2014/03/Spec.Ops-The.Line_.png","title":"Spec Ops: The Line 1.0.0 – Action-packed Third-Person Shooter game","content":"Spec Ops: The Line is an action-packed Third-Person Shooter that delivers heart pounding close combat through a squad-based gameplay mechanic. The provocative and gripping storyline challenges players’ morality by putting them in the middle of unspeakable situations where unimaginable choices affecting human life must be made.   Players lead a team of three characters, Captain […]"},{"link":"https://nmac.to/blog/thoughts-1-2-0/","image":"https://nmac.to/wp-content/uploads/2014/03/Thoughts.png","title":"Thoughts 1.2.0 – Information assistant","content":"Thoughts is a complete information assistant which allow you to create rich documents containing notes, links, pictures, tables and lists – in a beautiful interface. Whether you are journalist, storywriter, hobbiest or developer, you will find out that thoughts is just the perfect place to store all your thoughts.   Features: Style your text with […]"},{"link":"https://nmac.to/blog/sqlite-professional-1-0-28/","image":"https://nmac.to/wp-content/uploads/2014/03/SQLite.Professional.png","title":"SQLite Professional 1.0.28 – Advanced SQL editor","content":"SQLite Professional is the top SQLite editor for OS X.    Features: Automatic data reloading when the database gets modified externally. Backwards compatibility with SQLite 2. Version integration. Mucked your database? Rollback to a previous version. Semiautomatic dependency resolution. Column reordering. Import or export your data in CSV, mySQL, XML, or JSON formats. Export custom […]"},{"link":"https://nmac.to/blog/pear-note-3-1-3/","image":"https://nmac.to/wp-content/uploads/2014/01/Pear-Note.png","title":"Pear Note 3.1.3 – Integrates audio, video, and slides with traditional text notes","content":"Pear Note integrates audio, video, and slides with traditional text notes. By recording all activity, Pear Note keeps track of what’s going on while taking notes as well as what the user has to say about it. This makes Pear Note incredibly useful for important meetings, class settings, or speeches.   Recording Notes Pear Note […]"},{"link":"https://nmac.to/blog/macjournal-6-1/","image":"https://nmac.to/wp-content/uploads/2014/03/MacJournal.png","title":"MacJournal 6.1 – Create, maintain, and blog a personal journal","content":"MacJournal is the world’s most popular journaling software for the Mac. MacJournal 6 adds a calendar mode that show entries from any journal, geolocation, word count, and progress tracking, as well as additional blogging support. A Timeline mode has been added to give the journaler the ability to see their writing activity in chronological order. […]"},{"link":"https://nmac.to/blog/macdive-2-3-1/","image":"https://nmac.to/wp-content/uploads/2014/03/MacDive.png","title":"MacDive 2.3.1 – Log scuba dives directly from your dive computer","content":"MacDive is your digital logbook for downloading and logging your dives right from your dive computer! Supporting over 50 models of computer from Atomic Aquatics, Aeris, Mares, Oceanic, Suunto, and more, it’s back for version 2!   Version 2 provides a brand-new interface, bringing with it smart divelogs, iOS syncing, improved gear management, maps, and […]"},{"link":"https://nmac.to/blog/macaw-0-8/","image":"https://nmac.to/wp-content/uploads/2014/02/Macaw.png","title":"Macaw 0.8 – The code-savvy web design tool","content":"Stop writing code. Start drawing it.   Macaw provides the same flexibility as your favorite image editor but also writes semantic HTML and remarkably succinct CSS. It’s time to expect more from a web design tool.   Fluid canvas and grid Macaw is engineered for fluid widths. Resize the canvas and your grids and elements […]"},{"link":"https://nmac.to/blog/chocolat-2-2-3/","image":"https://nmac.to/wp-content/uploads/2014/01/Chocolat.png","title":"Chocolat 2.2.3 – Native Cocoa text editor","content":"Chocolat is a new text editor that combines native Cocoa with powerful text editing tools.    Features: Split editing Code completion Live errors Folding Symbol list Blockedit Vim mode Jump to definition Project find Go to file Web preview Documentation   Version 2.2.3: Feature: A new recent-project popover appears on launch. Can be disabled in […]"},{"link":"https://nmac.to/blog/hueshifter-1-2-0/","image":"https://nmac.to/wp-content/uploads/2014/01/HueShifter.png","title":"HueShifter 1.2.0 – Image color shifting application","content":"HueShifter is an amazing new application for doing color transposition or “color shifting” in images. Unlike other graphics applications, HueShifter works in perceptually uniform colorspace so you can make changes that are virtually imperceptible, all while working with color dimensions that you’re familiar with – hue, saturation and lightness.   HueShifter works right alongside Adobe […]"}]