[{"link":"https://nmac.to/blog/pdf-watermarker/","image":"https://nmac.to/wp-content/uploads/2018/11/PDF-Watermarker.png","title":"PDF Watermarker 3.9 – PDF Watermarker lets you easily watermark your PDFs","content":"With PDF Watermarker you can easily watermark your PDF documents: Text, Image, Stamp Watermark Apply Text, Image, Stamp Watermark Watermark a single PDF Generate batch of personalized watermarked PDF for different people Include an Image watermark on your PDF Add Stamp to your PDF Secure your PDF watermarked Set a password for all you Watermarked […]"},{"link":"https://nmac.to/blog/barsoom/","image":"https://nmac.to/wp-content/uploads/2016/07/Barsoom.png","title":"Barsoom 3.0 – Keep your menu bar in order","content":"Barsoom lets you rearrange any menu bar items in the order you want, and keep your menu bar in order between restarts. Simply rearrange them with the natural OS X way, Cmd-Drag-and-Drop. You can also hide items that you do not need to see simply by Cmd-Right-clicking on the item. Or with the new feature, […]"},{"link":"https://nmac.to/blog/icon-plus/","image":"https://nmac.to/wp-content/uploads/2016/08/Icon.Plus_.png","title":"Icon Plus 1.3 – Design Beautiful App Icons and Logos","content":"Turn any photo on your Mac into a beautiful icon, combine images and text to create stunning logo designs and edit existing graphics to achieve a perfect user interface. All these features make Icon Plus a very useful tool for both app developers and graphic designers. Here is a list of what Icon Plus has […]"},{"link":"https://nmac.to/blog/design-books-author-templates/","image":"https://nmac.to/wp-content/uploads/2017/12/DesiGN-Books-Author-Templates.png","title":"DesiGN Books Author Templates 6.0.1 – Themes for iBooks Author","content":"DesiGN Books Author Templates (was GN Books for iBooks Author) is a collection of compelling templates for Apple’s new application for book creation and publishing. Browse the wide range of designs to find the perfect look, add your text and images and publish your own book to iBookstore!   The templates cover various book categories […]"},{"link":"https://nmac.to/blog/tunesgo/","image":"https://nmac.to/wp-content/uploads/2018/05/TunesGo.png","title":"TunesGo 9.7.3.4 – Transfer music and playlists from your mobile to your iTunes Library","content":"TunesGo is a must-have phone manager. It could act as your one-stop solution to manage your entire mobile lifestyle in one convenient place. iTunes is no longer needed for all iOS-related features. It is a powerful tool to manage media contents on iOS and Android on PC, a. Smart transfer, supporting the transfer of all […]"},{"link":"https://nmac.to/blog/luminar-2/","image":"https://nmac.to/wp-content/uploads/2017/10/Luminar-2018.png","title":"Luminar 2018 1.3.2 – Powerful, adaptive, configurable image editing","content":"Luminar is the world’s first photo editor that adapts to your style and skill level. It is the supercharged photo software that makes complex editing easy and enjoyable–and it is as responsive and beautiful as your Mac.   Luminar is powered by the latest photo-processing tech handcrafted by a Macphun team with over 10 years […]"},{"link":"https://nmac.to/blog/ambify/","image":"https://nmac.to/wp-content/uploads/2016/01/Ambify.png","title":"Ambify 1.6.3 – Sync streaming music to Philips Hue light bulbs","content":"Ambify is the realtime music visualizer powered by Philips Hue.   Capture System Audio  Unlike the original app, Ambify for Mac is not an audio player but a powerful universal audio processor instead. When used in System Capture mode, Ambify can capture audio from any App on your Mac!   Philips Hue  Ambify makes use […]"},{"link":"https://nmac.to/blog/macproxy/","image":"https://nmac.to/wp-content/uploads/2014/08/MacProxy3.png","title":"MacProxy 3.0.10 – System-wide network proxy support","content":"MacProxy provides system-wide network proxy support for the Mac. It forwards network traffic from applications that do not support proxies and avoids complex setup for applications that do. MacProxy allows you to surf the Internet from behind a firewall, connect securely when using public Wi-Fi networks, and navigate the Internet without being tracked. Create profiles […]"},{"link":"https://nmac.to/blog/inpixio-photo-cutter/","image":"https://nmac.to/wp-content/uploads/2018/10/InPixio-Photo-Cutter.png","title":"InPixio Photo Cutter 1.4 – Cutout and remove photo background","content":"With inPixio Photo Cutter, Cut-out any detail, person, object or landscape element from your photos. Select the shape of the object thanks to the cursor or the background to remove, Photo Cutter algorithm runs automatically!   You can also use the “retention” cursor for important details to keep and get a successful clipping! Even fine […]"},{"link":"https://nmac.to/blog/flux/","image":"https://nmac.to/wp-content/uploads/2017/04/Flux7.png","title":"Flux 7.1.11 – Advanced Web design tool","content":"Flux is an advanced XHTML and CSS Web design app. You can do Web 2.0, AJAX, and most other buzzword-compliant things.   It has the following features: Drag-and-drop design of Web pages, which means you can do almost anything without touching or even seeing XHTML/CSS–but you can meddle with the code if you want. Apply […]"}]