[{"link":"https://nmac.to/blog/countdown/","image":"https://nmac.to/wp-content/uploads/2021/06/Countdown.png","title":"Countdown 6.0.4 – Keep track of any occasion","content":"Countdown is an easy way to keep track of upcoming events, holidays and important dates.   Features: Add, edit and delete countdowns iCloud sync your countdowns Siri Shortcuts Share countdowns to social media Set your own pictures from existing images, clipboard or the web Notifications before the countdown No ads, pay once   Device and […]"},{"link":"https://nmac.to/blog/i-picker/","image":"https://nmac.to/wp-content/uploads/2021/06/i-Picker.png","title":"i-Picker 1.0.4 – Open any URL in any browser","content":"i-Picker for Mac lets you pick between the installed browsers and any client application which can open the URL. If you use more than one web browser, tired of opening links with your default browser? Try i-Picker for Mac.   Usually, when you click on a link, it will be opened using the default browser. […]"},{"link":"https://nmac.to/blog/text-hider/","image":"https://nmac.to/wp-content/uploads/2021/06/Text-Hider.png","title":"Text Hider 2.10 – Keep secret in video & picture","content":"Hide your secret text inside any picture or video! Use it as a simple video player too.   Still, writing secrets in notebooks stashed away in a locked drawer?   Text Hider provides a better way of hiding secrets: in pictures, and not just image files, but also in video files or even in PDF […]"},{"link":"https://nmac.to/blog/star-trek-legends/","image":"https://nmac.to/wp-content/uploads/2021/04/Star-Trek-Legends.png","title":"Star Trek Legends 1.0.8 – Lead the ultimate away team","content":"Engage in an epic storyline for control of the mysterious Nexus and the fate of the universe as players step into the role of their favorite Star Trek heroes and villains in the hit franchise’s official team-based RPG. Players will embark on missions, experience epic turn-based combat and make choices that influence the entire story […]"},{"link":"https://nmac.to/blog/spaceland/","image":"https://nmac.to/wp-content/uploads/2021/06/Spaceland.png","title":"Spaceland 1.4.1 – Fast-paced sci-fi tactics","content":"It is probably the most dynamic turn-based strategy in the spirit of the old school. Less covers, more action! Land on a lost planet and show the mutants what you are made of. Shoot, kick, blow up and destroy. You will put together the most reckless team of fighters and unravel the mysteries of the […]"},{"link":"https://nmac.to/blog/survival-z/","image":"https://nmac.to/wp-content/uploads/2021/05/Survival_Z_1.png","title":"Survival Z 1.1.3 – Gear up and go shoot down the zombie threat!","content":"After the event, humanity lies on the brink while zombies dominate the landscape! You are a survivor. Armed with your wits and bravado, you are determined to save all who remain.   Your goal is clear: find survivors and seek out a way to exterminate the undead menace. Choose your way along randomly generated routes […]"},{"link":"https://nmac.to/blog/pac-man-party-royale/","image":"https://nmac.to/wp-content/uploads/2021/06/PAC-MAN-Party-Royale.png","title":"PAC-MAN Party Royale 2.1.14 – The retro arcade multiplayer","content":"Challenge your friends in this brand-new PAC-MAN game, mixing the instant fun of arcade retro-gaming with a multiplayer experience.   Play our 4 Players Battle Mode, and be the last PAC-MAN standing to win the rounds!   Eat pellets to gain speed and catch the Super Pellet first – and see your friends and the […]"},{"link":"https://nmac.to/blog/sid-meiers-civilization-vi/","image":"https://nmac.to/wp-content/uploads/2016/10/Civilization-VI.png","title":"Sid Meier’s Civilization VI 1.3.13 – Lead your people to a new frontier","content":"Sid Meier’s Civilization VI, winner of 15 E3 awards including Best PC Game and Best Strategy Game, is the next entry in the popular Civilization franchise, which has sold in over 35 million units worldwide, including more than 8 million units of Civilization V.   Originally created by legendary game designer Sid Meier, Civilization is […]"},{"link":"https://nmac.to/blog/pro-mouse/","image":"https://nmac.to/wp-content/uploads/2021/06/Pro-Mouse.png","title":"Pro Mouse 1.10 – Draw. Zoom. Highlight","content":"Whether you want to run a presentation/demo like a pro or just want to know where your mouse cursor is at all times, Pro Mouse is the tool for you!   Present like a Pro!   Have your audience follow your every click.   Highlight what matters by DRAWING anywhere with Pro Mouse. Clear your […]"},{"link":"https://nmac.to/blog/solfa/","image":"https://nmac.to/wp-content/uploads/2021/06/Solfa.png","title":"Solfa 1.6 – Bass guitar Violin Cello Piano","content":"How to learn notes? How to read sheet music? How to remember note names?   “Notes” helps you learn notes for piano, guitar or singing.   “Musical Notes” is a quiz game for kids and beginners that helps you learn simple music theory.   train sight-reading read notes of alto, bass, tenor, treble clef staff […]"}]