[{"link":"https://nmac.to/blog/peakhour/","image":"https://nmac.to/wp-content/uploads/2017/06/PeakHour4.png","title":"PeakHour 4.1.14 – Visualize and analyze your network traffic","content":"PeakHour is a beautiful, real-time network-traffic visualiser that lives in your menu bar. It provides an instant view of your Internet or WiFi activity in real-time. PeakHour is great for monitoring your Internet or WiFi connection, and can help you determine how much bandwidth your computers and devices are using at any given time.   […]"},{"link":"https://nmac.to/blog/capslocker/","image":"https://nmac.to/wp-content/uploads/2021/05/CapsLocker.png","title":"CapsLocker 1.4.0 – Never hit caps lock unnoticed anymore","content":"Caps Lock Notifications – never hit caps lock unnoticed anymore!   Ever hit caps lock by mistake and SUDDENLY WROTE EVERYTHING IN UPPERCASE?   Do no more! With CapsLocker you will get a little hint that you just enabled (or disabled) caps lock.   These are the features: Shows a small HUD whenever the caps […]"},{"link":"https://nmac.to/blog/audioswitcher/","image":"https://nmac.to/wp-content/uploads/2016/12/AudioSwitcher2.png","title":"AudioSwitcher 3.08 – Quick and easy control over AirPlay and other audio devices","content":"AudioSwitcher is a menu bar that allows you to switch quickly between all available input and output devices.  In addition you can change the volume of any device without having to change your current input / output.   You can quickly change the sample rate or output to multiple devices at the same time.   […]"},{"link":"https://nmac.to/blog/hyperbrawl-tournament/","image":"https://nmac.to/wp-content/uploads/2020/12/HyperBrawl_Tournament_1.png","title":"Hyperbrawl Tournament 1.3 – Future Arena Combat Sport","content":"HyperBrawl Tournament is a future arena combat sport like no other! Heroes compete in electrifying 2v2 PVP matches fusing no rules soccer, combat and skill-based weapon power ups. Challenge for trophies and artefacts in the single player GALAXY LEAGUE AND COSMIC CUP modes; or head online and compete with players from around the globe in […]"},{"link":"https://nmac.to/blog/spongebob-patty-pursuit/","image":"https://nmac.to/wp-content/uploads/2021/02/SpongeBob-Patty-Pursuit.png","title":"SpongeBob: Patty Pursuit 3.0 – Save the Krabby Patty Formula","content":"Trouble has come to Bikini Bottom! The evil “mastermind” Sheldon J. Plankton has once again hatched a plan to steal the secret Krabby Patty formula. This time he has enlisted his army of cousins to capture all of SpongeBob’s friends! Play as SpongeBob on his epic, most side-scrolly quest through Bikini Bottom ever! Explore, collect […]"},{"link":"https://nmac.to/blog/skate-city/","image":"https://nmac.to/wp-content/uploads/2020/12/Skate-City.png","title":"Skate City 3.1 – Your perfect ride, worldwide","content":"Capture the heart and soul of street skating in a style that’s all your own. Push to perfect your flow and improve your skills while mastering hundreds of trick combinations. Immerse yourself in the dynamic environments as morning fades to night, and the weather shifts unexpectedly.   Features:   Do you even skate? Now you […]"},{"link":"https://nmac.to/blog/possessions/","image":"https://nmac.to/wp-content/uploads/2021/05/Possessions.png","title":"Possessions 2.11 – Beautiful zen puzzle","content":"Imagine a room where a TV seems to be sitting on a table. But when you look at it   from another angle, it appears to be floating in mid-air. Magic? No. Perspective? Yes.   Welcome to a world where your eyes deceive you every day. Welcome to the world of Possessions – a minimalist […]"},{"link":"https://nmac.to/blog/fontography/","image":"https://nmac.to/wp-content/uploads/2016/09/Fontography_2.png","title":"Fontography 3.0 – Fonts & Typography + Photo Effects for Photos","content":"Fontography = Fonts + Photography “A picture is worth a thousand words.” Add gorgeous and inspirational text to your photos in ways you never thought you could.   With Fontography, you can: Mask a text box giving it the illusion the text is apart of the image Add a new image layer for your company […]"},{"link":"https://nmac.to/blog/papetura/","image":"https://nmac.to/wp-content/uploads/2021/05/Papetura.png","title":"Papetura 1.0 – An atmospheric point & click adventure game","content":"Papetura is a handcrafted puzzle adventure game made entirely out of paper.   Along with atmospheric music made by Floex, it creates a mysterious and unique paper world, shrouded in shadow and light.   The Story Papetura tells a story about lonely paper creature Pape, trapped in a flowery prison. One day Pape escapes and […]"},{"link":"https://nmac.to/blog/spelldrifter/","image":"https://nmac.to/wp-content/uploads/2021/05/Spelldrifter.png","title":"Spelldrifter 1.1.12 – Deck Building Tactical RPG","content":"Introducing Spelldrifter, a hybrid tactical role playing game and deck building game that features the best parts of both!   Spelldrifter combines the puzzle-like positional tactics of a turn-based RPG battle with the deep customizability and replayability of a collectible card game. The result: a hybrid, wherein players must juggle the resources at their disposal […]"}]