[{"link":"https://nmac.to/blog/tweetbot/","image":"https://nmac.to/wp-content/uploads/2017/09/Tweetbot2.png","title":"Tweetbot 2.5.4 – Popular Twitter client","content":"Tweetbot is a full-featured OS X Twitter client with a lot of personality. Whether it’s the meticulously-crafted interface, sounds and animation, or features like multiple timelines and column views, there’s a lot to love about Tweetbot.   Features Multiple Timelines. Quickly switch between your lists as your main timeline. Multiple Windows and Columns. Display timelines […]"},{"link":"https://nmac.to/blog/myfourwalls/","image":"https://nmac.to/wp-content/uploads/2015/10/MyFourWalls1.png","title":"MyFourWalls 1.0.7 – Furnishing planner","content":"MyFourWalls is an easy-to-use home planning tool that lets you play with new design choices in an existing space or plan the entire interior of a new home. take a 3d virtual house tour in real time to get an authentic impression of your new space. before rolling up your sleeves, let myfourwalls help you […]"},{"link":"https://nmac.to/blog/mail-satellite/","image":"https://nmac.to/wp-content/uploads/2017/11/Mail-Satellite.png","title":"Mail Satellite 1.9.16 – Display unread emails from menu bar","content":"Mail Satellite displays unread emails from your menu bar. Quickly view an email to reveal, reply or delete directly without showing Apple Mail. Based on AppleScript to communicate with Apple Mail.   Version 1.9.16: Release notes were unavailable when this listing was updated.   Intel, 64-bit processor OS X 10.9 or later    "},{"link":"https://nmac.to/blog/404bypass/","image":"https://nmac.to/wp-content/uploads/2017/11/404bypass.png","title":"404bypass 1.0.4 – Redirection made easy","content":"404bypass is designed to help you avoid 404 errors by generating a redirect file for your website. This is especially useful when a redesign leads to pages being assigned a new URL. 404bypass scans your old and new website, automatically compares the scan results, and generates a list of redirects. It also allows you to […]"},{"link":"https://nmac.to/blog/scrambler/","image":"https://nmac.to/wp-content/uploads/2017/11/Scrambler.png","title":"Scrambler 1.3 – Simplified data encryption tool","content":"Scrambler lets you encrypt your files to keep them safe from prying eyes. This is especially important when sending files to other Macs over untrusted email, instant messaging, and cloud-based services.   Scrambler is a simple, secure, and robust encryption app for the Mac. All you have to do is this: Drag a file on […]"},{"link":"https://nmac.to/blog/debris/","image":"https://nmac.to/wp-content/uploads/2017/10/debris.png","title":"Debris The Ice 1.1 – An atmospheric single-player adventure game","content":"You’re part of a small team sent to film a promotional video for a groundbreaking discovery: meteoric debris embedded deep in Arctic ice that provides clean, hyper-efficient energy. But as your dive begins, several explosions create a powerful current that drags you and your team down, trapping everyone in a vast network of submerged glacial […]"},{"link":"https://nmac.to/blog/proxie/","image":"https://nmac.to/wp-content/uploads/2017/08/Proxie.png","title":"Proxie 2.4.1 – HTTP debugging proxy","content":"Proxie puts a proxy between HTTP clients and the Internet. After a proper configuration of proxy settings, all HTTP traffic will go through Proxie and be available for inspection.   Features Any Platform – Proxie records all HTTP traffic from any Mac, Windows PC, Linux and mobile devices. Body Viewers – Proxie chooses the proper […]"},{"link":"https://nmac.to/blog/age-of-mythology/","image":"https://nmac.to/wp-content/uploads/2017/11/Age-of-Mythology.png","title":"Age of Mythology 2.0.1 – A classic real time strategy game","content":"The game that transports players to a time when heroes did battle with monsters of legend and the gods intervened in the affairs of mortals.   Use mythological creatures like Minotaurs and Cyclopes to bolster your armies’ strength. Call upon the gods for assistance in flattening enemy towns with meteors or scatter opposing troops with […]"},{"link":"https://nmac.to/blog/exchange-rates/","image":"https://nmac.to/wp-content/uploads/2017/05/Exchange-Rates.png","title":"Exchange Rates 2.8.1 – Easily accessed currency conversions","content":"Exchange Rates is perfect for you if you are tired of launching the OS X Calculator app and stepping through menu paths, or launching the fullscreen OS X Dashboard just for doing a simple currency conversion. It’s a small currency calculator residing in the OS X status bar — always available and always up-to-date. Nothing […]"},{"link":"https://nmac.to/blog/quick-launch/","image":"https://nmac.to/wp-content/uploads/2017/11/Quick-Launch.png","title":"Quick Launch 1.0 – Toolbar on the Menu","content":"The Fastest and Easiest way to Launch Apps & Docs Just drag apps and docs then drop on the menubar. Click to launch and it shows green light when the app is running. Global hotkey support. If you migrated from Windows you definitely need this !!   OS X 10.10 or later, 64-bit processor   […]"}]