[{"link":"https://nmac.to/blog/hacknet/","image":"https://nmac.to/wp-content/uploads/2017/05/Hacknet_5.png","title":"Hacknet 5.069 – An immersive, terminal-based hacking simulator","content":"Hacknet is an immersive, terminal-based hacking simulator for PC. Dive down a rabbit hoIe as you follow the instructions of a recently deceased hacker, whose death may not have been the accident the media reports. Using old school command prompts and real hacking processes, you’ll solve the mystery with minimal hand-holding and a rich world […]"},{"link":"https://nmac.to/blog/fontlab/","image":"https://nmac.to/wp-content/uploads/2019/04/FontLab7.png","title":"FontLab 7.2.0.7649 – Create your own fonts or edit existing fonts","content":"With FontLab (was FontLab Studio), you can create, open, modify, draw, space, kern, hint, and export desktop, web, color, and variable fonts. It is an all-around font editor, but also supports data interchange with other font creation tools, making it easy to integrate into your existing workflows. FontLab brought in the best of their classic […]"},{"link":"https://nmac.to/blog/videotag/","image":"https://nmac.to/wp-content/uploads/2020/12/VideoTag.png","title":"VideoTag 1.2 – Metadata for your videos","content":"Tag your mp4/m4v files with metadata and make your TV/iTunes library look gorgeous on all your devices. Just drag and drop a video file in from the Finder or from the TV app or iTunes and VideoTag will quickly download high quality metadata from themoviedb.org. You can select from alternative titles or search manually if […]"},{"link":"https://nmac.to/blog/trminal/","image":"https://nmac.to/wp-content/uploads/2017/11/Trminal_1.png","title":"Trminal 1.1.1 – Your Terminal shortcut","content":"Trminal will quickly open a Terminal window, or tab, for the current Finder directory. It’s always accessible from your main menu. It can also automatically run a shell script as soon as the Terminal window/tab opens. Supports the macOS built-in Terminal and iTerm2. An indispensable tool for any developer, shell nerd or git junkie.   […]"},{"link":"https://nmac.to/blog/hands-off/","image":"https://nmac.to/wp-content/uploads/2013/12/handsoff.png","title":"Hands Off! 4.4.3 – Monitor and control application access to your network and disks","content":"Hands Off! is an application to monitor and control the access of applications to your network and disks. Being able to monitor the normally unnoticeable activities enables you to make informed decisions regarding the transfer of your private information, hence avoiding confidential information leakage.   When connected to the Internet, applications can send any information […]"},{"link":"https://nmac.to/blog/shinsekai-into-the-depths/","image":"https://nmac.to/wp-content/uploads/2020/12/Shinsekai-Into-the-Depths.png","title":"Shinsekai Into the Depths 1.3.0 – Undersea exploration game","content":"Capcom presents a fresh and original undersea exploration game, filled with unique visual and audio experiences for you to discover.   The land has slowly but steadily been covered with ice, forcing mankind to take refuge in the ocean. Even the sea cannot protect them forever. The ice overtakes the undersea home of a lone […]"},{"link":"https://nmac.to/blog/empire-of-sin/","image":"https://nmac.to/wp-content/uploads/2020/12/Empire-of-Sin.png","title":"Empire of Sin 1.02.38741 – Turn-Based Strategy & Management Game","content":"Empire of Sin is a new strategy game brought to you by Romero Games and Paradox Interactive that puts you at the heart of the ruthless criminal underworld of 1920s Prohibition-era Chicago. Slip into the shoes of one of the fourteen real and historically inspired mob bosses such as Al Capone, Stephanie St. Clair, or […]"},{"link":"https://nmac.to/blog/portsmonitor/","image":"https://nmac.to/wp-content/uploads/2015/02/PortsMonitor_1.png","title":"PortsMonitor 1.4.5 – Monitor system TCP/IP network connections","content":"PortsMonitor is a system utility for monitoring system TCP/IP network connections by application, and connections’ status. With search-expression support, you can filter connections with preferred conditions.   Features: Monitor all system connections and open ports Filter connections by search expression For search-expression grammar please visit http://tickplant.com/portsmonitor/ Filter profile support Uses color to indicate item status: […]"},{"link":"https://nmac.to/blog/frogger-in-toy-town/","image":"https://nmac.to/wp-content/uploads/2020/12/Frogger-in-Toy-Town.png","title":"Frogger in Toy Town 1.4.0 – Jump into a froggy adventure","content":"Toppling blocks, falling books…   Things that seem unimportant to humans can pose great danger in the frog world…   Frogger is back! The classic frog-action game returns on Apple Arcade with an all-new look and the same simple gameplay. Guide the iconic amphibian forward as you evade the numerous obstacles in your path!   […]"},{"link":"https://nmac.to/blog/a-monsters-expedition/","image":"https://nmac.to/wp-content/uploads/2020/12/A-Monsters-Expedition.png","title":"A Monster’s Expedition 1.0.3 – Through Puzzling Exhibitions","content":"From some of the best puzzle designers in the world comes A Monster’s Expedition, an adorable and relaxing open world puzzle adventure for monsters who love to learn about humans.   By pushing trees over to create pathways, you’ll explore hundreds of islands near and far to learn about the history of “humanity”.   Immerse […]"}]