[{"link":"https://nmac.to/blog/youtube-hunter-4-8-0/","image":"https://nmac.to/wp-content/uploads/2013/12/39300.png","title":"YouTube Hunter 4.8.0 – Download and convert YouTube videos","content":"YouTube Hunter means it takes only seconds to find and download videos from YouTube, Vimeo, DailyMotion and others.   – YouTubeHunter has built-in search and preview capabilities. – Any videos (even in HD) will be on your Mac in several moments. – Get video by URL feature is available.   You don’t need install any […]"},{"link":"https://nmac.to/blog/jsref-v1-1/","image":"https://nmac.to/wp-content/uploads/2013/12/JSRef_icon.175x175-75.png","title":"JSRef v1.1 – Quick offline reference for the web- and webapp-developer","content":"JSRef is the missing quick offline reference for the web- and webapp-developer. It contains the current CSS3, ECMA (JavaScript Language Specification), DOM and Canvas API documentation. JSRef comes with a system wide service “Lookup in JSRef”, that integrates into your system and lets you look up the API entry from within any application (e.g. your HTML […]"},{"link":"https://nmac.to/blog/retrospect-v10-0-1-105/","image":"https://nmac.to/wp-content/uploads/2013/12/7562.png","title":"Retrospect v10.0.1.105 – Backup and recovery software","content":"Retrospect is the most trusted name in Mac backup and recovery, with more than two decades of field-tested expertise – protecting Macs and Windows PCs and servers worldwide from data loss due to user error, computer failure or site-wide disasters such as fire, theft or flood. Features: Protect servers, business-critical applications, desktops and notebooks with […]"},{"link":"https://nmac.to/blog/battery-time-remaining-v1-6-2/","image":"https://nmac.to/wp-content/uploads/2013/12/icon.175x175-7528.png","title":"Battery Time Remaining v1.6.2 – Battery time remaining on top of your screen","content":"Show battery time remaining on top of your screenExtra features:– Get notifications when battery is fully charged or on a certain percent– Languages: Dutch, English, French, German, Slovak, Swedish– Show battery temperature, power usage, cycle count and battery in mAh WHAT’S NEW Version 1.6.2: Added Spanish language REQUIREMENTS Intel, 64-bit processor OS X 10.8 or […]"},{"link":"https://nmac.to/blog/gctk-v1-2-1/","image":"https://nmac.to/wp-content/uploads/2013/12/gctk.175x175-75.png","title":"GCTK v1.2.1 – The Geocaching Toolkit","content":"30+ tools to help you solve mystery- and multi-caches and make navigational computations. The number of tools will grow depending your input GCTK features:CONVERSIONSBase64/Binary/Decimal/Hex to ASCII Binary/Decimal/Hex/Octal conversionsCelsius, Fahrenheit and KelvinCoordinatesystemsD°M’S” conversionsDistancesRoman numbers NAVIGATION2 WPs + 2 bearings = new WP2 WPs + 2 distances = 2 new WPs3 WPs + 3 distances = new WPCentroid […]"},{"link":"https://nmac.to/blog/bluetooth-screen-lock-v1-3-4/","image":"https://nmac.to/wp-content/uploads/2013/12/Bluetooth_Screen_Lock.175x175-75.png","title":"Bluetooth Screen Lock v1.3.4 – Bluetooth-activated screen locker","content":"Bluetooth Screen Lock ensures that you don’t forget to lock your screen again. Be secure at home and at work. The application will lock your screen when you walk away while carrying an associated bluetooth device. Notes: For best performance pair with device prior to launching application. A bluetooth signal is designed to work up […]"},{"link":"https://nmac.to/blog/contacts-sync-for-google-gmail-v3-8-3/","image":"https://nmac.to/wp-content/uploads/2013/12/icons.175x175-757.png","title":"Contacts Sync For Google Gmail v3.8.3 – Allows you to sync your Gmail and Mac contacts","content":"Contacts Sync For Google Gmail allows you to quickly and easily sync your Gmail and Mac contacts so you can have access to your contacts wherever you go. This app excels with its reliability, ease of use, speed, and with a true “2-way sync” that allows you to merge changes you’ve made to your Gmail […]"},{"link":"https://nmac.to/blog/chipmunk-v1-5-4-1/","image":"https://nmac.to/wp-content/uploads/2013/12/id405502331.png","title":"Chipmunk v1.5.4.1 – Tool to find and remove duplicate files","content":"Chipmunk finds all duplicates, fast.  Files are automatically compared byte by byte to determine if two given files are true duplicates. Intelligent deleting can operate on all files inside a folder that exist outside of it or vice versa. Search all drives connected to your Mac If you can access it you can search it. […]"},{"link":"https://nmac.to/blog/xnretro-v1-24/","image":"https://nmac.to/wp-content/uploads/2013/12/xnretro.175x175-75.png","title":"XnRetro v1.24 – Turn your photos into intant/vintage","content":"With XnView Retro you can easily turn your photos into intant/vintage images. Features: – 20 color effects – 15 light effects such as bokeh, leak – 28 frame borders – Adjustement like contrast, gamma, saturation, … – Vignetting – Noise – Save or share the result WHAT’S NEW Version 1.24: New icon Flickr sharing Bugs […]"},{"link":"https://nmac.to/blog/radium-v2-8-4/","image":"https://nmac.to/wp-content/uploads/2013/12/mzi.ioeybkry.175x175-75.png","title":"Radium v2.8.4 – Multi-network radio player; supports XM Online, AOL Radio, and more","content":"Radium is an Internet radio player that’s designed from the ground up to be simple, intuitive, and lightweight. With its powerful search, thousands of supported stations (including Sirius/XM and DI.fm/Sky.fm Premium), and the ability to add your own streams, Radium will change the way you listen to Internet radio.   Version 2.8.4: Fixed SiriusXM for […]"}]