[{"link":"https://nmac.to/blog/hide-desktop-files-1-0/","image":"https://nmac.to/wp-content/uploads/2016/01/Hide-Desktop-Files.png","title":"Hide Desktop Files 1.0 – Easily hide the files on your Desktop","content":"Hide Desktop Files lets you temporarily hide all those files on your Desktop with a single click. Perfect when you need clarity and focus.   Version 1.0: Initial release   Intel, 64-bit processor OS X 10.11 or later    "},{"link":"https://nmac.to/blog/cloudmagic-email-7-6-19/","image":"https://nmac.to/wp-content/uploads/2016/01/CloudMagic.png","title":"CloudMagic Email 7.6.19 – One app for all of your email accounts","content":"CloudMagic is the perfect app to handle your email accounts.   Instant push notifications for ALL types of email accounts: Gmail, Exchange, Yahoo, Outlook, iCloud, Google Apps, Office 365, IMAP – you name it! Supports all versions of Exchange: ActiveSync (EAS), EWS and IMAP. Handoff: Effortlessly hand off what you’re doing on iPhone, iPad or […]"},{"link":"https://nmac.to/blog/tomb-raider-anniversary-1-2/","image":"https://nmac.to/wp-content/uploads/2016/01/Tomb.Raider.Anniversary.png","title":"Tomb Raider: Anniversary 1.2 – Intense, classic action game","content":"A decade after Lara Croft’s first archaeological escapade in the celebrated Tomb Raider, that enthralling adventure was re-imagined for a new audience. Faithfully preserving the gameplay and story elements that made the original Tomb Raider so compelling, Tomb Raider Anniversary is a completely new experience that will captivate fledgeling explorers and veteran raiders alike.   […]"},{"link":"https://nmac.to/blog/a-boy-and-his-blob-1-0/","image":"https://nmac.to/wp-content/uploads/2016/01/A-Boy-and-His-Blob.png","title":"A Boy and His Blob 1.0 – Adventure & 2D Puzzle-Platformer Game","content":"A Boy and His Blob makes its triumphant return! A reimagining of the NES classic, as the boy, you feed your blob jelly beans and watch him transform into cool and useful objects to solve puzzles and escape danger. With its robust and emotionally driven story, challenging puzzles, and visually impressive art style, A Boy […]"},{"link":"https://nmac.to/blog/whatsapp-pocket-4-7-5/","image":"https://nmac.to/wp-content/uploads/2015/08/WhatsApp.Pocket.png","title":"WhatsApp Pocket 4.7.5 – Backup and manage WhatsApp chat messages","content":"WhatsApp Pocket lets you move WhatsApp chat messages from your iPhone to your Mac with just a few, simple mouse clicks. It sports a very clean and intuitive user interface, making it easy to view and read your chat history. Have important WhatsApp chats that you want to save? Or accidentally deleted a crucial message? […]"},{"link":"https://nmac.to/blog/textnut-2-24/","image":"https://nmac.to/wp-content/uploads/2016/01/TextNut.png","title":"TextNut 2.24 – CommonMark-compatible text editor","content":"TextNut combines the power of Markdown with the simplicity of rich text editing. It is 100% compatible with CommonMark specification.   Unlike most Markdown editors, TextNut provides an unique rich editing mode in which the Markdown marker characters are just triggers. You fully concentrate on the content without the interference of the marker characters. You […]"},{"link":"https://nmac.to/blog/spillo-1-6-5/","image":"https://nmac.to/wp-content/uploads/2014/08/Spillo.png","title":"Spillo 1.6.5 – Take full control over your bookmarks on Pinboard","content":"Spillo is a powerful, beautiful and amazingly fast Pinboard client. Spillo lets you browse and organize your bookmarks in a stunning modern interface. Spillo also makes creating a bookmark from anywhere on your Mac as convenient as possible.   A beautiful interface Spillo has a beautiful modern interface that feels just right at home on […]"},{"link":"https://nmac.to/blog/picatext-1-1/","image":"https://nmac.to/wp-content/uploads/2016/01/picatext.png","title":"picatext 1.1 – OCR made simple","content":"pica text is OCR made simple. We included just the functionality you need – nothing that might distract you. That helps focusing on the important things and saves you a lot of time. You need to get the text out of an image or from anywhere on your screen? With picatext this is as easy […]"},{"link":"https://nmac.to/blog/cursorsense-1-2-3/","image":"https://nmac.to/wp-content/uploads/2016/01/CursorSense.png","title":"CursorSense 1.2.3 – Adjust cursor acceleration and sensitivity","content":"CursorSense is the only application that adjusts the cursor acceleration and sensitivity. By adjusting both values, you can move the cursor just like you move your hand. All mice and trackpads are supported.   For Designers: Setting acceleration to 0 will make the cursor movement flat. This is good for drawing, but the cursor will […]"},{"link":"https://nmac.to/blog/compose-1-8-9/","image":"https://nmac.to/wp-content/uploads/2015/12/Compose.png","title":"Composé 1.8.9 – Develop iOS apps without writing code","content":"Composé creates apps for iOS that are tailored to iPhone and iPad. This ensures an authentic look-and-feel and no compromise on performance.   Features Arrange text and images on a pixel-perfect layout grid Include RSS-Feeds, JSON- and CSV data Include audio and video Add animations Create forms and databases Export your result for Xcode, so […]"}]