[{"link":"https://nmac.to/blog/letter-templates-for-pages-4-1-2/","image":"https://nmac.to/wp-content/uploads/2016/12/Letter-Templates-for-Pages.png","title":"Letter Templates for Pages 4.1.2 – A new look for your letters","content":"Letter Templates for Pages (was Stationery Set for Pages) gives you a new look for your letters! The modern and smooth Letter Templates for Pages offers an exceptional collection of letters for business and personal use that are visually attractive and highly functional to boot. Some of the templates are composed of multiple sections, so […]"},{"link":"https://nmac.to/blog/disk-map-analyzer-2-1/","image":"https://nmac.to/wp-content/uploads/2016/05/Disk-Map-Analyzer.png","title":"Disk Map Analyzer 2.1 – 2 in 1 – Clean Your Hard Drive","content":"Disk Map Analyzer was designed by users just like you, who are trying to free up valuable disk space in the easiest and fastest way possible. We’ve meticulously spent countless hours creating our disk mapping algorithm and optimized our app exclusively for Mac OSX. Our beautiful sunburst disk map is visually intuitive and feels natural. […]"},{"link":"https://nmac.to/blog/barcode-maker-1-0/","image":"https://nmac.to/wp-content/uploads/2016/12/Barcode-Maker.png","title":"Barcode Maker 1.0 – 18 different barcode standards maker","content":"Barcode Maker is the fastest way to perfect 18 different barcode standards, necessary to manage and sell products all over the planet. All you need to do is to enter your product code, and click ‘Process’. Your barcode is created. It has been copied into the clipboard and all you need to do is to […]"},{"link":"https://nmac.to/blog/templates-for-indesign-alungu-designs-2-0/","image":"https://nmac.to/wp-content/uploads/2016/12/Templates.for_.InDesign.png","title":"Templates for InDesign – Alungu Designs 2.0 – 100 distinctive designs for Adobe InDesign","content":"The perfect tool for publishers and advertisers, the Templates for InDesign – Alungu Designs app provides 100 distinctive designs for Adobe InDesign. Just choose a template, add your text and photos, make a few adjustments, and save time for other projects.   The 100 fully editable designs include blogs, brochures, certificates, invitations, labels, magazines, posters […]"},{"link":"https://nmac.to/blog/desk-3-1-0/","image":"https://nmac.to/wp-content/uploads/2015/02/Desk.png","title":"Desk 3 1.0 – Writing, Blogging, and Notes for WordPress","content":"Desk is a premium writing experience for all types of writers.   Whether you’re a casual enthusiast, the weekend writer, blogger, or digital publishing professional, you’ll find Desk to be a much-needed breath of fresh air.   Designed to marry both function and form, it is the desktop publishing client that you’ve always wanted: Simple, […]"},{"link":"https://nmac.to/blog/copyless-1-8-11/","image":"https://nmac.to/wp-content/uploads/2014/12/CopyLess.png","title":"CopyLess 1.8.11 – Store and access up to 100 clipboard items","content":"CopyLess is an advanced and flexible clipboard manager.   Unlike the system clipboard CopyLess can store up to 100 items to which you have instant access at any time. With CopyLess is no longer necessary to switch constantly between different applications or windows just to copy and paste several different items. Everything can now be […]"},{"link":"https://nmac.to/blog/phototangler-2-0/","image":"https://nmac.to/wp-content/uploads/2016/12/PhotoTangler2.png","title":"PhotoTangler 2.0 – Best Collage Maker To Blend Photos","content":"PhotoTangler Collage Maker is a powerful image app that instantly turns your favorite photos into beautiful collages. It allows you to blend them together in unique and creative ways. It’s easy, fun, and the results look like magic! Just drop photos on the canvas, and watch PhotoTangler seamlessly blend them together with any other photos […]"},{"link":"https://nmac.to/blog/music-player-3-0/","image":"https://nmac.to/wp-content/uploads/2016/12/Music-Player3.png","title":"Music Player 3.0 – Enjoy listening to millions of popular songs","content":"Music Player is a must have music player to enjoy listening to millions of popular songs.   Awesome features: Beautiful design. Fast access to music of your friends, subscriptions, favored public pages and communities. Music news. All songs from one post could be added in one click to your music. Hot keys: Fn-F7 — previous […]"},{"link":"https://nmac.to/blog/maxel-2-2/","image":"https://nmac.to/wp-content/uploads/2016/12/Maxel.png","title":"Maxel 2.2 – Maxel is a native download manager and accelerator","content":"Maxel speeds up your downloads by splitting each file into parts and downloading them simultaneously, maximizing your bandwidth. Maxel also manages your downloads, starting the next download when bandwidth is available and re-trying ones that fail automatically. Partial downloads are no problem either: Maxel saves its progress and can resume your downloads even if your […]"},{"link":"https://nmac.to/blog/document-builder-1-2/","image":"https://nmac.to/wp-content/uploads/2016/12/Document-Builder.png","title":"Document Builder 1.2 – Merges multiple .docx files into one","content":"Document builder merges multiple .docx files into one.   Often, documents are easier to edit as chapters: Terms and Conditions Privacy Policy Contracts Reports   In some cases, different people work on different parts of a document.   The Document Builder app makes it easy to select multiple Word (docx) files, change the order within […]"}]