[{"link":"https://nmac.to/blog/ex-libris-7-0/","image":"https://nmac.to/wp-content/uploads/2015/09/Ex-Libris.png","title":"Ex-Libris 7.0 – Library Management Database","content":"EX-LIBRIS is an Ideal library database software to quickly generate and review your book stock sheets on computer, thanks to Amazon Web Service, the world largest media database.   Features: Create, manage, save, print sheets of books in your library Easy and intuitive search of your books Integrated web browser for online search Barcode scanner […]"},{"link":"https://nmac.to/blog/textexpander-5-1-1/","image":"https://nmac.to/wp-content/uploads/2014/01/TextExpander.png","title":"TextExpander 5.1.1 – Expand custom keyboard shortcuts into frequently-used text and pictures","content":"TextExpander saves your fingers and your keyboard, expanding custom keyboard shortcuts into frequently-used text and pictures. Type more with less effort!   Here are a few examples for what you can do with TextExpander: Insert standard greetings, phrases, boilerplate paragraphs, and signatures – including formatted text and pictures. Correct typos automatically Organize snippets into groups […]"},{"link":"https://nmac.to/blog/sketchlist-3d-4-0-3617/","image":"https://nmac.to/wp-content/uploads/2015/09/SketchList.3D.png","title":"SketchList 3D 4.0.3617 – Woodworking Design Software","content":"SketchList 3D is an integrated modeling program designed specifically for woodworkers. As your designs progress all drawings and reports, including an optimized sheet and board layout diagram, are created in the background. Any changes to the design are immediately reflected in all reports.   Other design and CAD software simply automate the tasks of drawing […]"},{"link":"https://nmac.to/blog/dragon-dictate-4-0-7/","image":"https://nmac.to/wp-content/uploads/2014/09/Dragon.Dictate.png","title":"Dragon Dictate 4.0.7 – Premium voice recognition solution","content":"With Dragon Dictate speech recognition software, you can use your voice to create and edit text or interact with your favorite Mac applications. Far more than just speech-to-text, Dragon Dictate lets you create and edit documents, manage email, surf the Web, update social networks, and more – quickly, easily and accurately, all by voice. Open […]"},{"link":"https://nmac.to/blog/iskysoft-video-editor-6-0-1/","image":"https://nmac.to/wp-content/uploads/2015/09/iSkysoft-Video-Editor.png","title":"iSkysoft Video Editor 6.0.1 – Make movies, edit audio and share it on Social Networks","content":"iSkysoft Video Editor helps you make movies, edit audio, apply effects and share it on YouTube, Facebook, TV, iPhone, iPad, iPod, and more. You can also burn your video to DVD easily to preserve and share. It has every common tool you need to enhance your clips with a few clicks, with a lot filter […]"},{"link":"https://nmac.to/blog/arrival-1-0/","image":"https://nmac.to/wp-content/uploads/2015/09/Arrival.png","title":"Arrival 1.0 – GPS driving assistant: ETA, travel time and directions to your favorite locations","content":"Arrival shows you travel times and helps you to find the best and fastest routes to your favorite locations. You can get turn-by-turn directions in a click.   The app is your personal driving (and walking) assistant and displays current traffic conditions, your estimated time of arrival and the distance you need to travel. Arrival […]"},{"link":"https://nmac.to/blog/pdf-nomad-2-4-1/","image":"https://nmac.to/wp-content/uploads/2014/03/PDF-Nomad.png","title":"PDF Nomad 2.4.1 – PDF editor built for Mac","content":"PDF Nomad is a modern, carefully styled PDF editor, built from the ground up for OS X 10.7 and later. It features a multitude of ways to take your PDF documents from one place to the next, through an easy-to-use interface. It provides often used operations like merging multiple documents, as well as more exotic […]"},{"link":"https://nmac.to/blog/echofon-1-8-7/","image":"https://nmac.to/wp-content/uploads/2015/08/Echofon.png","title":"Echofon 1.8.7 – Syncs unread Tweets with your iPhone","content":"The Echofon interface was carefully designed to be comfortably left open all day. It stays out of the way when necessary and expands to support all the advanced features you need, when you need them.   Easily attach photos to your tweets with drag-and-drop. You can also attach screen captures, current iTunes song, or current […]"},{"link":"https://nmac.to/blog/radium-3-1-3/","image":"https://nmac.to/wp-content/uploads/2014/03/Radium.png","title":"Radium 3.1.3 – Multi-network radio player","content":"Radium is an Internet radio player that’s designed from the ground up to be simple, intuitive, and lightweight. With its powerful search, thousands of supported stations (including Sirius/XM and DI.fm/Sky.fm Premium), and the ability to add your own streams, Radium will change the way you listen to Internet radio.   Version 3.1.3: Fixed an issue […]"},{"link":"https://nmac.to/blog/infographics-2-1/","image":"https://nmac.to/wp-content/uploads/2015/06/Infographics.png","title":"Infographics 2.1 – Visualization graphics for Keynote","content":"The Infographics collection contains a wide range of high-quality designs for illustrating your Keynote presentations. Whether your slideshow is focused on a specific country, explains intricacies of an industry, or presents annual financial results Infographics is a go-to selection of quality visualization tools.   All images include transparent backgrounds that allow placing them on various […]"}]