[{"link":"https://nmac.to/blog/robodb-mysql-database-manager/","image":"https://nmac.to/wp-content/uploads/2018/02/RoboDB-MySQL-Database-Manager.png","title":"RoboDB MySQL Database Manager 1.0.0 – Manage your MySQL databases and users","content":"RoboDB MySQL Database Manager is an effective app that allows you to manage your MySQL databases and users. The app provides a graphical interface simplify the process of managing databases and users.   Features: Manage Unlimited Connections Manage Unlimited Databases / Tables Manage Unlimited Users and their privileges Export / Import function Data Transfer between […]"},{"link":"https://nmac.to/blog/retool/","image":"https://nmac.to/wp-content/uploads/2018/02/retool.png","title":"Retool 1.02 – A 3D hacking puzzle game","content":"Retool is a 3D hacking puzzle game set on incomplete orbital defense stations that circle around Sinai, home planet of the alien species known as Onix.   After 43 years of war, the Onix triumphed and defeated the humans. The victory came at a cost of destruction to their planet and orbital stations. Instead of […]"},{"link":"https://nmac.to/blog/warring-states/","image":"https://nmac.to/wp-content/uploads/2018/02/Warring-States.png","title":"Warring States 1.0 – A turn-based battle strategy game","content":"Warring States : Tactics is a turn-based battle strategy game set during the Warring States period of Ancient China.   The Warring States period is one of turmoil in China, where various feudal states struggle for control of all of China. Lead the forces of Qin through numerous historically-based missions as they challenge the other […]"},{"link":"https://nmac.to/blog/revhead/","image":"https://nmac.to/wp-content/uploads/2018/02/Revhead.png","title":"Revhead 1.2 – A car racing simulation game","content":"Revhead is a car racing simulation game, where you have to build your own race car.   You have a friend Charlie, who is busy with building race cars. He would need some help from you and he invites you to Australia. You start your journey somewhere in a small town in Australia, where the […]"},{"link":"https://nmac.to/blog/app-fixer/","image":"https://nmac.to/wp-content/uploads/2018/02/App-Fixer.png","title":"App Fixer 1.7 – Remove prefs and other settings for misbehaving apps","content":"App Fixer removes user preferences and saved application states for apps on your system, also resets Safari to aid recovery from adware hijacks and scams.   Does your favorite app keep crashing on launch, or quit unexpectedly during normal operation? Got an app that keeps starting up with unwanted settings or preferences that you can’t […]"},{"link":"https://nmac.to/blog/dvd-snap/","image":"https://nmac.to/wp-content/uploads/2018/02/DVD-Snap.png","title":"DVD Snap 3.2.1 – Takes screenshots of movies on Apple DVD player","content":"DVD Snap allows you to capture screenshots from any movie running in Apple’s DVD Player. Pick any scene you want and DVD Snap 3 either snaps a single photo or series of timed snaps in an interval of at least half a second. All your captured photos are automatically taken to DVD Snap 3’s beautiful […]"},{"link":"https://nmac.to/blog/aether/","image":"https://nmac.to/wp-content/uploads/2018/02/Aether.png","title":"Aether 1.6.4 – Log ham radio transmissions","content":"Aether is a ham radio logging application for OS X. It includes tools to quickly and easily log QSOs while on the air, as well as organize, search and track your QSOs later. Aether was designed for OS X, and has the same kind of clean, intuitive, friendly interface you’ve come to expect on the […]"},{"link":"https://nmac.to/blog/candleman/","image":"https://nmac.to/wp-content/uploads/2018/02/Candleman.png","title":"Candleman 1.0 – RPG Action & Adventure Platformer Game","content":"Candleman: The Complete Journey is a unique puzzle platformer, where light is both a welcome ally and a deceptive foe. Take the role of a little candle who can burn for only 10 seconds, and venture through an unsettling darkness of challenging levels with a smooth difficulty curve. Use your wits to overcome obstacles based […]"},{"link":"https://nmac.to/blog/clean-text-menu/","image":"https://nmac.to/wp-content/uploads/2017/12/Clean-Text-Menu.png","title":"Clean Text Menu 3.4 – Reduce text cleanup and editing time","content":"Clean Text Menu is an essential tool for webmasters, graphic designers, developers and magazine editors to reduce text cleanup and editing time, and it is a very convenient tool for all Mac users that needs to cleanup and editing text from emails, documents, or other material.   Features Smart-clean and clean-and-compact text Clean clipboard content […]"},{"link":"https://nmac.to/blog/colorific/","image":"https://nmac.to/wp-content/uploads/2018/02/Colorific.png","title":"Colorific 1.0 – Photo Effects: Black & White + Color","content":"Enhance your beautiful photos by drawing the part of the image to stay in color while the rest turn black & white. Use a built-in preset for ring style effects. Share to Facebook & Twitter easily! Or save as a Colorific file for editing later.   Intel, 64-bit processor OS X 10.10 or later   […]"}]