[{"link":"https://nmac.to/blog/desk-pm-2-0-1/","image":"https://nmac.to/wp-content/uploads/2015/02/Desk.png","title":"Desk PM 2.0.1 – A Writing, Blogging, and Notetaking App","content":"Desk is a premium writing experience for all types of writers.   Whether you’re a casual enthusiast, the weekend writer, blogger, or digital publishing professional, you’ll find Desk to be a much-needed breath of fresh air.   Designed to marry both function and form, it is the desktop publishing client that you’ve always wanted: Simple, […]"},{"link":"https://nmac.to/blog/desk-md-1-0-1/","image":"https://nmac.to/wp-content/uploads/2015/10/DeskMD.png","title":"Desk MD 1.0.1 – A Markdown-Powered Blogging App","content":"Desk MD is the FIRST desktop blogging client that is exclusively designed with Markdown in mind!   Built intentionally and specifically for writers, bloggers, and content creators who are passionate about the text-to-HTML conversion syntax that is Markdown, it is the only native blogging app of its kind!   Based on the award-winning “Best App […]"},{"link":"https://nmac.to/blog/blogo-2-3-4/","image":"https://nmac.to/wp-content/uploads/2014/08/Blogo.png","title":"Blogo 2.3.4 – Write, publish and manage multiple blogs","content":"Blogo is the easiest and fastest way to write, publish and manage multiple blogs. Blogo gathered features for a powerful solution and helps users to publish and create content easily. It makes it possible to manage multiple blogs at the same time, edit pictures with a built-in image editor, preview your posts on real-time, manage […]"},{"link":"https://nmac.to/blog/the-dwarf-run-1-0/","image":"https://nmac.to/wp-content/uploads/2015/10/The-Dwarf-Run.png","title":"The Dwarf Run 1.0 – An old-fashioned RPG with elements of point-n-click adventure","content":"The Dwarf Run is an old-fashioned RPG with elements of point-n-click adventure.   The story tells of an expedition to the ancient underworld temple undertaken by young dwarf Dalain Stonecruncher with party of friends and numerous adventures that followed.   Dalain, Zenn, Ionor, and Barbados are about to meet the strangest beings, join the rebellion, […]"},{"link":"https://nmac.to/blog/moneywiz-2-2/","image":"https://nmac.to/wp-content/uploads/2015/02/MoneyWiz2.png","title":"MoneyWiz 2.2 – Personal finance solution","content":"All your accounts, budgets and bills in one place! With powerful reports, worldwide online banking and instant sync between all your devices!   That’s MoneyWiz – the world’s most powerful and beautiful finance software.   HOW CAN MONEYWIZ HELP YOU? GET OUT OF DEBT : We’ve built MoneyWiz in a way that makes it easy […]"},{"link":"https://nmac.to/blog/iconvert-icons-2-9/","image":"https://nmac.to/wp-content/uploads/2015/06/iConvert.Icons_.png","title":"iConvert Icons 2.9 – Convert icons to .png format","content":"iConvert Icons is now the easiest way to create and convert icons from almost any format. With its unique auto-detection feature, just drop images, apps, folders with custom icons, and of course other icons right into the conversion window. All you need to do is choose the location where you want the newly converted icons […]"},{"link":"https://nmac.to/blog/graphic-3-0-1/","image":"https://nmac.to/wp-content/uploads/2015/10/Graphic.png","title":"Graphic 3.0.1 – Powerful vector drawing and illustration tool","content":"Graphic (was iDraw) has all of the tools you need to create everything from detailed technical illustrations to beautiful works of art. Create intricate designs quickly and easily, and continue working on the go with Graphic for the iPad.   Create resolution-independent illustrations that can be pasted into Pages documents, included in Keynote presentations, or […]"},{"link":"https://nmac.to/blog/themes-for-ibooks-author-3-4/","image":"https://nmac.to/wp-content/uploads/2015/10/Themes.for_.iBooks.Author.png","title":"Themes for iBooks Author 3.4 – Professionally developed templates for iBooks Author","content":"Themes for iBooks Author is a collection of compelling templates for Apple’s new application for book creation and publishing. Browse the wide range of designs to find the perfect look, add your text and images, and publish your own book to iBookstore!   The available templates cover various book categories, from business and travel, to […]"},{"link":"https://nmac.to/blog/master-pdf-editor-3-4-12/","image":"https://nmac.to/wp-content/uploads/2015/10/Master-PDF-Editor.png","title":"Master PDF Editor 3.4.12 – Create, edit, preview and encrypt PDF documents and more","content":"Looking for a complete solution to edit PDF documents? Then our brand new software Master PDF Editor is exactly what you need! With this easy-to-use and cost efficient application you can create, edit, preview, encrypt, sign and print XPS and interactive PDF documents with just a few clicks.   Features Edit PDF text, images and pages […]"},{"link":"https://nmac.to/blog/back-to-the-future-the-game/","image":"https://nmac.to/wp-content/uploads/2015/10/Back-to-the-Future.png","title":"Back to the Future: The Game 1.0 – Full 5 Episodes Adventure, Point & Click Game","content":"Marty McFly and Doc Brown return in a completely new Back to the Future adventure.   Six months after the events of the third film, the DeLorean Time Machine mysteriously returns to Hill Valley – driverless! Marty must go back in time and get aid from a resistant teenage Emmett Brown, or else the space […]"}]