[{"link":"https://nmac.to/blog/roundabout-1-0/","image":"https://nmac.to/wp-content/uploads/2016/05/Roundabout.png","title":"Roundabout 1.0 – Drive a spinning limousine around town with a dangerous missions","content":"Roundabout is a ’70s B-Movie game where you drive a constantly revolving limousine! Pick up passengers, find secret collectibles, take on dangerous missions, and fall in love in an open world puzzle adventure. Roundabout is the debut title from No Goblin, a studio founded by designers of games like Destroy All Humans!, The Gunstringer, and […]"},{"link":"https://nmac.to/blog/instant-3-1/","image":"https://nmac.to/wp-content/uploads/2015/07/Instant.png","title":"Instant 3.1 – Mimics the workflow of a real Polaroid instant camera","content":"Instant: The Polaroid Instant Photos brings the fun of Polaroid instant camera to your Mac.   Instant mimics the workflow of a real Polaroid instant camera. Drag and drop your digital photo on to the camera window, a view finder will pop up. Carefully select your field of view and click ‘Shoot’. A picture framed […]"},{"link":"https://nmac.to/blog/app-for-gmail-1-1/","image":"https://nmac.to/wp-content/uploads/2016/05/App-for-Gmail.png","title":"App for Gmail 1.1 – Email Menu Tab","content":"App for Gmail is the easiest and fastest way to access Gmail on your Mac.   The ONLY Gmail app that gives you two viewing options! View from your menubar. Pop-out for the new, movable floating head view!   With QuickTab, Gmail has never been more convenient on your Mac! Innovative features and a focus […]"},{"link":"https://nmac.to/blog/youtube-to-mp3/","image":"https://nmac.to/wp-content/uploads/2016/05/YouTube.to_.MP3.png","title":"YouTube to MP3 3.9.7 – Quickly download YouTube content in MP3 or AAC (M4A) format","content":"    If you enjoy listening to music on YouTube, Vimeo, DailyMotion or Soundcloud and you wish to take your favorite songs with you while you are offline, then YouTube to MP3 is the perfect app for you.   Simple and user-friendly music downloader and audio converter YouTube to MP3 is a self-explanatory Mac OS […]"},{"link":"https://nmac.to/blog/ninja-pizza-girl/","image":"https://nmac.to/wp-content/uploads/2016/05/Ninja.Pizza_.Girl_.png","title":"Ninja Pizza Girl 1.0 – bullying, emotional resilience and pizza delivering ninjas game","content":"Ninja Pizza Girl is a serious game about self-esteem, bullying and resilience – and pizza delivering ninjas!   Its deeply-woven story follows Gemma, a sixteen-year-old girl working as a pizza delivery ninja for her father’s independent Pizzeria. In a world where slums teeter on top of skyscrapers, where powerful mega-corporations exploit the poor and where […]"},{"link":"https://nmac.to/blog/fire-1-0-6780/","image":"https://nmac.to/wp-content/uploads/2016/05/Fire.png","title":"Fire 1.0.6780 – An exploration-adventure with intuitive puzzle design","content":"FIRE is a puzzleventure with intuitive puzzle design. Without losing many words it tells a savagely hilarious story. Journey into the Stone Age and face the most challenging task of this era: The search for fire!   This story’s hero is the lovably chaotic Neanderthal Ungh who dozes off during his very first night watch. […]"},{"link":"https://nmac.to/blog/business-card-composer-5-2-3/","image":"https://nmac.to/wp-content/uploads/2016/02/Business.Card_.Composer.png","title":"Business Card Composer 5.2.3 – Create and print business cards","content":"Business Card Composer is a complete kit to create and print business cards, calling cards, and badges. The package contains more than 1,000 high-quality clipart images (more than 40,000 with the Extras Pack), 740 ready-made designs and advanced editing tools.   The program conveniently uses personal data from Apple Address Book, and images from iPhoto […]"},{"link":"https://nmac.to/blog/the-mims-beginning-1-0/","image":"https://nmac.to/wp-content/uploads/2016/05/The-Mims-Beginning.png","title":"The Mims Beginning 1.0 – A journey with Mims in mysterious strategic game","content":"“The Mims Beginning” is a god-like strategy game with a dose of cosmic humor. The story takes place in an unknown space and time. In this galaxy mythical floating islands give shelter to all kinds of unusual and dangerous creatures. The game combines elements of fantasy and sci-fi genres.   Build interesting structures, plant vegetation, […]"},{"link":"https://nmac.to/blog/spellcrafter-1-0-2/","image":"https://nmac.to/wp-content/uploads/2016/05/Spellcrafter.png","title":"Spellcrafter 1.0.2 – RPG game with deep tactical turn-based combat","content":"Spellcrafter is an RPG game with deep tactical turn-based combat and a unique spell casting system. Explore the magical world, collect gold, interact with NPCs, take quests and make moral choices! Recruit heroes, assemble and summon powerful troops and send them into battle!   The unique feature of Spellcrafter is the spell casting system. The […]"},{"link":"https://nmac.to/blog/samudai-1-0/","image":"https://nmac.to/wp-content/uploads/2016/05/Samudai.png","title":"Samudai 1.0 – A local multiplayer party fighter game","content":"Samudai is a local multiplayer party fighter with Samurai Cats, lightning fast action, and multiple hazardous stages.   Stand your ground against your friends and push them to their limit! Slash, dash and claw your way to victory defeating them throughout Mount Samudai and face off against their Ultimate Boss Mode!   Take up to […]"}]