[{"link":"https://nmac.to/blog/istudiez-pro-1-2-5/","image":"https://nmac.to/wp-content/uploads/2014/06/iStudiez.Pro_.png","title":"iStudiez Pro 1.2.5 – Student planner with iOS syncing","content":"iStudiez Pro is a student planner with iOS syncing.   A student’s life is a dizzying mix of activity and just plain craziness! Take charge of your schedule and put iStudiez Pro to work for you! Take advantage of iStudiez Pro easy navigation and never miss another course, lecture and lab, track tasks and deadlines, […]"},{"link":"https://nmac.to/blog/finkit-3-3-3/","image":"https://nmac.to/wp-content/uploads/2014/09/FinKit.png","title":"FinKit 3.3.3 – Multi-function financial calculator","content":"FinKit is a financial calculator that solves all sorts of problems involving the time value of money.   Provides 55 financial calculations: Assets: capitalized cost – classic and MACRS depreciation Bonds: bond book value, price and yield – zero-coupon bond price and yield Dates: term date – date series – year fraction – time between […]"},{"link":"https://nmac.to/blog/acronis-true-image-1-0/","image":"https://nmac.to/wp-content/uploads/2014/09/Acronis.True_.Image_.png","title":"Acronis True Image 1.0 – Backup and disk management","content":"Assure your Mac is protected by having a full system image backup. Keep all your data safe even if your computer is lost, stolen or damaged. Backup locally or to the cloud, and access your files anytime, anywhere.   Key Features: Dual Protection Acronis True Image for Mac is the only dual-protection, full system image […]"},{"link":"https://nmac.to/blog/livequartz-2-3-1/","image":"https://nmac.to/wp-content/uploads/2014/05/lq.png","title":"LiveQuartz 2.3.1 – Simple image editor","content":"LiveQuartz is a simple and powerful photo editor for the Mac. It is based on non-destructive layers and filters. The layers are at the left and the filters are at the right of the window.   To edit a photo, just drag it into the window (or layers list) and it will be added as […]"},{"link":"https://nmac.to/blog/earth-3d-3-1-2/","image":"https://nmac.to/wp-content/uploads/2014/09/Earth-3D.png","title":"Earth 3D 3.1.2 – Turn your monitor into a realistic Space Shuttle window","content":"Earth 3D turns your monitor into a realistic space shuttle window! Our planet looks exactly as it’s seen by astronauts. You see the blackness of outer space with sparks of stars on it. You are flying around the Earth, a colorful ball with a veil of atmosphere.   Features: explore our planet with Interactive mode […]"},{"link":"https://nmac.to/blog/disktools-pro-3-9-1/","image":"https://nmac.to/wp-content/uploads/2014/09/DiskTools-Pro.png","title":"DiskTools Pro 3.9.1 – Defrag, backup and repair your hard drive","content":"DiskTools Pro makes Mac repair and maintenance painless, fast and easy. DiskTools Pro is the only utility software that allows you to schedule when to defragment, backup or repair bad sectors of your Mac. It also does not require you to run the tools from a boot DVD, CD or separate volumes in order to […]"},{"link":"https://nmac.to/blog/back-in-focus/","image":"https://nmac.to/wp-content/uploads/2014/09/Back.In_.Focus_.png","title":"Back In Focus 1.0.4 – Refocus blurry images","content":"Back In Focus is an application allowing to refocus blurry images.   If you ever took a great photo only to find out it’s slightly blurry, Back In Focus can help you get in back in focus! Supports most image formats Is able to recover details smaller than the blur size Makes it easy to […]"},{"link":"https://nmac.to/blog/sandy-beach-3d/","image":"https://nmac.to/wp-content/uploads/2014/09/Sandy-Beach-3D1.png","title":"Sandy Beach 3D 1.0.3 – Put a private beach on your desktop","content":"Sandy Beach 3D gives you tranquility, endless ocean, and sun-soaked sand. A light breeze, the roar of waves, and not a soul nearby…. Would you like to go to this paradise? Sandy Beach 3D live wallpaper puts a private beach on your desktop. It won’t wash away the icons but it will help you relax! […]"},{"link":"https://nmac.to/blog/picframe-2-6-1/","image":"https://nmac.to/wp-content/uploads/2014/09/PicFrame.png","title":"PicFrame 2.6.1 – Combine multiple photos into frames","content":"PicFrame helps you combine multiple photos into amazing looking frames that you can save to your computer or share to Facebook. With 67 adjustable frames, rounded corners and plenty of patterns, you will always have a unique look.   Since PicFrame was released on the iPhone and iPad we have often been requested to create […]"},{"link":"https://nmac.to/blog/flamingo-1-2-1/","image":"https://nmac.to/wp-content/uploads/2014/03/Flamingo.png","title":"Flamingo 1.2.1 – Messaging client that supports Hangouts/Gtalk, Facebook, and XMPP","content":"Flamingo is a beautiful, native instant messaging client for OS X that supports Hangouts/Gtalk, Facebook, and XMPP.   Features: All-in-one design: buddies, conversations, and chats in a single window. Multiple, detachable chats in a single window. Inline previews for images, videos, and tweets. Supports CloudApp, Droplr, Instagram, and YouTube. File transfer via direct connection (compatible […]"}]