[{"link":"https://nmac.to/blog/nba-jam-by-ea-sports/","image":"https://nmac.to/wp-content/uploads/2012/10/NBA-JAM.png","title":"NBA JAM by EA SPORTS 1.0.1 – 2-on-2 arcade basketball action","content":"In NBA JAM by EA SPORTS, BOOMSHAKALAKA! Rock your Mac with over-the-top, high-flying, 2-on-2 arcade basketball action – just like you remember it. Go to the hole. Go strong. Go for the monster jam!   HEAT UP ON YOUR MAC Jam with all 30 NBA teams and your favorite NBA stars! Unlock legends from the […]"},{"link":"https://nmac.to/blog/monopoly/","image":"https://nmac.to/wp-content/uploads/2012/10/Monopoly.png","title":"Monopoly 1.0.1 – The classic board game","content":"Monopoly … Build your fortune as you buy, sell and trade the world’s most famous properties in MONOPOLY, the classic board game come to life.   Take a spin around the world’s favorite board in this fantastic version for everyone to enjoy. Ride the Reading Railroad, build a house on Baltic Avenue, or buy up […]"},{"link":"https://nmac.to/blog/flight-control-hd/","image":"https://nmac.to/wp-content/uploads/2012/10/Flight-Control-HD.png","title":"Flight Control HD 1.03 – Don’t let planes collide on the tarmac","content":"Flight Control HD…The Classic iPhone Hit is Now Available on Your Mac! In Flight Control HD, you’re an air traffic controller at an increasingly busy airport. Just point and drag aircraft to their landing zones with your mouse or trackpad, but don’t let them collide. It’s simple, but not easy! You’ll need nerves of steel […]"},{"link":"https://nmac.to/blog/livestation-v320-for-mac/","image":"https://nmac.to/wp-content/uploads/2013/12/live.png","title":"Livestation v3.2.0 – Watch TV News online","content":"Livestation brings together one of the most impressive and widest selection of channels from around Europe under one easy to use and elegantly presented package. Unlike many P2P TV apps, Livestation has official agreements with major channels such as BBC World, CNN and The Discovery Channel meaning that you’re guaranteed high quality programming and images. […]"},{"link":"https://nmac.to/blog/itools-for-ipad-iphone-ipod-touch/","image":"https://nmac.to/wp-content/uploads/2013/12/itool.png","title":"ITools For iPad, iPhone, iPod touch","content":"iTools can be used to manage iBooks, pictures, media and other types of files found on iDevices. You can easily install, backup or uninstall your apps, as well as backup/restore folders. Supports devices: · iPhone 1,3G,3GS,4,4S iPad 1,2 iPod touch 1,2,3,4 · Supports iOS versions: iOS 1, 2, 3, 4, 5 · Works with both […]"},{"link":"https://nmac.to/blog/hotspot-shield-for-mac/","image":"https://nmac.to/wp-content/uploads/2013/12/hotspot1.png","title":"Hotspot Shield – Free VPN service","content":"From AnchorFree: Hotspot Shield is the security product for Mac that detects and protects against 3.5 million malware threats including the Flash Trojan virus. It also makes your communications secure in public Wi-Fi hotspots which otherwise leave you vulnerable to hackers and security breaches. Hotspot Shield’s VPN tunnel also gives you a simple solution to maintain […]"},{"link":"https://nmac.to/blog/fan-control-v12/","image":"https://nmac.to/wp-content/uploads/2013/12/fan.png","title":"Fan Control v1.2 – Control your cooling fan speed","content":"Can you hear your MacBook’s fan whirring a bit too loud? This means that your Mac is overheating and that you are putting too much strain on it. This can be caused by applications that use up a lot of your computer’s resources or is simply the result of having your Mac on for too […]"},{"link":"https://nmac.to/blog/world-conqueror-2/","image":"https://nmac.to/wp-content/uploads/2012/10/World-Conqueror-2.png","title":"World Conqueror 2 1.1.0 – Accomplish a lot of important campaigns during World War II","content":"In World Conqueror II you will be a general to accomplish a lot of important campaigns during World War II and Cold War. You can fight with or against those famous generals including Guderian, Rommel, Patton, Zhukov, Nimitz, MacArthur, Yamamoto, Montgomery and de Gaulle. It’s so impressive to see their unique tactics and ace forces. […]"},{"link":"https://nmac.to/blog/adobe-flash-player/","image":"https://nmac.to/wp-content/uploads/2013/12/adop.png","title":"Adobe Flash Player – Essential Flash player for OSX","content":"Adobe Flash Player is a cross-platform, browser-based application runtime that provides uncompromised viewing of expressive applications, content, and videos across browsers and operating systems.   Intel Mac OS X 10.6 or later MediaFire"},{"link":"https://nmac.to/blog/crystal-tower/","image":"https://nmac.to/wp-content/uploads/2012/10/Crystal-Tower.png","title":"Crystal Tower 1.0 – 3D crystal blocks game","content":"Crystal Tower is the ultimate 3D physics-based puzzle. You have to destroy blue blocks and keep red blocks from being destroyed.   Some blue blocks contain bonuses which rise from the bottom to the up when you break them – tap a bonus with your finger to catch it!   Crystal Tower contains 60 levels […]"}]