[{"link":"https://nmac.to/blog/bevy-1-1-1/","image":"https://nmac.to/wp-content/uploads/2015/12/Bevy.png","title":"Bevy 1.1.1 – Application launcher shows you all apps in one window","content":"Bevy is a launcher that shows you all of your application icons in a single window that can be opened with a global hot key, from the menu bar or by clicking its dock icon. You just specify folders where your applications are located and Bevy creates visual groups of icons for each folder. To […]"},{"link":"https://nmac.to/blog/treble-cat-1-3/","image":"https://nmac.to/wp-content/uploads/2016/02/Treble.Cat_.png","title":"Treble Cat 1.3 – Learn To Read Music","content":"Treble Cat is a highly entertaining game designed to help kids and adults learn how to quickly identify notes in the treble clef. This will help to effortlessly improve sight reading skills.   This game has been designed and created in collaboration with professional musicians and educators.   Version 1.3: new practice level   OS […]"},{"link":"https://nmac.to/blog/desktop-ghost-1-02/","image":"https://nmac.to/wp-content/uploads/2016/02/Desktop.Ghost_.png","title":"Desktop Ghost 1.02 – Instantly hide and show all desktop files and folders","content":"Instantly hide and show all files, folders, and app icons on your messy desktop with Desktop Ghost! You don’t need to move all the files on your desktop to take a screen recording or a screenshot anymore! Temporarily hide your messy desktop with Desktop Ghost and unhide it when you’re ready!   Features: Instantly hide […]"},{"link":"https://nmac.to/blog/density-1-0-0/","image":"https://nmac.to/wp-content/uploads/2016/02/Density.png","title":"Density 1.0.0 – Pixel Calculator App","content":"Density is a simple OS X utility app made for Designers & Developers to help them calculate the dimensions for multiple screen sizes.   Special Features: Easily generate and save a text file with all the sizes from the app Make Density’s window “Float on top” so it won’t disappear when switched to another application. […]"},{"link":"https://nmac.to/blog/compress-all-2-2/","image":"https://nmac.to/wp-content/uploads/2016/02/Compress.All_.png","title":"Compress All! 2.2 – Quickly photos/images compression utility","content":"Save space on your computer by compressing your photos/images. With Compress All you can compress a set of photos/images quickly without the need to be an expert in image processing.   You can add your photos/images, change the compress factor on a simple slider, marked with min (minimum compression) and max (max compression), and save. […]"},{"link":"https://nmac.to/blog/city-jazz-2-6/","image":"https://nmac.to/wp-content/uploads/2016/02/City.Jazz_.png","title":"City Jazz 2.6 – Best radio stations that broadcast continuous jazz","content":"City Jazz brings together a selection of the best radio stations that broadcast continuous jazz in high quality streaming.   City Jazz includes the world’s first radio search engine where any radio station, song or artist can be located and played from anywhere in the world.   Version 2.6: Minor bug fixes   Intel, 64-bit […]"},{"link":"https://nmac.to/blog/city-70s80s90s-2-6/","image":"https://nmac.to/wp-content/uploads/2016/02/City.70s80s90s.png","title":"City 70s80s90s 2.6 – Continuous music of the 70s 80s and 90s.","content":"City 70s80s90s includes the world’s first radio search engine where any radio station, song or artist can be located and played from anywhere in the world.   This Radio City selection brings together the best radio stations that broadcast continuous music of the 70s 80s and 90s.   If you enjoy music from the 70’s, […]"},{"link":"https://nmac.to/blog/ba-da-bump-1-1-1/","image":"https://nmac.to/wp-content/uploads/2016/02/BA.DA_.BUMP_.png","title":"BA DA BUMP 1.1.1 – Destroy the fireballs and discover the secrets of the dragon","content":"BA DA BUMP…Destroy the fireballs and discover the dragon’s secrets. 100% fun for everyone!   Start a new adventure for our little dragon, an adventure filled with balls to blow up, secrets to discover and goals to reach.   A mysterious spell has confined the little dragon’s fire in crystal balls.   Help him free […]"},{"link":"https://nmac.to/blog/water-break-1-1/","image":"https://nmac.to/wp-content/uploads/2016/02/Water-Break.png","title":"Water Break 1.1 – Set your desired water intake intervals during your busy day","content":"Water break allows you to set your desired water intake intervals during your busy day. Simply set up your schedule and the app will remind you in an elegant way to consume your desired water requirements.   If only our lives could be this simple.   Version 1.1: minor issues fixes…   OS X 10.6 […]"},{"link":"https://nmac.to/blog/photo-to-movie-5-4-1-0/","image":"https://nmac.to/wp-content/uploads/2015/04/Photo.to_.Movie_.png","title":"Photo to Movie 5.4.1.0 – Create a movie by zooming/panning over a photo","content":"Photo to Movie enables you to create a movie by zooming and panning over a photo. It presents a simple interface to specify the starting and ending frames and generates full quality QuickTime or DV Stream files (compatible with iMovie).   You can use Photo to Movie to: Graphically select the starting and ending frames […]"}]