[{"link":"https://nmac.to/blog/apple-iad-producer-v32-design-and/","image":"https://nmac.to/wp-content/uploads/2013/12/iad1.png","title":"Apple iAd Producer v3.2 – Design and assemble interactive iOS advertising content","content":"Apple iAd Producer is designed for iOS developers who want to create content for the company’s iAd program. Included are a visual designer, page templates, a library of pre-built components, page transitions, animation effects, a simulator, an asset library, automatic generation of multiple versions for different devices and speeds, project validation, a JavaScript editor and […]"},{"link":"https://nmac.to/blog/cream-v11-lightweight-newsreader/","image":"https://nmac.to/wp-content/uploads/2013/12/Cream-Icon.png","title":"Cream 1.1 – Lightweight newsreader","content":"Cream is a lightweight newsreader that helps you get on top of your feeds by skimming off the creamiest stories. It’s the only newsreader that monitors what you read, and learns what you like.   Throw in as many feeds as you like: Cream will sort out the sweet from the sour, so you only […]"},{"link":"https://nmac.to/blog/adium-v154-popular-instant-messaging/","image":"https://nmac.to/wp-content/uploads/2013/12/Adium11.png","title":"Adium v1.5.4 – Popular instant messaging client supports a plethora of services","content":"Adium is a fast and free instant messaging client which supports AIM, ICQ, Jabber, MSN, Yahoo!, Google Talk, Yahoo! Japan, Bonjour, Gadu-Gadu, Novell Groupwise, SIP/SIMPLE (Text), and Lotus Sametime. Adium supports beautiful WebKit message display, tabbed messaging, encrypted chat, file transfer, and more. Give it a try; you won’t look back. Adium is currently translated […]"},{"link":"https://nmac.to/blog/iconbox-v259-customize-and-organize/","image":"https://nmac.to/wp-content/uploads/2012/11/IconBox.png","title":"IconBox 2.5.9 – Customize and organize icons across your Mac","content":"IconBox is a helpful organizational tool for Macs. When the first version of IconBox was released 8 years ago, it was the first Icon Organizer running on Mac OS X, allowing users to conveniently organize their collection of icons in an iPhoto-like way. With version 2.5, IconBox has been completely rewritten and features a brand […]"},{"link":"https://nmac.to/blog/choco-v14-design-photo-collages/","image":"https://nmac.to/wp-content/uploads/2013/12/Choco2.png","title":"Choco v1.4 – Design photo collages","content":"Choco is the ultimate photo collage designer, loaded with more than 100 helpful templates, layout generators, frames, shadows and built-in effects to bring your images to life. Templates library Choco features more than 100 pre-built templates, divided into helpful categories: Classic – Create classic collages with a clean-and-simple grid layout, featuring fixed numbers of rows […]"},{"link":"https://nmac.to/blog/xquake-v203-latest-earthquakes-on-3d/","image":"https://nmac.to/wp-content/uploads/2013/12/AppIcon6.png","title":"xQuake v2.0.3 – Latest earthquakes on a 3D globe","content":"This innovative application displays the list of recent earthquakes and magnitudes on a 3D interactive globe. Find out when they happened, where they happened, how big they were, and more. All in an easy-to-use interface! Tectonic activity of various Richter magnitudes are specified with color coded dots. Each dot represents an earthquake and its magnitude […]"},{"link":"https://nmac.to/blog/menutab-for-facebook-v54-instantly/","image":"https://nmac.to/wp-content/uploads/2013/12/fac.png","title":"MenuTab for Facebook 5.4 – instantly access your Facebook","content":"MenuTab takes your Facebook addiction to a whole new level. It is the best app for instantly accessing your Facebook account without having to open your web browser! With MenuTab, we take advantage of the magic of Facebook to make everything totally real-time, with the latest news from your friends coming straight onto your desktop. […]"},{"link":"https://nmac.to/blog/idraw-v22-powerful-vector-drawing-and/","image":"https://nmac.to/wp-content/uploads/2013/12/iDraw.png","title":"iDraw 2.2 – Powerful vector drawing and illustration tool","content":"iDraw is a powerful feature-packed vector drawing and illustration application for Mac OSX. iDraw has all of the tools you need to create everything from detailed technical illustrations to beautiful works of art. Create intricate designs quickly and easily, and continue working on the go with iDraw for the iPad.   Create resolution-independent illustrations that can […]"},{"link":"https://nmac.to/blog/face-for-facebook-v17-helps-you-connect/","image":"https://nmac.to/wp-content/uploads/2013/12/facbook.png","title":"Face for Facebook v1.7 – helps you connect with your friends and share on","content":"Share and stay connected with your friends with Facebook. Face for Facebook helps you connect with your friends and share on the go. Rest you already know… What’s New in Version 1.7– Improved layout… and fixed some small issue… ScreenShots : BitShare Click Here RapidShare Click Here Uploaded Click Here SlingFile Click Here CroCko Click […]"},{"link":"https://nmac.to/blog/temperature-gauge-v36-monitor-your-macs/","image":"https://nmac.to/wp-content/uploads/2013/12/logo1.png","title":"Temperature Gauge v3.6 – Monitor your Mac’s temperature sensors and fan speeds","content":"Temperature Gauge lets you monitor all the temperatures and fan speeds inside your Mac. With over 500 international five star ratings and world class support, it’s a great tool for every Mac user to have. – Run in background mode with the info displayed in the menu bar. – See the temperature values in either […]"}]