[{"link":"https://nmac.to/blog/piccollage-1-1/","image":"https://nmac.to/wp-content/uploads/2014/02/PicCollage.png","title":"PicCollage 1.1 – The new generation collage maker","content":"PicCollage is a powerful and well-designed photo collage maker with which it becomes easy to turn photos into funny collages. Comes with seven collage layouts — Free, Classic, Grid, Focus, Shape, Irregular, Stitch, and a library of preset templates, it helps to start making collage quickly. You can change collage background from kinds of styles […]"},{"link":"https://nmac.to/blog/crazytalk-7-30-2225-1/","image":"https://nmac.to/wp-content/uploads/2014/02/CrazyTalk.png","title":"CrazyTalk 7.30.2225.1- Facial animation tool","content":"CrazyTalk is the most popular facial animation tool that uses sound and text to vividly animate facial images. With this groundbreaking Auto Motion technology, you just need to import images, specify the facial feature points and record your own voice to automatically generate lip-syncs to create 3D life-like, talking videos.   Version 7.30.2225.1: Enhanced: Content […]"},{"link":"https://nmac.to/blog/email-backup-pro-2-8/","image":"https://nmac.to/wp-content/uploads/2014/02/Email-Backup-Pro.png","title":"Email Backup Pro 2.8 – Automated email backup solution","content":"Email Backup Pro is an easy-to-use, powerful, automated email backup solution. It allows for scheduled backups of the most common email applications through the configuration of a simple interface.   Features: Easy restoration from an email backup. Allows any number of previous backups to be kept Compressed Backups Major Email application support Flexible Scheduling Auto-mounting […]"},{"link":"https://nmac.to/blog/animix-1-7/","image":"https://nmac.to/wp-content/uploads/2014/02/Animix.png","title":"Animix 1.7 – Animate your photos","content":"Animix app is an unique way to breathe the life into your photos. You can add weather effects, animate water surfaces, put a sun lens flare and set up the camera movement. The app is that simple that even a kid can use it to produce some creative works! Animix contains free screensaver module that […]"},{"link":"https://nmac.to/blog/sandvox-2-8-9/","image":"https://nmac.to/wp-content/uploads/2014/02/Sandvox.png","title":"Sandvox 2.8.9 – Easily build eye-catching Web sites","content":"Sandvox is for Mac users who want to create a professional looking website quickly and easily. With Sandvox, you don’t need to be a Web genius to build a stylish, feature-rich, standards-compliant website that’s functional and user friendly. Sandvox’s drag and drop interface lets you watch your website take shape and come to life as […]"},{"link":"https://nmac.to/blog/ibank-5-0-4/","image":"https://nmac.to/wp-content/uploads/2014/02/iBank.png","title":"iBank 5.0.4 – Intuitive personal finance manager, widget available","content":"iBank is a new standard for Mac money management.    With its intuitive user interface and a full set of money management features, iBank 5 is the most complete software available for Mac personal finance. iBank 5 lets you enter and edit your transactions with ease, pay bills online and on time, download your online […]"},{"link":"https://nmac.to/blog/bombsquad/","image":"https://nmac.to/wp-content/uploads/2014/02/BombSquad.png","title":"BombSquad 1.3.3 – Arcade-style party game","content":"With BombSquad, grab some friends, your Mac, a few iPhones for controllers, and get your party-game on! Who needs consoles?!   Take on the computer alone or with friends in campaign mode, or challenge said friends to a tournament of mini-games including Capture-the-Flag, King-of-the-Hill, Bomber-Hockey, and of course Epic-Slow-Motion-Elimination.   Laugh gleefully as you land […]"},{"link":"https://nmac.to/blog/motionartist-1-2/","image":"https://nmac.to/wp-content/uploads/2014/02/MotionArtist.png","title":"MotionArtist 1.2 – Develop amazing interactive comics","content":"MotionArtist is everything you need to develop amazing interactive comics, robust animations for web or video export, and compile incredible multi-media presentations. Simply import your images, audio, or video and utilize MotionArtist’s powerful, easy, and intuitive toolset to create ambitious motion creations to share with the world!   Massive Workspace Director’s view gives you a […]"},{"link":"https://nmac.to/blog/investoscope-2-3-4/","image":"https://nmac.to/wp-content/uploads/2014/02/Investoscope.png","title":"Investoscope 2.3.4 – Portfolio tracker for the individual investor","content":"Investoscope is a portfolio tracker for the individual investor. With a compelling and intuitive one window user interface, Investoscope lets you monitor the performance of your investments in stocks, bonds, mutual funds, and other securities.   FEATURES : Automatically downloads latest quote prices from free sources on the internet. Keep up-to-date with the latest news. […]"},{"link":"https://nmac.to/blog/voila-3-7/","image":"https://nmac.to/wp-content/uploads/2014/02/Voila.png","title":"Voila 3.7 – Capture, annotate, organize, and share media","content":"Voila is a screen-capture, recording, and annotation tool that is a full-featured replacement for Mac’s screen-capture and screen-recording capabilities. It has a large and robust set of editing, organizing, annotation, and effects tools that allows the user to create and add details to screenshots, tutorials, videos, and presentations.   Voila lets you capture any shape, […]"}]