[{"link":"https://nmac.to/blog/converters-1-2/","image":"https://nmac.to/wp-content/uploads/2016/11/Converters.png","title":"Converters 1.2 – A valuable converter for professionals & students","content":"Converters is the application that brings a new idea of functionality.   Calculate faster than ever.   Not just a conversion, but categories of conversion with lots of units to convert always at hand.   A valuable tool for professionals, students but also to solve everyday problems.   FEATURES Convert over 25 units divided into […]"},{"link":"https://nmac.to/blog/word-air-1-7-2/","image":"https://nmac.to/wp-content/uploads/2016/08/Word-Air.png","title":"Word Air 1.7.2 – for Microsoft Word Edition & Open Office Format","content":"Word Air is a beautiful, easy-to-use text editor that is designed to make writing convenient, efficient and comfortable. Word Air is ease, fast and uncluttered. It starts up quickly, has a live word count, easy on the eyes and you can export all the common formats: .pdf, .rtf, .doc, .txt and more .   Features […]"},{"link":"https://nmac.to/blog/tuck-1-0-build-21/","image":"https://nmac.to/wp-content/uploads/2015/12/Tuck.png","title":"Tuck 1.0 build 21 – Dock any window to the edge of your screen","content":"Tuck allows you to dock any window to the edge of your screen and automatically hide/show when you mouse to that screen edge, like the Dock in OS X.   Version 1.0 build 21: Initial release.   Intel OS X 10.6.6 or later Accessibility enabled    "},{"link":"https://nmac.to/blog/remixlive-1-2-3/","image":"https://nmac.to/wp-content/uploads/2016/08/Remixlive.png","title":"Remixlive 1.2.3 – Remix loops with pads","content":"The essential app for instant remixing, powered by pro samples. Remix music with synced loops, sounds & FX.   Mixvibes, the pioneer of digital DJing, introduces the perfect remix toolbox: lay down samples on a grid of pads and tweak them in seconds. Remixlive is all you need to turn ideas into high-quality tracks.   […]"},{"link":"https://nmac.to/blog/supervideo-2-0/","image":"https://nmac.to/wp-content/uploads/2016/11/SuperVideo.png","title":"SuperVideo 2.0 – Video Effects & Filters","content":"Tons of amazing effects for your videos!   Unique, outstanding effects you’ll love. You’ll have endless fun and turn your videos into amazing art pieces with just one click!   Version 2.0: New filters and effects Arbitrary video size and duration for Premium version Bug fixes and improvements   OS X 10.9 or later, 64-bit […]"},{"link":"https://nmac.to/blog/socialfan-1-0-2/","image":"https://nmac.to/wp-content/uploads/2014/05/SocialFan.png","title":"SocialFan 1.0.2 – All-in-one social media, email, and task management app [UPDATE]","content":"SocialFan is a single app that manages your emails, social media, notes, tasks, journal, and more. Switching between your apps has never been so easy. No logins, no logouts, and no hassles. Easily switch on or off modules based on your preference.   Social Media Switching between your favorite social media sites has never been […]"},{"link":"https://nmac.to/blog/pdf-converter-pro-5-1-0/","image":"https://nmac.to/wp-content/uploads/2016/04/PDF-Converter-Pro.png","title":"PDF Converter Pro 5.1.0 – Convert PDFs to Offices files, HTML, and more","content":"PDF Converter Pro offers the best converter from PDF to editable Microsoft Word, Excel, PowerPoint, Plain Text, Rich Text Format, and images. It is a must for people who want to work more smartly in the office or who need to get PDF content quickly. Wondershare PDF Converter Pro adds advanced OCR technology that allows […]"},{"link":"https://nmac.to/blog/patterns-1-2/","image":"https://nmac.to/wp-content/uploads/2016/09/Patterns.png","title":"Patterns 1.2 – Powerful tool for working with regular expressions","content":"Patterns is a simple yet powerful tool for working with regular expressions. Build great patterns quickly and effortlessly with syntax coloring, and with matching and replacing occurring in real time.   Features: Regular expression syntax coloring makes it easy to see how your pattern is interpreted by the regex engine. No more confusion about what […]"},{"link":"https://nmac.to/blog/moneywiz-2-5-1/","image":"https://nmac.to/wp-content/uploads/2015/02/MoneyWiz2.png","title":"MoneyWiz 2.5.1 – Personal finance solution","content":"All your accounts, budgets and bills in one place! With powerful reports, worldwide online banking and instant sync between all your devices!   That’s MoneyWiz – the world’s most powerful and beautiful finance software.   HOW CAN MONEYWIZ HELP YOU? GET OUT OF DEBT : We’ve built MoneyWiz in a way that makes it easy […]"},{"link":"https://nmac.to/blog/flying-logic-pro-3-0-5/","image":"https://nmac.to/wp-content/uploads/2016/07/Flying-Logic-Pro.png","title":"Flying Logic Pro 3.0.5 – A spreadsheet-style reasoning tool","content":"Flying Logic Pro is a highly visual, easy-to-use software application that does for reasoning what spreadsheets do for numbers. Just as you would not do detailed financial projections in your head, you need Flying Logic for all nontrivial planning and reasoning endeavors.   Features The Flying Logic Advantage – Project management software won’t help you […]"}]