[{"link":"https://nmac.to/blog/darkwood-game/","image":"https://nmac.to/wp-content/uploads/2017/08/Darkwood.png","title":"Darkwood 1.3.31554 – A new perspective on survival horror game","content":"Scavenge and explore the rich, ever-changing free-roam world by day, then hunker down in your hideout and pray for the morning light. Survival horror from a top-down perspective that is terrifying to play. By day explore the randomly generated, ever-sinister woods, scavenge for materials, craft weapons and discover new secrets. By night find shelter, barricade, […]"},{"link":"https://nmac.to/blog/express-zip/","image":"https://nmac.to/wp-content/uploads/2020/01/Express-Zip.png","title":"Express Zip Plus 7.06 – File Compression and Extraction Software","content":"Express Zip is one of the most stable, easy-to-use and comprehensive file archive and compression tools available. Create, manage and extract zipped files and folders. Reduce file space needed by zipping big files before sending them to family, friends, coworkers and clients.   Express Zip Features Create new ZIP files quickly Open, unzip and extract […]"},{"link":"https://nmac.to/blog/mixpad/","image":"https://nmac.to/wp-content/uploads/2018/01/MixPad.png","title":"MixPad 5.85 – Music mixer","content":"MixPad is music recording and mixing software for OS X designed for easy audio production. Simply drag and drop your audio clips onto the timeline then mix music, vocal and audio tracks, adjust the volume, pan, fade, and add audio effects including EQ, compression, reverb and more. MixPad is the digital replacement to a studio […]"},{"link":"https://nmac.to/blog/express-burn/","image":"https://nmac.to/wp-content/uploads/2017/06/ExpressBurn.png","title":"Express Burn 9.07 – CD/DVD/Blu-ray burner app","content":"Express Burn is a CD-burning program that lets you create and record audio and data CDs. You can record a data or audio disc quickly and easily by dragging the files you want onto the icon and clicking Burn CD. The software then does the rest, including converting the files if required. Express Burn is […]"},{"link":"https://nmac.to/blog/photopad/","image":"https://nmac.to/wp-content/uploads/2019/09/PhotoPad.png","title":"PhotoPad 6.30 – Edit your photos and images easily","content":"PhotoPad picture editor is the fastest and most fun way to edit your digital photos. PhotoPad is one of the most stable, easy-to-use, and comprehensive photo editors available. Easily edit digital photos and other pictures Supports all popular image formats Crop, rotate, resize and flip photos fast   PhotoPad is designed to be ready to […]"},{"link":"https://nmac.to/blog/videopad/","image":"https://nmac.to/wp-content/uploads/2017/02/VideoPad.png","title":"VideoPad 8.40 – Powerful video editor","content":"VideoPad is a powerful movie-editing software for OS X. It allows you to create and edit videos of many formats including .avi, .wmv, .3gp, .wmv, .divx as well as several others. Try VideoPad for free to create a professional quality movie by combining several video clips or even working with just one.   Features Select […]"},{"link":"https://nmac.to/blog/recordpad/","image":"https://nmac.to/wp-content/uploads/2020/07/RecordPad.png","title":"RecordPad 9.00 – Record audio to export as mp3 or wav files","content":"RecordPad is a sound recording program for Mac OS X. Using RecordPad you can quickly and easily record audio notes, messages, or annoucements in either .wav or .mp3.   RecordPad is designed to be very easy and intuitive to use. Within minutes you will be able to start a recording, save it, and replay the […]"},{"link":"https://nmac.to/blog/orion-label-and-print-studio/","image":"https://nmac.to/wp-content/uploads/2019/04/Orion-Label-And-Print-Studio.png","title":"Orion Label And Print Studio 2.60 – Drag-and-drop label designer","content":"Orion Label And Print Studio is an easy to use drag and drop designer for a variety of print projects. Quickly design and print personalized labels, business cards, fold-style greeting cards, flyers, PDF books and more. Please note the free mode applies a watermark to completed designs, watermarks can be removed with in-app purchase.   […]"},{"link":"https://nmac.to/blog/totally-accurate-battle-simulator/","image":"https://nmac.to/wp-content/uploads/2019/04/Totally-Accurate-Battle-Simulator.png","title":"Totally Accurate Battle Simulator 0.11.1 – A wacky physics-based tactics game","content":"Totally Accurate Battle Simulator is a wacky physics-based tactics game.    Experience accurate warfare through the ages, TABS uses state of the art physics-based simulation to provide you with never-before-seen insight to our greatest battles of history.   Features Campaign Sandbox mode A bunch of silly units   Minimum System Requirements: Processor: 2.3GHz dual-core Intel […]"},{"link":"https://nmac.to/blog/another-sight-definitive-edition/","image":"https://nmac.to/wp-content/uploads/2020/07/Another-Sight.png","title":"Another Sight – Definitive Edition 4.21.2 – A surreal fantasy adventure game","content":"ANOTHER SIGHT is a surreal fantasy adventure with steampunk elements set in London in 1899, towards the end of the Victorian era. With an emphasis on culture and character, ANOTHER SIGHT focuses on the emotional development of the relationship between its two protagonists, Kit, a refreshingly intrepid teenager, and Hodge – a mysterious red-furred cat. […]"}]