[{"link":"https://nmac.to/blog/psychonauts/","image":"https://nmac.to/wp-content/uploads/2021/05/Psychonauts.png","title":"Psychonauts gog 3 46977 – Classic action/adventure platformer game","content":"A Psychic Odyssey Through the Minds of Misfits, Monsters, and Madmen   This classic action/adventure platformer from acclaimed developers Double Fine Productions follows the story of a young psychic named Raz. In his quest to join the Psychonauts–an elite group of international psychic secret agents–he breaks into their secret training facility: Whispering Rock Psychic Summer […]"},{"link":"https://nmac.to/blog/shockrods/","image":"https://nmac.to/wp-content/uploads/2021/05/ShockRods.png","title":"ShockRods 1.5.5 – Arena shooter Game","content":"ShockRods is about shooting and avoiding being shot by jumping and dodging. ShockRods features solo and team games that take place in natural surroundings and future sports arenas. Your goal in ShockRods is to score points – by shooting your opponents and achieving objectives; scoring goals, stealing the other team’s flag, or dealing the most […]"},{"link":"https://nmac.to/blog/fusion-studio/","image":"https://nmac.to/wp-content/uploads/2020/04/Fusion.png","title":"Fusion Studio 17.2 – Visual effects, 3D, VR and motion graphics solution","content":"Fusion is the world’s most advanced compositing software for visual effects artists, broadcast and motion graphic designers, and 3D animators. Over the last 30 years, Fusion has been used on thousands of Hollywood blockbuster movies and television shows. Fusion features a powerful node based interface that lets you quickly and easily create sophisticated effects by connecting […]"},{"link":"https://nmac.to/blog/lensflare-studio/","image":"https://nmac.to/wp-content/uploads/2016/08/LensFlare-Studio5.png","title":"LensFlare Studio 6.8 – Bring your photos to life","content":"LensFlare Studio is a powerful light-manipulation tool for adding optical effects to your photos. With over 100 effects, you can choose from lens flares, lighting effects, glares, bokeh, and more.   LensFlare Studio has over 100 high-resolution optical effects. Each effect responds dynamically as you position the light source, realistically simulating various lens types, reflections, […]"},{"link":"https://nmac.to/blog/be-focused-pro/","image":"https://nmac.to/wp-content/uploads/2016/11/Be-Focused-Pro16.png","title":"Be Focused Pro 2.1.1 – Focus Timer & Goal Tracker","content":"Staying on task seems is a real challenge for our screen-bound generation. The Be Focused lets you get things done by breaking up individual tasks among discrete intervals, separated by short breaks. It’s a surprisingly effective way to retain motivation and focus. Create tasks, configure breaks and track your progress throughout the day, week or […]"},{"link":"https://nmac.to/blog/image-deblur/","image":"https://nmac.to/wp-content/uploads/2021/04/Image-Deblur.png","title":"Image Deblur Blurred & Shaky 1.0.8 – Remove blur from your photos","content":"Restore defocused or blurred photos, remove motion blur and bring out the details from your pics. Perfect for blurred shots such as pics of moving cars, blurred signs…   Image Deblur is a professional tool that lets you remove the blur from your photos.   Thanks to its deconvolution algorithm it is possible to bring […]"},{"link":"https://nmac.to/blog/3dweather/","image":"https://nmac.to/wp-content/uploads/2017/04/3DWeather3.png","title":"3DWeather 3.8 – Get 3D weather alerts and forecasts","content":"3DWeather shows weather information in an interesting style. It lets you keep a 3D animated widget on the desktop that generates scenic representation of the present weather condition. One can also hide the widget and access the app from Menubar. It can be easy and quick to get latest weather updates and forecast whenever you […]"},{"link":"https://nmac.to/blog/enigma-recovery/","image":"https://nmac.to/wp-content/uploads/2018/12/Enigma-Recovery.png","title":"Enigma Recovery 3.0.164 – Recover deleted data from iOS devices & backups","content":"Accidentally lost or deleted important data from your iOS device? Enigma Recovery is the ideal data recovery tool for you. Our software can recover the deleted data you feared was lost forever from your iPhone, iPad or iPod Touch.   Designed to work with our free Restore App, the software will help you to restore […]"},{"link":"https://nmac.to/blog/book-track/","image":"https://nmac.to/wp-content/uploads/2021/04/Book-Track.png","title":"Book Track 2.1.6 – Catalog and track your books","content":"Book Track is the application built for iPhone, iPad and Mac to easily keep track of the books you have purchased and which you would like to read. Manage your personal collection and wish list, searching for books by name or author or entering them manually. Digitizing your personal library has never been easier or […]"},{"link":"https://nmac.to/blog/word-counter/","image":"https://nmac.to/wp-content/uploads/2020/02/WordCounter.png","title":"Word Counter 1.6.5 – Track how many words you write, when, and where","content":"The Word Counter is all about giving you insights in your productivity as a writer. What gets measured gets accomplished. By giving specific feedback about the quantity of your writing, we believe that the most important aspects of your writing can be improved. Currently the app is tracking daily words and their distribution across applications. […]"}]