[{"link":"https://nmac.to/blog/rcode-2-8/","image":"https://nmac.to/wp-content/uploads/2015/07/RCode.png","title":"RCode 2.8 – Powerful universal code editor","content":"RCode is the ultimate lightweight and powerful coding application, it opens in seconds so you can code straight away!   RCode supports most top language syntax’s supporting; Plain Text, C, C++, Objective C, CSS, HTML, JavaScript, JSON,PHP, Ruby, Shell and XML   RCode has a navigator mode to easily see and switch between your project […]"},{"link":"https://nmac.to/blog/intellie-notes-1-0-1/","image":"https://nmac.to/wp-content/uploads/2015/07/Intellie.Notes_.png","title":"Intellie Notes 1.0.1 – A Quick Note taking app for mac with clean interface","content":"Rather than organizing the notes in folders or applying tags to notes, Intellie Notes uses color to organized different notes and notes can be also filtered using color.   Intellie Notes also support multiple window for individual notes.   For syncing, Intellie Notes uses iCloud to sync you all notes across multiple mac device.   […]"},{"link":"https://nmac.to/blog/instant-menu-1-0/","image":"https://nmac.to/wp-content/uploads/2015/07/Instant-Menu.png","title":"Instant Menu 1.0 – Add menus to the right side of the status bar","content":"Instant Menu adds one or more global menus to the right side of the status bar. It provides you an access to the main directories of Mac system right from the toolbar. So you can easily access Applications, Desktop, Documents, Downloads, Library, Movies, Music, Pictures, Public with a single menu choice. Directories and subdirectories are […]"},{"link":"https://nmac.to/blog/blogo-2-3-1/","image":"https://nmac.to/wp-content/uploads/2014/08/Blogo.png","title":"Blogo 2.3.1 – Write, publish and manage multiple blogs","content":"Blogo is the easiest and fastest way to write, publish and manage multiple blogs. Blogo gathered features for a powerful solution and helps users to publish and create content easily. It makes it possible to manage multiple blogs at the same time, edit pictures with a built-in image editor, preview your posts on real-time, manage […]"},{"link":"https://nmac.to/blog/annotate-2-1/","image":"https://nmac.to/wp-content/uploads/2015/06/Annotate2.png","title":"Annotate 2.1 – Screenshot capture and annotation tool (was Glui)","content":"Annotate (was Glui) is the simplest way to capture, annotate and share screenshots.   This is a complete rewrite that builds on what made Glui popular and adds some of the most requested features. It’s way faster, far better, and most importantly, just as simple.   Key features: Capture a screenshot or drag and drop […]"},{"link":"https://nmac.to/blog/shortcat-0-7-6/","image":"https://nmac.to/wp-content/uploads/2015/07/Shortcat.png","title":"Shortcat 0.7.6 – Control your applications with a few short keystrokes","content":"Shortcat lets you keep your hands on the keyboard and boost your productivity! Shortcat is a keyboard tool for OS X that lets you “click” buttons and control your apps with a few keystrokes. Think of it as Spotlight for the user interface.   Version 0.7.6: Updated beta expiry date   Intel, 64-bit processor OS […]"},{"link":"https://nmac.to/blog/radio-2-0-1/","image":"https://nmac.to/wp-content/uploads/2015/07/Radio.png","title":"Radio 2.0.1 – Listen to over 10,000 professional and community radio stations","content":"The Radio App features over 10,000 professional and community radio stations from around the world. Radio offers tremendous depth and breadth of stations with genres ranging from Alternative, Electronica, Metal to Jazz and Classic across a broad set of languages including Italian, Spanish, French, German, Russian and Portuguese. We even have public radio, talk and […]"},{"link":"https://nmac.to/blog/pagico-7-2/","image":"https://nmac.to/wp-content/uploads/2015/07/Pagico.png","title":"Pagico 7.2 – Manage tasks, notes, and files, and your projects and clients","content":"Store and manage all your tasks, notes, files, projects and contacts in one easy-to-use app. Keeping everything organized and on-track is easier than ever.   Interactive Flowcharts  Its revolutionary flowchart intuitively presents all your schedule data without being overwhelming, helping you to easily and visually stay on track. With the brand-new Stats view, you can […]"},{"link":"https://nmac.to/blog/keep-everything-2-3/","image":"https://nmac.to/wp-content/uploads/2015/07/Keep.Everything.png","title":"Keep Everything 2.3 – Save web pages to Dropbox","content":"Keep Everything saves web pages to Dropbox so you can read them later, anytime, anywhere. It can save all or just a portion of web page as well as data from other applications, such as Twitter, YouTube, Pocket, and ReadKit and with Dropbox sync between the OS X and iOS version, your data is accessible […]"},{"link":"https://nmac.to/blog/emulsion-1-1-22/","image":"https://nmac.to/wp-content/uploads/2015/06/Emulsion.png","title":"Emulsion 1.1.22 – Photo library catalog","content":"Emulsion is a new photo catalog app. Emulsion can adjust exposure, colors, and almost everything else. You can also add gradients to your images to darken skies, or even add dust and scratches for a cool retro look. Emulsion can apply adjustments, effects, and metadata changes to one or hundreds of images at once. Want […]"}]