[{"link":"https://nmac.to/blog/winmail-viewer-2-0/","image":"https://nmac.to/wp-content/uploads/2015/01/Winmail.Viewer.png","title":"Winmail Viewer 2.0 – winmail.dat Viewer solution","content":"You may receive winmail.dat files from the senders who are using Microsoft Outlook (1997, 2000, 2003, 2007, 2010). Winmail.dat contains all attachments and rich text message, and not all e-mail clients can recognize its format. Enolsoft Winmail Viewer is the solution.   With Winmail Viewer, you can View attachment of a winmail.dat(TNEF encoded) file. Open […]"},{"link":"https://nmac.to/blog/pdf-magic-2-6-1/","image":"https://nmac.to/wp-content/uploads/2015/01/PDF-Magic.png","title":"PDF Magic 2.6.1 – Multi functions PDF editor","content":"Enolsoft PDF Magic – Batch merge, split, reorder, insert and rotate your PDF with Drag-n-Drop ease.   FEATURES Split one or more PDF files just where you want into several PDF files. Easily and quickly merge multiple PDF source files or pages to one new document. Drag-n-drop to extract and save specific pages from a […]"},{"link":"https://nmac.to/blog/extreme-landings-pro/","image":"https://nmac.to/wp-content/uploads/2015/01/Extreme.Landings.Pro_.png","title":"Extreme Landings Pro 1.2.2 – Manage the most critical flight conditions of history","content":"Resolve emergencies and incidents inspired to real ones, in a crescendo of pure adrenaline.   Start the individual engines, navigate between the equipment dashboards panels and be prepared to solve the over 5,000 possible situations to achieve the highest pilot level.   The simulator includes 36 missions to accomplish, 168 challenges to pass, cartography and […]"},{"link":"https://nmac.to/blog/web-snapper-3-3-7/","image":"https://nmac.to/wp-content/uploads/2015/01/Web.Snapper.png","title":"Web Snapper 3.3.7 – Capture entire Web pages as single images or PDFs","content":"Web Snapper lets you capture Web pages exactly as they appear in your browser. You can send them to a file as images or vector-based, multi-page PDFs. It captures the whole Web page – eliminating the need to cut, paste and crop multiple screen-shots when trying to create an image or PDF. Web Snapper integrates […]"},{"link":"https://nmac.to/blog/videobox-4-1-3/","image":"https://nmac.to/wp-content/uploads/2014/04/Videobox.png","title":"Videobox 4.1.3 – Download Flash video through your browser","content":"Videobox allows you to quickly and easily download Flash video from most all of the popular video sites on the internet. Videobox will convert the video into a native Quicktime format so it’s ready to view on your Mac, iPod, iPhone or iTunes.   Version 4.1.3: [New] Cleaned up UI errors [New] Videobox now reports […]"},{"link":"https://nmac.to/blog/taskmaster-3-17-2/","image":"https://nmac.to/wp-content/uploads/2015/01/Taskmaster.png","title":"Taskmaster 3.17.2 – Task timer aimed at Leapforce search engine evaluators","content":"Taskmaster is a full-featured task timer specifically for Leapforce search engine evaluators. It features a fully-configurable countdown timer that automatically calculates your productivity. You can easily track how long you’ve worked, what tasks you’ve done, and how much you’ve made. Start and stop times are recorded automatically, making invoicing a breeze. Now you can even […]"},{"link":"https://nmac.to/blog/next-1-3/","image":"https://nmac.to/wp-content/uploads/2015/01/Next.png","title":"Next 1.3 – Track your expenses and finances","content":"Next helps you get control of your expenses. It’s the easiest way to track your expenses. It’s fast, elegant and won’t get in your way. And with iCloud sync and the additional iPhone/iPad apps, your data is everywhere with you.   Your expenses are grouped into different views: By year, month or day. And thanks […]"},{"link":"https://nmac.to/blog/musicbox-2-4-1/","image":"https://nmac.to/wp-content/uploads/2015/01/Musicbox.png","title":"Musicbox 2.4.1 – Download songs/audio from your favorite music websites","content":"Musicbox can download songs from your favorite music websites, convert it into a native mp3 format and import it into your iTunes library so it’s ready to be listened to on your Mac, iPod or iPhone.   Version 2.4.1: [New] Cleaned up UI errors [New] Musicbox now reports when updating downloaders, instead of freezing for […]"},{"link":"https://nmac.to/blog/boot-runner-1-6/","image":"https://nmac.to/wp-content/uploads/2015/01/Boot.Runner.png","title":"Boot Runner 1.6 – Dual-boot startup control","content":"Get Boot Runner for complete startup control for dual-boot Macs. Use network policies and remote management tools for easy maintenance and customization of dual boot labs, kiosks and classrooms.   Customize the start up experience with custom background images and popover text. A menu bar disk selector gives one-click startup control from the desktop.   […]"},{"link":"https://nmac.to/blog/ideskcal-2-6-5/","image":"https://nmac.to/wp-content/uploads/2015/01/iDeskCal.png","title":"iDeskCal 2.6.5 – Allows quick access to your iCal calendar events","content":"iDeskCal embeds your calendar on your desktop, above your wallpaper but below your desktop items. With iDeskCal you can quickly and effortlessly know exactly what is on your calendar for the current day, and beyond.   iDeskCal is user configurable, so you can place it exactly where you want on your desktop, and configure the […]"}]