[{"link":"https://nmac.to/blog/radium-3-1/","image":"https://nmac.to/wp-content/uploads/2014/03/Radium.png","title":"Radium 3.1 – Multi-network radio player","content":"Radium is an Internet radio player that’s designed from the ground up to be simple, intuitive, and lightweight. With its powerful search, thousands of supported stations (including Sirius/XM and DI.fm/Sky.fm Premium), and the ability to add your own streams, Radium will change the way you listen to Internet radio.   Version 3.1: Visual refresh + […]"},{"link":"https://nmac.to/blog/mailbar-1-1-5/","image":"https://nmac.to/wp-content/uploads/2015/02/MailBar.png","title":"MailBar 1.1.5 – Manage your Mail.app inbox from the menu bar","content":"MailBar enables you to check your inbox and manage your emails directly from your Mac’s status bar.   The light and discreet application is designed to run in the background and display the number of new emails next to its menu bar icon. Thanks to MailBar, you can monitor and manage up to four different […]"},{"link":"https://nmac.to/blog/desk-1-2/","image":"https://nmac.to/wp-content/uploads/2015/02/Desk.png","title":"Desk 1.2 – Free writing environments app","content":"Desk is a premium writing experience for all types of writers.   Whether you’re a casual enthusiast, the weekend writer, blogger, or digital publishing professional, you’ll find Desk to be a much-needed breath of fresh air.   Designed to marry both function and form, it is the desktop publishing client that you’ve always wanted: Simple, […]"},{"link":"https://nmac.to/blog/current-for-facebook-1-0-3/","image":"https://nmac.to/wp-content/uploads/2015/01/Current-for-Facebook.png","title":"Current for Facebook 1.0.3 – Bring Facebook To The Mac Desktop","content":"Current offers THE BEST way to message and browse on Facebook with your Mac! With Current, you can Facebook message friends in their own chat windows and quickly access your inbox, notifications, and online friends right from the menu bar.   Current isn’t just a messaging app. It’s a complete replacement for using Facebook in […]"},{"link":"https://nmac.to/blog/colorstrokes-2-4/","image":"https://nmac.to/wp-content/uploads/2013/07/ColorStrokes.png","title":"ColorStrokes 2.4 – Powerful utility for image processing and more","content":"ColorStrokes is the only app that lets you play and manipulate the colors on photos in any possible way. ColorStrokes is simple, yet incredibly powerful app to make ordinary picture look catchy and extremely awesome.   ReColor photos: You have all the colors and tones under the hand, so pick whatever you like, mix colors […]"},{"link":"https://nmac.to/blog/color-accent-studio-pro-1-0/","image":"https://nmac.to/wp-content/uploads/2015/02/Color.Accent.Studio.Pro_.png","title":"Color Accent Studio Pro 1.0 – Add dramatic effect to your photos","content":"Color Accent Studio Pro allows you add a touch of color to your photos for a dramatic effect.   Easy and Simple In the middle screen, click “load image” Paint over your black and white image to reveal the natural color underneath. Manually select custom colors to add your own color to your creation. Zoom […]"},{"link":"https://nmac.to/blog/astropad-1-0/","image":"https://nmac.to/wp-content/uploads/2015/02/Astropad.png","title":"Astropad 1.0 – Transform your ipad into a professional graphics tablet","content":"Use the Mac creative tools you know & love, like Photoshop, with the touch experience of your iPad.   Creating Astropad required innovative new technology we call LIQUID. The result is stunning image quality and responsiveness never before seen in similar tools.   LIQUID is true to your source material with color corrected output and […]"},{"link":"https://nmac.to/blog/earth-3d-amazing-atlas-2-0-0/","image":"https://nmac.to/wp-content/uploads/2015/02/Earth-3D-Amazing-Atlas.png","title":"Earth 3D Amazing Atlas 2.0.0 – 3D globe wonders of the world","content":"Earth 3D Amazing Atlas features wonders of the world, political and geographic maps, and weather. Discover a lot of fascinating facts and useful information about our planet! Original and colorful graphics, user-friendly interface and accurate information — this is what Earth 3D – Amazing Atlas is all about!   Features: Relief model of the Earth […]"},{"link":"https://nmac.to/blog/webreaver-2-1/","image":"https://nmac.to/wp-content/uploads/2015/02/WebReaver.png","title":"WebReaver 2.1 – Web security testing tool for Mac OS","content":"WebReaver is an elegant, easy to use and fully-automated, web application security testing tool for Mac OS X. It is suitable for novice as well as advanced users. WebReaver allows you easily test any web application for a large variety of security issues.   WebReaver is powered by Websecurify’s latest security testing engine, which comes […]"},{"link":"https://nmac.to/blog/menutab-pro-for-twitter-1-1-1/","image":"https://nmac.to/wp-content/uploads/2015/02/MenuTab.Pro_.for_.Twitter.png","title":"MenuTab Pro for Twitter 1.1.1 – The Perfect Twitter App For Your MAC","content":"MenuTab Pro for Twitter is new way to access your Twitter. Doesn’t have enough space for a menubar app? Not a problem. We introduce MenuTab Pro that will stick on edges of your screen.   MenuTab Pro for Twitter with these Charming features:   Access your Twitter with “1 click” from your menubar，red icon in […]"}]