[{"link":"https://nmac.to/blog/startide/","image":"https://nmac.to/wp-content/uploads/2017/09/Startide.png","title":"Startide 1.0 – Arcade top-down shooter game","content":"Satrtide is the new take on the arcade top-down shooter – play as an elite pilot driving the Interstellar Recon Mecha geared with an unique set of weapons and special abilities. Explore the uncharted corners of the galaxy, discover its story and test your skills in epic battles against the most feared space dreadnoughts.   […]"},{"link":"https://nmac.to/blog/easyframe/","image":"https://nmac.to/wp-content/uploads/2016/07/EasyFrame.png","title":"EasyFrame 2.6.1 – Quickly add frames to digital images","content":"EasyFrame lets you easily slap a frame on any photos for that finishing touch. It comes with a built-in collection of frame, but best of all, it is extensible with your own frames (or frames you find on the Web).   Version 2.6.1: Updated app for latest macOS Removed old references that are no longer […]"},{"link":"https://nmac.to/blog/autodesk-eagle/","image":"https://nmac.to/wp-content/uploads/2017/09/Autodesk-EAGLE.png","title":"Autodesk EAGLE 8.3.1 – Schematic capture and printed circuit board design","content":"Eagle Layout Editor is a schematic capture and printed circuit board design package that runs in the X11 application environment.   Version 8.3.1: Bug fixes: Restored behavior of RIPUP command after pressing ESC Fixed issue with pad names / net name not showing up in PCB editor Fixed background color in schematic preview Fixed width […]"},{"link":"https://nmac.to/blog/photo-blur-fx/","image":"https://nmac.to/wp-content/uploads/2017/09/Photo-Blur-FX.png","title":"Photo Blur FX 1.0 – Image Blur and Focus Effects","content":"Photo Blur FX is the complete solution for applying blur and focus effects to your photos. Designed to satisfy the needs of both amateur and professional photographers and featuring an impressive set of blur and focus effects, Photo Blur FX gives you unlimited creative freedom when it comes to photo blur editing. But here is […]"},{"link":"https://nmac.to/blog/tv-streams/","image":"https://nmac.to/wp-content/uploads/2017/04/TV-Streams.png","title":"TV Streams 4.1 – The easy way to watch television","content":"Imagine a television in which you can see every channel of the world…   How it works?   1. DOWNLOAD Install TV Streams on your Mac, Apple TV or iOS device from the App Store.   2. ADD Import the channels you want using an M3U playlist. You can use the mail app or directly […]"},{"link":"https://nmac.to/blog/draft-writing/","image":"https://nmac.to/wp-content/uploads/2017/09/Draft-Writing.png","title":"Draft Writing 3.0.1 – Creative Text Editor","content":"Draft Writing is a creative text editor for writers and bloggers.   A writing tool to gather your ideas into one place.   Easy writing projects and texts management.   CREATE drafts for any blogs, articles, or quick notes; writing projects: short stories, novels, poems and more.   GET Simple but useful text editor; Status […]"},{"link":"https://nmac.to/blog/image-plus/","image":"https://nmac.to/wp-content/uploads/2017/09/Image-Plus.png","title":"Image Plus 1.2 – Watermark, Rotate and Convert Photos","content":"Image Plus allows you to fine-tune, watermark, resize, rotate, convert and apply artistic effects to your photos.   If you have photos on your Mac that need to be adjusted and watermarked then you are in luck. Image Plus is an all-in-one photo processing solution that any photographer or graphics designer should have in his […]"},{"link":"https://nmac.to/blog/squash/","image":"https://nmac.to/wp-content/uploads/2015/08/Squash.png","title":"Squash 2.0.4 – Image and picture compression","content":"Squash is a super simple app for compressing your images for lower filesize!   Don’t lose quality, or end up with grainy or horrible images, Squash maintains their existing resolution and quality and just reduces the filesize!   Whatever your reason, Squash is great for optimizing images for: Reducing filesize for sending as email attachments. […]"},{"link":"https://nmac.to/blog/beat-cop/","image":"https://nmac.to/wp-content/uploads/2017/09/BeatCop.png","title":"Beat Cop 1.1.172 – Pixel Graphics Adventure Game","content":"New York, more like a beast than a city. Explore it’s darkest corners and uncover its secrets as Jack Kelly, a former detective who has been framed for a murder. Degraded and forgotten by old pals, it’s your last chance to find the truth behind this whole terrible mess. The thing is, your new boss […]"},{"link":"https://nmac.to/blog/duke-grabowski/","image":"https://nmac.to/wp-content/uploads/2017/09/Duke.Grabowski.png","title":"Duke Grabowski, Mighty Swashbuckler 1.0 – Pirates Adventure Game","content":"    Duke Grabowski, Mighty Swashbuckler is a classic point-and-click adventure, created with love by an indie team that includes LucasArts alumni, Bill Tiller (The Curse of Monkey Island, Steven Spielberg’s The Dig, Indiana Jones and the Infernal Machine). Play as Duke, a pirate who’s had success in pillaging, ransacking, and other forms of piratey […]"}]