[{"link":"https://nmac.to/blog/photo-wall/","image":"https://nmac.to/wp-content/uploads/2018/01/Photo-Wall8.png","title":"Photo Wall 8.6.0 – Impressive photo collage maker","content":"Photo Wall – Collage Maker is a great application for making impressive photo collages. It has never been easier! Create interesting and unique collages made of your favorite photos just in a couple of minutes. We offer a lot of new backgrounds for pictures – select the ones you like most.   Photo Wall – […]"},{"link":"https://nmac.to/blog/social-media-lab/","image":"https://nmac.to/wp-content/uploads/2017/03/Social-Media-Lab.png","title":"Social Media Lab 1.3.1 – Templates for Pages","content":"Social media communication has never been easier! Jumsoft’s Social Media Lab for Pages offers a rich collection of hundreds of beautiful and stylish templates for your social media posts – promote your business, communicate sales, customize and use the provided images to your liking!   This pack offers everything you need to start and keep […]"},{"link":"https://nmac.to/blog/decor-graphics/","image":"https://nmac.to/wp-content/uploads/2017/12/Decor-Graphics.png","title":"Decor Graphics 3.3.1 – Templates Lab","content":"Liven up your work! Graphics Lab for iWork is a generous selection of hundreds of designs and illustrations to lift your Keynote presentations and Pages documents to a completely new level design-wise!   It includes everything: backgrounds and patterns for your documents and slideshows, individual characters and bullets to make outstanding titles and highlights for […]"},{"link":"https://nmac.to/blog/borderlands-the-pre-sequel/","image":"https://nmac.to/wp-content/uploads/2018/11/Borderlands-The-Pre-Sequel.png","title":"Borderlands: The Pre-Sequel 1.0.7 – Co-op Action & RPG Game","content":"Discover the story behind Borderlands 2 villain, Handsome Jack, and his rise to power. Taking place between the original Borderlands and Borderlands 2, the Pre-Sequel gives you a whole lotta new gameplay featuring the genre blending fusion of shooter and RPG mechanics that players have come to love.   Float through the air with each […]"},{"link":"https://nmac.to/blog/smartreporter/","image":"https://nmac.to/wp-content/uploads/2013/02/SMARTReporter.png","title":"SMARTReporter 3.1.17 – Hard drive pre-failure warning utility","content":"SMARTReporter is an application that can warn you of some hard disk drive failures before they actually happen! It does so by periodically polling the S.M.A.R.T. status of your hard disk drive. S.M.A.R.T. (Self-Monitoring Analysis and Reporting Technology) is a technology built into most modern hard disk drives that acts as an “early warning system” […]"},{"link":"https://nmac.to/blog/kelir-pro/","image":"https://nmac.to/wp-content/uploads/2018/11/Kelir.Pro_.png","title":"Kelir Pro 1.3 – Color picker, and gradient, and palette generator","content":"Kelir enable you to choose any color from everywhere on your screen using the unique picker with a preview which color you are selecting. Once you pick a color, any code will be available for you to paste it.   As we wanted to make your workflow efficient, we saved every color you picked, you […]"},{"link":"https://nmac.to/blog/bricscad/","image":"https://nmac.to/wp-content/uploads/2018/11/BricsCAD.png","title":"BricsCAD 18.2.27.1 – Building Information Modeling and Mechanical Design","content":"BricsCAD is a software application for computer-aided design. It is the all-in-one solution for 2D, 3D, Mechanical Design and Building Information Modeling. Based on industry-standard DWG, BricsCAD brings a modern yet familiar approach to design on macOS. It’s available in three editions – Classic, Pro and Platinum   Version 18.2.27.1: Release notes were unavailable when […]"},{"link":"https://nmac.to/blog/branding-lab/","image":"https://nmac.to/wp-content/uploads/2018/02/Branding-Lab.png","title":"Branding Lab 3.3.1 – Corporate stationery templates templates for Pages","content":"Develop your professional image and brand identity, save thousands on creative agency fees! Explore a broad range of professionally-designed customizable business stationery templates, easily adapt them to your professional needs!   Branding Lab for Pages offers corporate stationery templates in convenient packs sorted by style and appearance. Every style pack is a comprehensive collection of […]"},{"link":"https://nmac.to/blog/origami/","image":"https://nmac.to/wp-content/uploads/2016/02/Origami.png","title":"Origami 2.8.1 – 3D folding plug-in for Illustrator CS6 or later","content":"Origami is a 3D folding plug-in for Illustrator CS6 or later. It shows your flat 2D die-cuts in 3D with minimal setup. This helps to reduce errors and preview your design in a better way.   Version 2.8.1: Release notes were unavailable when this listing was updated.   Intel, 64-bit processor OS X 10.8 or […]"},{"link":"https://nmac.to/blog/cyberduck/","image":"https://nmac.to/wp-content/uploads/2017/04/Cyberduck4.png","title":"Cyberduck 6.8.2 – FTP and SFTP browser","content":"Cyberduck is a robust FTP/FTP-TLS/SFTP browser for the Mac whose lack of visual clutter and cleverly intuitive features make it easy to use. Support for external editors and system technologies such as Spotlight, Bonjour, Keychain, and AppleScript are built-in.   Cyberduck is an Open Source product licensed under the GPL and free to use. Donations […]"}]