[{"link":"https://nmac.to/blog/gyazmail-1-5-16/","image":"https://nmac.to/wp-content/uploads/2015/04/GyazMail.png","title":"GyazMail 1.5.16 – Alternative email client","content":"GyazMail is an e-mail client that is developed from scratch to be a simple, easy-to-use e-mail client with many features, based on the Cocoa framework. This software will be distributed as shareware (undecided on details at this point).   The main features of GyazMail are as follows: Multiple accounts Management of messages by one file […]"},{"link":"https://nmac.to/blog/battlelore-command-1-0/","image":"https://nmac.to/wp-content/uploads/2015/04/BattleLore.png","title":"BattleLore: Command 1.0 – Epic Fantasy Battles game","content":"Command valiant warriors and vicious demons in BattleLore: Command, based on the board game BattleLore Second Edition. Lead the noble Daqan army as they fearlessly defend their homeland from the invading hordes of the Uthuk Y’llan– demon-blooded barbarians spreading chaos and destruction wherever they go. Or, lead the Uthuk Y’llan and channel their fury into […]"},{"link":"https://nmac.to/blog/superimpose-studio-pro-1-3/","image":"https://nmac.to/wp-content/uploads/2015/04/Superimpose.Studio.Pro_.png","title":"Superimpose Studio Pro 1.3 – Easy to use photos customization software","content":"Superimpose your photos using Superimpose Studio!   Combine photos into professional quality photomontages using our easy to use software. You don’t need expensive software for simple and high quality tools to superimpose your images. Our technology gives you all the professional tools you need.   Easy and Simple “Skip” or press “Next” to read the […]"},{"link":"https://nmac.to/blog/proxifier-2-14-1/","image":"https://nmac.to/wp-content/uploads/2015/04/Proxifier.png","title":"Proxifier 2.14.1 – Access Internet apps via a firewalled/proxied network","content":"Proxifier allows users to access any Internet application via firewalled/proxied network. There are many network applications that do not support working through proxy servers and thus cannot be used behind a LAN or firewall(s). Proxifier solves this problem and gives you the opportunity to work with your favorite software without any restrictions.   With Proxifier […]"},{"link":"https://nmac.to/blog/markdown-plus-1-2-0/","image":"https://nmac.to/wp-content/uploads/2015/04/Markdown.Plus_.png","title":"Markdown Plus 1.2.0 – Efficient markdown editor","content":"Markdown Plus is a lightweight markdown editor. Besides common markdown, GitHub flavored markdown, it also supports task lists, emojis, Font Awesome icons, Ionicons icons, Mathematical formulae, flowcharts, sequence diagrams and gantt diagrams.   Fundamental features GitHub Flavored Markdown (GFM) Realtime preview Fenced code blocks Tables & Alignment Export to PDF Drag & drop to open […]"},{"link":"https://nmac.to/blog/ghosttile-1-1-1/","image":"https://nmac.to/wp-content/uploads/2014/11/GhostTile.png","title":"GhostTile 1.1.1 – Hide your running applications from the dock","content":"GhostTile lets you hide running applications from Dock in multiple ways: Drag & Drop xSelect from /Applications folder Click icon on Dock Per app config to hide or add menubar item Notification for added Apps’ Dock activities   GhostTile also has multiple ways to quick switch back: Click on menubar Call out Quick Switch window […]"},{"link":"https://nmac.to/blog/colorful-word-1-1-2/","image":"https://nmac.to/wp-content/uploads/2015/04/Colorful.Word_.png","title":"Colorful Word 1.1.2 – Powerful and versatile word processor","content":"Colorful Word is a powerful and versatile word processor that create and edit Microsoft Word, Open Document, plain text, rich text, HTML, and other kinds of documents. Colorful Word lets you create, edit, save all kinds of text documents; lets you format your documents as you like; lets you add photo, music or even movie […]"},{"link":"https://nmac.to/blog/subtitles-2-3/","image":"https://nmac.to/wp-content/uploads/2015/03/Subtitles.png","title":"Subtitles 2.3 – Automatically downloads subtitles for your movies and TV shows","content":"Subtitles App is the easiest way to download subtitles, Just drop your videos into Subtitles and let it do its magic. It doesn’t matter if the files don’t have the right name or the format they’re in, Subtitles will always find the right subtitles for your movies and TV shows.   Automatically finds subtitles Just […]"},{"link":"https://nmac.to/blog/astropad-1-0-2/","image":"https://nmac.to/wp-content/uploads/2015/02/Astropad.png","title":"Astropad 1.0.2 – Transform your ipad into a professional graphics tablet","content":"Use the Mac creative tools you know & love, like Photoshop, with the touch experience of your iPad.   Creating Astropad required innovative new technology we call LIQUID. The result is stunning image quality and responsiveness never before seen in similar tools.   LIQUID is true to your source material with color corrected output and […]"},{"link":"https://nmac.to/blog/trapped-dead-lockdown/","image":"https://nmac.to/wp-content/uploads/2015/03/Trapped.Dead_.Lockdown.png","title":"Trapped Dead : Lockdown 1.0 – Fight your way through an interactive horror story","content":"A small American town is overrun by the living dead! You manage to enter the town just before the military locks it down and now you must slice and shoot your way through thousands of zombies in order complete your mission in this action-packed Hack & Slash RPG.   In Trapped Dead: Lockdown, you fight […]"}]