[{"link":"https://nmac.to/blog/cleanmydrive/","image":"https://nmac.to/wp-content/uploads/2017/01/CleanMyDrive.png","title":"CleanMyDrive 2.1.8 – Manage and Clean External Drives","content":"CleanMyDrive lets you maintain your removable drives as easy as never before with CleanMyDrive! It cleans up needless service junk generated by Windows or Mac OS (DS_Store, Thumbs.db, Spotlight, hidden trashes and so on). It also helps you to manage your external drives.   Main Features Clean up drives from junk manually or automatically Eject […]"},{"link":"https://nmac.to/blog/bria/","image":"https://nmac.to/wp-content/uploads/2016/07/Bria.png","title":"BRIA 5.0.2 – SIP softphone client app","content":"Bria is a carrier-grade SIP softphone client that enables you to manage your communications easily from your Mac or Windows laptop. Bria can replace or complement your desk phone, allowing you to make voice and video calls over IP, see if your contacts are available, send messages, and share your screen.   Built on SIP and […]"},{"link":"https://nmac.to/blog/react-studio/","image":"https://nmac.to/wp-content/uploads/2017/09/React-Studio.png","title":"React Studio 1.1.1 – React JS web app using high-level components","content":"What if you could just focus on designing your web user experience?   With React Studio, model your React JS web app using high-level components, concepts and precise vector designs. Use our high-fidelity Sketch importer, or design in place.   Creating modern web apps is not easy — but it just got much less painful. […]"},{"link":"https://nmac.to/blog/xilisoft-video-converter/","image":"https://nmac.to/wp-content/uploads/2014/12/Xilisoft-Video-Converter.png","title":"Xilisoft Video Converter Ultimate 7.8.21 – Powerful Mac Video Converter","content":"Xilisoft Video Converter for Mac is a feature-rich Mac video converter that can convert between virtually all video and audio formats. No longer will you worry about files not being compatible with your devices, Xilisoft Video Converter for Mac makes most media files playable on the iPod, iPhone, iPad, Apple TV, Galaxy, Kindle, HTC One, […]"},{"link":"https://nmac.to/blog/steamworld-dig-2/","image":"https://nmac.to/wp-content/uploads/2017/09/SteamWorld-Dig-2.png","title":"SteamWorld Dig 2 1.1 – A platform mining adventure game","content":"SteamWorld Dig 2 takes you on a platform mining adventure forged in Metroidvania flames. When an old trading town is struck by mysterious earthquakes, it’s up to a lone steambot and her unlikely companion to uncover what trembling terrors lie beneath.   Dig your way underground and explore vivid worlds riddled with treasure, secrets and […]"},{"link":"https://nmac.to/blog/sense-of-the-devil/","image":"https://nmac.to/wp-content/uploads/2017/09/Sense-of-The-Devil.png","title":"Sense of The Devil 1.0.90 – First person horror shooter game","content":"Sense of The Devil is first person horror shooter that confronts players with humanity greatest fears living deep in the forest.   THE SETTING The story is set in medieval times, meaning only some basic weapons are available and majority of the earth is still uncharted.   THE PLOT The story starts when a fellow […]"},{"link":"https://nmac.to/blog/music-streaming/","image":"https://nmac.to/wp-content/uploads/2017/09/Music-Streaming.png","title":"Music Streaming 1.2.1 – Listen to and control your favorite music and stations","content":"Music Streaming is the best Mac desktop client that helps you listen to and control your favorite music and stations with the greatest ease. It’s convenient, beautiful, customizable, and requires NO Adobe Flash Player!   Version 1.2.1: bug fixed.   OS X 10.11 or later, 64-bit processor    "},{"link":"https://nmac.to/blog/plan-your-tasks/","image":"https://nmac.to/wp-content/uploads/2017/09/Plan-Your-Tasks.png","title":"Plan Your Tasks 2.0.2 – To-Do List Manager","content":"Plan Your Tasks is a productivity tool that allows you to capture all your ideas and duties in one place. Manage everything you have to do while working with many different tasks.   Features: Rich customization opportunities Progress simple tracking Arrangement by categories Sorting by name, status and date Color marking and highlighting.   Advantages: […]"},{"link":"https://nmac.to/blog/flame-painter-pro/","image":"https://nmac.to/wp-content/uploads/2016/10/Flame-Painter-3-Pro.png","title":"Flame Painter Pro 3.2 – Procedural painting program","content":"    Flame Painter 3 is a unique paint application that lets you easily create original artwork, light effects, unconventional design or beautiful backgrounds with flame brushes.   Flame Painter was created within ‘I am an Artist’ experimental project. The initial vision was to create an application for professional artists as well as for people […]"},{"link":"https://nmac.to/blog/smart-recorder/","image":"https://nmac.to/wp-content/uploads/2017/09/Smart-Recorder.png","title":"Smart Recorder 1.0.8 – Smart, simple screen recording","content":"Just point Smart Recorder at the movie window and our ‘Smart Record’ option captures your movies like magic!   Smart Recorder provides: Simple to use – fully automated screen and movie recording. Five capture modes – fully automatic through to fully manual. Recording of encrypted video streams – including YouTube, Hulu and Netflix! Recording for […]"}]