[{"link":"https://nmac.to/blog/sketchbook-pro/","image":"https://nmac.to/wp-content/uploads/2017/04/SketchBook-Pro8.png","title":"SketchBook Pro 2021 8.8.0 – Fast and intuitive paint and drawing toolset","content":"SketchBook Pro is a fun and intuitive paint and drawing application, transforming your Mac into an artistic toolkit. With familiar tools designed for professional artists, illustrators, and designers, SketchBook Pro’s easy-to-use interface will help unlock the creativity in everyone.   This is a completely new version of SketchBook Pro and is not available as a […]"},{"link":"https://nmac.to/blog/autocad/","image":"https://nmac.to/wp-content/uploads/2017/05/AutoCAD2017.png","title":"AutoCAD 2021 24.0.46.1748 – Powerful, full-featured version of the 3D design tool","content":"AutoCAD 2019 design and documentation software lets you create stunning designs. Speed documentation and detailing work with productivity tools, and share your work with TrustedDWG technology. Connect your workflow across integrated desktop, cloud, and mobile solutions. Select your CAD design software platform of choice with AutoCAD for Windows or AutoCAD for Mac.   Version 2021 ( […]"},{"link":"https://nmac.to/blog/maya/","image":"https://nmac.to/wp-content/uploads/2016/11/Maya.2017.png","title":"Maya 2019.3 – Professional 3D modeling and animation tool","content":"Maya is an award-winning software and powerful, integrated 3D modeling, animation, visual effects, and rendering solution. Because Maya is based on an open architecture, all your work can be scripted or programmed using a well-documented and comprehensive API (application programming interface), or one of two embedded scripting languages, the Maya Embedded Language (MEL) or Python. […]"},{"link":"https://nmac.to/blog/the-dark-crystal/","image":"https://nmac.to/wp-content/uploads/2020/04/The-Dark-Crystal.png","title":"The Dark Crystal: Age of Resistance Tactics 1.0.496 – Turn-Based Adventure Strategy Game","content":"In The Dark Crystal: Age of Resistance Tactics, you will lead a fledgling resistance of Gelfling against their oppressive overlords, the Skeksis, across more than 50 unique turn-based tactics RPG battles. Along the way, you will recruit and customize new allies by assigning them jobs, modifying their abilities, and outfitting them with equipment to ensure […]"},{"link":"https://nmac.to/blog/midnight/","image":"https://nmac.to/wp-content/uploads/2020/04/Midnight.png","title":"Midnight 2.3.1 – Dark Theme Sketch Plugin","content":"Midnight adds a dark theme to Sketch. Bonus features include layer tags, indent guides, custom selection color, custom canvas darkness, and more.   Advanced Features   Layer Tags Apply colored tags to Layers, Artboards and Pages.   Indent Guides Easily identify how Groups and Layers are nested.   Custom Toolbar Icons Choose to display icons […]"},{"link":"https://nmac.to/blog/weedcraft-inc/","image":"https://nmac.to/wp-content/uploads/2019/04/Weedcraft-Inc.png","title":"Weedcraft Inc 1.3.2 – Management, Strategy & Simulation Game","content":"Weedcraft Inc explores the business of producing, breeding and selling weed in America, delving deep into the financial, political and cultural aspects of the country’s complex relationship with this troublesome and promising plant.   Would-be marijuana moguls will need to prioritize resources carefully as they manage the production and distribution of their weed. Cultivate killer […]"},{"link":"https://nmac.to/blog/iscreen-recorder/","image":"https://nmac.to/wp-content/uploads/2018/12/iScreen-Recorder.png","title":"iScreen Recorder 3.10.1 – Lightweight screen recorder","content":"iScreen Recorder is an easy-to-use, efficient screen recording tool.Using it you can record the full screen, can record custom region. If you require high-quality video, then you only need a simple select recording quality.Enabled the recording equipment if you want to record narration. To increase the personalization of the video if you want by setting […]"},{"link":"https://nmac.to/blog/fonedog-toolkit-for-android/","image":"https://nmac.to/wp-content/uploads/2020/04/FoneDog-Toolkit-for-Android.png","title":"FoneDog Toolkit for Android 2.0.22 – Recover lost data from Android devices","content":"FoneDog Android Data Recovery specializes in recovering deleted contacts (phone numbers, names, emails), text messages (content, phone numbers, sending/received date), and call history (names, phone numbers, call type, duration), WhatsApp (messages/attachments), photos, videos, audio files, and documents from Android devices. If you forget or fail to backup your devices, you can still regain the data. […]"},{"link":"https://nmac.to/blog/retrobatch/","image":"https://nmac.to/wp-content/uploads/2018/08/Retrobatch.png","title":"Retrobatch 1.4 – Flexible, super charged batch image processing","content":"Flexible, super charged, batch image processing for your Mac.   Flexible A node based batch image processor means you can mix, match, and combine different operations together to make the perfect workflow.   Super Charged A node for every operation, from changing DPI to rotation to Machine Learning to custom behaviors with AppleScript. Optimize your […]"},{"link":"https://nmac.to/blog/rar/","image":"https://nmac.to/wp-content/uploads/2020/04/RAR.png","title":"RAR 5.90 – RAR is a powerful terminal based archive utility","content":"RAR is a compression program offering an original algorithm. This new way to compress files provides greater efficiency, and makes smaller archives — especially on multimedia files and archives with many files. RAR also offers self-extracting capabilities as well as disk-spanning (or multi-volumes). RAR is the official RAR archive utility for OS X (offered as […]"}]