[{"link":"https://nmac.to/blog/suite-for-iwork-8-1/","image":"https://nmac.to/wp-content/uploads/2015/06/Suite-for-iWork.png","title":"Suite for iWork 8.1 – Themes for Keynote, Templates for Pages and Numbers","content":"Suite for iWork is a collection of more than 870 templates for Pages, Keynote and Numbers.   700 beautiful templates for Pages documents. 96 static and 25 action themes for Keynote presentations. 50 templates for Numbers. All-in-One app.   Templates for Pages documents.   700 pre-designed and elegant templates for your Pages documents. Whenever you […]"},{"link":"https://nmac.to/blog/yosemiterevert-1-5/","image":"https://nmac.to/wp-content/uploads/2015/06/YosemiteRevert.png","title":"YosemiteRevert 1.5 – Reverts icons and UI elements to those of prior OS X versions","content":"YosemiteRevert changes application icons, system icons (such as the folder icon), menu bar icons, and more, as well as the system font, in OS X 10.10 Yosemite back to the way they were in prior versions of OS X.   Version 1.5: Changes By popular request, YosemiteRevert now allows users to choose which changes to […]"},{"link":"https://nmac.to/blog/flyhunter-origins-1-0/","image":"https://nmac.to/wp-content/uploads/2015/06/Flyhunter.png","title":"Flyhunter Origins 1.0 – Exciting adventure game","content":"Meet Zak; a bumbling alien spaceship Janitor and wannabe Flyhunter. Zak is a “Zursk”- one of three alien species from Burgarol 3. He works on board the Flyhunter Crew’s legendary spaceship; ‘The Frog’ but deep down he longs for an exciting adventure of his own.   Somewhere in Earth’s orbit, while the heroic Flyhunters are […]"},{"link":"https://nmac.to/blog/emulsion-1-1-5/","image":"https://nmac.to/wp-content/uploads/2015/06/Emulsion.png","title":"Emulsion 1.1.5 – Photo library catalog","content":"Emulsion is a new photo catalog app. Emulsion can adjust exposure, colors, and almost everything else. You can also add gradients to your images to darken skies, or even add dust and scratches for a cool retro look. Emulsion can apply adjustments, effects, and metadata changes to one or hundreds of images at once. Want […]"},{"link":"https://nmac.to/blog/annotate-2-0-7/","image":"https://nmac.to/wp-content/uploads/2015/06/Annotate2.png","title":"Annotate 2.0.7 – Screenshot capture and annotation tool (was Glui)","content":"Annotate (was Glui) is the simplest way to capture, annotate and share screenshots.   This is a complete rewrite that builds on what made Glui popular and adds some of the most requested features. It’s way faster, far better, and most importantly, just as simple.   Key features: Capture a screenshot or drag and drop […]"},{"link":"https://nmac.to/blog/adobe-flash-professional-cc-2015-15-0/","image":"https://nmac.to/wp-content/uploads/2014/06/ADOBE-FLASH-PRO-CC.png","title":"Adobe Flash Professional CC 2015 15.0 – Creating advanced interactive content","content":"Flash CC 2015 lets you share work directly from within the application and get access to new features the moment they’re released. Your entire creative world, together in one place. Work faster than ever before with a 64-bit architecture, a new streamlined user interface, and more connected tools. Create HTML content and export high-definition video […]"},{"link":"https://nmac.to/blog/adobe-edge-animate-cc-2015-6-0/","image":"https://nmac.to/wp-content/uploads/2015/06/Adobe.Edge_.Animate.png","title":"Adobe Edge Animate CC 2015 6.0 – Web design tools to add motion to web graphics","content":"Edge Animate gives web designers the tools they need to add motion to web graphics and create interactive content on their sites, while assuring that their designs display consistently across mobile devices, tablets, and modern browsers.   Version 6.0: On-stage text editing: Edit and add styles to text directly on the stage, instead of using […]"},{"link":"https://nmac.to/blog/datum-6-6/","image":"https://nmac.to/wp-content/uploads/2015/05/Datum.png","title":"Datum 6.6 – Full featured SQLite database manager","content":"Datum is a full featured SQLite database manager. It is light weight and blazing fast. It has all the tools to help you be a SQLite master as soon as you launch the app. Instant loading and editing. Fast, powerful, complete. It’s the most powerful SQLite manager in the App Store.   Features include: Easy […]"},{"link":"https://nmac.to/blog/wild-frontera-1-0/","image":"https://nmac.to/wp-content/uploads/2015/06/WildFrontera.png","title":"Wild Frontera 1.0 – Top-down action shooter game","content":"Wild Frontera is a top-down action shooter set in a western-fantasy world   You are a lonesome gunslinger, that will have to get rid of hordes of enemies and defeat spectacular bosses in order to escape to the frontier.   Armed with a rusty six-shooter that you can swap very quickly for new weapons, for […]"},{"link":"https://nmac.to/blog/voilabits-dvdripper-4-1-0/","image":"https://nmac.to/wp-content/uploads/2015/06/Voilabits.DVDRipper.png","title":"Voilabits DVDRipper 4.1.0 – Easily rip and convert DVDs","content":"Voilabits DVDRipper is a reliable and efficient Mac DVD ripping software to decrypt, rip, copy and convert DVDs. It supports almost any format, including HD and MP4, AVI, WMV or FLV to 1080P / 4K HD to iPhone, iPad, Apple TV, PSP, PS3, Xbox, Amazon Tab, etc.   You can also personalize DVD with build-in […]"}]