[{"link":"https://nmac.to/blog/autoprompt/","image":"https://nmac.to/wp-content/uploads/2017/02/AutoPrompt.png","title":"AutoPrompt 1.1 – Keep track of app use and duration","content":"AutoPrompt is a simple menu-bar application which asks you what are you up to from time-to-time. It gives you an intuitive interface to list your tasks and their duration. Just write down your current task whenever it prompts, and you are done. Build your daily worksheet while you work. The very concept of the app […]"},{"link":"https://nmac.to/blog/chemdraw/","image":"https://nmac.to/wp-content/uploads/2015/11/ChemDraw.Professional.png","title":"ChemDraw Professional 16.0.1.4 – Chemists and biologists drawing tool","content":"ChemDraw Professional is the complete drawing tool of choice for chemists and biologists to create publication-ready, scientifically intelligent drawings for use in ELNs, databases and publications and for querying chemical databases, now including SciFinder®.   A single drawing solution that both chemists and biologists can trust to accurately handle and represent organic, organometallic and polymeric […]"},{"link":"https://nmac.to/blog/photo-theater/","image":"https://nmac.to/wp-content/uploads/2016/10/Photo-Theater-Pro.png","title":"Photo Theater Pro 4.5.1 – Slideshow Movie Maker","content":"Photo Theater Pro makes sweet home movies out of your favorite photos, video clips, and music. It is easy-to-use yet powerful. Just add your digital photos and video clips to make lovely home movies with background music for your family and friends. To make your movies more stunning, add subtitles, and transition/theme effects, and share […]"},{"link":"https://nmac.to/blog/pro-evolution-soccer/","image":"https://nmac.to/wp-content/uploads/2016/10/pes2017.png","title":"Pro Evolution Soccer ( PES ) 2017 1.04 – The most advanced football game ever ( Wineskin )","content":"The award winning series returns taking the famed gameplay to a new level by achieving interactive reality in both control and new authentic visuals.   Control Reality in Pro Evolution Soccer 2017 with these new features: Real Touch – Players control the ball in unique ways based on where and how you control them Adaptive […]"},{"link":"https://nmac.to/blog/paws-for-trello/","image":"https://nmac.to/wp-content/uploads/2016/07/Paws-for-Trello1.png","title":"Paws for Trello 2.2.3 – Powerful Trello client for the desktop","content":"Paws for Trello is a beautiful Trello client. It brings Trello to your desktop with native notifications, powerful shortcuts, and more – away from the distractions of your browser.   Features Distraction-free Trello Experience – Paws makes Trello feel right at home on your desktop. Stay productive with a beautiful minimal interface that doesn’t get […]"},{"link":"https://nmac.to/blog/backgammon-masters/","image":"https://nmac.to/wp-content/uploads/2015/10/Backgammon.Masters.png","title":"Backgammon Masters 1.7.5 – Backgammon in medieval style","content":"Backgammon Masters is a wonderfully executed game of backgammon in medieval style. It has very simple and easy to use interface for real fans of this popular board game! Backgammon is one of the oldest board games in the world, beginnings of which date back to more than 5000 years. Despite its old age millions […]"},{"link":"https://nmac.to/blog/karma-incarnation-1/","image":"https://nmac.to/wp-content/uploads/2017/07/Karma.-Incarnation-1.png","title":"Karma. Incarnation 1 1.0 – Multi-award winning adventure & puzzle game","content":"This original adventure game explores a love story between two beautiful souls through ingenious humour and a bizarre, hand-drawn, frame-by-frame animation style. Our hero’s beloved has been abducted by evil spirits, and the only way to reunite them is to reincarnate himself as a dragon to defeat Evil. But something has gone wrong, and his […]"},{"link":"https://nmac.to/blog/diskkeeper/","image":"https://nmac.to/wp-content/uploads/2015/05/DiskKeeper.png","title":"DiskKeeper 1.9.17 – System clean up, find big files, and mass rename your file collections","content":"With DiskKeeper you can clean up your computer, find big files, remove useless languages and rename your file collections.   DiskKeeper is a set of tools that will help you: Clean your junk, log, cache files with ease in order to boost your computer and free up disk space Uninstall apps completely including their leftovers […]"},{"link":"https://nmac.to/blog/serial-cleaner/","image":"https://nmac.to/wp-content/uploads/2017/07/Serial-Cleaner.png","title":"Serial Cleaner 1.0 – 2D stealth & action game","content":"Step into the polished shoes of The Cleaner, a professional crime scene cleaner for the mob. There’s no business like the cleaning business, and right now business is booming…   Sneak around crime scenes avoiding detection from the guarding cops as you vacuum up blood, hide bodies and remove evidence in this 70’s styled, fast […]"},{"link":"https://nmac.to/blog/ultimate-general-civil-war/","image":"https://nmac.to/wp-content/uploads/2017/07/Ultimate-General-Civil-War.png","title":"Ultimate General: Civil War 1.0 – Historical Strategy & Simulation Game","content":"Ultimate General: Civil War is a tactical war-game. Experience the bloodiest period of U.S. history – the American Civil War of 1861-1865.   MAIN FEATURES   Full campaign: Fight in the American Civil War campaign and participate in 50+ battles from small engagements to massive battles that can last several days over hundreds of square […]"}]