[{"link":"https://nmac.to/blog/icona-13/","image":"https://nmac.to/wp-content/uploads/2013/12/icona.175x175-75.jpg","title":"Icona 1.3 – Create your own icons from image","content":"Icona is a simple App that allows you to create icons from image. You can decide to save the icon or apply it to a folder. Is very easy to use. Drag an image into the Icona window and then drag the folder you want to change. Creating icons has never been so easy. not guarantee […]"},{"link":"https://nmac.to/blog/geoexpert-211/","image":"https://nmac.to/wp-content/uploads/2013/12/icon.175x175-7522.jpg","title":"GeoExpert 2.1.1 – World Geography","content":"Have fun learning to identify the countries, capitals and flags of the world!! GeoExpert is unique among games in the App Store due to the fact that it is educational in nature and makes learning fun. Because of this, it is used in various schools to teach geography.   Available also for iPad and iPhone. […]"},{"link":"https://nmac.to/blog/caliander-112/","image":"https://nmac.to/wp-content/uploads/2013/12/Application_Icon.175x175-75.jpg","title":"Caliander 1.1.2 – Create calendar events quickly and with little effort","content":"Caliander is the calendar that lets you create events faster and with less effort while keeping you on top of things with its smart and unique presentation. It uses the same calendar database as iCal, so it syncs with all your devices as usual, and all your events are there – no migration needed! Caliander […]"},{"link":"https://nmac.to/blog/finkit-3212/","image":"https://nmac.to/wp-content/uploads/2013/12/9890.jpg","title":"FinKit 3.2.12 – Multi-function financial calculator","content":"FinKit is a financial calculator that solves all sorts of problems involving the time value of money.   Provides 55 financial calculations: Assets: capitalized cost – classic and MACRS depreciation Bonds: bond book value, price and yield – zero-coupon bond price and yield Dates: term date – date series – year fraction – time between […]"},{"link":"https://nmac.to/blog/kickoff-20/","image":"https://nmac.to/wp-content/uploads/2013/12/icon.175x175-7523.jpg","title":"Kickoff 2.0 – Chat and Tasks for Teams","content":"Kickoff is a real-time chat and task sharing tool designed for small teams. And with its offline support, deep integration with Mountain Lion and lightning fast performance, Kickoff makes your team even more productive. Group Chat• Drag and drop any kind of files• Mention your coworkers (simply using “@name”) to draw their attention• Inline preview […]"},{"link":"https://nmac.to/blog/passlocker-20/","image":"https://nmac.to/wp-content/uploads/2013/12/PassLockerIcon.175x175-75.jpg","title":"PassLocker 2.0 – Securely store your login credentials","content":"PassLocker helps you maintain your login credentials with ease. With stylish looks, tight security, and great features such as auto-login and iCloud sync, it definitely is the best way to manage your login credentials on both OS X and iOS.   Features: Auto-login support (without extension) for the most used web sites (Amazon, Dribbble, eBay, […]"},{"link":"https://nmac.to/blog/flashfrozen-133/","image":"https://nmac.to/wp-content/uploads/2013/12/flashfrozen.175x175-75.png","title":"FlashFrozen 1.3.3 – Menu item kills Flash plug-in in popular browsers","content":"FlashFrozen is a menu item that allows you to quit the Flash plug-in in a browser if a Flash animation is hogged your Mac’s CPU cycles or freezing the loading of Web pages. WHAT’S NEW Version 1.3.3: Improved support for Chromium browsers, including Opera.   REQUIREMENTS Intel, Mac OS X 10.6.6 or later, Safari, Firefox […]"},{"link":"https://nmac.to/blog/izip-27/","image":"https://nmac.to/wp-content/uploads/2013/12/iZip.175x175-75.jpg","title":"iZip 2.7 – Application for managing archives","content":"iZip is the easiest way to manage .ZIP, .ZIPX and .RAR archives on your Mac, and best of all it’s completely free! When you open an archive with iZip it appears as a removable disk. This allows management of your files right inside the OS X Finder, all view modes including cover-flow just work. For […]"},{"link":"https://nmac.to/blog/cities-in-motion-10/","image":"https://nmac.to/wp-content/uploads/2013/12/cities12.png","title":"Cities in Motion 1.0 – Manage and run entire cities in this thrilling simulation game","content":"Cities in Motion (CIM) is a city-based mass transportation simulator for the PC. Players operate their own transportation company, building a public network with a variety of vehicle types, including buses, trams, and subway trains.By meeting the needs of city residents, the player tries to make as much profit as possible.   Observing the changing […]"},{"link":"https://nmac.to/blog/age-of-empires-iii/","image":"https://nmac.to/wp-content/uploads/2013/12/images333.png","title":"Age of Empires III 1.0.6 – Strategy game of conquest and war","content":"Age of Empires ||| is one of the most amazing and legendary civilization style strategy games that ever existed. Now in this third part, you’re taken into the New World. Players are able to develop European nations from the Age of Discovery through to the Industrial Age with Age of Empires III.     There are eight playable nations […]"}]