[{"link":"https://nmac.to/blog/spark-inspector-1-3-1/","image":"https://nmac.to/wp-content/uploads/2014/09/Spark.Inspector.png","title":"Spark Inspector 1.3.1 – Runtime debugger for iOS apps","content":"Spark Inspector is a runtime debugger for iOS.   Features: Monitor & Experiment in Real-time Live Mirroring Experiment at Runtime Use a Device or Simulator See Notifications in Real-time Filtering Understand App Architecture Resend Past Notifications Xcode Integration   Version 1.3.1: A minor update that adds plugin support for the Xcode 6 GM. You can […]"},{"link":"https://nmac.to/blog/photostyler-6-8/","image":"https://nmac.to/wp-content/uploads/2014/09/PhotoStyler.png","title":"PhotoStyler 6.8 – Add a sense of realism to your digital photos","content":"PhotoStyler is the easiest way to style your digital photos with your Mac. This simple, fast and accurate native solution combines the powers of Apple’s core technologies with the flexibility and efficiency of proprietary application-specific modules. PhotoStyler supports all image formats that are supported by MacOS including RAW images.   PhotoStyler doesn’t require any special […]"},{"link":"https://nmac.to/blog/flavours-1-1-15/","image":"https://nmac.to/wp-content/uploads/2014/09/Flavours.png","title":"Flavours 1.1.15 – Create and apply themes to change the appearance of OS X","content":"Flavours is a Mac application that allow users to create, apply and share beautifully designed themes.   Classy Give your Mac a gorgeous new look by applying delicious themes!   Easy Unleash your creativity and make your very own flavour with ease!   Fast Create a new unique flavour in minutes, personalize your Mac in […]"},{"link":"https://nmac.to/blog/antetype-1-6-1/","image":"https://nmac.to/wp-content/uploads/2014/09/Antetype.png","title":"Antetype 1.6.1 – Interface design tool","content":"Antetype UI designer is a brand new, ground-breaking design application that supports user-interface designers at every step of their work. Design beautiful interfaces, invent new widgets, style them, and put it all together in an interactive prototype!   Features: Multiple Looks and Feels: Looks and feels are stored globally in the shared library and can […]"},{"link":"https://nmac.to/blog/appbolish-1-0/","image":"https://nmac.to/wp-content/uploads/2014/09/AppBolish.png","title":"AppBolish 1.0 – Thoroughly uninstall apps","content":"AppBolish is a thorough app uninstallation solution.   Dragging apps to the Trash can leave numerous caches, logs, and support files littered all over the hard drive. This clogs up valuable disk space! Every app is analyzed, after which AppBolish begins to deeply scan the computer for all related items and presents a final list […]"},{"link":"https://nmac.to/blog/hyperpdf-1-1-1/","image":"https://nmac.to/wp-content/uploads/2014/09/HyperPdf.png","title":"HyperPdf 1.1.1 – PDF viewer and note taker","content":"HyperPdf is the new PDF Viewer and note-taker for Mac.   Read PDFs like a book– HyperPDF introduces a unique page-turning interface to read your PDF like real books. Turn pages with swipe gestures. Annotate your files – Add shapes, notes to your PDF. If the text is selectable, you can highlight, underline and strike-through […]"},{"link":"https://nmac.to/blog/acereader-elite-10-0-5/","image":"https://nmac.to/wp-content/uploads/2014/09/AceReader.Elite_.Edition.png","title":"AceReader Elite 10.0.5 – Speed-reading and fluency-assessment tool for all ages","content":"AceReader Elite (was AceReader Pro) lets you double your reading speed. It has been the industry leader for over a decade.   Proven: Picked as the program of choice, and successfully being used by hundreds of learning centers (world wide), the US Air Force Academy, the Joint Chiefs of Staff at the Pentagon plus thousands […]"},{"link":"https://nmac.to/blog/folders-factory-1-8/","image":"https://nmac.to/wp-content/uploads/2014/09/Folders.Factory.png","title":"Folders Factory 1.8 – Change the color of folders","content":"With Folders Factory, you can easily change their colour, add pictures, include text or even make them look like “embossed” system folders.   Doing this will improve your performance and your system’s appearance. You’ll no longer have to read folder names as you can now easily identify the one you need.   The application is […]"},{"link":"https://nmac.to/blog/blogo-2-0-2/","image":"https://nmac.to/wp-content/uploads/2014/08/Blogo.png","title":"Blogo 2.0.2 – Write, publish and manage multiple blogs","content":"Blogo is the easiest and fastest way to write, publish and manage multiple blogs. Blogo gathered features for a powerful solution and helps users to publish and create content easily. It makes it possible to manage multiple blogs at the same time, edit pictures with a built-in image editor, preview your posts on real-time, manage […]"},{"link":"https://nmac.to/blog/youtube-hunter-5-4-9/","image":"https://nmac.to/wp-content/uploads/2014/08/YouTubeHunter.png","title":"YouTube Hunter 5.4.9 – Download and convert YouTube videos","content":"YouTubeHunter is a video downloader and converter.   It takes only seconds to find and download videos from YouTube, Vimeo, DailyMotion, VEVO and others. YouTubeHunter downloads videos 15x faster than real time playing and supports simultaneous downloads. YouTubeHunter has built-in search and preview capabilities. Get video by URL feature is available. YouTubeHunter keeps subtitles for […]"}]