[{"link":"https://nmac.to/blog/kardnote/","image":"https://nmac.to/wp-content/uploads/2017/06/Kardnote1.png","title":"Kardnote 1.0.7 – Note-taking with Markdown","content":"Kardnote aims to provide a daily note-taking tool with the power of Markdown. However, Markdown is optional here; it also has an intuitive rich-text editing mode. In this mode, you even don’t need to know what Markdown is. Kardnote offers a balance of simple and powerful.   Features Switch editor mode between Markdown and an […]"},{"link":"https://nmac.to/blog/vallum/","image":"https://nmac.to/wp-content/uploads/2016/11/Vallum.png","title":"Vallum 2.3.2 – Control app connections to outside sources","content":"Vallum is a little tool that helps you monitor and block application connections. It is able to intercept connections at the application layer, and hold them while you decide whether to pass or block them. Vallum’s interface is very simple and is icon-based. Its default configuration is not intrusive, and it does not require any […]"},{"link":"https://nmac.to/blog/shio/","image":"https://nmac.to/wp-content/uploads/2017/05/Shio.png","title":"Shio 1.2.0 – A challenging platformer game","content":"Shio isn’t your typical platformer. Floating lanterns aren’t just decorations – their purpose is to help you explore the world of “Shio”. Jumping from lantern to lantern should be easy, no? Wrong. You’ll need to harness the best of your wits and dexterity to navigate through this world.   Who is the man under the […]"},{"link":"https://nmac.to/blog/smartplayer/","image":"https://nmac.to/wp-content/uploads/2017/09/SmartPlayer.png","title":"SmartPlayer 1.7 – A simple, easy-to-use media player","content":"Smart Player is a simple, easy-to-use media player.   Features Easy to add and play videos Play videos on desktop, front, or status bar Play in semi-transparent mode Customize aspect ratio settings Increase or decrease playback speed Trim videos and play right away Use shortcuts for most of the settings Share videos via mail right […]"},{"link":"https://nmac.to/blog/tiny-echo/","image":"https://nmac.to/wp-content/uploads/2017/09/Tiny-Echo.png","title":"Tiny Echo 1.0 – Point & Click Casual & Adventure Game","content":"Might and Delight invites you to the ethereal otherworld of Tiny Echo and poses the question – what lives do the little spirits of the undergrowth live?   Take a walk into a never before seen realm and explore a tranquil and mysterious world teeming with shades trying to make it through another daily cycle.   Uncover […]"},{"link":"https://nmac.to/blog/peninsular-war/","image":"https://nmac.to/wp-content/uploads/2017/09/Peninsular-War.png","title":"Peninsular War 1.0 – Advanced strategy wargame","content":"    Peninsular War Battles places you at the forefront of Napoleon’s campaign to conquer Portugal and Spain. Play is possible as the British, French or Spanish across 5 campaigns with a total of 40 missions. Peninsular War Battles is the most advanced wargame from HexWar yet! The missions represent well researched representation of the […]"},{"link":"https://nmac.to/blog/death-point/","image":"https://nmac.to/wp-content/uploads/2017/09/Death-Point.png","title":"Death Point 1.0 – A classic stealth-action game","content":"Death Point is a classic stealth-action, which not only should inspire player but also surprise him. It’s an adventure, filled with excitement and empathy. At first glance, you get almost traditional game, tightly staffed with hard levels and various tasks. Instead you are immersed in a different world, fully associating yourself with the main character. […]"},{"link":"https://nmac.to/blog/the-archive-browser/","image":"https://nmac.to/wp-content/uploads/2016/05/The-Archive-Browser.png","title":"The Archive Browser 1.11.2 – Browse and extract the contents of archives","content":"The Archive Browser is a program that lets you browse the contents of archives, as well as extract them. It will let you open files from inside archives, and lets you preview them using Quick Look.   It is based on The Unarchiver, which means it can handle a large number of different archive formats: […]"},{"link":"https://nmac.to/blog/airstreamer-for-google-chromecast/","image":"https://nmac.to/wp-content/uploads/2017/01/AirStreamer-for-Google-Chromecast.png","title":"AirStreamer 1.2 – for Google Chromecast","content":"Playing online videos from Youtube, Facebook… on Chromecast device is an easy task but playing local videos such as MKV, AVI, WMV… on Chromecast seems to be impossible.   AirStreamer enables playing MKV, AVI, WMV… videos on Chromecast device.   No video conversion, no HDMI cable, no configuration. Just open and enjoy your videos on […]"},{"link":"https://nmac.to/blog/iphoto-library-manager/","image":"https://nmac.to/wp-content/uploads/2016/10/iPhoto-Library-Manager.png","title":"iPhoto Library Manager 4.2.7 – Manage multiple iPhoto libraries and find duplicate photos","content":"iPhoto Library Manager allows you to organize your photos among multiple iPhoto libraries, rather than having to store all of your photos in one giant library. You can browse the photos in all your libraries directly from iPhoto Library Manager, without having to open each library in iPhoto just to see its photos, and search […]"}]