[{"link":"https://nmac.to/blog/gaget-1-1-1/","image":"https://nmac.to/wp-content/uploads/2015/11/GAget.png","title":"GAget 1.1.1 – A simple widget for Google Analyics","content":"GAget lets you check your Google Analytics stats in seconds! Your most important numbers are just a swipe away: GAget puts your Analytics data in the Notification Center.   GAget contains the following information about your profiles: Sessions Users Page views Bounce rate Percent of new visitors Average time on site Top 8 countries your […]"},{"link":"https://nmac.to/blog/new-file-here-2-4/","image":"https://nmac.to/wp-content/uploads/2014/07/New.File_.Here_.png","title":"New File Here 2.4 – Create files easily in any location","content":"New File Here adds a “New File Here” menu item to Finder’s context menu, enabling you to create files easily in any location.   New File Here supports templates now! There are over 30 built-in file templates, and you can also add your own templates!   Creating a new document can be a drawn-out process […]"},{"link":"https://nmac.to/blog/fake-1-8-10/","image":"https://nmac.to/wp-content/uploads/2014/09/Fake.png","title":"Fake 1.8.10 – Browser that simplifies Web automation","content":"Fake is a new browser for Mac OS X that makes web automation simple. Fake allows you to drag discrete browser Actions into a graphical Workflow that can be run again and again without human interaction. The Fake Workflows you create can be saved, reopened, and shared.   Inspired by Apple’s Automator application, Fake looks […]"},{"link":"https://nmac.to/blog/super-denoising-1-2-0/","image":"https://nmac.to/wp-content/uploads/2015/11/Super.Denoising.png","title":"Super Denoising 1.2.0 – Powerful, professional image-noise reduction","content":"Super Denoising is a powerful, professional image-noise reduction app that detects and removes noise, perfect for handling grainy and underexposed digital images. Super Denoising uses advanced smart-denoising technology to quickly and effectively remove noise and improve image quality without disrupting crisp outlines and image colors for clearer, more natural images. Unlike most noise reduction software […]"},{"link":"https://nmac.to/blog/tcpblock-4-2/","image":"https://nmac.to/wp-content/uploads/2013/01/tcpblock.png","title":"TCPBlock 4.2 – Lightweight and fast application firewall ( little snitch alternative )","content":"TCPBlock is a lightweight and fast application firewall for OS X 10.6 or later developed by Jo Delantis. The OS X firewall protects you from connections that come from outside of your computer. But what about the software from your computer that opens new connections to the internet? With TCPBlock you can prevent selected applications […]"},{"link":"https://nmac.to/blog/weather-live-1-9/","image":"https://nmac.to/wp-content/uploads/2015/11/Weather-Live1.png","title":"Weather Live 1.9 – Beautiful weather for multiple locations around the world","content":"Meet Weather Live, the most beautiful weather app. Ever.   Don’t let bad weather take you by surprise! Whether it is cloudy, rainy, snowy, or even stormy outside, Weather Live will provide you with current weather conditions and forecast in your city and multiple locations all around the world. You won’t even have to look […]"},{"link":"https://nmac.to/blog/pagico-7-3/","image":"https://nmac.to/wp-content/uploads/2015/07/Pagico.png","title":"Pagico 7.3 – Manage tasks, notes, and files, and your projects and clients","content":"Store and manage all your tasks, notes, files, projects and contacts in one easy-to-use app. Keeping everything organized and on-track is easier than ever.   Interactive Flowcharts  Its revolutionary flowchart intuitively presents all your schedule data without being overwhelming, helping you to easily and visually stay on track. With the brand-new Stats view, you can […]"},{"link":"https://nmac.to/blog/pixa-1-1-8/","image":"https://nmac.to/wp-content/uploads/2014/01/Pixa.png","title":"Pixa 1.1.8 – Quickly and easily organize your images","content":"Pixa is an image-organizing application. The new app functions well, is easy to use, and helps people organize their images quickly and easily on their computers.   For those who prefer not to use the Pixa library, the application can still find images when the user searches for them. So, either way, Pixa makes it […]"},{"link":"https://nmac.to/blog/lego-jurassic-world-1-0/","image":"https://nmac.to/wp-content/uploads/2015/10/LEGO.Jurassic.World_.png","title":"LEGO Jurassic World 1.0 – Jurassic World in classic LEGO humor","content":"    LEGO Jurassic World is an adventure 65 million years in the making!   Following the epic storylines of Jurassic Park, The Lost World: Jurassic Park and Jurassic Park III, as well as the highly anticipated Jurassic World, LEGO Jurassic World is the first videogame where players will be able to relive and experience […]"},{"link":"https://nmac.to/blog/dungeons-2/","image":"https://nmac.to/wp-content/uploads/2015/10/Dungeons.2.png","title":"Dungeons 2 – A Game of Winter 1.5.1 – RPG, Simulation and Strategy game","content":"Young Barthas Snow of the Northwatch goes forth to search for his lost uncle Banjo beyond the great wall. A difficult journey lies before him, on which he unwittingly awakens an unimaginable evil from a long dead era…   In the major extension A Game of Winter, hordes of undead overrun Dungeons 2 – and […]"}]