[{"link":"https://nmac.to/blog/time-sink/","image":"https://nmac.to/wp-content/uploads/2020/03/Time_Sink_2.png","title":"Time Sink 2.2.3 – Track time spent in each window and app","content":"Time Sink watches how you use your Mac, recording the time spent in each window and program — whether that be foreground orbackground time. You can view and export reports, exclude apps and windows, and group related tasks together into one pool, which is then tracked as a single object. Can be run as a […]"},{"link":"https://nmac.to/blog/wonderbox-the-adventure-maker/","image":"https://nmac.to/wp-content/uploads/2021/04/Wonderbox.png","title":"Wonderbox The Adventure Maker 1.5.0 – Endless adventures await","content":"Creating and exploring are the essence of Wonderbox, an action-adventure game set in beautiful dioramas. Discover this ever-expanding universe with your friends and family, where you can make and share your own adventures.   SEVEN WONDERS OF THE GAME   1 – The Adventures Accept the call, and your journey is set: to have fun! […]"},{"link":"https://nmac.to/blog/fantasian/","image":"https://nmac.to/wp-content/uploads/2021/07/FANTASIAN.png","title":"FANTASIAN 2.0.0 – A Diorama Adventure RPG","content":"Fantasian by Mistwalker Corp. — From the creator of Final Fantasy, comes the next breathtaking adventure from industry legend Hironobu Sakaguchi. Fantasian is an exciting, new RPG set against a spectacular backdrop made from over 150 handmade dioramas that blends physical environments and 3D characters.   STORY The tale begins in a realm governed by […]"},{"link":"https://nmac.to/blog/phonerescue/","image":"https://nmac.to/wp-content/uploads/2016/11/PhoneRescue.png","title":"PhoneRescue 4.2.0 – iOS data recovery program","content":"PhoneRescue is an ultimate iOS data recovery program designed for retrieving your lost photos, messages, contacts, notes and more on your iPhone, iPad and iPod touch. Also it can repair an iDevice from any iOS crash error.   Features Focuses on analyzing and recovering the most important 25 types of iOS content Recovers data and […]"},{"link":"https://nmac.to/blog/chronicle/","image":"https://nmac.to/wp-content/uploads/2017/06/Chronicle8.png","title":"Chronicle Pro 9.8.1 – Manage your billing cycles and payments","content":"If you pay bills, you need Chronicle. It gives you the peace of mind of never having to worry about whether you paid a bill again.   Even if you use another finance application for general finance, you need Chronicle. One late payment can wreak havoc on your credit score, leading to higher interest rates […]"},{"link":"https://nmac.to/blog/butler/","image":"https://nmac.to/wp-content/uploads/2015/12/Butler.png","title":"Butler 4.4.4 – Hot key, menu, and keyword launcher","content":"Butler makes it easier for you to perform a wide variety of potentially recurring tasks. Just arrange these tasks in Butler’s fully customizable configuration and assign one or more triggers to a task.   Available Triggers freely configurable system-wide menus in your menu bar/Butler’s docklet freely configurable pop-up menus — triggered via hot key or […]"},{"link":"https://nmac.to/blog/adobe-photoshop-elements/","image":"https://nmac.to/wp-content/uploads/2016/08/Adobe.Photoshop.Elements.png","title":"Adobe Photoshop Elements 2022 – Consumer photo editor/organizer","content":"Adobe Photoshop Elements–the #1 selling consumer photo editing software–helps you edit pictures with powerful, easy-to-use options and share them via print, the web, Facebook, and more.   Version 2022: Release notes were unavailable when this listing was updated.   Intel, 64-bit processor macOS 10.14 or later    "},{"link":"https://nmac.to/blog/adobe-premiere-elements/","image":"https://nmac.to/wp-content/uploads/2016/10/Adobe-Premiere-Elements.png","title":"Adobe Premiere Elements 2022 – Consumer video-editing software","content":"Adobe Premiere Elements just got better. Now you can create quick movies from favorite parts of your clips or tell big life stories in full-on productions. Add motion inside movie titles, punch up the drama with cool focus effects, and get guidance as you go.   Features Transform your videos – Make quick movies your […]"},{"link":"https://nmac.to/blog/winzip/","image":"https://nmac.to/wp-content/uploads/2017/10/WinZip6.png","title":"WinZip 9.0.5554 – Mac edition of established compression utility","content":"WinZip combines cutting-edge compression and strong AES encryption into a simple, Mac-friendly design. Now you can zip and encrypt files for swifter, safer sharing and significantly smaller storage – all with an easy-to-use Mac zip tool made just for you!   As the world leader in file compression technology with over 20 years of expertise […]"},{"link":"https://nmac.to/blog/calligraphic-fonts/","image":"https://nmac.to/wp-content/uploads/2021/01/Calligraphic_Fonts_2_.png","title":"Calligraphic Fonts 2.13 – Font edit software","content":"12 calligraphic fonts of all periods, from traditional middle ages Uncial and BlackLetters through Modern Chancery and contemporaryGrandBes.   View each font, play with it and install it in a couple clicks. Use calligraphy in your favorite application without need for any special training or commands.   Type, it calligraphs. Perfect for invitations, postcards, weddings, […]"}]