[{"link":"https://nmac.to/blog/image2icon/","image":"https://nmac.to/wp-content/uploads/2020/03/Image2icon_2.png","title":"Image2Icon 2.17 – Convert images to .icns files","content":"Image2icon (was img2icns) is the easiest way to create your own mac icons and customize your folders and files. Image to Icon Conversion – It’s easy as pie: drop an image to Image2icon, then drop a file or folder apply the icon. Icon Templates – Unleash your creativity! Choose between 20+ Retina-ready templates and apply […]"},{"link":"https://nmac.to/blog/mediahuman-video-converter/","image":"https://nmac.to/wp-content/uploads/2021/01/MediaHuman-Video-Converter.png","title":"MediaHuman Video Converter 1.3 – Quickly convert video files between popular formats","content":"MediaHuman Video Converter is designed to make your life easier when you need to convert your videos from one format to another or change its quality and size to fit storage space of your portable device. It supports most common video formats such as Audio Video Interleaved (AVI), Digital Video, DVD Video, Flash Video, H.264/MPEG […]"},{"link":"https://nmac.to/blog/dvd-cloner/","image":"https://nmac.to/wp-content/uploads/2020/12/DVD_Cloner_8.png","title":"DVD-Cloner 9.10 – Copy/clone/burn DVD movies on Mac","content":"DVD-Cloner for Mac 5 is the up-to-the-minute generation of the top DVD copy software for Mac worldwide. It enables you to copy/clone/burn DVD movies on Mac with lossless quality. The brand-new interfaces make DVD copy for Mac much easier than before. Besides, it can remove various DVD copy protections such as CSS, RE, RCE and […]"},{"link":"https://nmac.to/blog/the-clock/","image":"https://nmac.to/wp-content/uploads/2020/11/The_Clock_4.png","title":"The Clock 4.6.4 – System clock enhancement, with multiple time zones","content":"The Clock is a premium world clock with the following features: Keep track, easily and efficiently of your contacts in different time zones. Have a quick view on a Calendar, which can be integrated with the system Calendar.app Easily setup meetings with the Meeting Planner. Have a highlight on the Business Hours and Holidays of […]"},{"link":"https://nmac.to/blog/amadeus-pro/","image":"https://nmac.to/wp-content/uploads/2016/09/Amadeus-Pro.png","title":"Amadeus Pro 2.8.9 – Multitrack sound recorder/editor with MP3 support","content":"Amadeus Pro lets you use your Mac computer for any audio-related task, such as live audio recording, digitizing tapes and records, converting between a variety of sound formats, etc. Thanks to its outstanding direct-to-disk abilities and waveform caching, edits on arbitrarily large sounds (even beyond the usual 2GB limit) are performed at lightning speed. The […]"},{"link":"https://nmac.to/blog/typora/","image":"https://nmac.to/wp-content/uploads/2021/12/Typora.png","title":"Typora 1.2.4 – Minimalist Markdown editor","content":"Typora gives you a seamless experience as both a reader and a writer. It removes the preview window, mode switcher, syntax symbols of markdown source code, and all other unnecessary distractions, replacing them with a real-time preview to help you concentrate on the content itself.   Features: Markdown support including tables, code fences with syntax […]"},{"link":"https://nmac.to/blog/middle/","image":"https://nmac.to/wp-content/uploads/2020/11/Middle_1.png","title":"Middle 1.7.4 – Adds the middle click to your trackpad or Magic Mouse","content":"Middle simply adds the middle click to your Mac for your trackpad or Magic Mouse   Select from the following gestures Click with three fingers (trackpad or Magic Mouse) Tap with three fingers (trackpad or Magic Mouse) Force touch with one finger on a force touch compatible trackpad Click with one finger in the center […]"},{"link":"https://nmac.to/blog/monodraw/","image":"https://nmac.to/wp-content/uploads/2022/03/Monodraw_1_.png","title":"Monodraw 1.6 – Powerful ASCII art editor","content":"Monodraw allows you to easily create text-based art (like diagrams, layouts, flow charts) and visually represent algorithms, data structures, binary formats and more. Because it’s all just text, it can be easily embedded almost anywhere.   A picture is worth a thousand words. A diagram is probably worth twice as much. Enhance your technical documentation […]"},{"link":"https://nmac.to/blog/past-for-ichat/","image":"https://nmac.to/wp-content/uploads/2022/03/Past-for-iChat.png","title":"Past for iChat 1.2.6 – Open and view old chat log files","content":"Past for iChat is a little application to open and view old chat log files created by Apple’s iChat application (.ichat and .chat files) on macOS Big Sur, Monterey and later. iChat was the predecessor of the new and improved Messages app.   Starting with macOS Big Sur the refreshed Messages application doesn’t support opening […]"},{"link":"https://nmac.to/blog/victory-at-sea-pacific/","image":"https://nmac.to/wp-content/uploads/2014/08/Victory-At-Sea-Pacific.png","title":"Victory At Sea Pacific 1.11.2 – World War II naval combat game","content":"Victory at Sea Pacific – the game of naval combat during the Second World War where a player can switch between commanding the entire Pacific theatre to zooming down to take control of individual ships and flights of planes.    Fire the torpedoes from your submarine wolf pack or step onto the Bridge to direct […]"}]