[{"link":"https://nmac.to/blog/radium-3-0-7/","image":"https://nmac.to/wp-content/uploads/2014/03/Radium.png","title":"Radium 3.0.7 – Multi-network radio player","content":"Radium is an Internet radio player that’s designed from the ground up to be simple, intuitive, and lightweight. With its powerful search, thousands of supported stations (including Sirius/XM and DI.fm/Sky.fm Premium), and the ability to add your own streams, Radium will change the way you listen to Internet radio.   Version 3.0.7: Radium can now […]"},{"link":"https://nmac.to/blog/photoscan-pro-1-0-4/","image":"https://nmac.to/wp-content/uploads/2014/04/PhotoScan.png","title":"PhotoScan Pro 1.0.4 – Builds textured 3D models using digital photos","content":"PhotoScan Pro is 3D reconstruction software that automatically builds textured 3D models using digital photos of the scene. It allows for precise textured mesh models reconstruction. The program provides robust photo alignment, no coded targets or special shooting conditions are required.   Features: Photo alignment Point cloud generation (sparse / dense) Polygonal model generation Texture […]"},{"link":"https://nmac.to/blog/designs-for-mail-1-9/","image":"https://nmac.to/wp-content/uploads/2014/02/Designs.for_.Mail_.png","title":"Designs for Mail 1.9 – 100+ beautiful templates for Apple’s Mail","content":"Designs for Mail brings you a diverse collection of templates for creating customized email messages in Apple Mail.    Choose a lively seasonal template for a family newsletter. Or select a sharp, sophisticated design for a business proposal. Designs for Mail’s selection is constantly expanding, so you’ll always have access to the latest templates.   […]"},{"link":"https://nmac.to/blog/contact-alerts-for-skype-1-1/","image":"https://nmac.to/wp-content/uploads/2014/04/Contact.Alerts.for_.Skype_.png","title":"Contact Alerts for Skype 1.1 – Online contact alert notification app for Skype","content":"Contact Alerts for Skype is the leading online contact alert notification app for Skype on Mac OSX.   Trust Contact Alerts to ensure you never miss an opportunity to connect with your selected Skype contacts again.   UNIQUE FEATURES Configure online alerts for your Skype contacts on a user by user basis Now also provides […]"},{"link":"https://nmac.to/blog/briefs-1-2-5/","image":"https://nmac.to/wp-content/uploads/2014/04/Briefs.png","title":"Briefs 1.2.5 – Create mobile interactive design prototypes","content":"Briefs is the essential app design tool built for a professional design workflow. Lifeless mockups don’t tell the entire story, but you don’t have time to build a prototype. We’ve been there, too. Your clients needed a clearer picture, so give them something to touch.   With Briefs, you can deliver iterations of your design […]"},{"link":"https://nmac.to/blog/wondershare-pdf-editor-pro-3-6-0/","image":"https://nmac.to/wp-content/uploads/2014/04/PDF-Editor-Pro.png","title":"Wondershare PDF Editor Pro 3.6.0 – Edit and enhance your PDFs","content":"Wondershare PDF Editor Pro allows you to edit PDF files effortlessly. It’s easy to correct mistakes and typos in original PDF: just use the Touchup Tool to select the text you want to edit, and double click on the text blocks, you can easily correct mistakes and typos.   Main features of PDF Editor Pro: […]"},{"link":"https://nmac.to/blog/chocolat-2-3/","image":"https://nmac.to/wp-content/uploads/2014/01/Chocolat.png","title":"Chocolat 2.3 – Native Cocoa text editor","content":"Chocolat is a new text editor that combines native Cocoa with powerful text editing tools.    Features: Split editing Code completion Live errors Folding Symbol list Blockedit Vim mode Jump to definition Project find Go to file Web preview Documentation   Version 2.3: Feature: Git support in the source list! Note: JSHint now shows error […]"},{"link":"https://nmac.to/blog/quickwho-5-1-0/","image":"https://nmac.to/wp-content/uploads/2014/04/QuickWho.png","title":"QuickWho 5.1.0 – Graphical interface to the Unix whois tool","content":"QuickWho provides a rich array of information about specific Internet domains that surpasses other command-line, GUI or web-based “whois” tools. Are you curious about who owns a particular domain name? Do you want to contact them, or gather more information about them? QuickWho can help you with these tasks.   Why QuickWho? Simple, pleasant-to-use interface. […]"},{"link":"https://nmac.to/blog/packetstream-6-1-0/","image":"https://nmac.to/wp-content/uploads/2014/04/PacketStream.png","title":"PacketStream 6.1.0 – Easy way to configure/use Apple network monitoring tools","content":"PacketStream provides point-and-click activation of the Mac’s built-in network monitoring program, which is usually available only from the command line. By clicking a few buttons, you can monitor data as it streams over your network–especially useful for checking Web traffic, network bottlenecks, or even suspicious network activity. All network data is displayed in the application […]"},{"link":"https://nmac.to/blog/deskscribble-1-1-2/","image":"https://nmac.to/wp-content/uploads/2014/04/Deskscribble.png","title":"Deskscribble 1.1.2 – Draw and scribble on top of the desktop and windows","content":"Deskscribble not only allows you to draw on top of your desktop and ontop of all open windows, it is also an easy to use whiteboard, blackboard and you can even use it for your own and your kids’ scribbles.   Deskscribble is perfect for: Presentations Visual demonstrations Desktop highlighting Annotations Writing notes Scribbles Kids […]"}]