[{"link":"https://nmac.to/blog/design-your-collage/","image":"https://nmac.to/wp-content/uploads/2021/01/Design-Your-Collage.png","title":"Design Your Collage 1.1.1 – Make Photo Collages","content":"Create FUNNY and ASTONISHING collages in Design Your Collage in several seconds!   LOOK THROUGH THIS GREAT AMOUNT OF FRAMES and choose the one you want to use set the size and orientation of the frame choose the layout setting for several frames   DOZENS OF BACKGROUNDS TO YOUR TASTE choose and set the most […]"},{"link":"https://nmac.to/blog/wifiner/","image":"https://nmac.to/wp-content/uploads/2017/12/Wifiner.png","title":"Wifiner 1.3.191 – Wi-Fi analyzer","content":"Wifiner allows you to analyze and troubleshoot your Wi-Fi network connection just in a few clicks. Load your own map or choose one of the samples, point to where you are on the map and Wifiner starts measuring wireless signal right away. Run a survey by walking around the space you wish to scan and […]"},{"link":"https://nmac.to/blog/vezer/","image":"https://nmac.to/wp-content/uploads/2019/04/Vezer.png","title":"Vezer 1.8.9 – Timeline and control software for audiovisual artists","content":"Vezér enables control of realtime video software, lighting setups, and any MIDI, OSC, or DMX-enabled environments, through the use of timeline based MIDI, OSC, and DMX automations.   Version 1.8.9: New Features: Synchronized start of multiple audio files in the same Composition /vezer/compname/playhead now accepts time in hh:mm:ss:ff format too Fixed BPM sync may accidentally […]"},{"link":"https://nmac.to/blog/ssdreporter/","image":"https://nmac.to/wp-content/uploads/2016/02/SSDReporter.png","title":"SSDReporter 1.5.7 – Health-check for solid-state drives","content":"SSDReporter is an application that checks the health of your internal solid state drives (“SSD” aka “Flash Storage”). Since SSDs have a limited life-time determined by the number of write operations, it is important to keep an eye on your SSD status. SSDReporter can warn you by e-mail or on-screen each time the health of […]"},{"link":"https://nmac.to/blog/keycue/","image":"https://nmac.to/wp-content/uploads/2016/06/KeyCue.png","title":"KeyCue 9.9 – Displays all menu shortcut commands","content":"KeyCue has always been a handy tool for learning and remembering keyboard shortcuts. With a simple keystroke or click, KeyCue displays a table with all available keyboard shortcuts, system-wide hotkeys, as well as key combinations for triggering macros in Keyboard Maestro, QuicKeys and iKey. But KeyCue 8.0 contains a bunch of new features that take […]"},{"link":"https://nmac.to/blog/copy/","image":"https://nmac.to/wp-content/uploads/2021/01/Copy_plus.png","title":"Copy+ 1.1.2 – Manage clipboard history","content":"The original “CopyCopy” mode eliminates useless data. Favorite URL: CopyCopy. Favorite picture: CopyCopy. Favorite chat history: CopyCopy.   Of course, we also support Copy to record data once.   Hot Key “Command+C” Copy history to Clipboard again. “Backspace” Delete history. Clipboard history Two original save modes: copy once, continuously copy twice Automatically save your clipboard […]"},{"link":"https://nmac.to/blog/tenorshare-4ukey/","image":"https://nmac.to/wp-content/uploads/2018/12/Tenorshare-4uKey.png","title":"Tenorshare 4uKey 2.3.2 – Unlock iPhone/iPad Locked Screen in Minutes","content":"No matter it is a 4-digit /6-digit passcode, custom numeric code, alphanumeric passcode, Touch ID or Face ID, Tenorshare 4uKey is capable of removing it in a few minutes.   Want to factory reset but the iPhone is locked? 4uKey enables you to restore factory resetting without a password.   ByPass iPhone/iPad Screen Passwords Instantly […]"},{"link":"https://nmac.to/blog/charrua-soccer/","image":"https://nmac.to/wp-content/uploads/2021/01/Charrua-Soccer.png","title":"Charrua Soccer 4.01 – Retro Soccer Reimagined","content":"You can play single player (player VS computer), two players (player VS player), or Competitions.   Play Modes: Friendly Match Competitions Penalty Match Party Tournament The supported competitions are: Global Cup American Cup European Cup Women’s Global Cup Global Cup 1930 (evoking the first international cup with a retro look) Charrua Cups (men and women) […]"},{"link":"https://nmac.to/blog/tangle-tower/","image":"https://nmac.to/wp-content/uploads/2021/01/Tangle-Tower.png","title":"Tangle Tower 1.2 – A murder mystery adventure","content":"Unravel a thrilling mystery by exploring a strange and twisted mansion, discovering curious clues, interrogating peculiar suspects and solving unique puzzles.   Freya Fellow has been murdered. The lead suspect? A shadowy figure found looming over her body, wielding a knife. The problem? That suspect… is just a painting.   Investigate the entirety of Tangle […]"},{"link":"https://nmac.to/blog/word-laces/","image":"https://nmac.to/wp-content/uploads/2021/01/Word-Laces.png","title":"Word Laces 2.1.4 – Solve puzzles. Collect shoes.","content":"Word Laces is a word puzzle game about associations, connotations, and collecting shoes.   Every picture tells a story, find the meaning and solve the puzzle. Just swipe to lace up words, it’s simple and satisfying!   Each level presents you with an image and a set of jumbled letters. Your task is to find […]"}]