[{"link":"https://nmac.to/blog/launchmagic-5-0-0/","image":"https://nmac.to/wp-content/uploads/2015/01/LaunchMagic.png","title":"LaunchMagic 5.0.0 – Robust application launching utility","content":"LaunchMagic (was F10 Launch Studio) is the premier launch management suite for OS X. The fastest way to open applications, documents, and folders. Its one-of-a-kind design delivers an extraordinarily fast and efficient way to open applications, documents, and folders. It will literally change the way you use your computer.   Version 5.0.0: New Special non-fullscreen […]"},{"link":"https://nmac.to/blog/jsking-1-5-1/","image":"https://nmac.to/wp-content/uploads/2015/03/JSKing.png","title":"JSKing 1.5.1 – Edit and run JavaScript code with just one click","content":"JSKing lets you edit and run JavaScript code right away with just one click. Take advantage of the built-in components: JavaScript-interpreter: no additional tools required to evaluate the JavaScript-Code! Debugger for easy to find all logical errors in your algorithms! CodeCompressor: removes the comments and white spaces, reducing the file size and minimizing the loading […]"},{"link":"https://nmac.to/blog/iquickmark-1-4-2/","image":"https://nmac.to/wp-content/uploads/2015/03/iQuickMark.png","title":"iQuickMark 1.4.2 – Measure your computer performance","content":"iQuickMark measures your computer performance and scalability (processor, memory, disk, OS etc.) and compares it with other models.   iQuickMark provides an easy way to measure quickness of your computer and it’s components and compare it with latest models available.   It benchmarks the most important from user experience perspective aspects such as Processor, Memory, […]"},{"link":"https://nmac.to/blog/apowersoft-video-downloader-1-4-7/","image":"https://nmac.to/wp-content/uploads/2015/03/Apowersoft.Video_.Downloader.png","title":"Apowersoft Video Downloader 1.4.7 – Video downloader for tons of video websites","content":"Apowersoft Video Downloader for Mac is specially designed for Mac users to download online videos from tons of video websites, such as YouTube, Vimeo, Dailymotion, Veoh, Facebook, Blip TV, Hulu, Metacafe, Liveleak, etc. Using this Mac video downloader, you are able to download all videos in whatever format, including MP4, WMV, FLV, 3GP, MOV, WebM […]"},{"link":"https://nmac.to/blog/playonmac-4-2-6/","image":"https://nmac.to/wp-content/uploads/2015/01/PlayOnMac.png","title":"PlayOnMac 4.2.6 – Run Windows apps on your Mac","content":"PlayOnMac is like wineskin, winebottler or crossover a piece of sofware which allows you to easily install and use numerous games and softwares designed to run with Microsoft’s Windows.Interesting points to know: You don’t have to own a Windows license to use PlayOnMac. PlayOnMac is based on Wine, and so profits from all its possibilities […]"},{"link":"https://nmac.to/blog/oddworld-new-n-tasty-2-0-0-2/","image":"https://nmac.to/wp-content/uploads/2015/03/Oddworld.New_.n.Tasty_.png","title":"Oddworld New ‘n’ Tasty 2.0.0.2 – Contemporary puzzle-platformer game","content":"Explore ancient ruins, dodge carnivorous beasts and avoid trigger-happy guards as Abe, the original Oddworld hero in this lovingly recrafted take on the classic adventure “Abe’s Oddysee”.   Once a happy floor waxer in Oddworld’s biggest meat processing plant, Abe stumbles across his boss’s secret plan to turn the factory’s slave labor force into the […]"},{"link":"https://nmac.to/blog/never-alone-1-0/","image":"https://nmac.to/wp-content/uploads/2015/03/never-alone.png","title":"Never Alone 1.0 – Atmospheric puzzle & adventure game","content":"On over 50 “Best of 2014” lists, from Eurogamer to PC Gamer, from the L.A. Times to the New Yorker. Nominated for awards from DICE, GDC, SXSW, BAFTA, IndieCade, and more. The whole world has discovered and fallen in love with Never Alone (Kisima Ingitchuna) — the first game developed in collaboration with the Iñupiat, […]"},{"link":"https://nmac.to/blog/cradle-of-rome-2-premium-1-6-1/","image":"https://nmac.to/wp-content/uploads/2015/03/Cradle.Of_.Rome_.2.Premium.png","title":"Cradle of Rome 2 Premium 1.6.1 – Match-3 game set in the Roman Empire","content":"Conquer 100 intuitively designed levels by swapping tiles and matching three or more in a row. Use the chance to build Ancient Rome, the most legendary city of all time!   Rome, the most powerful and beautiful capital on the seven hills, invites you to become its emperor! In this most addictive match-3 game, you […]"},{"link":"https://nmac.to/blog/calcbot-1-0-1/","image":"https://nmac.to/wp-content/uploads/2015/02/Calcbot.png","title":"Calcbot 1.0.1 – Intelligent calculator and unit converter","content":"Calcbot is an intelligent calculator and unit converter for the rest of us. Featuring an easy-to-read history tape, expression view, intuitive conversion, and much more!   Features History Tape – Every calculation you enter gets saved to the history tape and optionally sent to your clipboard for quick pasting. Refer to calculations later or send […]"},{"link":"https://nmac.to/blog/zipster-1-0-4/","image":"https://nmac.to/wp-content/uploads/2015/03/Zipster.png","title":"Zipster 1.0.4 – Treat Zip files like folders","content":"Zipster makes life with Zip archives better. Ever been envious of the way Windows users can just browse into Zip files, copy files in and out of them with ease and all without running a Zip utility? With Zipster, your Zip files are just like another folder in Finder. And, even better than Windows, you […]"}]