[{"link":"https://nmac.to/blog/tuba-1-2/","image":"https://nmac.to/wp-content/uploads/2013/12/MacIcon.175x175-752.jpg","title":"Tuba 1.2 – Super fast and elegantly designed YouTube app","content":"Tuba is a super fast and elegantly designed YouTube app for your beloved Mac   Why use Tuba app instead of youtube.com? 1) The app is blazing fast compare with the website.Everything is much faster. 2) Better design: more content, no clutter. 3) Save 50% battery. Tuba only uses half the power compare with youtube.com, […]"},{"link":"https://nmac.to/blog/hq-photo-enlarger-1-68/","image":"https://nmac.to/wp-content/uploads/2013/12/mzi.wvdzyysb.175x175-75.jpg","title":"HQ Photo Enlarger 1.68 – Innovative image enlargement","content":"The program offers an innovative image enlargement algorithm which results in perfectly smooth and crisp edges. And it can simulate the texture and film grain which keep photos looking natural even in extreme enlargements.HQ Photo Enlarger beats any of the alternative solutions, such as Photoshop’s Bicubic technique, Bilinear methods, and so-called ‘industry standards’. Features: • […]"},{"link":"https://nmac.to/blog/face-for-facebook-2-3/","image":"https://nmac.to/wp-content/uploads/2013/12/Face_for_Facebook_icon.175x175-75.jpg","title":"Face for Facebook 2.3 – Access Facebook from your menu bar","content":"Share and stay connected with your friends with Facebook. Face for Facebook helps you connect with your friends and share on the go. Rest you already know… Please enjoy with Love…   WHAT’S NEW Version 2.3: Improved the layout and added some more features…   REQUIREMENTS OS X 10.6.6 or later ScreenShots :     […]"},{"link":"https://nmac.to/blog/copyless-1-7-7/","image":"https://nmac.to/wp-content/uploads/2013/12/AppIcon.175x175-7512.jpg","title":"CopyLess 1.7.7 – Store and access up to 100 clipboard items","content":"CopyLess is an advanced and flexible clipboard manager. Unlike the system clipboard CopyLess can store up to 100 items to which you have instant access at any time. With CopyLess is no longer necessary to switch constantly between different applications or windows just to copy and paste several different items. Everything can now be copied […]"},{"link":"https://nmac.to/blog/lamoji-1-2/","image":"https://nmac.to/wp-content/uploads/2013/12/Lamoji.175x175-75.jpg","title":"Lamoji 1.2 – Insert emojis into your text","content":"Lamoji is an application that lets you easily insert emojis into your text. Use them to make your messages more colorful and more fun! Features: Add emoijs to your text Fast access Lamoji orders the emojis by usage Simple, clean and easy Tips: Only macs with Lion and iOS devices are able to use emojis […]"},{"link":"https://nmac.to/blog/porthole-1-3-0/","image":"https://nmac.to/wp-content/uploads/2013/12/423741.jpg","title":"Porthole 1.3.0 – AirPlay all audio to multiple speakers","content":"Porthole is a tool that lets you stream the music from your favorite music player such as Spotify or Pandora to your Airplay speakers, Apple AirPort Express and Apple TV. Porthole focuses on being elegant and simple to use. The setup wizard will have you going in no-time. De-cable your living room and start enjoying wireless […]"},{"link":"https://nmac.to/blog/tuba-1-1/","image":"https://nmac.to/wp-content/uploads/2013/12/MacIcon.175x175-753.jpg","title":"Tuba 1.1 – Super fast and elegantly designed YouTube app","content":"Tuba is a super fast and elegantly designed YouTube app for your beloved Mac   Why use Tuba app instead of youtube.com? 1) The app is blazing fast compare with the website.Everything is much faster. 2) Better design: more content, no clutter. 3) Save 50% battery. Tuba only uses half the power compare with youtube.com, […]"},{"link":"https://nmac.to/blog/sparkbox-1-2/","image":"https://nmac.to/wp-content/uploads/2013/12/Sparkbox.175x175-75.jpg","title":"Sparkbox 1.2 – Smart web image capture application","content":"Sparkbox helps you manage images for design projects. Unlike iPhoto, it catalogues all of your images, not just the photographs you’ve taken yourself. Sparkbox is a tidy and easily navigable image library for your Mac, perfect for designers looking to organize their image collections and find sources of visual inspiration.   Features: Drag-and-drop functionality, menu […]"},{"link":"https://nmac.to/blog/icollage-pro-1-1/","image":"https://nmac.to/wp-content/uploads/2013/12/icollagepro.175x175-751.jpg","title":"iCollage Pro 1.1 – Stylish collage creation","content":"iCollage Pro allows you to easily create collages on your Mac! You can bring together your best pictures of your fondest memories in one stunning image! iCollage Pro allows you to have complete creative control of your collage! After choosing the pictures you want to collage, you have several editing options. You have the ability to […]"},{"link":"https://nmac.to/blog/algodoo-2-1-0/","image":"https://nmac.to/wp-content/uploads/2013/12/AlgodooLogo.175x175-75.jpg","title":"Algodoo 2.1.0 – 2D physics sandbox where you can play with physics like never before","content":"Become an inventor with Algodoo – Start designing and testing your ideas in seconds. Algodoo is endless fun for any age to create, play & learn physics! In a simulated “real” world you can build, play and make your inventions come alive. With simple drawing tools, objects like gears, motors, lasers, springs, ropes, and even […]"}]