[{"link":"https://nmac.to/blog/ramdisk-manager-1-1/","image":"https://nmac.to/wp-content/uploads/2014/06/RAMDisk.Manager.png","title":"RAMDisk Manager 1.1 – Easily create, manage, and monitor RAM disks","content":"RAMDisk Manager allows you to easily create, manage, and monitor RAM disks. RAM Disks are special devices created in Random Access Memory (RAM) which can be used as normal drives to speedup the work on huge documents (pictures, movies, etc…) and prevent hard disks (HD) and solid state drives (SSD) unnecessary read/write when some system […]"},{"link":"https://nmac.to/blog/mira-1-4-9/","image":"https://nmac.to/wp-content/uploads/2014/06/Mira.png","title":"Mira 1.4.9 – Control any app with the Apple Remote","content":"Mira is designed exclusively for the Apple Remote, taking it beyond Front Row with personal control for any application, on any Mac. Shipping with built-in support for over 80 applications, new ones can be given their own specific actions in a few seconds with virtually no learning curve and no additional software or plugins to […]"},{"link":"https://nmac.to/blog/stellar-partition-manager-2-5-0/","image":"https://nmac.to/wp-content/uploads/2014/06/StellarPartitionManager.png","title":"Stellar Partition Manager 2.5.0 – Partition management utility for Mac OS","content":"Stellar Partition Manager is a reliable disk partition Mac utility to manage your Apple partitions safely. This powerful Mac OS disk utility partition manager optimizes your hard drive performance by helping you create, format, delete, hide/reveal, shift and resize different partitions in your Mac hard drive.   Sometimes, you may find your Mac partition to […]"},{"link":"https://nmac.to/blog/light-screen-sharing-1-2-9/","image":"https://nmac.to/wp-content/uploads/2014/06/Light-Screen-Sharing.png","title":"Light Screen Sharing 1.2.9 – Remote desktop for Mac","content":"Are you managing a lot of Macs or have a lot of friends who need a remote support? With this application you have a powerfull Screen Sharing and VNC client at your fingertips always sitting in your Mac OS X menu. Connecting to remote screen is always only 2 taps away.   Light ScreenSharing doesn’t […]"},{"link":"https://nmac.to/blog/leafnote-1-02/","image":"https://nmac.to/wp-content/uploads/2014/06/Leafnote.png","title":"Leafnote 1.02 – Simple text editor with tree-based organization","content":"Simple but incredibly useful, Leafnote is a minimal text editor with a twist: the ability to keep multiple documents together as a single project, organized in an easy-to-rearrange tree.   Use it for projects large and small; write a whole novel scene-by-scene, or just keep notes and scraps of ideas together in a single project […]"},{"link":"https://nmac.to/blog/diskaid-6-7-2/","image":"https://nmac.to/wp-content/uploads/2014/01/DiskAid.png","title":"DiskAid 6.7.2 – Use your iOS device as an external disk and more","content":"DiskAid is the ultimate transfer tool for accessing the iPod, iPhone or iPad directly from the desktop. Access data such as: music, video, photos, contacts, notes, call history, text messages (SMS), voicemail, and voice memos. With DiskAid you can also transfer files and folders betwen your iPhone, iPad or iPod touch and your computer and […]"},{"link":"https://nmac.to/blog/the-logo-creator-6-8/","image":"https://nmac.to/wp-content/uploads/2014/06/The.Logo_.Creator.png","title":"The Logo Creator 6.8 – Create your own logos, page headers, podcast covers and more","content":"The Logo Creator is the coolest way to create your own logos – page headers – podcast covers – blog graphics – and whatever else you may need images for, and an easy to use interface. Tons of cool templates, choose from over 200 awesome templates. Mix and match them all. Use your own images […]"},{"link":"https://nmac.to/blog/macaw-1-0-12/","image":"https://nmac.to/wp-content/uploads/2014/04/Macaw1.png","title":"Macaw 1.0.12 – The code-savvy web design tool","content":"Stop writing code. Start drawing it.   Macaw provides the same flexibility as your favorite image editor but also writes semantic HTML and remarkably succinct CSS. It’s time to expect more from a web design tool.   Fluid canvas and grid Macaw is engineered for fluid widths. Resize the canvas and your grids and elements […]"},{"link":"https://nmac.to/blog/istudiez-pro-1-2-3/","image":"https://nmac.to/wp-content/uploads/2014/06/iStudiez.Pro_.png","title":"iStudiez Pro 1.2.3 – Student planner with iOS syncing","content":"iStudiez Pro is a student planner with iOS syncing.   A student’s life is a dizzying mix of activity and just plain craziness! Take charge of your schedule and put iStudiez Pro to work for you! Take advantage of iStudiez Pro easy navigation and never miss another course, lecture and lab, track tasks and deadlines, […]"},{"link":"https://nmac.to/blog/hex-editor-1-0/","image":"https://nmac.to/wp-content/uploads/2014/06/Hex-Editor.png","title":"Hex-Editor 1.0 – Ultimate hex source editor","content":"Hex-Editor : The ultimate hex source editor. Open any file types in hex format and easy-to-use tools to edit and compare hex values.   Cut, Copy, Paste, Insert, delete, rearrange:  Hex-Editor does not limit you to in-place changes like some hex editors. Hex-Editor can cut, copy, paste, insert and delete any amount of data with no […]"}]