[{"link":"https://nmac.to/blog/iphone-magic-platinum/","image":"https://nmac.to/wp-content/uploads/2017/02/Xilisoft-iPhone-Magic-Platinum.png","title":"iPhone Magic Platinum 5.7.31 – Backup, transfer and manage iPhone/iPad music, movie and more","content":"Once with Xilisoft iPhone Magic for Mac, iPhone/iPad management on Mac becomes much easier than ever before. It makes it possible to backup, transfer and manage iPhone/iPad music, movie, books, photos, apps, contacts, messages, iPhone ringtone, etc.   Xilisoft iPhone Magic for Mac enlarges your media file resource. It can just convert and transfer CD/DVD […]"},{"link":"https://nmac.to/blog/smartbaby/","image":"https://nmac.to/wp-content/uploads/2020/05/SmartBaby.png","title":"SmartBaby 1.0.2 – JSON to Swift Codable Model","content":"SmartBaby infer Swift Codable model from JSON to save your time.   It can infer property’s type from JSON, such as String, Int, Double, Bool, even URL and Date. It can handle nested JSON, it will generate nested models. You can specify property’s name with smart Property Map, array’s object name with smart Array Object […]"},{"link":"https://nmac.to/blog/kingdoms-and-castles/","image":"https://nmac.to/wp-content/uploads/2018/05/Kingdoms-and-Castles.png","title":"Kingdoms and Castles 117r7 – City Builder, Strategy & Simulation Game","content":"Kingdoms and Castles is a game about growing a kingdom from a tiny hamlet to a sprawling city and imposing castle.   Your kingdom must survive a living and dangerous world. Do the viking raiders make off with your villagers? Or are they stopped, full of arrows, at the castle gates? Does a dragon torch […]"},{"link":"https://nmac.to/blog/viruskiller-antivirus/","image":"https://nmac.to/wp-content/uploads/2018/02/Antivirus-VirusKiller.png","title":"Antivirus VirusKiller 4.3.7 – Protects from viruses, malware, and more","content":"Malware isn’t the only threat to your Mac, and yes Macs do get malware. According to our company research on cybercrime, the attacks on Mac systems had increased by more than 78% in 2017.   That’s the reason why you must choose an antivirus software from a security company like we are because we can […]"},{"link":"https://nmac.to/blog/thief-master-thief-edition/","image":"https://nmac.to/wp-content/uploads/2020/05/Thief.png","title":"Thief: Master Thief Edition 1.1 – First-Person Action & Adventure Game","content":"Garrett, the Master Thief, steps out of the shadows into the City. In this treacherous place, where the Baron’s Watch spreads a rising tide of fear and oppression, his skills are the only things he can trust. Even the most cautious citizens and their best-guarded possessions are not safe from his reach.    As an […]"},{"link":"https://nmac.to/blog/scotch/","image":"https://nmac.to/wp-content/uploads/2014/03/Scotch-1.png","title":"Scotch 1.11 – Join images become easier with this app","content":"Scotch is a simple graphic application that allow you to join images.   Features: join multiple images; move the selected image in front or back of other images; apply a “blend” effect; “snap to grid” function; expand or reduce the image size; crop the image; edit the image applying various effects; undo/redo your modify; export […]"},{"link":"https://nmac.to/blog/rocket/","image":"https://nmac.to/wp-content/uploads/2019/07/Rocket.png","title":"Rocket 1.7.4 – Slack-style emoji everywhere on your Mac","content":"Rocket provides you with Slack-style emoji everywhere on your Mac.   Note: This application contains in-app and/or external module purchases.   Version 1.7.4: Release notes were unavailable when this listing was updated.   Intel, 64-bit processor OS X 10.11 or later    "},{"link":"https://nmac.to/blog/accdb-mdb-explorer/","image":"https://nmac.to/wp-content/uploads/2016/06/ACCDB-MDB-Explorer.png","title":"ACCDB MDB Explorer 2.4.7 – Open, view & export Access files","content":"ACCDB MDB Explorer is a tool designed to provide a quick and easy way to view ACCDB and MDB database files without an Access license. This application can be used to open tables from multiple Access databases, having table structure described in term of column, index, and relation.   Using ACCDB MDB Explorer, you can […]"},{"link":"https://nmac.to/blog/blacksad-under-the-skin/","image":"https://nmac.to/wp-content/uploads/2019/12/Blacksad.Under_.the_.Skin_.png","title":"Blacksad Under the Skin 1.0.4 – Investigation & Adventure Game","content":"A dark corruption scandal in the heart of the New York City’s underworld for charismatic detective John Blacksad!   The 50s, New York City: Joe Dunn, owner of a boxing club, is found dead.   Meanwhile, rising star Bobby Yale, due to take to the ring for the most important fight of his career, has […]"},{"link":"https://nmac.to/blog/company-of-heroes-2/","image":"https://nmac.to/wp-content/uploads/2016/07/Company.of_.Heroes.2.png","title":"Company of Heroes 2 1.3.6 – Experience the ultimate WWII RTS platform game","content":"Direct your troops through fast-paced real-time battles in the brutal fight to turn the tide of World War II. From the desperate defence of Stalingrad to victory in Berlin, you must defeat a tenacious enemy and the deadly cold of the Russian winter.   Objective-based missions challenge you to maneuver soldiers, guns, and tanks across […]"}]