[{"link":"https://nmac.to/blog/pixa-1-1-5/","image":"https://nmac.to/wp-content/uploads/2014/01/Pixa.png","title":"Pixa 1.1.5 – Quickly and easily organize your images","content":"Pixa is an image-organizing application. The new app functions well, is easy to use, and helps people organize their images quickly and easily on their computers.   For those who prefer not to use the Pixa library, the application can still find images when the user searches for them. So, either way, Pixa makes it […]"},{"link":"https://nmac.to/blog/passlocker-3-0/","image":"https://nmac.to/wp-content/uploads/2014/04/PassLocker.png","title":"PassLocker 3.0 – Keep your passwords never been easier on both Mac & iOS!","content":"PassLocker helps you maintain your login credentials with ease. With stylish looks, tight security, and great features such as auto-login and iCloud sync, it definitely is the best way to manage your login credentials on both OS X and iOS.   Features: Auto-login support (without extension) for the most used web sites (Amazon, Dribbble, eBay, […]"},{"link":"https://nmac.to/blog/writer-pro-1-1-2/","image":"https://nmac.to/wp-content/uploads/2014/01/Writer-Pro.png","title":"Writer Pro 1.1.2 – Professional writing suite","content":"Writer Pro is a professional writing suite that gives you full control over your notes, drafts and edits.    Workflow: Note – Write – Edit – Read. Each stage has a task-specific typeface and color. Syntax Control scans the syntax of English, French, German, Italian, and Spanish text and highlights your adjectives, nouns, verbs, adverbs, […]"},{"link":"https://nmac.to/blog/tublme-1-0-2/","image":"https://nmac.to/wp-content/uploads/2014/04/Tublme.png","title":"Tublme 1.0.2 – Beautiful Tumblr desktop client","content":"Tublme is a beautiful and powerful, yet easy-to-use, Tumblr desktop client. It makes browsing Tumblr a whole new experience with its minimalistic approach.   Features: Lists – As in Twitter, a list is a selected group of users. Just add people (you don’t even need to be following them) to a new or existing list […]"},{"link":"https://nmac.to/blog/dwellclick-2-2-1/","image":"https://nmac.to/wp-content/uploads/2014/04/DwellClick.png","title":"DwellClick 2.2.1 – Control your Mac with mouse movements only","content":"DwellClick is an app that clicks the mouse for you, and lets you give your fingers a rest!   Click and drag with mouse movements only. No clicking required! Save thousands of clicks per day. No more tired and sore hands. Drag and resize windows so easily it’s like magic! Works great with any trackpad […]"},{"link":"https://nmac.to/blog/cloud-mate-1-5-8/","image":"https://nmac.to/wp-content/uploads/2014/04/Cloud-Mate.png","title":"Cloud Mate 1.5.8 – Add a Finder-like interface to iCloud","content":"Cloud Mate adds a Finder-like interface to iCloud, and adds iCloud to the Finder. iCloud is great. iCloud splits all your content up by the app that created it. iCloud hides your Photo Stream. Cloud Mate sets those files free!   Here are just some of the reasons we think you’ll love Cloud Mate: Want […]"},{"link":"https://nmac.to/blog/tab-launcher-2-5/","image":"https://nmac.to/wp-content/uploads/2013/12/Tab-Launcher.png","title":"Tab Launcher 2.5 – Clean up and organize the Dock","content":"The idea of Tab Launcher is not to replace the system’s dock, but to help keep it clean, with only the applications that are currently running.   By removing all the application from the dock and organizing them on tabs, you can quickly find and run any application you want.   Apart from that, you […]"},{"link":"https://nmac.to/blog/devonsphere-express-1-6-2/","image":"https://nmac.to/wp-content/uploads/2014/04/DEVONsphere.Express.png","title":"DEVONsphere Express 1.6.2 – Finds connections between seemingly unrelated files","content":"DEVONsphere Express makes your Mac smarter. Be more productive by letting DEVONsphere Express keep track of related emails, articles on the same subject, or similar Web pages. Discover the hidden connection between seemingly unrelated files.   Find other items related to what you’re working on Search like with Spotlight on steroids Context-aware, always focuses on […]"},{"link":"https://nmac.to/blog/devonnote-2-7-5/","image":"https://nmac.to/wp-content/uploads/2014/04/DEVONnote.png","title":"DEVONnote 2.7.5 – Intelligent notepad","content":"DEVONnote is an easy-to-use, intelligent note pad capable of storing and organising plain or rich texts and file aliases. Store and manage your bookmarks in DEVONnote too, browse the Web using the integrated browser based on Apple’s WebKit, capture interesting notes immediately or organize webcams. Furthermore, DEVONnote helps you sort in new stuff and supports […]"},{"link":"https://nmac.to/blog/devonagent-pro-3-8/","image":"https://nmac.to/wp-content/uploads/2014/04/DEVONagent.Pro_.png","title":"DEVONagent Pro 3.8 – Maximize Web search efficiency","content":"DEVONagent Pro helps you search more efficiently on the web. It searches multiple sources, frees you from hunting for the really relevant results, and gives you power tools for your research.   Filters bad results so you don’t have to Shows results the way you want Creates reports in many formats Saves searches so you […]"}]