[{"link":"https://nmac.to/blog/easy-video-converter/","image":"https://nmac.to/wp-content/uploads/2020/08/Easy-Video-Converter.png","title":"Converter to MP4 4.0.0 – Best transcoding video to mp4","content":"Converter to MP4 is a best video converter tool. It can handles almost all audio and video formats to playable format on Apple’s devices.Just drag your file into easy video converter, select an output preset and click convert. No other options to choose, no professional skills required though, It can intelligently analyzes the import file, […]"},{"link":"https://nmac.to/blog/macsome-any-audiobook-converter/","image":"https://nmac.to/wp-content/uploads/2020/11/Macsome-Any-Audiobook-Converter.png","title":"Macsome Any Audiobook Converter 1.0.0 – Audible audio book to MP3 or AAC converter","content":"As an all-in-one Audible Audiobook Converter, Macsome Audiobook Converter enables you to download Audible AA/AAX audiobooks to your Mac. And then convert Audible AA or AAX audiobooks to MP3, M4A and M4B with ID3 tags preserve, including Title, Artist, Author, Year, Genre, Comments, etc.   Audiobook Converter for Mac is able to convert Audible audiobooks […]"},{"link":"https://nmac.to/blog/on-rusty-trails/","image":"https://nmac.to/wp-content/uploads/2016/07/On_Rusty_Trails.png","title":"On Rusty Trails 1.3.0a – A modern, illustrative platformer game","content":"On Rusty Trails is a modern, illustrative platformer, set in a world constantly reacting to your change in identity. You are Elvis. Home owner, triangular metal person and lover of dryness. A sudden thunderstorm leaves your house dissolved into a pile of rubble. Only lightning-fast reactions will keep you from a looming rusty funeral. Don […]"},{"link":"https://nmac.to/blog/conglomerate-451/","image":"https://nmac.to/wp-content/uploads/2020/04/Conglomerate-451.png","title":"Conglomerate 451 1.5.7 – Grid-based, dungeon crawling, first-person RPG Game","content":"Conglomerate 451 is a grid-based, dungeon crawling first-person RPG with roguelike elements set in a cyberpunk world.   You are the CEO of a Special Agency, instructed by the Senate of Conglomerate city to restore the order in sector 451, where corrupted corporations have established their turfs. Thanks to the last constitutional decree, you are […]"},{"link":"https://nmac.to/blog/uninstall-pkg/","image":"https://nmac.to/wp-content/uploads/2017/10/UninstallPKG1.png","title":"UninstallPKG 1.1.9 – Remove packages (.PKG) and all their contents","content":"UninstallPKG allows you to completely remove so called “packages” (file extension .pkg) and all their installed contents from your Mac. It can be used to reclaim precious disk space by removing unwanted functionality like unused printer drivers, or to completely remove applications you no longer use. UninstallPKG can also keep your Mac clean by removing […]"},{"link":"https://nmac.to/blog/coda/","image":"https://nmac.to/wp-content/uploads/2017/06/Coda2.png","title":"Coda 2.7.7 – One-window Web development suite","content":"Coda is a powerful Web editor that puts everything in one place. An editor. Terminal. CSS. Files. With Coda 2, we went beyond expectations. With loads of new, much-requested features, a few surprises, and a seriously refreshed UI, this update is, truly, major.   Features: Integrated file browser. Fully-featured text editor. CSS editor. Preview. Built-in […]"},{"link":"https://nmac.to/blog/sky-rogue/","image":"https://nmac.to/wp-content/uploads/2020/11/Sky-Rogue.png","title":"Sky Rogue 1.3.1 – A fwooshy rogue-lite action flight simulator","content":"Sky Rogue is a fwooshy rogue-lite action flight simulator! Blow things up over land, sea, and air, on an infinite number of procedurally-generated islands. Choose one of a diverse set of aeros and kit it out with a dizzying array of weaponry. Go toe-to-toe with enemy aces or assault giant flying aircraft carriers and battleships, […]"},{"link":"https://nmac.to/blog/walden-a-game/","image":"https://nmac.to/wp-content/uploads/2020/11/Walden-a-game.png","title":"Walden a game 1.0 – Walking Simulator & Adventure Game","content":"Take on Henry David Thoreau’s classic adventure in living simply in nature as you explore this epic open world game based on the story of Thoreau’s life in the woods alone at Walden Pond. Features a dynamic and changing natural environment filled with exquisite details, as well as a multi-faceted narrative following Thoreau’s quest for […]"},{"link":"https://nmac.to/blog/pyre/","image":"https://nmac.to/wp-content/uploads/2018/02/Pyre.png","title":"Pyre 1.50476 – A party-based RPG Game","content":"Pyre is a party-based RPG in which you lead a band of exiles to freedom through ancient competitions spread across a vast, mystical purgatory. Who shall return to glory, and who shall remain in exile to the end of their days?   Key Features:   A New World From the Creators of Bastion and Transistor […]"},{"link":"https://nmac.to/blog/colorsnapper/","image":"https://nmac.to/wp-content/uploads/2017/07/ColorSnapper21.png","title":"ColorSnapper 2 1.6.4 – Quickly find the color of any pixel","content":"ColorSnapper 2 is the OS X color picker app for designers and developers which makes it easy to collect, adjust, organize, and export colors of any pixel of the screen. It is activated via a system-wide hotkey, giving you a magnifying glass to easily pick any pixel you need, even from retina displays. The resulting […]"}]