[{"link":"https://nmac.to/blog/cornerstone/","image":"https://nmac.to/wp-content/uploads/2016/07/Cornerstone3.png","title":"Cornerstone 4.1 – Feature-rich Subversion client","content":"Work smarter with the all-new Cornerstone for Mac. Featuring a stunning new design, enhanced workflows and improved performance — Cornerstone 3 puts powerful tools at your fingertips.   With full support for all of Subversion’s rich features, serious version control is now easier than ever.   HIGHLIGHTS Streamlined workflow for previewing your changes before committing […]"},{"link":"https://nmac.to/blog/framer-x/","image":"https://nmac.to/wp-content/uploads/2019/04/Framer-X.png","title":"Framer X 21 – Always interactive, lightning fast design","content":"Bring your creative ideas to life with Framer X, the best tool for interactive design. Create responsive layouts, design realistic prototypes, and bring everything closer to production—all in one place.   Simply rapid prototyping Framer X offers tools to design scroll, link and page interactions. But don’t stop there—add a 3D effect or momentum. Create flows […]"},{"link":"https://nmac.to/blog/black-white-2/","image":"https://nmac.to/wp-content/uploads/2019/04/Black-White-2.png","title":"Black & White 2: Battle of the Gods 1.0.1 – Play as a god in this strategy game","content":"Black & White 2 is the sequel to the genre-defining god simulator Black & White. Players take control of a world where they will build cities, send armies into battle, and take care of a giant monster that can help protect your land of fantasy. The game ahs more structure and a stronger storyline than […]"},{"link":"https://nmac.to/blog/urban-trial-playground/","image":"https://nmac.to/wp-content/uploads/2019/04/Urban-Trial-Playground.png","title":"Urban Trial Playground 4.18.3 – Bike racing series game","content":"Urban Trial Playground levels are designed as a surface able to be used to perform tricks and stunts, combining your best moves into multi-score combos.   Urban Trial Playground has been created to provide countless hours of action for fans of adrenaline and freestyle fanatics. Combine tricks in unique and virtually endless combos to grind […]"},{"link":"https://nmac.to/blog/primo-iphone-data-recovery/","image":"https://nmac.to/wp-content/uploads/2017/04/Primo-iPhone-Data-Recovery.png","title":"Primo iPhone Data Recovery 2.3.1 – iOS data recovery tool","content":"Primo iPhone Data Recovery is an ultimate iOS data recovery tool designed for retrieving the accidentally deleted, damaged or lost data on your iPhone, iPad and iTouch.   Features: Support up to 25 types of files to retrieve like messages, photos, contacts, notes, voice memos, Safari history, App data and documents, etc. Help you get […]"},{"link":"https://nmac.to/blog/primophoto/","image":"https://nmac.to/wp-content/uploads/2018/11/PrimoPhoto.png","title":"PrimoPhoto 1.5.1 – Simplified photo management for iPhone","content":"PrimoPhoto aims to make your iPhone photo management much easier: exporting photos by album, adding images without iTunes, convert Live Photos to GIF, even cleaning out junk photos to optimize your iPhone storage. The result is more than just an ordinary iPhone photo transfer; it’s everything you’ll need for greater enjoyment of your photo collections. […]"},{"link":"https://nmac.to/blog/chessmaster/","image":"https://nmac.to/wp-content/uploads/2019/04/Chessmaster.png","title":"Chessmaster 9000 1.1.3 – Learn to master chess with comprehensive tutorials","content":"Chessmaster 9000 introduces players to the rules and strategies of chess, while building skills through fun yet comprehensive tutorials. Beginners as well as seasoned chess players can enjoy the many features and stimulating competition that have made Chessmaster the world’s most popular chess program.   Featuring challenging gameplay with unrivalled personal instruction and chess resource […]"},{"link":"https://nmac.to/blog/architect-3d/","image":"https://nmac.to/wp-content/uploads/2019/04/Architect-3D-Ultimate.png","title":"Architect 3D Ultimate 2017 19.0.8 – Design your dream project","content":"Architect 3D is a Home Design application that allows you to design, equip and decorate your home and garden in 3D. Design your creative project step by step and room by room, from the basement to the loft space. Draw up plans of your house, equip your interior and exterior areas and add your own personal […]"},{"link":"https://nmac.to/blog/joyoshare-livephoto-converter/","image":"https://nmac.to/wp-content/uploads/2018/11/Joyoshare-LivePhoto-Converter.png","title":"Joyoshare LivePhoto Converter 2.0.0 – Live Photo Converter","content":"Joyoshare LivePhoto Converter is competent of converting any iPhone or Android Live Photos to the shareable GIF pictures and other common still image formats including JPG, PNG, TIFF, WEBP, MBP, etc for viewing on older iPhone and other non-iPhone users. With the support of real-time preview function, you can easily convert one Live Photo at […]"},{"link":"https://nmac.to/blog/joyoshare-heic-converter/","image":"https://nmac.to/wp-content/uploads/2017/12/Joyoshare-HEIC-Converter.png","title":"Joyoshare HEIC Converter 2.0.0 – Convert HEIC photos to other formats","content":"Joyoshare HEIC Converter is able to convert HEIC photos from iOS 11 and macOS High Sierra to common formats such as: JPEG, PNG, GIF, TIFF, BMP, WEBP, etc. With an easy-to-operate interface, you can convert a single HEIC image or mutliple photos in bulk. With Joyoshare HEIC Converter, converting HEIC to JPG, PNG, and other […]"}]