[{"link":"https://nmac.to/blog/on-the-job-3-0-9/","image":"https://nmac.to/wp-content/uploads/2014/12/On-The-Job.png","title":"On the Job 3.0.9 – Project time tracker","content":"On The Job is a time tracking solution designed with ease of use in mind. Easily track the time you spend on multiple clients and multiple tasks. The clear and simple interface is designed to get out of your way, so you can spend less time keeping track of your time, and more time working […]"},{"link":"https://nmac.to/blog/icopybot-7-9-0/","image":"https://nmac.to/wp-content/uploads/2014/12/iCopyBot.png","title":"iCopyBot 7.9.0 – Batch transfer iDevice content back to a folder or iTunes library","content":"iCopyBot allows you to batch transfer iPad, iPod, iPhone songs, videos, books and photos back to a folder or iTunes library on your Mac computer with just few clicks, include playlists, songs rating, comment, play count, volume adjustment and so on.   Version 7.9.0: Release notes were unavailable when this listing was updated.   Intel […]"},{"link":"https://nmac.to/blog/caleventer-3-2-1/","image":"https://nmac.to/wp-content/uploads/2014/12/CalEventer.png","title":"CalEventer 3.2.1 – No more output limitations for Calendar","content":"This indispensable utility will list all of your Calendar Events (recurring and non-recurring) from a chosen list of your calendars (Local and iCloud) within a specified date range.   The Location & Weekday Filters allow you to narrow down your Events to any combinations you can imagine, thus helping you to generate useful Event listings […]"},{"link":"https://nmac.to/blog/blogo-2-1/","image":"https://nmac.to/wp-content/uploads/2014/08/Blogo.png","title":"Blogo 2.1 – Write, publish and manage multiple blogs","content":"Blogo is the easiest and fastest way to write, publish and manage multiple blogs. Blogo gathered features for a powerful solution and helps users to publish and create content easily. It makes it possible to manage multiple blogs at the same time, edit pictures with a built-in image editor, preview your posts on real-time, manage […]"},{"link":"https://nmac.to/blog/cuptakes-1-8-9/","image":"https://nmac.to/wp-content/uploads/2013/12/Cuptakes.175x175-75.png","title":"Cuptakes 1.8.9 – desktop wallpapers for the girly girls","content":"Cuptakes, wallpapers for the girly girls, now for your desktop!   As a graphic designer, I have always wanted to have a more girly selection of wallpapers for my desktop, iPhone, and iPad. Unfortunately, most of the wallpapers and apps out there are for the male world… I say.. what about us ladies?! With that, […]"},{"link":"https://nmac.to/blog/blades-of-time-limited-edition-1-0/","image":"https://nmac.to/wp-content/uploads/2014/12/bladesoftime.png","title":"Blades of Time Limited Edition 1.0 – Action & adventure journey to an ancient island","content":"Ayumi, the gorgeous gun and sword-wielding treasure hunter, sets out on a journey to an ancient island in search of new adventures. While rich in bounty, the island is also filled with the magic of Chaos, being at the same time home to blood thirsty monsters. With a host of colorful characters, eye-popping visual appeal, […]"},{"link":"https://nmac.to/blog/moneywiz-1-6-0/","image":"https://nmac.to/wp-content/uploads/2014/01/MoneyWiz.png","title":"MoneyWiz 1.6.0 – Personal finance solution","content":"MoneyWiz lets you do more with your money. View all your accounts, budgets and bills in one place. Experience reports on a whole new level. Sync Everything across devices!   Meet MoneyWiz – the personal finance assistant that just works!   HOW IS MONEYWIZ BETTER? Automatically keeps data consistent across multiple devices Gives you beautiful […]"},{"link":"https://nmac.to/blog/macfonts-comicfonts-1-2/","image":"https://nmac.to/wp-content/uploads/2014/12/MacFonts-ComicFonts.png","title":"MacFonts-ComicFonts 1.2 – MacFonts Tech Collection","content":"A premier collection of 10 beautifully drawn fonts for illustrative work, including a personal AND commercial use license for a single user so you can use the fonts in any home, business or for-profit project. All fonts are available in OpenType format and work in all applications including Quark, Illustrator, Photoshop, Microsoft Office, iLife, iWork, […]"},{"link":"https://nmac.to/blog/iworkfast-3-1/","image":"https://nmac.to/wp-content/uploads/2014/12/iWorkFast.png","title":"iWorkFast 3.1 – Templates for Pages Numbers Keynote","content":"iWorkFast: Templates for Pages Numbers Keynote is the ultimate bundle package providing creative designs and templates for Pages, Numbers and Keynote (see technical requirements below).   PAGES Get the tools to create great-looking documents.   Quickly browse through the template categories, from annual reports and magazines, newspapers and datasheets, business cards and letterhead, calendars and […]"},{"link":"https://nmac.to/blog/vssh-1-8/","image":"https://nmac.to/wp-content/uploads/2014/04/vSSH.png","title":"vSSH 1.8 – SSH protocol connectivity tools","content":"VSSH is advanced customizable SSH and Telnet client with iCloud connections, macros and keys sharing.   Key fetaures: SSH and Telnet protocols Username/password and public/private Keys authentication Multi-sessions with tabbed interface iCloud connections, macros and keys sharing with other vSSH apps (for iPhone, iPad and OS X) Key forwarding Port forwarding (support connection without shell: […]"}]