[{"link":"https://nmac.to/blog/photolinker/","image":"https://nmac.to/wp-content/uploads/2017/12/PhotoLinker.png","title":"PhotoLinker 3.5.15 – Photo annotation and geotagging tool","content":"PhotoLinker provides an unprecedented level of map, GPS track and photo tag interactivity, making photo annotation a compelling project and not a dreadful chore.   Features A completely customizable metadata editor to facilitate a streamlined and efficient workflow. PhotoLinker complies with the recently released (9/2008; rev 2/2009) recommendations of the Metadata Working Group, ensuring proper […]"},{"link":"https://nmac.to/blog/simpleimage/","image":"https://nmac.to/wp-content/uploads/2016/03/SimpleImage6.png","title":"SimpleImage 6.3.1 – Media cataloging and viewing utility","content":"SimpleImage is a full-featured media viewing, cataloguing and slide show application, updated to take full advantage of OS X.   View View all the most common kinds of images & movies in a single app and display them in slideshows.   Catalogue Catalogue your images & movies with browsers and restore windows just the way […]"},{"link":"https://nmac.to/blog/explaindio/","image":"https://nmac.to/wp-content/uploads/2018/12/Explaindio.png","title":"Explaindio 4.014 – 2D & 3D Video Animation Creator","content":"Discover the Proven Video Creator That Will Attract, Engage, And Convert Visitors to Buyers!   2D & 3D Animation, Explainer, Doodle Sketch, And Motion Videos In Minutes!!   Features: Multiple animations at the same time Full multi-timeline editing Full 3D animations Import of external 3D elements 3D models and animation customization 180+ pre-made text animation […]"},{"link":"https://nmac.to/blog/gear-player/","image":"https://nmac.to/wp-content/uploads/2017/02/Gear-Player2.png","title":"Gear Player 2.2.38 – Music player for Google Music and YouTube","content":"Gear Player allows you to connect to your existing Google Play Music and YouTube account without confining yourself to a Web browser or Flash player. The interface aims to be simple and intuitive, just does what it has to. Don’t hesitate, go on and try it!   Users can upload up to 20,000 of their […]"},{"link":"https://nmac.to/blog/hard-disk-manager/","image":"https://nmac.to/wp-content/uploads/2017/06/Hard-Disk-Manager.png","title":"Hard Disk Manager 1.3.873 – Total system and disk management","content":"Paragon Hard Disk Manager is the ideal system- and data-management solution for Mac. Powerful backup and flexible recovery functions, everything you need for perfect partitioning, reliable data-wiping algorithms, and much more…. All of this is what will make your Mac happy!   Features Complete hard disk management – Covers all aspects of a Mac computer […]"},{"link":"https://nmac.to/blog/starman/","image":"https://nmac.to/wp-content/uploads/2018/12/Starman.png","title":"Starman 1.1 – Point & Click Adventure Game","content":"Guide Starman through breathtaking architectural sceneries with delicate atmospheres and elaborate puzzles.   Recover the light, and bring life back!   IMMERSIVE. Starman is not only a game but a whole experience, where soothing original music mixes with beautifully crafted levels. Sit, relax, and enjoy.   CHALLENGING. New puzzles every level will keep you learning […]"},{"link":"https://nmac.to/blog/a-good-snowman-is-hard-to-build/","image":"https://nmac.to/wp-content/uploads/2016/11/A-Good-Snowman-Is-Hard-To-Build.png","title":"A Good Snowman Is Hard To Build 1.10 – An adorable puzzle game","content":"A Good Snowman Is Hard To Build is an adorable puzzle game about being a monster and making snowmen. Adorable graphics by Benjamin Davis Featuring a gorgeous original soundtrack by Ryan Roth Lovingly-crafted puzzle design from Alan Hazelden, one of the creators of Sokobond   Awards: Best Character Design – Intel Level Up 2014 Official […]"},{"link":"https://nmac.to/blog/raw-editor/","image":"https://nmac.to/wp-content/uploads/2018/12/RAW-Editor.png","title":"RAW-Editor 2.0 – Convert RAW photo to common photo format","content":"RAW-Editor is the integrated photo processing solution which specially optimized for RAW format processing. It supports almost popular cameras, rotate, crop, adjust white balance and so on. This version has been supported some fantasy photo effect, such as photo fade, photo mono etc. With new feature named preset, you can save the effect parameters for […]"},{"link":"https://nmac.to/blog/tsioque/","image":"https://nmac.to/wp-content/uploads/2018/12/TSIOQUE.png","title":"TSIOQUE 1.1.2 – Story Rich Point & Click & Adventure Game","content":"TSIOQUE is a dark but playful Point & Click adventure, hand-animated in meticulous, frame-by-frame 2D. Escape the clutches of an Evil Wizard and discover the secrets hidden within the spellbound castle of your ancestors.   We take the role of princess Tsioque, imprisoned in a castle overtaken by the Evil Wizard. When darkness falls on […]"},{"link":"https://nmac.to/blog/gn-bundle-for-iwork/","image":"https://nmac.to/wp-content/uploads/2017/09/GN-Bundle-for-iWork.png","title":"GN Bundle for iWork 6.1 – Templates for iWork","content":"GN Bundle for iWork (was Bundle for iWork, then was Templates Studio) provides you with unique designs for Pages documents, spreadsheet templates for Numbers, first-class slideshow themes for Keynote, and images for illustrating your content. All templates are available in the US and international paper sizes.   Version 6.1: We have modified some categories to […]"}]