[{"link":"https://nmac.to/blog/pwgenerator/","image":"https://nmac.to/wp-content/uploads/2022/03/PwGenerator.png","title":"PwGenerator 1.11.0 – Create passwords and Wi-Fi keys","content":"PwGenerator is a utility to create passwords and Wi-Fi keys. Creating a strong password is always a tedious job, how about a password generator customizable according to your criteria?   Easily generates WPA/WPA2/WEP keys. Choose the types of characters (uppercase, lowercase, numbers, and symbols) and adjust their redundancy. A diagram summarizes the priority of each […]"},{"link":"https://nmac.to/blog/plistedit-pro/","image":"https://nmac.to/wp-content/uploads/2014/10/PlistEdit.Pro_.png","title":"PlistEdit Pro 1.9.5 – Property list editor","content":"PlistEdit Pro is the most advanced property list editor written for Mac OS X. Property list files are used throughout Mac OS X, and with PlistEdit Pro, users can easily change these files and exert finer control over their systems. You can use PlistEdit Pro in your development work, and its built-in preference file browser […]"},{"link":"https://nmac.to/blog/magnet/","image":"https://nmac.to/wp-content/uploads/2022/04/Magnet_2.png","title":"Magnet 2.8.0 – Snap windows into various sizes and positions","content":"Window Magnet will change the way you work with your Mac! Easily snap windows into various sizes and positions by simply dragging them to the edges and corners of the screen. Maximize them, place them side by side or deploy them into all four quarters of your screen in the blink of an eye.   […]"},{"link":"https://nmac.to/blog/cisdem-pdfpasswordremover/","image":"https://nmac.to/wp-content/uploads/2016/10/Cisdem-PDFPasswordRemover.png","title":"Cisdem PDFPasswordRemover 4.4.0 – Recover and remove PDF owner passwords","content":"Cisdem PDFPasswordRemover is an ultimate PDF decrypter, which unlocks all restrictions of both owner password and open password. So there are no restrictions to open, edit, copy and print PDF files any more! With automatically remembering decryption preference setting and resume decryption progress, it could be your Individual and Business best tool.   Features Decrypt […]"},{"link":"https://nmac.to/blog/djay-pro/","image":"https://nmac.to/wp-content/uploads/2020/10/djay-Pro-AI.png","title":"djay Pro AI 3.1.12 – Transform your Mac into a full-fledged DJ system","content":"Welcome to djay Pro AI! Algoriddim’s acclaimed DJ software and winner of multiple Apple Design Awards has been rebuilt from the ground up using groundbreaking AI technology – NEURAL MIX.   NEURAL MIX allows you to isolate instrumentals and acappellas of your favorite tracks in real-time and redefines the boundaries of creative mixing. You can […]"},{"link":"https://nmac.to/blog/mesaexif/","image":"https://nmac.to/wp-content/uploads/2022/03/MesaExif.png","title":"MesaExif 2.4.14 – Powerful meta data processor","content":"MesaExif is an easy-to-use and powerful Meta Data processor.   Features Choose your photos with jpg / tiff / png. MesaExif shows thumbnails and Meta Data. View and edit Exif, ExifAUX, GPS, IPTC, JFIF, TIFF, Canon’s and Nikon’s. Manage your Base Location by searching map, and tap to set the coordinates to GPS dictionary. You […]"},{"link":"https://nmac.to/blog/raw-power/","image":"https://nmac.to/wp-content/uploads/2019/04/RAW-Power3.png","title":"RAW Power 3.4.5 – Unlock the power of Apple’s raw photo engine","content":"RAW Power unlocks the power of Apple’s RAW engine with simple, easy-to-use controls. Use it as an editing extension inside Apple Photos, or as a standalone, non-destructive RAW photo editor. If you loved Aperture’s advanced RAW processing adjustments, you’ll feel right at home with RAW Power. Using adjustments like Boost, previously only available in Aperture, you […]"},{"link":"https://nmac.to/blog/widsmob-panorama/","image":"https://nmac.to/wp-content/uploads/2018/06/WidsMob-Panorama.png","title":"WidsMob Panorama 4.23 – Stitch photos into panoramas","content":"WidsMob Panorama allows you to auto stitch collections of unordered images into panoramas. It aligns images without manually messing around moving photos, automatic exposure leveling and lens shading correction. Stitch images into panoramas with vertical, horizontal, tile and 360 degrees 4 different modes. Whether you need to composite images taken vertically, horizontally, in tile or […]"},{"link":"https://nmac.to/blog/rectangle-pro/","image":"https://nmac.to/wp-content/uploads/2022/01/Rectangle-Pro.png","title":"Rectangle Pro 2.3.2 – Window manager app","content":"Snap windows faster in this featureful Rectangle superset. Toss windows in the right places with cursor movement, move multiple windows with one command, create custom shortcuts, and more.   Features 16 window sizes & positions Keyboard shortcuts Drag windows to screen edges to snap Move and resize by holding a key and moving your cursor […]"},{"link":"https://nmac.to/blog/invisor/","image":"https://nmac.to/wp-content/uploads/2017/06/Invisor3.png","title":"Invisor 3.19 – Provides technical information about your video and audio files","content":"Invisor is based on MediaInfo library, and shows detailed info about file’s container and data streams including video, audio, subtitles, and chapters. Displays technical information about your video and audio files with ability to compare collected data.   Export feature allows you to save gathered information in different formats: Text, HTML, CSV, XML, JSON, plist.   […]"}]