[{"link":"https://nmac.to/blog/welcome-to-the-game-1-0-2/","image":"https://nmac.to/wp-content/uploads/2016/07/Welcome.To_.The_.Game_.png","title":"Welcome To The Game 1.0.2 – A creepy horror/puzzle game","content":"Welcome to the Game is a creepy horror / puzzle game that takes you into the world of the Deep Web. Explore the Deep Web with the sole purpose of trying to find a Red Room, an online service / website that allows you to see and participate in interactive torture and murder.   Welcome […]"},{"link":"https://nmac.to/blog/video-slave-2-4-102/","image":"https://nmac.to/wp-content/uploads/2016/07/Video-Slave.png","title":"Video Slave 2.4.102 – Timecode synchronized video player","content":"Use Video Slave 2 to play movie clips in sync with Pro Tools, Cubase, Nuendo, Logic Pro X, Studio One and many other popular DAWs. Video Slave 2 uses MIDI Timecode – a protocol supported by most Digital Audio Workstations on the market today – to drive synchronized movie playback as well as MIDI Machine Control for full scrubbing […]"},{"link":"https://nmac.to/blog/on-site-backup-1-7/","image":"https://nmac.to/wp-content/uploads/2016/06/On.Site_.Backup.png","title":"On Site Backup 1.7 – An app to backup SQL databases, FTP sites and mapped drives","content":"Our data used to be on our PCs. We needed an Off Site Backup to protect it. Today, our data is in the Cloud. Now we need an On Site Backup to protect it.   On Site Backup is a program to backup SQL databases, FTP sites and mapped drives quickly and automatically.   Source […]"},{"link":"https://nmac.to/blog/youtube-hunter-5-6-5/","image":"https://nmac.to/wp-content/uploads/2014/08/YouTubeHunter.png","title":"YouTube Hunter 5.6.5 – Download and convert YouTube videos","content":"YouTubeHunter is a video downloader and converter.   It takes only seconds to find and download videos from YouTube, Vimeo, DailyMotion, VEVO and others. YouTubeHunter downloads videos 15x faster than real time playing and supports simultaneous downloads. YouTubeHunter has built-in search and preview capabilities. Get video by URL feature is available. YouTubeHunter keeps subtitles for […]"},{"link":"https://nmac.to/blog/you-need-a-budget-4-3-855/","image":"https://nmac.to/wp-content/uploads/2013/12/You-Need-a-Budget-4.png","title":"You Need a Budget 4.3.855 – Easy-to-use budget software","content":"You Need a Budget is easy-to-use budget software paired with a powerful methodology.    The software is built around the YNAB Method, which is comprised of our Four Rules. These Four Rules help you break the paycheck to paycheck cycle, get out of debt, and save more money faster. Where other software packages tend to […]"},{"link":"https://nmac.to/blog/soundboard-2-2-2/","image":"https://nmac.to/wp-content/uploads/2016/06/Soundboard.png","title":"Soundboard 2.2.2 – Trigger sound effects for radio broadcasts and more","content":"Soundboard is a Mac version of an old school cart machine like the kind used in broadcast radio. Soundboard lets you create libraries of your favorite audio clips to be triggered instantly with your Mac keyboard.   Live sound effects, on tap!   Version 2.2.2: Added full Retina display support Implemented copying of sounds via […]"},{"link":"https://nmac.to/blog/daylife-1-0-0/","image":"https://nmac.to/wp-content/uploads/2016/06/Daylife.png","title":"Daylife 1.0.0 – Tell your story, capture your thoughts and rediscover your dreams","content":"Daylife welcomes you with its simple and distraction-free interface so you can focus on your thoughts. Its elegant design makes powerful features unobtrusive so you can zero in on your story.   Quickly add entries at anytime. Click the Quicky Entry icon in the menu bar to quickly and easily add an entry to your […]"},{"link":"https://nmac.to/blog/airvlc-1-1-2/","image":"https://nmac.to/wp-content/uploads/2016/06/AirVLC.png","title":"AirVLC 1.1.2 – Watch videos on your Mac and play the audio through AirPlay, in sync","content":"With AirVLC you can watch videos on your Mac and play the audio through AirPlay, in sync. AirPlay alone causes a delay in the audio, which makes videos unwatchable. AirVLC helps to overcome that by creating a delay. It uses VLC. No need for a sub-par video player. AirVLC merely controls the awesome video player […]"},{"link":"https://nmac.to/blog/appgenome-1-3-1/","image":"https://nmac.to/wp-content/uploads/2016/06/AppGenome.png","title":"AppGenome 1.3.1 – Create your own URL-based apps","content":"AppGenome lets you set your own URL, browser agent type (mobile or desktop), and create your own desktop app that will stay in your menubar, so you can forget about all those “app for” apps.   Features Set your own URL of any web page or web app Manually set your agent type (browser type): […]"},{"link":"https://nmac.to/blog/analog-2-0/","image":"https://nmac.to/wp-content/uploads/2016/06/Analog.png","title":"Analog 2.0 – Improve your photos with filters and borders","content":"Analog makes it easy to improve your photos with a stunning selection of filters and borders. We built Analog to make it as fun and easy as possible to give your digital photos some soul. Drag in a photo, browse through filters and borders, and start processing. There are 20 built-in filters, and over a […]"}]