[{"link":"https://nmac.to/blog/worms-clan-wars/","image":"https://nmac.to/wp-content/uploads/2014/11/Worms.Clan_.Wars1_.png","title":"Worms Clan Wars 1.0 – Classic turn-based strategy game","content":"Worms™ Clan Wars brings friends and families together in the noble pursuit of self‐improvement, world domination and exploding sheep.   Worms™ Clan Wars is the biggest and best Worms™ game to date – more worms, larger landscapes, more dynamic water, more weapons and more customisation items than ever before. Worms™ Clan Wars is designed to […]"},{"link":"https://nmac.to/blog/hex-editor-1-2/","image":"https://nmac.to/wp-content/uploads/2014/06/Hex-Editor.png","title":"Hex-Editor 1.2 – Ultimate hex source editor","content":"Hex-Editor : The ultimate hex source editor. Open any file types in hex format and easy-to-use tools to edit and compare hex values.   Cut, Copy, Paste, Insert, delete, rearrange:  Hex-Editor does not limit you to in-place changes like some hex editors. Hex-Editor can cut, copy, paste, insert and delete any amount of data with no […]"},{"link":"https://nmac.to/blog/thumbtack-1-2-3/","image":"https://nmac.to/wp-content/uploads/2014/11/Thumbtack.png","title":"Thumbtack 1.2.3 – Easy access to your Pinboard bookmarks","content":"Thumbtack is a menu-bar utility that provides quick and easy access to the most recently saved bookmarks in your Pinboard account. It was developed around one core feature, allowing it be polished, reliable, and extremely efficient.   You don’t have to be a Pinboard power-user to enjoy the benefits of having a Pinboard account. The […]"},{"link":"https://nmac.to/blog/koi-pond-3d-1-2-0/","image":"https://nmac.to/wp-content/uploads/2014/11/Koi.Pond_.3D.png","title":"Koi Pond 3D 1.2.0 – Realistic Koi pond simulation","content":"Koi Pond 3D is a world of harmony and tranquility, with brightly-colored Koi fish pictured among fine aquatic vegetation in the water looking so real you can almost feel its coolness. Pleasant mood music is a gentle final touch to this work of art.   Features: 4 different koi ponds 10 varieties of koi fish […]"},{"link":"https://nmac.to/blog/elbow-pro-iii-3-8/","image":"https://nmac.to/wp-content/uploads/2014/11/Elbow-Pro-III.png","title":"Elbow Pro III 3.8 – Cut, zoom & rotate the elbow","content":"Elbow Pro III gives users an in depth look into the body region and allows them to cut, zoom & rotate the elbow. Elbow Pro III provides multiple cross sections (Sagittal, Coronal and Transverse) as well as the ability to cut away different layers revealing the muscles, blood vessels, nerves and connective tissue down to […]"},{"link":"https://nmac.to/blog/chocolat-3-0-1/","image":"https://nmac.to/wp-content/uploads/2014/01/Chocolat.png","title":"Chocolat 3.0.1 – Native Cocoa text editor","content":"Chocolat is a new text editor that combines native Cocoa with powerful text editing tools.    Features: Split editing Code completion Live errors Folding Symbol list Blockedit Vim mode Jump to definition Project find Go to file Web preview Documentation   Version 3.0.1: Bug: Fixed PHP code completion. Crash: Fixed a crash with the split […]"},{"link":"https://nmac.to/blog/archive-expert-5-10/","image":"https://nmac.to/wp-content/uploads/2014/03/Archive.Expert.png","title":"Archive Expert 5.10 – File archive manager tool","content":"Archive Expert is a professional, full-featured file archive manager tool. It help you to Browse, Extract, Create, Modify, Split multiple file archives. View, preview files, show advanced file information inside archives.   EXTRACTION FORMATS zip, rar, 7z, lha, zipx, stufflt, hqx, bin, gzip, gz, tgz, tar-gz, bz2, bzip2, bz, txz, tar, iso, cdi, nrg, mdf, […]"},{"link":"https://nmac.to/blog/web-form-builder-2-4-5318/","image":"https://nmac.to/wp-content/uploads/2014/11/Web.Form_.Builder.png","title":"Web Form Builder 2.4.5318 – Create Web forms with drag-and-drop actions","content":"Web Form Builder lets you create Web forms with painless drag-and-drop actions.   Select and assemble form elements in quick-and-easy templates without writing a line of code. Design clean, concise forms that look great on desktop browsers, tablets, and mobile devices. Capture user information and engage your audience, building your online presence like never before. […]"},{"link":"https://nmac.to/blog/web-editor-2-0-2831/","image":"https://nmac.to/wp-content/uploads/2014/11/Web-Editor.png","title":"Web Editor 2.0-2831 – Clever and flexible web editor","content":"Web Editor is a clever and flexible web editor — with some serious clout.   Start Coding in Seconds. It only takes a moment to get your workspace set up. With so many ways to start a new project, the option you need is a click or two away. Start with a clean slate using […]"},{"link":"https://nmac.to/blog/responsive-layout-maker-1-1-2746/","image":"https://nmac.to/wp-content/uploads/2014/11/Responsive-Layout-Maker.png","title":"Responsive Layout Maker 1.1.2746 – Rapidly prototype responsive web layouts","content":"Responsive Layout Maker lets you prototype responsive designs and generate custom layouts. The adaptable layout is the core, and most challenging aspect, of any responsive website. And this makes Responsive Layout Maker a true game changer. It’s the only app for visually developing bullet-proof, production ready, layout designs that adapt to any screen size or […]"}]