[{"link":"https://nmac.to/blog/business-card-shop/","image":"https://nmac.to/wp-content/uploads/2015/12/Business-Card-Shop8.png","title":"Business Card Shop 8.0.1 – Easily create original business card layouts","content":"Business Card Shop (was SOHO Business Cards) helps users create one-of-a-kind business card designs. Simple, one-step tools let users quickly draw shapes, add graphics, arrange and align objects, rotate objects and add designer special effects.   There are more than 30 shapes with individual controls to help users create logos and custom design elements. Built-in rulers, […]"},{"link":"https://nmac.to/blog/printlife/","image":"https://nmac.to/wp-content/uploads/2015/12/PrintLife4.png","title":"PrintLife 4.0.3 – Design with templates and high-res artwork","content":"PrintLife is the fastest, easiest way to design and print everything!   Throw away the cheesy clip art and clumsy design software of yesteryear. Toss aside those corny templates that were too embarrassing to actually use. Welcome to PrintLife, the modern app for designing and printing almost anything: labels, greeting cards, certificates, envelopes, fax covers, […]"},{"link":"https://nmac.to/blog/iscrapbook/","image":"https://nmac.to/wp-content/uploads/2016/03/iScrapbook6.png","title":"iScrapbook 7.0.4 – Design and print beautiful scrapbooks","content":"iScrapbook, the easiest way to design and print beautiful scrapbooks. iScrapbook is a digital scrapbook tool designed for both novice and professional scrapbookers. Its class-leading assortment of design tools are sophisticated, yet so easy to use that everyone can achieve stunning results. iScrapbook manages then entire scrapbook process from page design to album organization.   […]"},{"link":"https://nmac.to/blog/fotofuse/","image":"https://nmac.to/wp-content/uploads/2016/03/FotoFuse.png","title":"FotoFuse 2.0.1 – Easily create and share collages","content":"FotoFuse is the fastest, easiest way to share one’s stories using photos. Simply drag photos into professionally-designed templates to create amazing photo collages. For a little extra flare, add text and artwork. After one’s masterpiece is finished, it can be shared via Twitter, Facebook, Flickr, Mail, Messages, AirDrop, and more.   Features 550+ templates Popular […]"},{"link":"https://nmac.to/blog/algobot/","image":"https://nmac.to/wp-content/uploads/2018/04/Algobot.png","title":"Algobot 1.2.0 – Sci-fi Singleplayer Puzzle Game","content":"Deep inside the Europa, a pan-galactic colonization ship, the sleeping crew dreams about their new life on the far side of the galaxy.   But there can be no rest for Algo Bot, a service droid working on the junk deck. When a routine recycling mission with cantankerous line manager PAL goes horribly wrong, crisis […]"},{"link":"https://nmac.to/blog/alternote/","image":"https://nmac.to/wp-content/uploads/2016/03/Alternote1.png","title":"Alternote 1.0.18 – Note-taking app that integrates with Evernote","content":"Alternote is a gorgeous OS X note-taking app that integrates with Evernote. Designed to be the most convenient and natural way to make notes, collect information, write down your ideas, feelings and memories.   Alternote is totally secure. There are no Alternote servers in the chain, just you, your Mac and Evernote backend.   Distraction-free […]"},{"link":"https://nmac.to/blog/stellar-drive-clone/","image":"https://nmac.to/wp-content/uploads/2016/07/Stellar-Drive-Clone.png","title":"Stellar Drive Clone 3.5.0.5 – Clone hard drive and volumes efficiently","content":"Stellar Drive Clone enables the users to clone the entire hard drive as well as the individual volumes based on HFS, HFS+, FAT, and exFAT file systems, including the boot Volume. The tool also includes a helpful module – Backup – to create automatic backup schedule of selected files and folders of any Mac volume. […]"},{"link":"https://nmac.to/blog/udesktop-next/","image":"https://nmac.to/wp-content/uploads/2016/10/uDesktop-NEXT.png","title":"uDesktop NEXT 3.2.2 – vast wallpaper collection","content":"uDesktop NEXT is one of the biggest wallpaper collections. Choose from many thousands of hi-res wallpapers. Relax and get a fresh mood every day with beautiful pictures from uDesktop NEXT. Experience its full power and beauty. Here you can find the many wallpapers which you’ve been looking for so long and use them to decorate […]"},{"link":"https://nmac.to/blog/aquarelo/","image":"https://nmac.to/wp-content/uploads/2018/03/Aquarelo.png","title":"Aquarelo 1.0.3 – Improve your color workflow","content":"    Aquarelo convert your values in 36 standard color formats: Android ARGB Android RGB Android XML CGColor RGB CGColor CMYK CSS HEX CSS HSL CSS HSLA CSS RGB CSS RGBA Java RGB Java RGBA .Net RGB .Net RGBA Open RGB Open RGBA NSColor Calibrated HSB NSColor Calibrated RGB NSColor Device RGB NSColor Device CMYK […]"},{"link":"https://nmac.to/blog/running-with-rifles/","image":"https://nmac.to/wp-content/uploads/2018/03/RUNNING-WITH-RIFLES.png","title":"RUNNING WITH RIFLES 1.64 – A top-down tactical shooter with open world RPG elements","content":"In RWR, you join the ranks of an army as a common soldier, just like the thousands around you.   The open world approach lets you define your own path and story in the campaign. Push back the enemy with your comrades or go deep behind enemy lines to sabotage their efforts and loot valuable […]"}]