[{"link":"https://nmac.to/blog/bee-2-3-5/","image":"https://nmac.to/wp-content/uploads/2015/03/Bee.png","title":"Bee 2.3.5 – Client for tracking in FogBugz, GitHub, and JIRA","content":"Bee syncs with GitHub Issues, JIRA, and FogBugz. You can also use Bee to keep track of your plain text notes.   Features: Flight Path. Flight Path lives in your menu bar and helps you by intelligently selecting the task you should be working on next. Notifications. Bee uses Notification Center to inform you of […]"},{"link":"https://nmac.to/blog/speedrunners/","image":"https://nmac.to/wp-content/uploads/2016/07/SpeedRunners.png","title":"SpeedRunners 1.0 – 2D Multiplayer Racing Game","content":"In a city filled with superheroes, getting to crimes becomes a competition on its own. Fortunately there are enough rockets, bombs, grappling hooks, spikes, and other goodies lying around — to make the competition fun and fast. Welcome to SpeedRunners.   SpeedRunners is a 4 player competitive platformer with grappling hooks, power-ups, and interactive environments. […]"},{"link":"https://nmac.to/blog/necropolis-1-0/","image":"https://nmac.to/wp-content/uploads/2016/07/Necropolis.png","title":"Necropolis 1.0 – Third-person action with Rogue-lite dungeon-delving game","content":"NECROPOLIS combines third-person action with Rogue-lite dungeon-delving for a game that’s fast-paced and addictive, yet diabolically hardcore. You play as a nameless adventurer attempting to escape a living, magical dungeon that reconstructs itself each time you play, with only one way out – down. Craft, equip, explore, and fight to stay alive as you delve […]"},{"link":"https://nmac.to/blog/iphone-data-recovery-6-7-1-2/","image":"https://nmac.to/wp-content/themes/nmac/images/placeholder-320.png","title":"iPhone Data Recovery 6.7.1.2 – Recover all what you want back on iPhone","content":"There are various situations when you just simply need to save personal messages and important contacts from your phone to your PC. However, due to virus attacks or phone damages, you might lose your sensitive data.   Tenorshare iPhone Data Recovery is a comprehensive and reliable piece of software geared toward users who need to […]"},{"link":"https://nmac.to/blog/havenmoon-1-0/","image":"https://nmac.to/wp-content/uploads/2016/07/HavenMoon.png","title":"HavenMoon 1.0 – Adventure, Puzzle and Exploration Game","content":"Haven Moon will transport you to a mysterious world where you have to explore abandoned islands and solve their secrets to find a treasure. In this Myst-like game inspired by Jules Verne’s universe, use your senses and intelligence to find your way through secret passages and curious machinery.   THE STORY You are teleported to […]"},{"link":"https://nmac.to/blog/earth-space-colonies-1-0/","image":"https://nmac.to/wp-content/uploads/2016/07/Earth-Space-Colonies.png","title":"Earth Space Colonies 1.0 – A strategy-simulation game","content":"Earth Space Colonies is a strategy-simulation game where you build space colonies around the Solar system. Your first destination is Mars. Establish a first self-sustaining colony and terraform a red wasteland into a green oasis. Balance your resources and expand the infrastructure. Build anything from high-tech factories, hotels, military bases to space elevators and terraformers. […]"},{"link":"https://nmac.to/blog/window-tidy-2-1-3/","image":"https://nmac.to/wp-content/uploads/2014/12/Window.Tidy_.png","title":"Window Tidy 2.1.3 – Manage windows with ease","content":"Window Tidy lets you quickly and easily arrange your application windows on your Desktop onto a customizable grid using nothing but drag and drop! When you want to reposition a window, there are no hot-keys to remember or menus to click, you simply drag and drop the window onto customisable pop-up Layout Icon and it […]"},{"link":"https://nmac.to/blog/tunesmedic-2-2-0/","image":"https://nmac.to/wp-content/uploads/2016/07/TunesMedic2.png","title":"TunesMedic 2.2.0 – Remove Duplicates, Clean, Repair & Export for iTunes","content":"TunesMedic is a cleaning utility specially created for iTunes.   It can solve the problems you have with your Music library by removing duplicates or broken links, deleting empty playlists or exporting songs.   It can also make iTunes run faster by cleaning caches, the Music folder or iOS update files. Besides repairing, TunesMedic can […]"},{"link":"https://nmac.to/blog/quote-your-images-1-2/","image":"https://nmac.to/wp-content/uploads/2016/07/Quote.your_.Images.png","title":"Quote your Images 1.2 – Design unique picture quotes","content":"Quote your Images – Create great images by adding text. You can change font, color, alignment. You have full control of how your text will apear.   The Rich Text Editing capabilities allows you to change the font and color. To do so, select the portion of the text you wanna change and click on […]"},{"link":"https://nmac.to/blog/microphone-lock-1-4/","image":"https://nmac.to/wp-content/uploads/2016/07/Microphone-Lock.png","title":"Microphone Lock 1.4 – Lock your microphone and refuse access by any app","content":"Is my microphone tapped? Thanks to click-jacking, trojan horses and malware, governments and hackers have found ways to listen in on your conversations. Microphone Lock enables you to lock your microphone and refuse access by any app. If your microphone was already in use, its audio will silence immediately.   And, if you unlock your […]"}]