[{"link":"https://nmac.to/blog/disk-plus/","image":"https://nmac.to/wp-content/uploads/2021/02/Disk-PLUS.png","title":"Disk PLUS 1.73 – A Comprehensive Drive Cleaner","content":"Disk PLUS is a very comprehensive multipurpose disk utility that can be used as both a disk cleaner and a space recovery tool. As a disk cleaner, it detects junk data from various hard to detect locations regularly cleaning which will keep your Mac optimized and in good condition. As a space recovery tool, it […]"},{"link":"https://nmac.to/blog/clicker-for-youtube/","image":"https://nmac.to/wp-content/uploads/2020/12/Clicker-for-YouTube.png","title":"Clicker for YouTube 1.20 – A native macOS YouTube app with adblocker and more","content":"Clicker for YouTube is a standalone YouTube app for macOS   Features Launch YouTube right from your Dock Picture-in-Picture w/ video controls Built-in ad blocker Like/Dislike and Autoplay from Touch Bar Sleep timer w/ auto-shut off Native push notifications Quick access from the Menu Bar Native macOS design language Truly Full Screen Browsing Upload video […]"},{"link":"https://nmac.to/blog/batchoutput-xls/","image":"https://nmac.to/wp-content/uploads/2018/02/BatchOutput-XLS.png","title":"BatchOutput XLS 2.5.14 – Automate Excel printing and PDF export","content":"BatchOutput XLS automates printing and PDF production from Microsoft Excel. Just add Excel files to the BatchOutput XLS list, adjust the settings, and BatchOutput will do the rest automatically. For example, BatchOutput can be left to process hundreds of Excel files overnight, and the completed job can be picked up next morning.   In addition […]"},{"link":"https://nmac.to/blog/codedrop/","image":"https://nmac.to/wp-content/uploads/2022/02/CodeDrop.png","title":"CodeDrop 1.0.3 – A Gist client","content":"CodeDrop allows you to easily create Gists on GitHub right from your desktop. Just drag and drop a file or snippet of text onto the CodeDrop icon in the menu bar to get started. With CodeDrop, you can upload both public and private Gists. Once an upload completes, you’ll get a notification. A link to […]"},{"link":"https://nmac.to/blog/instacal/","image":"https://nmac.to/wp-content/uploads/2017/08/InstaCal.png","title":"InstaCal 1.9.8 – The Missing Menu Bar Calendar","content":"InstaCal is an affordable, yet powerful calendar app that puts all your events right at your fingertips, always available in your Mac’s menu bar. InstaCal is quick and convenient, and can be opened at any time with a configurable keyboard shortcut. From there you can view your calendar events, make changes, invite friends or even […]"},{"link":"https://nmac.to/blog/uri-handler/","image":"https://nmac.to/wp-content/uploads/2020/11/URI-Handler.png","title":"URI Handler – Open With Picker 1.9 – Open With Desired Browser/Mail","content":"Opening URLs on a modern Mac is pretty simple. Your MAC computer, your phone and your tablet all have default apps, the preloaded software that springs into action whenever a specific task needs doing. Click an image you’ve just received over email, for example, and it opens in your default image viewer. Follow a web […]"},{"link":"https://nmac.to/blog/calculator-for-safari/","image":"https://nmac.to/wp-content/uploads/2022/02/Calculator-for-Safari.png","title":"Calculator for Safari 1.6.1 – Calculator Button in Toolbar","content":"Add a simple Calculator to your browser! You can open the calculator while browsing any web page.   Make easy operations like Addition, Subtraction, Multiplication and Division. You also can use decimals for your operations. Supports: Keyboard, NumPad and Mouse.   HOW TO USE EXTENSION: Start by installing the latest macOS updates to make sure […]"},{"link":"https://nmac.to/blog/movie-thumbnails-maker/","image":"https://nmac.to/wp-content/uploads/2019/04/Movie-Thumbnails-Maker.png","title":"Movie Thumbnails Maker 4.2.0 – Create a collage from movie segments","content":"Movie Collage Creator lets you catch the content of the latest movies at first glance. How about creating an amazing overview for all the latest movies? Movie Collage Creator is the all-in-one solution, you don’t need guess the content of the movie any more.   Key Features: Support various formats such as AVI, WMV, RM, […]"},{"link":"https://nmac.to/blog/screenium/","image":"https://nmac.to/wp-content/uploads/2021/06/Screenium_3.png","title":"Screenium 3.3.2 – Advanced screen-capture utility","content":"Record exactly what you see on the screen and turn it into a screencast in next to no time. Screenium 3 lets you record at 60 frames per second, offering optimum performance for your tutorials, gameplay recordings or any other screen content you wish to record. If you work with an ultra-high resolution 4K or […]"},{"link":"https://nmac.to/blog/mate-translate/","image":"https://nmac.to/wp-content/uploads/2017/12/Mate-Translate.png","title":"Mate Translate 8.1.3 – Translate words and phrases between over 100 languages","content":"Mate Translate (was Instant Translate) allows you to translate words and phrases between over 100 languages, use text-to-speech, and browse through already-done translations in the history. You can quickly swap languages in the pop-up using Control+S.   Features 100+ languages supported text-to-speech offline history of translations translate in the pop-up window that’s always in the […]"}]