[{"link":"https://nmac.to/blog/mini-design-bundle/","image":"https://nmac.to/wp-content/uploads/2013/12/Mini_Design_Bundle.jpg","title":"Mini Design Bundle 1.0 – Logo Design Resources Including Batch Image Converter","content":"The Mini Design Bundle packs together an imaginative set of logos, logo graphics, website buttons, icons, backgrounds, price boxes, and talk bubbles. Everything is royalty free for commercial use, and includes high-resolution image formats as well as the original PSD, EPS or AI source files. The bundle includes: 100+ high-resolution logo objects (transparent PNGs) 50+ […]"},{"link":"https://nmac.to/blog/filehelper/","image":"https://nmac.to/wp-content/uploads/2013/12/FileIcon.175x175-75.jpg","title":"FileHelper 1.0.1 – Duplicates file finder","content":"Your Mac needs more free disk space! The FileHelper will find all duplicates and remove it. Intuitive interface helps you find all duplicate files: – advanced and fast algorithm of scanning– automatic selection of duplicates– safe deletion, it removes only allowed files– drag-and-drop folder– remove to Trash– custom settings for scanning– select file extensions to […]"},{"link":"https://nmac.to/blog/kuvva-wallpapers/","image":"https://nmac.to/wp-content/uploads/2013/12/Kuvva.jpg","title":"Kuvva Wallpapers 1.4.2 – Daily curated art for your desktop","content":"Kuvva Wallpapers is a utility that offers a weekly selection of curated images streamed straight to your desktop. Kuvva selects a new surprising artist each week and they in turn offer a new image for your desktop wallpaper for every day of the week. Rotating throughout the day. Kuvva will help style your digital life. […]"},{"link":"https://nmac.to/blog/zip-expert/","image":"https://nmac.to/wp-content/uploads/2013/12/zipexpert.175x175-75.jpg","title":"Zip Expert 1.0 – Extract / create archive files","content":"Zip Expert, a small and easy to use app that can extract / create many different kinds of archive files.   Extraction formats supported: Zip, RAR, 7z, TAR, Gzip, CAB, PAX, Lzma, Bzip2 and more.   Compression formats supported: Zip, 7z, TAR, Gzip, Bzip2   Features: Supports password protected archive files extracting. Supports compress files […]"},{"link":"https://nmac.to/blog/simplyweather/","image":"https://nmac.to/wp-content/uploads/2013/12/SimplyWeather.jpg","title":"SimplyWeather 1.0.1 – Weather info in your menu bar","content":"SimplyWeather simply puts the weather in your menu bar. Just glance up and you’ll see the current temperature outside. Click on it to get a more detailed view of what the current conditions are and what the next four days will be. Hover your mouse over the information to get a quick forecast of today […]"},{"link":"https://nmac.to/blog/desk-clock/","image":"https://nmac.to/wp-content/uploads/2013/12/Desk.Clock_.jpg","title":"Desk Clock 1.1 – Set your preferred way of viewing the time","content":"Desk Clock is a customizable time keeping delight, allowing users to set up their preferred way of viewing time. Simple to set up and use. Move the clock around to where you want it. Pick the style and size you like the most. Desk Clock is a great way to display time the way you […]"},{"link":"https://nmac.to/blog/cleanr/","image":"https://nmac.to/wp-content/uploads/2013/12/iclean.175x175-75.jpg","title":"Cleanr 1.01 – Clean your hard drive of caches, downloads, etc","content":"Cleanr quickly scans your computer’s hard drive to provide you with a unique visual of your files. You can make space for files by deleting anything you see taking up space or files you no longer need. You can remove cached and unwanted files from your hard drive in a flash! Cleanr can clean your […]"},{"link":"https://nmac.to/blog/miniplayer-for-youtube/","image":"https://nmac.to/wp-content/uploads/2013/12/tube.jpg","title":"Miniplayer for Youtube 1.1 – Use your youtube videos like tracks in a library","content":"Do you like music?. Do you use YouTube to listen to music?. Have you got Youtube playlists? You Need Miniplayer for Youtube! When you use Miniplayer for Youtube, you choose if you only hear or want to see the video. Miniplayer for Youtube lets you use your youtube videos like tracks in a library. Listen / […]"},{"link":"https://nmac.to/blog/dentropy/","image":"https://nmac.to/wp-content/uploads/2013/12/icon.175x175-7521.jpg","title":"dEntropy 1.01 – Tidy your folder and files from your desktop","content":"Your download folder bristles? Your desktop almost breaks from your last month’s files you just wanted to „buffer here until tomorrow“? Even in our virtual life the entropy rises from day to day and hinders us from accomplishing important tasks. Everybody wants to fight their personal entropy but „ain’t nobody got time for that!?“ How […]"},{"link":"https://nmac.to/blog/emcee-for-itunes-17/","image":"https://nmac.to/wp-content/uploads/2013/12/Emcee.175x175-75.jpg","title":"Emcee for iTunes 1.7 – Humbly shows the song in the menu bar","content":"Many Mac apps show what’s currently playing in your iTunes — often by rendering semi-transparent widgets over what you do. Those widgets distract you from work and never answer the question “What’s playing?” the moment you have it.   Emcee humbly shows the song in the menu bar.   The song name does not scroll, […]"}]