[{"link":"https://nmac.to/blog/mp3tag/","image":"https://nmac.to/wp-content/uploads/2021/04/Mp3tag.png","title":"Mp3ta‪g‬ 1.2.2 – The universal tag editor","content":"Mp3tag is a powerful and easy-to-use tool to edit metadata of audio files. Musicians, DJs, podcasters, and audio-enthusiasts use it for many different aspects of handling audio files.   It supports batch tag-editing for multiple files at once, covering many audio formats from MP3, over MP4, and M4V (yes, that’s video!) to FLAC, OGG, OPUS, […]"},{"link":"https://nmac.to/blog/tampermonkey/","image":"https://nmac.to/wp-content/uploads/2020/12/Tampermonkey.png","title":"Tampermonkey 4.13.6140 – Userscript manager","content":"Tampermonkey is the most popular userscript manager, with over 10 million users. It’s available for Safari, Chrome, Microsoft Edge, Opera Next and Firefox.   Tampermonkey makes it very easy to manage your userscripts and provides features like a clear overview over the running scripts, a built-in editor, ZIP-based import and export, automatic update checks and […]"},{"link":"https://nmac.to/blog/autocrypt/","image":"https://nmac.to/wp-content/uploads/2021/03/AutoCrypt_2.png","title":"AutoCrypt 2.5 – Save encryption settings in a document","content":"AutoCrypt, is an encryption/decryption app with a document-based approach.   AutoCrypt uses the latest Apple technology: Sandbox: The app works at the maximum security level Resume: the app will reopen at the point and state the user left it Auto save: the app saves using the Mac OS X autosave functionality Versions: the user can […]"},{"link":"https://nmac.to/blog/disk-doctor/","image":"https://nmac.to/wp-content/uploads/2016/07/Disk-Doctor3.png","title":"Disk Doctor 4.4 – Free up disk space","content":"Disk Doctor will free up disk space by removing cached and unneeded files from your hard drive.   With one press of a button, Disk Doctor can empty the following: Applications Caches Application Logs Language Packs Mail Downloads Folder Downloads Folder Trash Can   Version 4.4: Added native support for M1   Intel, 64-bit processor […]"},{"link":"https://nmac.to/blog/super-vectorizer/","image":"https://nmac.to/wp-content/uploads/2016/05/Super-Vectorizer.png","title":"Super Vectorizer 2.1.0 – Professional vector trace tool","content":"Super Vectorizer is a professional vector-trace tool that enables conversion from a raster (bitmap) image–such as JPEG, BMP, or PNG--to a scalable vector graphic with a few simple clicks. It automatically creates high-quality vector traces from images, and supports tracing of not only color and grayscale images, but also black and white. Super Vectorizer can […]"},{"link":"https://nmac.to/blog/better-trash/","image":"https://nmac.to/wp-content/uploads/2021/03/Better-Trash.png","title":"Better Trash 1.7.0 – A trash manage app","content":"Better Trash is a trash manage app on macOS, it’s designed to help you solve problems that Trash can’t be emptied, clean up the trash automatically, view the original location of the trash item, and view the history record of emptying trash with Better Trash.   1. Have you ever encountered the Trash can’t empty? […]"},{"link":"https://nmac.to/blog/dmg-master/","image":"https://nmac.to/wp-content/uploads/2016/05/DMG-Master.png","title":"DMG Master 2.9 – Create DMG image archives with a document based approach","content":"DMG Master is a simple and optimized Mac OS X app to create standard DMG Disk Image Archive recognized by any Mac, with just one click. Disk Images Archive (DMG) is the preferred and standard way on the Mac to create archives to exchange group of files compacted in a single file from one user […]"},{"link":"https://nmac.to/blog/explottens/","image":"https://nmac.to/wp-content/uploads/2021/04/Explottens_1_.png","title":"Explottens 1.7 – The Time is Meow!","content":"Explottens is a heart pumping, hair raising, twin-stick shoot ‘em up that follows Kit the pilot and his band of misfits as they zip, boost, and shoot through the sky, battling the ferocious felines of K.L.A.W. Explottens focuses on delivering pure arcade joy with bullet hell gameplay, epic boss battles and lots of explosions in […]"},{"link":"https://nmac.to/blog/mini-metro-plus/","image":"https://nmac.to/wp-content/uploads/2021/07/Mini_Metro_Plus.png","title":"Mini Metro+ 1.0.1 – Build a better subway","content":"Mini Metro is a game about designing a subway map for a growing city. Draw lines between stations and start your trains running. As new stations open, redraw your lines to keep them efficient. Decide where to use your limited resources. How long can you keep the city moving?   Random city growth means each […]"},{"link":"https://nmac.to/blog/the-bluecoats-north-south/","image":"https://nmac.to/wp-content/uploads/2021/07/The-Bluecoats.png","title":"The Bluecoats: North & South 1.0 – Turn Based Strategy Game","content":"Reunite with Sergeant Cornelius M. Chesterfield and Corporal Blutch in this remastered game that combines turn-based strategy and real-time action. This new version will delight fans of the original game, initially released on the Amiga at the end of the 1980s!   Master turn-based strategy to achieve victory. Take control of new states, secure forts […]"}]