[{"link":"https://nmac.to/blog/liquid-author/","image":"https://nmac.to/wp-content/uploads/2018/01/Liquid-Author.png","title":"Liquid | Author 1.5.6 – Word processor with powerful controls","content":"The Author word processor provides a minimalist visual environment with powerful controls: Automatic Outline. Pinch to collapse the text using your trackpad to see just the Headings and then click in the left hand margin to re-arrange the Headings. Quick Citation Creation. Select text and cmd-T to add ciTations for academic papers, books, web and […]"},{"link":"https://nmac.to/blog/conarium-game/","image":"https://nmac.to/wp-content/uploads/2018/02/Conarium.png","title":"Conarium 1.0.0.6 – Lovecraftian Horror & Adventure Game","content":"Conarium is a chilling Lovecraftian game that follows the gripping story of four scientists and their endeavour to challenge what we normally consider to be the “absolute” limits of nature. Inspired by H.P. Lovecraft’s novella At the Mountains of Madness, but largely set after the original story.   You, as Frank Gilman, open your eyes […]"},{"link":"https://nmac.to/blog/uninstaller-sensei/","image":"https://nmac.to/wp-content/uploads/2017/11/Uninstaller-sensei.png","title":"Uninstaller sensei 1.3.1 – Completely remove applications","content":"Uninstaller sensei is an app for complete removal of applications and files that are associated with them. You can remove installed apps or uninstall just dragging it or enable Spider and usually move app to trash, and Spider take cares about everything. Now don’t need to remove app use Uninstaller sensei select app from apps […]"},{"link":"https://nmac.to/blog/screen-capture-recorder/","image":"https://nmac.to/wp-content/uploads/2016/12/Screen-Capture-Recorder2.png","title":"Screen Capture & Recorder 2.5.2 – Perfect screen recording software","content":"Screen Capture & Recorder is one perfect screen recording software, The core feature is recording exactly what you see with High-Resolution and High-FPS on your Mac, Record audio from Microphone & Computer Sound at the same time. Screen Capture & Recorder also support video editor to trim the recorded video or other video files like […]"},{"link":"https://nmac.to/blog/mail-act-on/","image":"https://nmac.to/wp-content/uploads/2016/10/Mail-ActOn4.png","title":"Mail Act-On 4.1.4 – Map customized email rules and actions to Act-On keys","content":"Mail Act-On is the powerful enhancement to Apple’s Mail Application that puts organization at your fingertips. Use Mail Act-On to create rules to perform action on messages by responding to simple keystrokes. Create Outbox rules to automatically add headers and set the archive mailboxes of sent mail. Mail Act-On is the indispensable tool for anyone […]"},{"link":"https://nmac.to/blog/paint-s/","image":"https://nmac.to/wp-content/uploads/2018/02/Paint-S.png","title":"Paint S 5.6.8 – An easy-to-use drawing tool","content":"Paint S is an easy-to-use drawing tool and image editor which can help you to draw pictures and edit your existing photos. With it you can sketch and crop, rotate, scale images very easily. At the same time, you can and text onto images as you want. The app also supports layers, so you can […]"},{"link":"https://nmac.to/blog/poly-bridge/","image":"https://nmac.to/wp-content/uploads/2018/02/Poly-Bridge.png","title":"Poly Bridge 1.0 – Bridge building simulator game","content":"Unleash your engineering creativity with an engaging and fresh bridge-building simulator with all the bells and whistles.   Enjoy hours of physics-based puzzle solving in the Campaign and then jump in the Sandbox to create your own bridge designs and puzzles.   Challenge friends and the rest of the Steam Workshop community to solve your […]"},{"link":"https://nmac.to/blog/bookmarkapp/","image":"https://nmac.to/wp-content/uploads/2017/04/BookmarkApp.png","title":"BookmarkApp 1.7.6 – duplicate cleaner and organizer","content":"BookmarkApp is an unique and useful tool for organizing bookmarks in your Safari browser.   Everyone who use Safari as a main browser has many duplicated bookmarks.   Even after cleaning, during importing or adding of the new bookmarks may appear a lot of new duplicates. The aim of this tool to make your Safari […]"},{"link":"https://nmac.to/blog/dashcam-viewer/","image":"https://nmac.to/wp-content/uploads/2018/02/Dashcam-Viewer.png","title":"Dashcam Viewer 2.7.7 – View sequential dashcam videos and associated GPS data","content":"Dashcam Viewer is an application for viewing sequential dashcam videos and associated GPS data. With Dashcam Viewer you can play your videos on the main screen while watching your vehicle’s speed, distance, position, and bearing update on graphs, data displays, and Google Maps. You can even export your GPS tracks to common file formats such […]"},{"link":"https://nmac.to/blog/hidden-folks/","image":"https://nmac.to/wp-content/uploads/2018/02/Hidden-Folks.png","title":"Hidden Folks 1.4.1 – Search for hidden folks in hand-drawn landscapes","content":"Search for hidden folks in hand-drawn, interactive, miniature landscapes. Unfurl tent flaps, cut through bushes, slam doors, and poke some crocodiles! Rooooaaaarrrr!!!!!   A strip of targets shows you what to look for. Click on a target for a hint, and find enough to unlock the next area.   In case you like numbers a […]"}]