[{"link":"https://nmac.to/blog/reveal-1-6-2/","image":"https://nmac.to/wp-content/themes/nmac/images/placeholder-320.png","title":"Reveal 1.6.2 – Developer tool for editing iOS apps","content":"Reveal is a powerful, smart iOS developer tool that allows you to interact with your apps in fine, visually-stunning detail. Runtime inspection for iOS apps… Reveal brings the power of tools like Firebug and Web Inspector to iOS developers. See your application’s view hierarchy at runtime with advanced 2D and 3D visualisations. Debug view layout […]"},{"link":"https://nmac.to/blog/movavi-split-movie-1-0/","image":"https://nmac.to/wp-content/uploads/2015/11/Movavi.Split_.Movie_.png","title":"Movavi Split Movie 1.0 – Split, cut, and trim videos in popular formats","content":"Movavi Split Movie for Mac OS X is an entire editing studio in a single program. Split, trim, and cut movies in AVI, MKV, MP4, WMV, MPEG-TS (MTS), MOV, FLV, MPEG, H.264, and other formats. Unlike other Mac editing programs, Split Movie processes multimedia without re-encoding and post-conversion which preserves the original quality and lets […]"},{"link":"https://nmac.to/blog/evil-defenders/","image":"https://nmac.to/wp-content/uploads/2015/11/Evil.Defenders.png","title":"Evil Defenders 1.0 – A fun & frenetic defense game","content":"Evil Defenders is a fun, frenetic defense game: build and upgrade your towers, сast spells to repel enemy forces, use special landmarks and defend the Lands of Evil from invaders!   Feel free to play the game in many different ways through unique tower upgrades, a deep skill tree and 100 in-game achievements.   Main […]"},{"link":"https://nmac.to/blog/galak-z-1-0/","image":"https://nmac.to/wp-content/uploads/2015/11/Galak-Z.png","title":"Galak-Z 1.0 – A.I. driven hardcore combat like you’ve never seen in a 2D shooter","content":"Prepare for the bar to be raised on deep-space 2D dog-fighting! GALAK-Z is a modern, A.I. and physics-driven open-world action game, viewed through the lens of the classic 16-bit space shooter. Powered by the next-generation Cyntient AI platform, GALAK-Z puts players in control of anime-inspired spacecraft inhabiting procedurally generated worlds.   In GALAK-Z both stealth […]"},{"link":"https://nmac.to/blog/wasteland-2-directors-cut/","image":"https://nmac.to/wp-content/uploads/2015/11/Wasteland.2.Directors.Cut_.png","title":"Wasteland 2: Director’s Cut 2.0.0.1 – The first-ever post-apocalyptic computer RPG Game","content":"    From the Producer of the original Fallout comes Wasteland 2, the sequel to the first-ever post-apocalyptic computer RPG.   The Wasteland’s hellish landscape is waiting for you to make your mark… or die trying. With over 80 hours of gameplay, you will deck out your Desert Ranger squad with the most devastating weaponry […]"},{"link":"https://nmac.to/blog/phoneexpander-1-1/","image":"https://nmac.to/wp-content/uploads/2015/11/PhoneExpander.png","title":"PhoneExpander 1.1 – Quickly free up iOS storage","content":"PhoneExpander is an app that runs on your Mac, just like iTunes. You connect your iOS device and are able to clear out space for updates, new apps, and media. It takes a few minutes to run, and you can use just one or all of the different tools. PhoneExpander is designed to be simple […]"},{"link":"https://nmac.to/blog/mobisaver-5-0/","image":"https://nmac.to/wp-content/uploads/2015/11/MobiSaver.png","title":"MobiSaver 5.0 – Top-rated iPhone, iPad, iPod touch Data Recovery Software","content":"EaseUS MobiSaver for Mac is a fast, efficient and easy-to-use Mac iPhone data recovery software designed to handle various kinds of iPhone/iPad /iPod touch data loss circumstances. Lost data after accidental deletion/virus attack/restoring to factory settings. Lost data after iOS upgrade, jailbreak or restoring to factory settings. Fail to read your data because device is […]"},{"link":"https://nmac.to/blog/quickbooks-2015-16-0-4/","image":"https://nmac.to/wp-content/uploads/2014/12/QuickBooks-2015.png","title":"QuickBooks 2015 16.0.4 – Financial management and accounting for small businesses","content":"QuickBooks Pro 2015 helps you manage your business easily and efficiently. Organize your finances all in one   place, track money going in and out of your business, and spot areas where you can save.   Built for Mac OS – Looks and works like you’d expect Create invoices, pay bills, and manage expenses Gain […]"},{"link":"https://nmac.to/blog/ssh-tunnel-15-11/","image":"https://nmac.to/wp-content/uploads/2015/03/SSH.Tunnel.png","title":"SSH Tunnel 15.11 – Easily manage and control ssh tunnels","content":"SSH Tunnel allows you to easily manage and precisely control your ssh tunnels.   SSH Tunnel is able to remember the ssh login password and save it to OS X’s keychain. Furthermore, SSH Tunnel is designed to automatically reconnect when your Mac is waking up from sleep.   Notable Features: Auto launch when log in […]"},{"link":"https://nmac.to/blog/framer-studio-1-14-14/","image":"https://nmac.to/wp-content/uploads/2014/08/Framer.Studio.png","title":"Framer Studio 1.14.14 – Invent, design and experiment with interaction","content":"Framer Studio is built on Framer.js, an open source framework for rapid prototyping. Framer allows you to define animations and interactions. It runs on mobile devices, too.   Source on GitHub Hardware Accelerated Events & 3D Animations Spring Physics Framer.js used at: Google, Facebook, Instagram and Stripe   Generate Generate assets out of Sketch and […]"}]