[{"link":"https://nmac.to/blog/infinium-strike-1-0/","image":"https://nmac.to/wp-content/uploads/2016/07/Infinium.Strike.png","title":"Infinium Strike 1.0 – Arcade style tower defense game","content":"The year is 2170. One after another, the human colonies have fallen to the seemingly limitless invasion force of the enigmatic organic ships known as the Wrog. Entire armadas of Earth’s fighters have been decimated. Our last hope lies with the Freedom Strike, a massive super-tech battlecarrier fitted with interchangeable turrets and a fleet of […]"},{"link":"https://nmac.to/blog/folderbrander-2-4/","image":"https://nmac.to/wp-content/uploads/2016/07/FolderBrander.png","title":"FolderBrander 2.4 – Change folder icons in the Finder sidebar","content":"FolderBrander lets you quickly and easily alter the look of your folders. Mac OS X lets you keep folders in the Dock and the Finder’s sidebar. This makes accessing frequently used folders quick and easy. The problem is that without customized folder icons, you cannot tell the folders apart. In many cases, having a short […]"},{"link":"https://nmac.to/blog/bloom-1-0-447/","image":"https://nmac.to/wp-content/uploads/2016/02/Bloom.png","title":"Bloom 1.0.447 – Lightweight, cross-platform, procedural graphics editor","content":"Bloom (was Ormr) is a fast, lightweight, cross-platform procedural graphics editor that lets you tweak any action you have ever performed — organized by layer. In Bloom, everything is numerically adjustable – all the time, long after the initial effect has been applied. You can tweak and adjust every detail to your heart’s delight until […]"},{"link":"https://nmac.to/blog/veertu-1-1-2/","image":"https://nmac.to/wp-content/uploads/2016/02/Veertu.png","title":"Veertu 1.1.2 – Native Virtualization for OS X","content":"Run Windows and Linux on your Mac alongside OS X   Veertu is simple, light, secure virtualization software designed for Mac.   With Veertu you can run your favorite Window or Linux distribution directly on OS X. Veertu is powered by Hypervisor framework and runs entirely in sandbox,eliminating the need for root permissions and kernel […]"},{"link":"https://nmac.to/blog/steamroll-4-10-4/","image":"https://nmac.to/wp-content/uploads/2016/07/steamroll.png","title":"Steamroll 4.10.4 – An adventure and puzzle game with a touch of minigolf gameplay","content":"Steamroll is an adventure and puzzle game with a touch of minigolf. It creates a steampunk atmosphere where you will have to solve puzzles by designing and shooting steamballs from your vehicle to create ramps, walls, activate triggers, blow things away, and more.   In Steamroll you are a young engineer in his first day […]"},{"link":"https://nmac.to/blog/split-lab-1-3/","image":"https://nmac.to/wp-content/uploads/2016/07/Split-Lab.png","title":"Split Lab 1.3 – A professional image splitting tool","content":"Split Lab is a professional image splitting tool. It creates pieces from PNG, TIFF and JPG images at any size and resolution.   Split Lab is for all creatives, artists and designers, who need to create high quality splits from artwork for print, digital or for experimenting with content formats.   Split Lab comes with […]"},{"link":"https://nmac.to/blog/socialpanel-1-3-6/","image":"https://nmac.to/wp-content/uploads/2016/06/SocialPanel.png","title":"SocialPanel 1.3.6 – Access social networks from your desktop","content":"SocialPanel brings a completely new experience to accessing your favorite social networks from your desktop. SocialPanel stays hidden from your desktop without disturbing your work and fades in or out when you move your mouse to the very right side of the screen (excluding the corners so you can use the OS X hot-corner shortcuts). […]"},{"link":"https://nmac.to/blog/greeting-cards-1-7/","image":"https://nmac.to/wp-content/uploads/2016/07/Greeting-Cards.png","title":"Greeting Cards 1.7 – A collection of 500 Pages templates for cheerful celebrations","content":"Greeting Cards – Graphic Node presents a holidays card application offering a collection of 500 Pages templates for cheerful celebrations.   Buy it now if you: Want to congratulate your friends or loved ones Do it like a professional designer Want to get regular updates Like free things and holidays   Nearly all objects in […]"},{"link":"https://nmac.to/blog/data-rescue-4-2-3/","image":"https://nmac.to/wp-content/uploads/2014/03/Data.Rescue.png","title":"Data Rescue 4.2.3 – Powerful hard drive data recovery solution","content":"Data Rescue is a robust and reliable data recovery solution for your Mac. Data Rescue has a 5-star average rating on the Mac App Store a 4.5 star rating on Amazon, in addition to over 150 industry awards for best-in-class Mac recovery since it’s debut in 2002. Works on all Mac hard drives even if […]"},{"link":"https://nmac.to/blog/combo-translator-1-0/","image":"https://nmac.to/wp-content/uploads/2016/07/Combo-Translator.png","title":"Combo Translator 1.0 – All Major Translators In One App","content":"Combo Translator includes all major translators: Google Translate, Bing Translator and Yandex Translate.   It’s simple and easy to use, just enter your text and get the translations from all translators at the same time.   Features: Included 3 translate engines: Google Translate, Bing Translator and Yandex Translate. Supports over 90 languages. Text to Speech […]"}]