[{"link":"https://nmac.to/blog/compress-all-3-2/","image":"https://nmac.to/wp-content/uploads/2016/07/Compress-All3.png","title":"Compress All! 3.2 – Compress your photos & images in seconds to reduce space","content":"Save space on your computer by compressing your photos/images. With Compress All you can compress a set of photos/images quickly without the need to be an expert in image processing.   You can add your photos/images, change the compress factor on a simple slider, marked with min (minimum compression) and max (max compression), and save. […]"},{"link":"https://nmac.to/blog/chordsmaestro-1-3/","image":"https://nmac.to/wp-content/uploads/2016/07/ChordsMaestro.png","title":"ChordsMaestro 1.3 – Play various chords for the piano and 6 different string instruments","content":"Using this great chords collection, you will be able to play the chords of 7 popular music instruments (piano, guitar, bass guitar, ukulele etc.), no prior experience needed!   All music instruments in the app are interconnected, and this gives the unique ability to transfer the chords from one instrument to another!   Take advantage […]"},{"link":"https://nmac.to/blog/business-templates-for-pages-and-numbers-2-0-1/","image":"https://nmac.to/wp-content/uploads/2016/07/Business.Templates.png","title":"Business Templates (for Pages and Numbers) 2.0.1 – Add-on for Apple’s Pages and Numbers","content":"Business Templates (for Pages and Numbers) is a valuable add-on for Apple’s Pages and Numbers apps. It provides 75 professional business-oriented templates, in a coherent design.   42 TEMPLATES FOR PAGES Annual Report, Application for Employment, Bill of Sale, Brochure, 3x Business Cards, Case Study, Consulting Contract, Business Plan, Cash Advance Request Form, Clothing Tag, […]"},{"link":"https://nmac.to/blog/templates-for-pages-by-nobody-2-3/","image":"https://nmac.to/wp-content/uploads/2016/07/Templates.for_.Pages.png","title":"Templates for Pages (by Nobody) 2.3 – Amazing add-on for Apple’s Pages app","content":"Templates for Pages (by Nobody) is an amazing add-on for Apple’s Pages app. It provides 250 templates for Pages in 34 categories.   34 CATEGORIES Blank Paper Brochures Business Cards Calendars (2016 and 2017) Cards Certificates Coupons Envelopes Essays (MLA, APA) Fax Cover Sheets Flyers iBooks Invitations Invoices Labels (Address Label, Shipping Label, Gift Label) […]"},{"link":"https://nmac.to/blog/templates-for-numbers-by-nobody-1-1/","image":"https://nmac.to/wp-content/uploads/2016/07/Templates.for_.Numbers.png","title":"Templates for Numbers (by Nobody) 1.1 – Amazing add-on for Apple’s Numbers app","content":"Templates for Numbers (by Nobody) is an amazing add-on for Apple’s Numbers app. It provides 55 templates suitable for various tasks.   CONTENT Address List 1, Address List 2, Babysitter Notes, Balance Sheet, Break Even Analysis, Budget – Personal Monthly, Budget – Travel 1, Budget – Travel 2, Budget – Wedding, Budget, Calendar Daily, Calendar […]"},{"link":"https://nmac.to/blog/templates-for-keynote-by-nobody-1-2/","image":"https://nmac.to/wp-content/uploads/2016/07/Templates.for_.Keynote.png","title":"Templates for Keynote (by Nobody) 1.2 – Amazing add-on for Apple’s Keynote app","content":"Templates for Keynote (by Nobody) is an amazing add-on for Apple’s Keynote app. It provides 60 stunning templates for Keynote, each with over 20 ready-to-use slides to suit everyone’s needs.   INTEGRATES SEAMLESSLY WITH KEYNOTE  Simply open a template in Keynote and use it just like one of the built-in ones.   EASILY CUSTOMIZABLE  Once […]"},{"link":"https://nmac.to/blog/quick-file-renamer-4-7/","image":"https://nmac.to/wp-content/uploads/2016/07/Quick-File-Renamer.png","title":"Quick File Renamer 4.7 – A simple and safe file renaming solution for everyone","content":"Quick File Renamer – Rename your photo collection using meaningful names. Organize your MP3 or iTunes music library with artist, song, album and track numbers. Access the EXIF metadata in your digital photography and use it to name your files.   Simply browse for files, use our wildcard search, or drag and drop them into […]"},{"link":"https://nmac.to/blog/oh-my-schedule-im-a-doctor-pro-1-0/","image":"https://nmac.to/wp-content/uploads/2016/07/Oh-My-Schedule.png","title":"Oh My Schedule! I’m a Doctor Pro 1.0 – A useful optimize and organize tool for doctors","content":"Any branch of medicine requires precise organization of work. Sometimes, medics work in rough conditions, which are connected with stress and lack of time. Each, even the least essential step of the treatment process must be precisely performed in accordance with the rules, regulations and schedule. Sometimes it is impossible to keep all nuances in […]"},{"link":"https://nmac.to/blog/epubor-ultimate-3-0-8-14/","image":"https://nmac.to/wp-content/uploads/2016/03/Epubor.Ultimate.png","title":"Epubor Ultimate 3.0.8.14 – Convert eBook formats and remove DRM","content":"Epubor Ultimate lets you convert and remove DRM from eBooks. The software can decrypt and convert eBooks purchased from: Amazon Kindle, Kobo, Sony, Google Play, Barnes, Noble Nook, Smashwords, and even public libraries.   What’s Unique New eBook conversion core developed by Epubor, 5x faster than others Now supports the Kobo DRM version 3.19, which […]"},{"link":"https://nmac.to/blog/easy-file-hider-1-1-1/","image":"https://nmac.to/wp-content/uploads/2016/07/Easy.File_.Hider_.png","title":"Easy File Hider 1.1.1 – Quickly and easily hide files and folders","content":"Easy File Hider – Quickly and easily hide files and folders! Your password-protected list of files and folders can be toggled between hidden and visible with the push of a button!   What the app can do: Make files and folders disappear Restore hidden files exactly as they were Protect your sensitive documents from view […]"}]