[{"link":"https://nmac.to/blog/icey-1-0/","image":"https://nmac.to/wp-content/uploads/2017/05/ICEY.png","title":"ICEY 1.0 – A 2D side-scrolling action & adventure game","content":"ICEY is a 2D side-scrolling action game. As you follow the narrator’s omnipresent voice, you will see through ICEY’s eyes and learn the truth about her world.   “Alright, you caught me! This ISN’T really just a simple 2D action game, and you WON’T be seeing through ICEY’s eyes… NOR will you learn the truth […]"},{"link":"https://nmac.to/blog/art-view-2-0/","image":"https://nmac.to/wp-content/uploads/2014/01/Art-View.png","title":"Art View 2.0 – Enhanced Quick Look support for Adobe Creative Suite and Cloud","content":"Art View: Quick Look enhancement for Creative Suite and Creative Cloud.    Download and launch Art View. Suddenly your graphics files’ Quick Look previews come to life. Illustrator files preview with or without PDF compatibility, InDesign files show their embedded previews for the first time outside of Bridge, and Adobe Swatch Exchange files show up […]"},{"link":"https://nmac.to/blog/timing-1-8-1/","image":"https://nmac.to/wp-content/uploads/2014/09/Timing.png","title":"Timing 1.8.1 – Discover how you spend time on your Mac","content":"Timing is the best way to keep track of the time you spend with your Mac. Find out where your time goes — without ever having to start a timer again!   Timing automatically tracks which documents you are editing, which applications you use, and the domains of the websites you visit. You’ll never have […]"},{"link":"https://nmac.to/blog/devonagent-pro-3-9-6/","image":"https://nmac.to/wp-content/uploads/2014/04/DEVONagent.Pro_.png","title":"DEVONagent Pro 3.9.6 – Maximize Web search efficiency","content":"DEVONagent Pro helps you search more efficiently on the web. It searches multiple sources, frees you from hunting for the really relevant results, and gives you power tools for your research.   Filters bad results so you don’t have to Shows results the way you want Creates reports in many formats Saves searches so you […]"},{"link":"https://nmac.to/blog/mytuner-radio-2-0/","image":"https://nmac.to/wp-content/uploads/2017/05/myTuner-Radio2.png","title":"myTuner Radio 2.0 – Listen to the radio from your menu bar","content":"myTuner Radio is the best way to listen to the radio on your Mac. More than 120 countries and 30,000 radio stations available in our application, from sports to news and music and many others to choose from.   With myTuner Radio you can: Listen to the best radios stations Radios from more than 120 […]"},{"link":"https://nmac.to/blog/flyer-mill-1-7/","image":"https://nmac.to/wp-content/uploads/2017/02/Flyer-Mill.png","title":"Flyer Mill 1.7 – Templates for Pages","content":"Flyer Mill – Templates for Pages is an excellent collection of 220 original templates, designed to give a unique look to your promo material. Whether you’re promoting a cool event, launching a new product, or announcing a mind-blowing sale, these flyers will help you do that with efficiency and style.   Every object in Flyers […]"},{"link":"https://nmac.to/blog/stellardrivedefrag-3-0/","image":"https://nmac.to/wp-content/uploads/2017/05/StellarDriveDefrag.png","title":"StellarDriveDefrag 3.0 – Defragment meta data in a disk volume","content":"    StellarDriveDefrag is here to help you systematize the fragmented data and free space in the Mac volumes. The software gathers the fragmented data of a file and stores together into a single chunk of memory, which makes the data access speed faster.   Features Defrags the meta-data files in a volume. Optimizes the […]"},{"link":"https://nmac.to/blog/aragami-assassin-masks-1-0/","image":"https://nmac.to/wp-content/uploads/2016/10/Aragami.png","title":"Aragami – Assassin Masks 1.0 – A third person action & adventure stealth game","content":"You are Aragami, a vengeful spirit with the power to control the shadows. You’ve been summoned by Yamiko, a girl imprisoned in the city fortress of Kyuryu. Embark on a dark journey full of blood and secrets to discover the truth about aragami. Infiltrate the occupied city of Kyuryu with your supernatural powers and fight […]"},{"link":"https://nmac.to/blog/badia-bigpicture-for-indesign-8-0-0/","image":"https://nmac.to/wp-content/uploads/2017/05/Badia-BigPicture.png","title":"Badia BigPicture for InDesign 8.0.0 – Manage graphics and picture links in Adobe InDesign","content":"Badia BigPicture for InDesign gives you the most comprehensive solution for managing graphics and picture links in Adobe InDesign. With BigPicture, you get instant access to detailed image information, complete picture lists, a unique search-and-relink engine, plus powerful tools for updating, revealing, opening, renaming, replacing, and moving multiple links.   Version 8.0.0: New version for […]"},{"link":"https://nmac.to/blog/home-design-3d-4-1-1/","image":"https://nmac.to/wp-content/uploads/2016/11/Home-Design-3D.png","title":"Home Design 3D 4.1.1 – Design and change your home","content":"With Home Design 3D, designing and remodeling your house in 3D has never been so quick and intuitive!   Accessible to everyone, Home Design 3D is the reference interior design application for a professional result at your fingertips!   CREATE, DESIGN, FURNISH AND DECORATE EASILY YOUR HOME AND SHARE IT WITH A COMMUNITY OF MORE […]"}]