[{"link":"https://nmac.to/blog/photostyler-v653-add-sense-of-realism/","image":"https://nmac.to/wp-content/uploads/2013/12/PhotoStyler.png","title":"PhotoStyler 6.7 – Add a sense of realism to your digital photos","content":"PhotoStyler is the easiest way to style your digital photos with your Mac. This simple, fast and accurate native solution combines the powers of Apple’s core technologies with the flexibility and efficiency of proprietary application-specific modules. PhotoStyler supports all image formats that are supported by MacOS including RAW images. PhotoStyler doesn’t require any special skills […]"},{"link":"https://nmac.to/blog/diskaid/","image":"https://nmac.to/wp-content/uploads/2013/12/27830.jpg","title":"DiskAid 6.4.6 – Use your iOS device as an external disk and more","content":"DiskAid is the ultimate Transfer Tool for accessing the iPod, iPhone or iPad directly from the desktop. Access Data such as: Music, Video, Photos, Contacts, Notes, Call History, Text Messages (SMS), Voicemail and Voice Memos.Connects directly to any installed iPhone App and enables the use of the iPhone as an USB Drive.   With DiskAid you […]"},{"link":"https://nmac.to/blog/growl-21/","image":"https://nmac.to/wp-content/uploads/2013/12/Growl.png","title":"Growl 2.1.3 – Notification system for OS X apps","content":"Growl is a notification system that allows any application to send it a notification, and then it displays it. You can (for example) be notified that you have new email, or that a download completed.   WHAT’S NEW Version 2.1.3: Fixes an issue on OS X 10.9 where sending notifications to Growl will result in […]"},{"link":"https://nmac.to/blog/analog-13/","image":"https://nmac.to/wp-content/uploads/2013/12/analog_colors.png","title":"Analog 1.4 – Improve your photos with filters and borders","content":"Analog makes it easy to improve your photos with a stunning selection of filters and borders. We built Analog to make it as fun and easy as possible to give your digital photos some soul. Drag in a photo, browse through filters and borders, and start processing. There are 20 built-in filters, and over a […]"},{"link":"https://nmac.to/blog/airbeam-pro/","image":"https://nmac.to/wp-content/uploads/2013/12/icon_pro.175x175-75.jpg","title":"AirBeam Pro 1.4 – Turns your Mac & iDevices into a flexible audio and video monitoring system","content":"AirBeam Pro streams live video and audio from your Mac’s cameras and microphones across a WiFi or 3G network. You can watch the stream in a web browser or with the AirBeam App on your iPhones, iPads or iPods. And AirBeam works also vice versa: Use your iDevices as remote cameras and follow the live stream on […]"},{"link":"https://nmac.to/blog/intensify/","image":"https://nmac.to/wp-content/uploads/2013/12/ICON_INTENSIFY.175x175-75.png","title":"Intensify 1.0.0 – Create clarity and intensity in your photos","content":"Intensify lets discerning photographers of all skill levels create powerful photographic images with unprecedented drama and detail. Precise control of contrast, structure, detail and sharpening across different tonal ranges delivers high quality results every time.   Special algorithms to prevent image artifacts, image layer stacking with opacity control, dozens of professionally created presets, adjustment brushes, RAW […]"},{"link":"https://nmac.to/blog/idive/","image":"https://nmac.to/wp-content/uploads/2013/11/iDive.png","title":"iDive 2.0.5 – Pro-grade video cataloging for DV enthusiasts","content":"iDive is a digital video shoebox…for your DV tapes and now for all your QuickTime movies.   It will turn any assortment of disorganised video files into an instantly accessible catalog. Finding a clip hidden amongst hours of footage will never again be a problem.   Intuitive concepts such as people, places, events can be […]"},{"link":"https://nmac.to/blog/espionage-35/","image":"https://nmac.to/wp-content/uploads/2013/12/espionage.png","title":"Espionage 3.5.3 – Password protect files and folders through the Finder","content":"Espionage is a unique data security application. It lets you encrypt and password protect individual folders, and interact with them straight from the Finder.Espionage protects you even if you’re forced to give up your password by giving you the ability to have multiple master passwords, each protecting a unique set of folders through a feature […]"},{"link":"https://nmac.to/blog/appriority-1110/","image":"https://nmac.to/wp-content/uploads/2013/12/Appriority.175x175-75.jpg","title":"Appriority 1.1.11 – Optimize CPU load and speed up your apps","content":"Appriority is an easy-to-use tool for OS X that simply makes the app you’re working in go faster by allowing you to optimize the CPU load on your computer. Once fully configured, Appriority works by suspending and resuming applications as you switch among them. Inactive applications can be set for suspension which will eliminate their […]"},{"link":"https://nmac.to/blog/sketcher/","image":"https://nmac.to/wp-content/uploads/2013/12/sketcher.png","title":"Sketcher 1.4.1 – Turn digital photos into hand-made art","content":"Sketcher is for you if, like most of us, you like hand-made drawings, colorful oil paintings and accurate pencils strokes of the sketches, bu can’t draw well enough. This little app solves the problem!   Sketcher can easily turn any digital photo into the pencil sketch, watercolor or oil drawing, it’s light, simple, cross-platform, feature […]"}]