[{"link":"https://nmac.to/blog/lucid-1-0-1/","image":"https://nmac.to/wp-content/uploads/2015/11/Lucid1.png","title":"Lucid 1.0.1 – An easy to use software program that makes your pictures look great","content":"LUCiD was designed to help every photo look its best without the work. We all want great-looking photos, a chance to capture a memory and share it with others. But sometimes your smartphone doesn’t quite get the job done. LUCiD lets you improve photos in an instant while you’re on the go and share those […]"},{"link":"https://nmac.to/blog/fundy-designer-1-10-0/","image":"https://nmac.to/wp-content/uploads/2015/11/Fundy.Designer1.png","title":"Fundy Designer 1.10.0 – Next generation design tool","content":"A design leader in the professional photographic community since 2008, Fundy Software is behind you every step of the way. Working to bring you software that is revolutionary in its functionality and ease of use, learn how Andrew Funderburg, CEO of Fundy Software started the company.   Revolutionize your album design workflow and design like […]"},{"link":"https://nmac.to/blog/itemplates-4/","image":"https://nmac.to/wp-content/uploads/2015/11/iTemplates.png","title":"iTemplates 4 – Professional templates for Pages, Keynote, and Numbers","content":"iTemplates back to the origins, a unique and amazing collection of templates ready to use the iWork suite.   More than 120 pre-formatted templates, unique and professional-looking, will help you in all that you need. Newsletters, flyers, documents, letters, resumes, business cards. And yet, Numbers for spreadsheets, calendars customizable monthly, planning costs, planning trips … […]"},{"link":"https://nmac.to/blog/minuet-1-0/","image":"https://nmac.to/wp-content/uploads/2015/11/Minuet.png","title":"Minuet 1.0 – Light, playlist-centric, queue-based music player","content":"Minuet is a light and elegant music player. Its playlist-driven, queue-centric model lets you build, import, export, search, sort, and rearrange playlists with ease. A centralized queue makes it a breeze to mix and match songs from any of your playlists on the fly and even save your queue as a playlist. Minuet has been […]"},{"link":"https://nmac.to/blog/voila-3-9-2/","image":"https://nmac.to/wp-content/uploads/2014/02/Voila.png","title":"Voila 3.9.2 – Capture, annotate, organize, and share media","content":"Voila is a screen-capture, recording, and annotation tool that is a full-featured replacement for Mac’s screen-capture and screen-recording capabilities. It has a large and robust set of editing, organizing, annotation, and effects tools that allows the user to create and add details to screenshots, tutorials, videos, and presentations.   Voila lets you capture any shape, […]"},{"link":"https://nmac.to/blog/desk-nt-1-0-1/","image":"https://nmac.to/wp-content/uploads/2015/11/DeskNT.png","title":"Desk NT 1.0.1 – A Writing and Notetaking App","content":"Desk NT is a writing and notetaking app for anyone who needs to capture their thoughts in a simple and elegant way.   Based on the award-winning “Best App of 2014” (Desk PM), it was created for those that didn’t need blog publishing features but instead wanted to focus on their ability to create and […]"},{"link":"https://nmac.to/blog/gunnheim-1-0/","image":"https://nmac.to/wp-content/uploads/2015/11/Gunnheim.png","title":"Gunnheim 1.0 – A 1-4 player top down shooter game ( co-op gaming )","content":"The Lord of Death hits the bottle hard on the Ragnarok of all benders and hell breaks loose- literally. Enter the unholy children of Gunnheim: gun-toting, skull-crushing Viking warriors born and bred for battle, summoned to restore the balance. Gunnheim is a 1-4 player top down shooter inspired by Viking mythology and the golden era […]"},{"link":"https://nmac.to/blog/blogtouch-1-8-0/","image":"https://nmac.to/wp-content/uploads/2015/08/BlogTouch.png","title":"BlogTouch 1.8.0 – Blogger/Blogspot editor for your Mac","content":"BlogTouch is a friendly Blogger/Blogspot editor for your Mac. It’s equipped with everything you need to manage your blogs: write, publish, update or share posts and moderate comments.   Be more productive and efficient with this powerful and straightforward tool – because at the end of the day, we all have something to share.   […]"},{"link":"https://nmac.to/blog/letterspace-1-6-3/","image":"https://nmac.to/wp-content/uploads/2015/11/Letterspace.png","title":"Letterspace 1.6.3 – Multi-platform note-taking app with #hashtag and @mention support","content":"Letterspace is a multi-platform, cloud-syncing note-taking app with Markdown, #hashtag, and @mention support. Easily organize notes and even create to-do lists with Letterspace.   Think about all of the notes you have to take on a daily basis. It’s something we all do. Good note taking is based on being able to get your thoughts […]"},{"link":"https://nmac.to/blog/quickshot-2-0-1/","image":"https://nmac.to/wp-content/uploads/2015/11/QuickShot.png","title":"QuickShot 2.0.1 – Manage all your images right from your menubar!","content":"QuickShot is the ultimate image menubar manager.   “The utility you never knew you needed, but now you love”   With QuickShot, you can now view, filter, and share your images straight from your menubar!   The new quick-grab feature is also a game changer, now whenever a new image is added to a folder […]"}]