[{"link":"https://nmac.to/blog/multidock/","image":"https://nmac.to/wp-content/uploads/2019/06/MultiDock.png","title":"MultiDock 1.44 – Organize your favorite folders, files and applications with Dock’s","content":"MultiDock is a simple application that allows you to organize frequently used applications, documents and folders using small panels (Dock’s).   Main features: Create an unlimited number of panels Attach panels to the edges of the screen (left, bottom, right and top) Floating/ movable panel mode for placement of panels anywhere on the screen Adjust […]"},{"link":"https://nmac.to/blog/deskcover/","image":"https://nmac.to/wp-content/uploads/2017/08/DeskCover.png","title":"DeskCover 1.8 – Make your Desktop less distracting","content":"DeskCover is a simple Mac application that allows you to hide the mess on your desktop with a single mouse-click or by pressing a global hotkey. It also allows you to focus on your current task by highlighting the window of the currently active application and automatically dimming those of inactive ones.   Features Cover […]"},{"link":"https://nmac.to/blog/diskcatalogmaker/","image":"https://nmac.to/wp-content/uploads/2016/07/DiskCatalogMaker6.png","title":"DiskCatalogMaker 8.3.5 – Catalog your disks","content":"DiskCatalogMaker is a simple disk management tool which catalogs disks.   Simple, light-weight, and fast. Finder-like intuitive look and feel. Super-fast search algorithm. Can compress catalog data for disk space. Can generate thumbnail images. Long Unicode file name support. ZIP / RAR / 7-Zip / StuffIt / tar / gzip / bzip2 / CompactPro / […]"},{"link":"https://nmac.to/blog/mesmer/","image":"https://nmac.to/wp-content/uploads/2020/10/Mesmer.png","title":"Mesmer 1.0.4 – Open World Action & Adventure Game","content":"Mesmer is a unique social survival game where every encounter matters. As a revolution leader, influence people and factions into following your cause, while keeping yourself out of the spotlight of the secret police. The stakes are high, and the dangers are many. But there is hope yet.   Will you be the one to […]"},{"link":"https://nmac.to/blog/tuneskit-audible-converter/","image":"https://nmac.to/wp-content/uploads/2017/07/TunesKit-Audible-Converter.png","title":"TunesKit Audible Converter 2.1.1 – losslessly convert DRM-protected Audible audio book","content":"A unique and innovative Audible audiobook DRM cracker designed to losslessly convert any DRM-protected Audible audio book from AA, AAX formats to MP3, M4A, M4B, WAV, AAC, AC3, FLAC and other DRM-free popular audios in an easiest yet fastest way ever.   TunesKit Audible Converter is one of the smartest audiobook converters that any Audible […]"},{"link":"https://nmac.to/blog/automounter/","image":"https://nmac.to/wp-content/uploads/2017/02/AutoMounter1.png","title":"AutoMounter 1.7.1 – Automatically mount your network shares form menubar","content":"AutoMounter is a sleek and powerful menu item for automatically mounting your network shares, ensuring that your shares are always mounted when you need them. Features Automatically mounts SMB / AFP / NFS / WebDAV / (FTP is read-only) Supports multiple NAS appliances, with server discovery Advanced rule matching against WiFi SSIDs and more Wake-on-LAN […]"},{"link":"https://nmac.to/blog/cleaner-for-xcode/","image":"https://nmac.to/wp-content/uploads/2020/06/Cleaner-for-Xcode.png","title":"Cleaner for Xcode 4.0.5 – Remove unwanted and deprecated Xcode files","content":"This app helps you to make your Xcode faster by removing unwanted and deprecated files.   You can run cleaner weekly or monthly to keep your developer folder health and to save more disk space.   Version 4.0.5: Fixed UI issue on macOS 11.3   Intel, 64-bit processor macOS 11.0 or later    "},{"link":"https://nmac.to/blog/while-true-learn/","image":"https://nmac.to/wp-content/uploads/2021/04/while-True-learn.png","title":"while True learn 1.2.95 – Programming Simulation Game","content":"while True: learn() is a puzzle/simulation game about even more puzzling stuff: machine learning, neural networks, big data and AI. But most importantly, it’s about understanding your cat.   In this game, you play as a coder who accidentally found out that their cat is extremely good at coding, but not as good at speaking […]"},{"link":"https://nmac.to/blog/radio-silence/","image":"https://nmac.to/wp-content/uploads/2016/04/Radio.Silence2.png","title":"Radio Silence 3.1 – Outbound application firewall ( Little Snitch! Alternative )","content":"Radio Silence is an outbound application firewall that lets you block Internet access from individual apps.   Features: 100% Annoyance-free: Radio Silence respects your concentration. That is why it will never interrupt you with pop-up windows or alerts. Zero Maintenance: Once Radio Silence is installed, you can forget all about it. It is always on […]"},{"link":"https://nmac.to/blog/wirecast/","image":"https://nmac.to/wp-content/uploads/2016/09/Wirecast7.png","title":"Wirecast 14.1.2 – Stream live from the desktop","content":"Wirecast lets you capture an unlimited number of input devices from live camera feeds, iOS cameras (coming soon), computer desktop, Web feeds, and more. Then add polish and professionalism to your broadcast with live switching, transitions, titles, lower thirds, and more. And finally, use the built in multiformat encoding capabilities and easily stream to integrated […]"}]