[{"link":"https://nmac.to/blog/osfoora-for-twitter-clean-and-intuitive/","image":"https://nmac.to/wp-content/uploads/2013/12/osfo1.png","title":"Osfoora 1.2 – Clean and intuitive Twitter client.","content":"Osfoora for Twitter is a powerful Twitter client with a clean and intuitive user interface. You’ll enjoy a wide set of powerful features such as Muting users, Read Later, Message Conversations, Multiple Accounts, and more.   FEATURE LIST: Multiple accounts with multi-windows. TweetMarker Support: Timeline syncing of reading position between different Twitter apps. Inline picture thumbnails […]"},{"link":"https://nmac.to/blog/socialite/","image":"https://nmac.to/wp-content/uploads/2013/12/soc.png","title":"Socialite v1.4 – Creates a single interface for multiple social websites","content":"Socialite is a revolutionary social application. It seamlessly integrates many social websites, including Flickr, Facebook, Twitter, Reddit, RSS and Google Reader. It allows you to interact with them and receive notifications, all from a stunning user interface. REQUIREMENTS   – Mac OS X 10.6 or later – 64-bit processor ScreenShots : ScreenShot 1 , ScreenShot 2 RapidShare Click […]"},{"link":"https://nmac.to/blog/speed/","image":"https://nmac.to/wp-content/uploads/2013/12/sdicon.png","title":"Speed Download 5.3.0 – Versatile download manager and accelerator","content":"Speed Download combines four amazing products into one small and easy to use application:   A turbo-charged download manager with auto-resuming downloads A fully featured secure FTP client A file sharing utility with full encryption And complete .Mac/iDisk/WEBDAV connectivity.   Speed Download 5 also introduces a stunning new user interface option that feels right at home […]"},{"link":"https://nmac.to/blog/adium-all-in-one-messenger/","image":"https://nmac.to/wp-content/uploads/2013/12/Adium111.png","title":"Adium All in One Messenger For Mac","content":"Adium is a fast and free instant messaging client which supports AIM, ICQ, Jabber, MSN, Yahoo!, Google Talk, Yahoo! Japan, Bonjour, Gadu-Gadu, Novell Groupwise, SIP/SIMPLE (Text), and Lotus Sametime. Adium supports beautiful WebKit message display, tabbed messaging, encrypted chat, file transfer, and more. Give it a try; you won’t look back. Adium is currently translated […]"}]