[{"link":"https://nmac.to/blog/parallels-toolbox-1-5-2/","image":"https://nmac.to/wp-content/uploads/2017/04/Parallels-Toolbox.png","title":"Parallels Toolbox 1.5.2 – Tools to simplify everyday tasks","content":"Parallels Toolbox offers a set of tools, with no complicated settings, to simplify everyday tasks. Archive Your Files – Compress files with one click to use less storage space. Unarchive any archived files, RAR, zip, and more Record Your Screen – Record a video of a screen, active window, or area Take Screenshots – Screenshot […]"},{"link":"https://nmac.to/blog/barcode-maker-2-23/","image":"https://nmac.to/wp-content/uploads/2016/12/Barcode-Maker.png","title":"Barcode Maker 2.23 – 18 different barcode standards maker","content":"Barcode Maker is the fastest way to perfect 18 different barcode standards, necessary to manage and sell products all over the planet. All you need to do is to enter your product code, and click ‘Process’. Your barcode is created. It has been copied into the clipboard and all you need to do is to […]"},{"link":"https://nmac.to/blog/spillo-1-10-1/","image":"https://nmac.to/wp-content/uploads/2014/08/Spillo.png","title":"Spillo 1.10.1 – Take full control over your bookmarks on Pinboard","content":"Spillo is a powerful, beautiful and amazingly fast Pinboard client. Spillo lets you browse and organize your bookmarks in a stunning modern interface. Spillo also makes creating a bookmark from anywhere on your Mac as convenient as possible.   A beautiful interface Spillo has a beautiful modern interface that feels just right at home on […]"},{"link":"https://nmac.to/blog/image-vectorizer-1-6/","image":"https://nmac.to/wp-content/uploads/2017/04/Image-Vectorizer.png","title":"Image Vectorizer 1.6 – Raster-to-vector graphic conversion in one click","content":"Image Vectorizer is the solution to the problem of creating a vector graphic version of a logo or icon for a design you’ve been working on. It makes the process as fast and painless as possible! Simply drag an image in to the app and click to convert. Image Vectorizer then lets you copy the […]"},{"link":"https://nmac.to/blog/provideoplayer-2-1-4/","image":"https://nmac.to/wp-content/uploads/2014/06/ProVideoPlayer.png","title":"ProVideoPlayer 2.1.4 – Playlist and video manager","content":"ProVideoPlayer was designed to enhanced live staging events such as concerts, trade show booths, conferences, or church services; it manages an unlimited amount of clips in an unlimited number of playlists and gives a tremendous amount of control to the playback of these video clips including Hue, Brightness, Saturation, Start/Stop times, and speed, either on […]"},{"link":"https://nmac.to/blog/disk-space-pro-2-5-1/","image":"https://nmac.to/wp-content/uploads/2015/09/Disk.Space_.Pro_.png","title":"Disk Space Pro 2.5.1 – Shows disk drive information","content":"Disk Space Pro is an app that shows disk drive information. This includes hard drives, external drives, network drives, DVD’s, CD’s, memory cards, and USB flash drives. Scan your home folders for a sortable list showing their size on your hard drive. Then single click in the scan results to drill down to subfolders. Disk […]"},{"link":"https://nmac.to/blog/duke-of-alpha-centauri-1-0/","image":"https://nmac.to/wp-content/uploads/2017/04/Duke-Of-Alpha-Centauri.png","title":"Duke Of Alpha Centauri 1.0 – A space shooter game with amazing graphics","content":"Duke of Alpha Centuri is a space shooter with amazing graphics. The main goal of our game is to have a lot of fun while blowing up hordes of different types of enemies.   Engage in boss fights, upgrade your ship and ship systems until you are able to show off in an endless mode. […]"},{"link":"https://nmac.to/blog/browser-care-4-0-1/","image":"https://nmac.to/wp-content/uploads/2016/07/Browser-Care3.png","title":"Browser Care 4.0.1 – Browser maintenance app","content":"Browser Care is a powerful application that allows you to keep your browsers clean and under control since navigating accumulates files on your Mac.   Features Care. A button for everything. Take Care of your browser to recover space on your Mac. Simple presets. Convenient presets that are fast and easy (even for beginners). Items […]"},{"link":"https://nmac.to/blog/cleanusbdrive-1-5/","image":"https://nmac.to/wp-content/uploads/2016/09/CleanUSBDrive.png","title":"CleanUSBDrive 1.5 – The fastest DS_Store remover for external drives","content":"CleanUSBDrive is an utility to eject any external drive removing those files that you don’t want to see in your smartTV multimedia-browser, for example. It cleans all drives from system junk before ejecting, with a very high performance.   Features Simple and fast Very minimalist design Status bar App Remove .DS_Store, ._AppleDouble, Thumbs.db, .Trashes, .Spotlight, […]"},{"link":"https://nmac.to/blog/barcode-maker-2-12/","image":"https://nmac.to/wp-content/uploads/2016/12/Barcode-Maker.png","title":"Barcode Maker 2.12 – 18 different barcode standards maker","content":"Barcode Maker is the fastest way to perfect 18 different barcode standards, necessary to manage and sell products all over the planet. All you need to do is to enter your product code, and click ‘Process’. Your barcode is created. It has been copied into the clipboard and all you need to do is to […]"}]