[{"link":"https://nmac.to/blog/videobox-4-2-2/","image":"https://nmac.to/wp-content/uploads/2014/04/Videobox.png","title":"Videobox 4.2.2 – Download Flash video through your browser","content":"Videobox allows you to quickly and easily download Flash video from most all of the popular video sites on the internet. Videobox will convert the video into a native Quicktime format so it’s ready to view on your Mac, iPod, iPhone or iTunes.   Version 4.2.2: Release notes were unavailable when this listing was updated. […]"},{"link":"https://nmac.to/blog/nevermind-1-0/","image":"https://nmac.to/wp-content/uploads/2015/10/Nevermind.png","title":"Nevermind 1.0 – A biofeedback-enhanced adventure game","content":"Nevermind is a biofeedback-enhanced adventure game that takes you into the dark and surreal world within the subconscious minds of psychological trauma victims.   As you explore twisted labyrinths and solve the puzzles of the mind, an (optional) biofeedback sensor will monitor your feelings of fear and anxiety with each passing moment. If you let […]"},{"link":"https://nmac.to/blog/chitchat-1-5-0/","image":"https://nmac.to/wp-content/uploads/2015/08/ChitChat.png","title":"ChitChat 1.5.0 – A native Mac app wrapper for WhatsApp Web","content":"ChitChat is A Mac app wrapper around WhatsApp’s web client, WhatsApp Web.   Requires WhatsApp Web compatible device (ie. not an iPhone unfortunately, unless you’re jailbroken)   Allows you to receive notification center notifications for new messages, and adds some useful keyboard shortcuts: Start a new conversation ⌘N Search past conversations ⌘F Jump to your […]"},{"link":"https://nmac.to/blog/cardrescue-5-60/","image":"https://nmac.to/wp-content/uploads/2015/10/CardRescue.png","title":"CardRescue 5.60 – Recovers deleted pictures from memory stick, etc","content":"CardRescue is photo-recovery software. It recovers deleted pictures from memory sticks, SD cards, Compact-Flash cards, xD Picture cards, and various flash-memory cards used by digital cameras. It also recovers lost photos from reformatted or damaged memory cards.   Most digital cameras do not completely wipe digital pictures from the storage card when the user deletes […]"},{"link":"https://nmac.to/blog/cross-dj-3-3-11/","image":"https://nmac.to/wp-content/uploads/2015/10/Cross.DJ_.png","title":"Cross DJ 3.3.11 – Professional DJ software","content":"Cross DJ is the best pro DJ app on Mac. Mix tracks in perfect sync on a powerful audio engine. Engineered by Mixvibes, digital DJing pioneer for 15 years.   MIX AUDIO & VIDEO  2 full featured video players Control audio & video at the same time or separately 37 video transitions Webcam input Text/image […]"},{"link":"https://nmac.to/blog/weather-live-1-8/","image":"https://nmac.to/wp-content/uploads/2014/06/Weather-Live.png","title":"Weather Live 1.8 – Beautiful weather for multiple locations around the world","content":"Meet Weather Live, the most beautiful weather app. Ever.   Don’t let bad weather take you by surprise! Whether it is cloudy, rainy, snowy, or even stormy outside, Weather Live will provide you with current weather conditions and forecast in your city and multiple locations all around the world. You won’t even have to look […]"},{"link":"https://nmac.to/blog/the-hit-list-1-1-16/","image":"https://nmac.to/wp-content/uploads/2015/10/The.Hit_.List_.png","title":"The Hit List 1.1.16 – Advanced reminder application","content":"The Hit List manages the daily chaos of your modern life. It’s easy to learn – it’s as easy as making lists. And it’s powerful enough to let you plan, then forget, then act when the time is right.   Your life is complicated enough as it is. The tool to manage your life shouldn’t […]"},{"link":"https://nmac.to/blog/armikrog-1-0/","image":"https://nmac.to/wp-content/uploads/2015/10/Armikrog.png","title":"Armikrog 1.0 – Point and click adventure game","content":"Armikrog is a unique stop motion clay animated point and click adventure game from the creators of Earthworm Jim and the Neverhood. Follow the adventures of space explorer Tommynaut and his blind alien talking dog Beak-Beak, as they unravel the mysteries of the fortress that holds them captive through exploration and puzzle solving!   Follow […]"},{"link":"https://nmac.to/blog/typemetal-2-0-9/","image":"https://nmac.to/wp-content/uploads/2015/10/TypeMetal.png","title":"TypeMetal 2.0.9 – HTML-enabled text editor","content":"TypeMetal is an HTML-enabled text editor. Both a handy HTML notepad and a serious, structured writing tool, TypeMetal is designed to help you produce modern, semantic, streamlined HTML with ease and agility.   TypeMetal was designed for HTML5, and can also open, edit, and create these HTML document types: XHTML 1.1 XHTML 1.0 (Strict and […]"},{"link":"https://nmac.to/blog/persona-1-2/","image":"https://nmac.to/wp-content/uploads/2015/10/Persona.png","title":"Persona 1.2 – Tool to help develop characters while writing","content":"Persona is an innovative character development tool for fiction writers. Readers long for engrossing, character-driven narratives, but even the most experienced storytellers struggle to create strong, compelling characters. Persona is a unique and inspiring app that helps you organize and centralize your character data. Categorize characters by archetypes, fill in crucial background data, and more. […]"}]