[{"link":"https://nmac.to/blog/axis-allies-1942-online/","image":"https://nmac.to/wp-content/uploads/2021/11/Axis-Allies-1942.png","title":"Axis & Allies 1942 Online 1.0.12 live d56 – Strategy Board Game","content":"Axis & Allies 1942 Online is the official digital version of Hasbro’s strategy classic—Axis & Allies 1942 Second Edition! This board game fits your screen AND your busy schedule. Get notified on your turn, and command armies at your own pace!   Team up with friends, challenge the world’s top Axis & Allies players in […]"},{"link":"https://nmac.to/blog/superhot/","image":"https://nmac.to/wp-content/uploads/2020/07/SUPERHOT1.png","title":"SUPERHOT: MIND CONTROL DELETE 1.0.4d – First person shooter where time moves only when you move","content":"Blurring the lines between cautious strategy and unbridled mayhem, SUPERHOT is the FPS in which time moves only when you move. No regenerating health bars. No conveniently placed ammo drops. It’s just you, outnumbered and outgunned, grabbing the weapons of fallen enemies to shoot, slice, and maneuver through a hurricane of slow-motion bullets.   With […]"},{"link":"https://nmac.to/blog/house-flipper/","image":"https://nmac.to/wp-content/uploads/2018/05/House-Flipper.png","title":"House Flipper 1.2290 – A unique chance to become a one-man renovation crew","content":"House Flipper is a unique chance to become a one-man renovation crew. Buy, repair and remodel devastated houses. Give them a second life and sell them at a profit!   What you’ve got at your disposal is a set of tools and parts. Use them to hammer, drill, nail and screw things together, and do […]"},{"link":"https://nmac.to/blog/checkbook-pro/","image":"https://nmac.to/wp-content/uploads/2016/11/CheckBook2.png","title":"CheckBook Pro 2.7.6 – Manage personal checking accounts","content":"CheckBook Pro is more than a basic check register and reporting tool: it features everything in CheckBook, our powerfully simple personal finance manager, and then some. Get a report for all of your accounts at once. Search for transactions with any combination of criteria. Group your transactions into folders. Change the details of a group […]"},{"link":"https://nmac.to/blog/ishowu-instant/","image":"https://nmac.to/wp-content/uploads/2016/08/iShowU-Instant.png","title":"iShowU Instant 1.4.10 – Full-featured screen recording and audio sweetening","content":"iShowU Instant gives you real-time screen recording like you’ve never seen before! It is the fastest, most feature-filled real-time screen capture tool from shinywhitebox yet. All of the features you would expect are here, and probably some you don’t! Record from any screen Enhance your microphone audio through the use of a dynamics processor, compressor […]"},{"link":"https://nmac.to/blog/widsmob-montage/","image":"https://nmac.to/wp-content/uploads/2018/04/WidsMob-Montage.png","title":"WidsMob Montage 1.20 – Create mosaic photos","content":"WidsMob Montage allows you to turn everything into mosaic photographs. You can set both JPEG and PNG into a mosaic, the program supports photo mosaic, tile mosaic, shape mosaic and other photo mosaic types. What is more, you can also design photo montage in shape according to any template. Whether you need to add special […]"},{"link":"https://nmac.to/blog/any-recscreen/","image":"https://nmac.to/wp-content/uploads/2020/12/Any-RecScreen.png","title":"Any RecScreen 2.0.71 – Record Screen & Audio Easily","content":"Any RecScreen is an easy-to-use screen recorder for Mac that enables you to record computer screen in full screen or a customized area. You can record webcam to create picture-in-picture video through adding webcam in recording area. The audio in your videos from either a microphone or your computer’s system audio can be also captured. […]"},{"link":"https://nmac.to/blog/epiphany-workflow-ii/","image":"https://nmac.to/wp-content/uploads/2022/04/Epiphany-WorkFlow-II.png","title":"Epiphany WorkFlow II 8.1.2 – Streamline Academic Writing","content":"Simplify your academic writing. Organize notes and source materials, then recall them with a click. With E you can focus on writing not on routine distractions.   E is for writing research papers also for synthesizing weekly study guides from class materials. Using E, you can finish you writing project sooner and with far less […]"},{"link":"https://nmac.to/blog/duplicate-photos-fixer-pro/","image":"https://nmac.to/wp-content/uploads/2017/09/Duplicate-Photos-Fixer-Pro2.png","title":"Duplicate Photos Fixer Pro 4.4 – Search for and remove duplicate photos","content":"Duplicate Photos Fixer Pro is an excellent photo-fixing tool that smoothly scans and deletes duplicate or similar photos, depending on the matching level you choose. This captivating tool works with photos from iPhoto, along with photos from external storages and your system’s hard drives as well. Free up ample disk space by deleting a large […]"},{"link":"https://nmac.to/blog/drawpad/","image":"https://nmac.to/wp-content/uploads/2022/02/DrawPad.png","title":"DrawPad 8.24 – Computer drawing and graphic editing program","content":"DrawPad for Mac OSX is an essential tool for all types of drawing and graphic design projects. You can start with a blank canvas or if you are a beginner, choose from an array of logo, invitation, and advertising templates. Edit both raster and vector images and create image layers for non-destructive edits. Pencil and […]"}]