[{"link":"https://nmac.to/blog/mxgp3/","image":"https://nmac.to/wp-content/uploads/2019/03/MXGP3.png","title":"MXGP3 1.0 – The Official Motocross Videogame","content":"Experience all the adrenaline of Motocross with the official Championship’s only videogame! MXGP3 – The Official Motocross Videogame offers the most involving game experience ever, with completely new gameplay and graphics thanks to Unreal® Engine 4. Race on 18 official tracks and in the MXoN with all riders and bikes from the 2016 MXGP and MX2 […]"},{"link":"https://nmac.to/blog/soundmate/","image":"https://nmac.to/wp-content/uploads/2017/08/SoundMate3.png","title":"SoundMate 3.3.3 – SoundCloud desktop client","content":"With SoundMate You can using Apple Media Keys to control SoundCloud Play.You can binding Apple media keys to play/pause,next,previous.   Global hotkey – you can easily toggle play/pause and switch to the next or previous track with Global hotkey even when it’s running at background.   Menu bar Icon -you can control SoundCloud from menu […]"},{"link":"https://nmac.to/blog/anymp4-mac-video-enhancement/","image":"https://nmac.to/wp-content/uploads/2019/03/AnyMP4-Mac-Video-Enhancement.png","title":"AnyMP4 Mac Video Enhancement 8.2.10 – Enhance video quality on Mac","content":"You may have trouble with some low quality video files and want to change video resolution to enhance video resolution. If you’re looking for powerful video enhancing software, AnyMP4 Video Enhancement Software for Mac is the best choice. It has the capacity of enhancing video quality from SD to HD, and improving the brightness and […]"},{"link":"https://nmac.to/blog/pendula-swing/","image":"https://nmac.to/wp-content/uploads/2019/02/Pendula-Swing.png","title":"Pendula Swing 2.2.2 – An episodic adventure game inspired by TV series","content":"Pendula Swing is an episodic adventure game inspired by TV series, set in a Fantasy version of the American Roaring 20s. Season 1’s protagonist is Brialynne, a once famous dwarven hero who is forced to return to a world she no longer recognizes.    Strange music, a completely new fashion, fast moving steel horses and […]"},{"link":"https://nmac.to/blog/children-of-zodiarcs/","image":"https://nmac.to/wp-content/uploads/2019/03/Children-of-Zodiarcs.png","title":"Children of Zodiarcs 1.0.3 – A Story-Driven Tactical RPG Game","content":"Children of Zodiarcs is a story-driven, tactical RPG set in the fantasy realm of Lumus; a world divided by affluence and poverty. Take control of Nahmi and her fellow outcasts, utilising a brand new deck and dice based combat system to strike a blow to the noble Lords’ and Ladies’ unquenchable thirst for profit.   […]"},{"link":"https://nmac.to/blog/endless-space-2/","image":"https://nmac.to/wp-content/uploads/2017/05/Endless-Space-2.png","title":"Endless Space 2 Penumbra 1.4.7 – A sci-fi turn-based 4X strategy game","content":"Endless Space 2 will put you in the fascinating role of a leader guiding a civilization in making its first steps into the cold depths of interstellar space.   You will explore mysterious star systems, discover the secrets of ancient races, develop advanced technologies of unthinkable power, and, of course, encounter new life forms to […]"},{"link":"https://nmac.to/blog/toast-titanium/","image":"https://nmac.to/wp-content/uploads/2017/07/Toast-Titanium17.png","title":"Toast Titanium 17.4 – The ultimate media toolkit; disc burning, video conversion and more","content":"Roxio Toast 17 Titanium, the leading DVD burner for Mac, makes burning even better, adding Roxio Secure Burn to protect your files on disc and USB in Mac- or Windows-compatible formats. Get more style with more than 20 themed templates with menus, submenus, and chapters in Toast MyDVD, the pro-quality disc authoring tool. Quickly trim […]"},{"link":"https://nmac.to/blog/unforeseen-incidents/","image":"https://nmac.to/wp-content/uploads/2018/05/Unforeseen-Incidents.png","title":"Unforeseen Incidents 1.0.9.2 – A classical style interactive mystery game","content":"Unforeseen Incidents is a classical style interactive mystery set in a beautifully hand-painted world. When small-town handyman Harper Pendrell meets a dying woman in the street, he unwittingly stumbles into a diabolical conspiracy – a mystery only he can solve. An unknown disease is spreading across the country, and between them a scientist, a reporter […]"},{"link":"https://nmac.to/blog/oxenfree/","image":"https://nmac.to/wp-content/uploads/2016/01/Oxenfree-1.png","title":"Oxenfree 2.7.1 – A supernatural thriller game","content":"Oxenfree is a supernatural thriller about a group of friends who unwittingly open a ghostly rift. Play as Alex, a bright, rebellious teenager who brings her new stepbrother Jonas to an overnight party on an old military island. The night takes a terrifying turn when you unwittingly open a ghostly gate spawned from the island’s […]"},{"link":"https://nmac.to/blog/event0/","image":"https://nmac.to/wp-content/uploads/2016/09/Event0.png","title":"Event[0] 169161 – A sci-fi narrative exploration game","content":"Event[0] is an award-winning narrative exploration game where you must build a relationship with a lonely spaceship computer to get home. Set in a retrofuture inspired by sci-fi classics such as 2001: A Space Odyssey, the game is about forging a personal relationship with your only companion, an insecure AI entity capable of procedurally generating […]"}]