[{"link":"https://nmac.to/blog/victor-vran/","image":"https://nmac.to/wp-content/uploads/2015/07/Victor-Vran1.png","title":"Victor Vran 2.07 – Isometric Action-RPG Game","content":"Victor Vran is an isometric Action-RPG with a massive selection of weapons, items, outfits, demon powers and destiny cards. Experience intense combat action with dozens of enemies attacking you from all sides and unleash powerful skills to finish them off!   Victor Vran lets you decide how to play the game. Forge your own personal […]"},{"link":"https://nmac.to/blog/dirt-4/","image":"https://nmac.to/wp-content/uploads/2019/04/DiRT-4.png","title":"DiRT 4 1.0.1 – Award-winning rally driving game","content":"Motorsport by its very nature is dangerous. DiRT 4 is all about embracing that danger. It’s about the thrill, exhilaration and adrenaline that is absolutely vital to off-road racing. And more than that, it’s about loving that feeling. It’s about pushing flat out next to a sheer cliff drop. Going for the gap that’s slightly […]"},{"link":"https://nmac.to/blog/i39/","image":"https://nmac.to/wp-content/uploads/2018/06/i391.png","title":"i39 1.6 – Create iPhone ringtones and alert tones","content":"i39 is a simple and easy-to-use tool for creating ringtones and alert tones from any music on your Mac. With i39 you can easily create unique ringtones to personalize your iPhone.   Features Built-in iTunes navigator lets you quickly find the needed song Use ‘Open Other’ to choose any song on the disk Zoom in […]"},{"link":"https://nmac.to/blog/xilisoft-iphone-transfer/","image":"https://nmac.to/wp-content/uploads/2019/04/Xilisoft-iPhone-Transfer.png","title":"Xilisoft iPhone Transfer 5.7.28 – iPhone management software","content":"Once with Xilisoft iPhone Transfer for Mac, iPhone management on Mac becomes much easier than ever before.   This Mac iPhone copy software makes it possible to backup iPhone music, SMS, videos, movies, photos, podcasts, etc to Mac and copy files from iPhone to iTunes. And just like iTunes but easier than iTunes, it also […]"},{"link":"https://nmac.to/blog/muster/","image":"https://nmac.to/wp-content/uploads/2018/10/Muster.png","title":"Muster 9.0.12 – Render farm software and distributed computing","content":"Muster 9 is a software to provide a clean and powerfull system to manage CGI Renderfarms and distributed computing.   It has a wide range of incredible features, a clean interface and an huge amount of customizations facilities. Easy for Wranglers, powerfull for pipeline’s developers.   Muster includes an integrated web server engine that’s the […]"},{"link":"https://nmac.to/blog/offworld-trading-company/","image":"https://nmac.to/wp-content/uploads/2016/11/Offworld-Trading-Company1.png","title":"Offworld Trading Company 1.21 – Space Simulation Game","content":"From the lead designer of Civilization IV comes a new kind of strategy game: Offworld Trading Company, an economic strategy game.   Mars has been colonized and has invited you to lend a hand to make sure the new colony has a shot at success. But you’re not the only one that’s been invited, other […]"},{"link":"https://nmac.to/blog/chameleon/","image":"https://nmac.to/wp-content/uploads/2019/02/Chameleon.png","title":"Chameleon 0.9 – A quick and easy way to change your interface colors","content":"Chameleon is a small app that brings these settings to your menu bar, making it much easier to customize your UI at any time. With this app, you can change the interface highlight and accent colors and switch between the Dark and Light UI modes with just one or two clicks.   Accessible interface color […]"},{"link":"https://nmac.to/blog/the-world-next-door/","image":"https://nmac.to/wp-content/uploads/2019/03/The-World-Next-Door.png","title":"The World Next Door 1.1.0 – Thrilling Action & Adventure Game","content":"Inspired by the emotional storytelling and thrilling action of anime and indie gaming, The World Next Door follows Jun, a rebellious teen who finds herself far from home in the magical and mysterious world of Emrys. As she encounters a colorful cast of otherworldly creatures, Jun must learn to rely on her new friends to […]"},{"link":"https://nmac.to/blog/movavi-screen-capture-studio/","image":"https://nmac.to/wp-content/uploads/2017/03/Movavi-Screen-Capture-Studio.png","title":"Movavi Screen Capture Studio 10.2.0 – One-Click Screen Capture","content":"Movavi Screen Capture Studio is a convenient screen recorder for Mac that lets you capture anything from the screen of your Apple computer: video guides, Skype calls, streaming video, and much more.   The built-in video editing tool helps you turn raw footage into stylish video clips. Cut unwanted fragments, enhance the video, add music […]"},{"link":"https://nmac.to/blog/flexiglass/","image":"https://nmac.to/wp-content/uploads/2016/11/Flexiglass1.png","title":"Flexiglass 1.7.1 – Window manager","content":"Flexiglass enables some of the missing features in Mac OS X window management and offers an extremely convenient way to move, resize, maximize, and close windows on a Mac with a mouse, trackpad and keyboard.   Move & Resize Usually, when you want to move or resize a window on a Mac you are limited […]"}]