[{"link":"https://nmac.to/blog/memory-cleaner/","image":"https://nmac.to/wp-content/uploads/2019/03/Memory_Cleaner_1.png","title":"Memory Cleaner 1.5 – Freeup memory space","content":"Memory Cleaner monitors RAM usage on your computer and frees up unused memory with one click. With Memory Cleaner, you can easily manage your memory usage. An animated status icon in the menu bar shows you the percentage of memory being used, as well as memory cleaning being run.   Features Memory usage information displayed […]"},{"link":"https://nmac.to/blog/etrecheck-pro/","image":"https://nmac.to/wp-content/uploads/2018/05/EtreCheck.png","title":"EtreCheck Pro 6.5.3 – For troubleshooting your Mac; displays important system details","content":"EtreCheck is an app that displays the important details of your system configuration and allow you to copy that information to the Clipboard. It is meant to be used with Apple Support Communities to help people help you with your Mac. EtreCheck automatically removes any personally identifiable information from the output.   EtreCheck will automatically […]"},{"link":"https://nmac.to/blog/sync-folders-pro/","image":"https://nmac.to/wp-content/uploads/2016/08/Sync-Folders-Pro3.png","title":"Sync Folders Pro 4.5.9 – Automatically sync any number of folders","content":"Sync Folders Pro synchronizes any number of local folders on-the-fly whenever there are changes, or on external drives either manually or at a set time (when connected).   The app synchronizes folders with or without filter for folder names and / or file names. Sync Folders Pro is perfect for backup to USB, memory cards, […]"},{"link":"https://nmac.to/blog/frame-grab/","image":"https://nmac.to/wp-content/uploads/2021/10/Frame_Grab_2.png","title":"Frame Grab 2.57 – Take HQ pictures from video","content":"Frame Grab provides you to export frame images as JPEG, PNG or TIFF file format from your movies very easily. You can export one-by-one, or can export multiple frames from the queue at a time.   To open movies Choose File > Open and select the movie file(s). Or drag the file(s) to the Frame […]"},{"link":"https://nmac.to/blog/color-code-copy/","image":"https://nmac.to/wp-content/uploads/2021/01/Color-Code-Copy.png","title":"Color Code Copy 1.3.3 – Copy color codes in various formats","content":"The copy clipboard color codes in various formats (#Hex, Objective-C UIColor, Swift UIColor, Objective-C NSColor, Swift NSColor).   Ease of use Hex and RGB colors   Select the default copy code. (Preferences)   Double mouse click outside of the picker that copies the code and closes the window   Dark and Light mode.   Color […]"},{"link":"https://nmac.to/blog/espresso/","image":"https://nmac.to/wp-content/uploads/2017/04/Espresso3.png","title":"Espresso 5.8 – Powerful HTML, XML, CSS, and JavaScript development tool","content":"Espresso is back. For people who make delightful, innovative, and fast websites — in an app to match. Espresso helps you write, code, design, build, and publish with flair and efficiency. Sophisticated text features, amazing Live Preview with Browser Xray, CSSEdit tools, the Navigator, Dynamo auto-building, and Server Sync. Whether you’re starting from scratch or […]"},{"link":"https://nmac.to/blog/serial/","image":"https://nmac.to/wp-content/uploads/2016/10/Serial.png","title":"Serial 2.0.12 – Powerful serial terminal for makers and sysadmins","content":"Serial is a modern terminal emulator designed to make working with servers, network equipment, and embedded hardware easier for engineers and system administrators.   For system administrators, Serial supports the all-important break sequence required when working with routers and switches. Serial also includes a full-featured terminal emulator, allowing you to work with the screen-based menus […]"},{"link":"https://nmac.to/blog/turntable/","image":"https://nmac.to/wp-content/uploads/2020/11/TurnTable_4.png","title":"TurnTable 4.0.3 – Play your music with a new interface","content":"TurnTable allows you to browse and play your music collection in a new kind of music interface. Play your life in the most compelling way. Like the new iTunes. The first music experience true to the art. Visually, a full artists chart, flip-through records, and an albums-collection view.   The real albums experience, finally on […]"},{"link":"https://nmac.to/blog/corelcad/","image":"https://nmac.to/wp-content/uploads/2020/06/CorelCAD_2021.png","title":"CorelCAD 2021.2.1.3515 – Powerful CAD solution","content":"With CorelCAD experience powerful and affordable CAD software with industry-standard features and 2D drafting and 3D design tools. Improve your design productivity and performance with interactive In-Place text editing, layout and table editing tools. Open, edit and share files in .DWG format for easy collaboration with colleagues and suppliers. Enjoy the benefits of full customization […]"},{"link":"https://nmac.to/blog/mediatrans/","image":"https://nmac.to/wp-content/uploads/2016/09/MediaTrans.png","title":"MediaTrans 7.6 – Easy, high-speed transfer between Macs and iDevices","content":"MacX MediaTrans is an excellent iPhone content manager for the transfer of photos, music, videos, TV shows, movies, etc., between iPhone, iPad, iPod, and Mac. You can also use an iPhone as a USB drive for file backup from Word or Excel to PDF, apps, etc. It provides an easy and hassle-free way to create/delete/edit […]"}]