[{"link":"https://nmac.to/blog/palua-v3-0-3/","image":"https://nmac.to/wp-content/uploads/2013/12/ICN_switch.175x175-75.png","title":"Palua v3.0.3 – Quickly switch the mode of the Function Keys on any Mac keyboard","content":"Palua is the easy way to quickly switch the mode of your Function Keys on any Mac keyboard!  You need to run a game, or start a graphic application, or work on a project that need F1-F12 as function keys, just hit option+command+TAB and the switch will happen. And as usual, done by Molowa, simple, […]"},{"link":"https://nmac.to/blog/newsbar-v3-0-1/","image":"https://nmac.to/wp-content/uploads/2016/05/NewsBar.png","title":"NewsBar 3.0.1 – Fast-updating Desktop RSS News Reader","content":"NewsBar is built with a fresh concept: news feeds delivered with a smooth animation, right to your desktop with automatic iCloud sync across all Apple devices. Converts plain old RSS feeds into a live news stream with keyword watching and alerts. Works fine without Google Reader, syncing with Feedly.   All of your RSS feeds […]"},{"link":"https://nmac.to/blog/blue-planet-v1-2-1/","image":"https://nmac.to/wp-content/uploads/2013/12/BluePlanetIcon.png","title":"Blue Planet v1.2.1 – Shows satellite images of earth as wallpaper","content":"Blue Planet shows you wonderful satellite images of the Earth as your desktop background. The map changes in real-time as the sun travels across the sky, illuminating different parts of the world and leaving others in the shadow of the night. Features: – Choose from four gorgeous maps. – Use Apple’s Core Location technology to […]"},{"link":"https://nmac.to/blog/docks-v2-0-3/","image":"https://nmac.to/wp-content/uploads/2013/12/Docks.png","title":"Docks v2.0.3 – Have a Dock for work, a Dock for play or whatever you like","content":"Docks… Take Back your Dock! With so many fantastic applications for Mac OS X, it’s hard to decide which ones should stay in your Dock all the time, and sometimes it has just been easier to have a cluttered Dock with applications you aren’t using all the time. Finally, there is a solution! Now, you […]"},{"link":"https://nmac.to/blog/videomark-v1-6/","image":"https://nmac.to/wp-content/uploads/2013/12/icon3.png","title":"VideoMark 1.6 – Easily add watermarks to your videos","content":"VideoMark is a fully-featured yet easy-to-use video and movie watermark software which can be used to overlay a digital watermark for video protection or placing a logo for branding your products. VideoMark is the only viable and affordable watermarking solution on the Mac operating system.   VideoMark can help you easily add simple text or […]"},{"link":"https://nmac.to/blog/symphytum-v1-0-build-2/","image":"https://nmac.to/wp-content/uploads/2013/12/46197.png","title":"Symphytum v1.0 Build 2 – Personal database software","content":"Symphytum is a personal database software for everyone who desires to manage and organize data in an easy and intuitive way, without having to study complex database languages and software user interfaces. Design input forms. Move and resize fields thanks to the dynamic layout engine. Use text, numbers, images, files and other control fields. Put your […]"},{"link":"https://nmac.to/blog/roads-of-rome-2/","image":"https://nmac.to/wp-content/uploads/2012/12/Roads-of-Rome-2.png","title":"Roads of Rome 2 1.0 – Strategy / time management game","content":"Take up new tricky tasks and overcome dangerous challenges in Roads of Rome 2, an addictive game that successfully combines strategy and time management features!   Caesar, the governor of Rome, has been poisoned, and there’s no potion strong enough in the world of mortals that can cure him of his terrible disease. Caesar’s daughter […]"},{"link":"https://nmac.to/blog/shuttie-v1-3-2/","image":"https://nmac.to/wp-content/uploads/2013/12/icon.175x175-7539.png","title":"Shuttie v1.3.2 – Schedule time for shutdown, restart, sleep or logout","content":"Shuttie allows you to set the time when you computer will shutdown, restart, sleep or logout you by itself. It’s pretty useful when your’re watching some movies from your bed, and don’t have the remote controller. You don’t have to stand up from the bed to shut it down, when the movie ends. Downloading some […]"},{"link":"https://nmac.to/blog/pandabar-v1-3-0/","image":"https://nmac.to/wp-content/uploads/2013/12/panda_app_icons.png","title":"PandaBar 1.3.0 – Play Pandora music from the menu bar","content":"PandaBar is a native Mac app that lets you play and control your Pandora radio stations from the comfort of your menu bar.   Features: Control song playback (play/pause/next song) Give your songs thumbs up/down ratings All the radio stations you’ve created on Pandora.com can be played directly from PandaBar Global keyboard hotkeys for everything! […]"},{"link":"https://nmac.to/blog/my-files-v1-11/","image":"https://nmac.to/wp-content/uploads/2013/12/icons.175x175-758.png","title":"My Files v1.11 – One Cloud App To Rule Them All!","content":"You have a lot of cloud storage options, free, freemium, and premium. But they dont work together and you need 5 apps on all your devices to manage them. – My Files brings your Dropbox, Drive, SkyDrive, SugarSync and Box accounts together in one simple, convenient, easy to use interface. – Share files via EMail, […]"}]