[{"link":"https://nmac.to/blog/grand-theft-auto-3-gta-3-1-0/","image":"https://nmac.to/wp-content/uploads/2013/08/Grand-Theft-Auto-3.png","title":"Grand Theft Auto 3 ( GTA 3 ) 1.0 – Go anywhere and jack anyone [UPDATE]","content":"In Grand Theft Auto 3, crime does pay.   The hugely successful, highly controversial Grand Theft Auto franchise moves into three dimensions in the dark and seedy underworld of Liberty City.   With the freedom to go anywhere and jack anyone, Grand Theft Auto III puts the dark, intriguing and ruthless world of crime at […]"},{"link":"https://nmac.to/blog/swiftcapture-1-0/","image":"https://nmac.to/wp-content/uploads/2016/09/SwiftCapture.png","title":"SwiftCapture 1.0 – Video capture with timelapse and stop-motion features","content":"SwiftCapture is an easy-to-use but powerful video capture application. Its powerful features and intuitive user interface will allow users to create high-quality video recordings, timelapse captures, and stop-motion movies. SwiftCapture supports any video input device that works on a Mac, including built-in FaceTime and iSight cameras, USB webcams, and the popular Blackmagic range of devices […]"},{"link":"https://nmac.to/blog/falcon-1-4-0/","image":"https://nmac.to/wp-content/uploads/2016/06/Falcon.png","title":"Falcon 1.4.0 – A simple, markdown based note-taking app","content":"Falconis a simple, markdown based note-taking app.   Features Write notes, journals and research Organise notes in multiple notebooks for various topics Supports adding images to your notes Search notes easily by their title, content or tags Editor-only and Preview-only modes allow to edit and read notes in an uncluttered and focused way. Backup your […]"},{"link":"https://nmac.to/blog/alien-skin-software-photo-bundle-collection-07-09-16/","image":"https://nmac.to/wp-content/uploads/2016/09/Alien-Skin.png","title":"Alien Skin Software Photo Bundle Collection 07.09.16 – Popular Photo Editing Bundle","content":"The collection of all the latest released at the moment by Alien Skin Software image filters for Adobe Photoshop, Lightroom, Photoshop Elements and Apple Aperture. These filters will be useful for both novice and professional users listed graphic editors. With them you will be able to easily and accurately process or to decorate your picture. […]"},{"link":"https://nmac.to/blog/purrfect-memory-1-02/","image":"https://nmac.to/wp-content/uploads/2016/09/Purrfect-Memory.png","title":"Purrfect Memory 1.02 – Memorization and Study Tool","content":"Purrfect Memory is great for memorize anything you can type. A subtle yet powerful menu bar app, Purrfect Memory reminds you to practice and memorize phrases, quotes, facts or verses.   Adaptable: Level up your brain, as Purrfect Memory intelligently gives just enough hints to allow you to recall and reinforce what you are trying […]"},{"link":"https://nmac.to/blog/megapack-for-microsoft-office-3-1/","image":"https://nmac.to/wp-content/uploads/2014/08/MegaPack.for_.Microsoft.Office.png","title":"MegaPack for Microsoft Office 3.1 – Templates for Word Excel Powerpoint","content":"MegaPack for Microsoft Office: Templates for Word Excel Powerpoint is the ultimate bundle package providing creative designs and templates for Microsoft Office® (see technical requirements below).   WORD Get the tools to create great-looking Word documents.   Quickly browse through the template categories, from annual reports and magazines, newspapers and datasheets, business cards and letterhead, […]"},{"link":"https://nmac.to/blog/franz-4-0-3/","image":"https://nmac.to/wp-content/uploads/2016/03/Franz.png","title":"Franz 4.0.3 – A free messaging app for Slack, Facebook Messenger, WhatsApp and more","content":"Franz is a free messaging app/former Emperor of Austria and combines chat & messaging services into one application. He currently supports Slack, HipChat, Facebook Messenger, Telegram, WhatsApp, Google Hangouts, Skype and Grape. You can download Franz for Mac and he is soon coming to Windows as well.   Franz allows you to add every service several […]"},{"link":"https://nmac.to/blog/world-clock-1-3-3/","image":"https://nmac.to/wp-content/uploads/2015/04/World.Clock_.png","title":"World Clock 1.3.3 – International time simplified","content":"World Clock is a simple and powerful world clock.   Features: Add cities and timezones like GMT and UTC with a few key strokes. Convert international time with a drag of a cursor. Schedule international calls and meetings and add them to your calendar. Add Interactive Widget to your Today’s View (OSX Yosemite only): quickly […]"},{"link":"https://nmac.to/blog/vtools-1-1-0-0/","image":"https://nmac.to/wp-content/uploads/2016/09/vtools.png","title":"VTools 1.1.0.0 – Download, Convert, Burn, Transfer & Manage Video Files","content":"VTools for Mac users stands out from others mainly for its versatility. You can never imagine video and audio downloading, converting, burning, transferring and managing can be realized using only one tool. VTools for Mac just made it! All these 5 process can be done smoothly one-by-one using this tool, saving you so much time […]"},{"link":"https://nmac.to/blog/suite-for-iwork-3-1/","image":"https://nmac.to/wp-content/uploads/2016/09/Suite-for-iWork3.png","title":"Suite for iWork 3.1 – Templates for iWork","content":"Suite for iWork is the ultimate tool for users of iWork, providing you with unique designs for your Pages documents, quality presentation themes for Keynote, and spreadsheet templates for Numbers. All templates are easily customizable and available in the US and international page formats.   Version 3.1: New Pages templates.   Intel, 64-bit processor OS […]"}]