[{"link":"https://nmac.to/blog/dwg-viewer-1-2-3/","image":"https://nmac.to/wp-content/uploads/2017/03/DWG-Viewer1.png","title":"DWG Viewer 1.2.3 – A lightning-fast drawing viewer for DXF and DWG files","content":"DWG Viewer is a lightning-fast drawing viewer that enables you to view DXF and DWG files, just as you would in AutoCAD.   Note that: This app supports DWG(3D), DWG(2D), DXF(3D) and DXF(2D) files.   Key Features: Support AutoCAD linetype – compatibility with layout visualization. Support visualization of 3D Wireframe and Shade. Support of AutoCAD […]"},{"link":"https://nmac.to/blog/3d-converter-6-3-97/","image":"https://nmac.to/wp-content/uploads/2016/11/3D-Converter.png","title":"3D Converter 6.3.97 – 2D to 3D video conversion","content":"3D Converter – The best 3D Video Converter with most 3D modes.   If you are 3D video lover, you shouldn’t miss this 3D Video Converter.It can convert 2D Video to 3D Effect, 3D video to other 3D modes, 3D video to common 2D video easily and fast. It provides Anaglyph, Side by Side or […]"},{"link":"https://nmac.to/blog/socialpanel-1-3-8/","image":"https://nmac.to/wp-content/uploads/2016/06/SocialPanel.png","title":"SocialPanel 1.3.8 – Access social networks from your desktop","content":"SocialPanel brings a completely new experience to accessing your favorite social networks from your desktop. SocialPanel stays hidden from your desktop without disturbing your work and fades in or out when you move your mouse to the very right side of the screen (excluding the corners so you can use the OS X hot-corner shortcuts). […]"},{"link":"https://nmac.to/blog/coolant-2-0/","image":"https://nmac.to/wp-content/uploads/2017/03/Coolant.png","title":"Coolant 2.0 – Save battery life and keep your laptop cool","content":"Coolant lets you know when apps get power hungry before they drain your battery or overheat your Mac. It’s a menu-bar app that lets you know when an app is using an excessive amount of CPU or memory so you can close it and save battery power. With Coolant you’re never blindsided with a quick-draining […]"},{"link":"https://nmac.to/blog/torment-tides-of-numenera-1-0-1/","image":"https://nmac.to/wp-content/uploads/2017/03/Torment-Tides.of_.Numenera.png","title":"Torment – Tides of Numenera 1.0.1 – RPG & Story Rich Adventure Game","content":"You are born falling from orbit, a new mind in a body once occupied by the Changing God, a being who has cheated death for millennia. If you survive, your journey through the Ninth World will only get stranger… and deadlier.   With a host of strange companions – whose motives and goals may help […]"},{"link":"https://nmac.to/blog/blogtouch-2-1-0/","image":"https://nmac.to/wp-content/uploads/2016/04/BlogTouch2.png","title":"BlogTouch 2.1.0 – Blogger/Blogspot editor for your Mac","content":"BlogTouch is a friendly Blogger/Blogspot editor for your Mac. It’s equipped with everything you need to manage your blogs: write, publish, update or share posts and moderate comments.   Be more productive and efficient with this powerful and straightforward tool – because at the end of the day, we all have something to share.   […]"},{"link":"https://nmac.to/blog/unity-pro-5-5-2f1/","image":"https://nmac.to/wp-content/uploads/2015/06/Unity3D.png","title":"Unity Pro 5.5.2f1 – High-end game development app","content":"Unity delivers a stable and scalable platform for creating captivating content. Content that is efficient to create, and that works on low as well as high-end hardware.   Unity is the only Mac-based high-end game development tool sporting a stylish pro-app GUI, no-friction workflow and top-of-the-line technical features such as extensible graphics, great particle effects, […]"},{"link":"https://nmac.to/blog/yesterday-origins/","image":"https://nmac.to/wp-content/uploads/2017/02/Yesterday-Origins.png","title":"Yesterday Origins 1.0 – Point & Click Adventure & Puzzle Game","content":"Solve puzzles and immerse yourself in a challenging quest full of unexpected turns! Discover an original visual style and story, touched by the unique humor that helped Pendulo Studios’ success, creators of the Runaway series!   It’s 1481. Young John is publically humiliated and dragged through the street. Under suspicion of witchcraft, he is imprisoned […]"},{"link":"https://nmac.to/blog/pdf-studio-11-0-6/","image":"https://nmac.to/wp-content/uploads/2017/02/PDF-Studio11.png","title":"PDF Studio 11.0.6 – Utility for working with PDF documents","content":"PDF Studio is an easy-to-use yet powerful program for working with PDF documents. View and Print: Open any PDF document and send it to the printer. Documents will be automatically resized to fit the paper size. PDF Studio supports all types of PDF fonts. PDF Interactive Forms: Fill any PDF form and save it locally. […]"},{"link":"https://nmac.to/blog/devonsphere-express-1-8-4/","image":"https://nmac.to/wp-content/uploads/2014/04/DEVONsphere.Express.png","title":"DEVONsphere Express 1.8.4 – Finds connections between seemingly unrelated files","content":"DEVONsphere Express makes your Mac smarter. Be more productive by letting DEVONsphere Express keep track of related emails, articles on the same subject, or similar Web pages. Discover the hidden connection between seemingly unrelated files.   Find other items related to what you’re working on Search like with Spotlight on steroids Context-aware, always focuses on […]"}]