[{"link":"https://nmac.to/blog/carousel/","image":"https://nmac.to/wp-content/uploads/2013/12/icon.175x175-7510.jpg","title":"Carousel 1.5 – Experience Instagram on your Mac","content":"Carousel is a simple, beautiful way to explore Instagram on your desktop in a minimal footprint. View your feed, popular photos, your photos, comment, like, save photos and much, much more. We’ve also implemented a full set of keyboard commands to make operation flawless and four wonderful themes to personalize Carousel to your liking. Please […]"},{"link":"https://nmac.to/blog/flow/","image":"https://nmac.to/wp-content/uploads/2013/09/Flow.png","title":"Flow 1.7.2 – Fast and elegant FTP and SFTP client","content":"Flow is the most beautiful, elegant, and fast FTP+SFTP client on the planet. And with the deepst URL integration, the most seamless droplets, and the fastest file-transfer implemetations anywhere, that’s not just hype. Connect to FTP and SFTP servers with the fastest file-transfer implementations anywhere. Edit files directly on the server, in the robust internal […]"},{"link":"https://nmac.to/blog/voila/","image":"https://nmac.to/wp-content/uploads/2013/12/icon.175x175-7511.jpg","title":"Voila 3.5 – Capture, annotate, organize, and share media","content":"Voila is a screen-capture, recording, and annotation tool that is a full-featured replacement for Mac’s screen-capture and screen-recording capabilities. It has a large and robust set of editing, organizing, annotation, and effects tools that allows the user to create and add details to screenshots, tutorials, videos, and presentations.   Voila lets you capture any shape, […]"},{"link":"https://nmac.to/blog/sandvox/","image":"https://nmac.to/wp-content/uploads/2013/12/AppIcon.175x175-756.jpg","title":"Sandvox 2.8.5 – Easily build eye-catching Web sites","content":"Sandvox is for Mac users who want to create a professional looking website quickly and easily. With Sandvox, you don’t need to be a Web genius to build a stylish, feature-rich, standards-compliant website that’s functional and user friendly. Sandvox’s drag and drop interface lets you watch your website take shape and come to life as […]"},{"link":"https://nmac.to/blog/briefs/","image":"https://nmac.to/wp-content/uploads/2013/12/Briefs.175x175-75.jpg","title":"Briefs 1.1.2 – Create mobile interactive design prototypes","content":"Briefs is the essential app design tool built for a professional design workflow. Lifeless mockups don’t tell the entire story, but you don’t have time to build a prototype. We’ve been there, too. Your clients needed a clearer picture, so give them something to touch.   With Briefs, you can deliver iterations of your design […]"},{"link":"https://nmac.to/blog/onedock-1-0-6/","image":"https://nmac.to/wp-content/uploads/2013/12/OneDock.175x175-75.jpg","title":"OneDock 1.0.6 – keep your applications and documents organized and close by","content":"As a wonderful companion to the Apple Dock, OneDock gives you the ability to create different docks for different categories. With its unique “spinning wheel dock” design, OneDock takes up very little screen real-estate and also smartly stays out of the way when not being used. Add different docks to hold different types of applications, files or […]"},{"link":"https://nmac.to/blog/smasher-3-004/","image":"https://nmac.to/wp-content/uploads/2013/12/19420.jpg","title":"Smasher 3.004 – Font maintenance tool","content":"Smasher preserves the health of your applications by performing automatic maintenance on your Mac. It works unattended to eliminate corruption to font caches and temporary files, the #1 cause of font-related problems and workflow interruptions–so your fonts always image correctly.   Smasher’s set-it-and-forget-it functionality eliminates cache-related problems on an automatic, ongoing basis. Like a virus checker, […]"},{"link":"https://nmac.to/blog/flutter-0554/","image":"https://nmac.to/wp-content/uploads/2013/12/Flutter.175x175-75.jpg","title":"Flutter 0.7.12 – Control your multimedia experience with hand gestures","content":"Flutter enables you to use hand gestures to control music and videos via the built-in webcam in your computer. We hated using the keyboard and mouse for controlling music in the background or watching movies on our computers from a few feet away. So we decided to solve this problem..   It works with iTunes, Spotify, […]"},{"link":"https://nmac.to/blog/mariner-write-3-9-2/","image":"https://nmac.to/wp-content/uploads/2013/12/1095.jpg","title":"Mariner Write 3.9.2 – Light-weight and straightforward word processor","content":"Mariner Write is your Mac OS go-to word processing tool! Professional writer, educator or student, Write has all the functionality you need for that important letter, technical paper or research project. Elegantly efficient and powerful, Mariner Write turns out great looking documents. Create customized headers, footers, endnotes or footnotes.   Easily define styles; use keyboard shortcuts […]"},{"link":"https://nmac.to/blog/quickbooks-pro-2013/","image":"https://nmac.to/wp-content/uploads/2013/12/10146.jpg","title":"QuickBooks Pro 2013 14.0.2 R3 – Financial management and accounting for small businesses","content":"QuickBooks Pro 2013 helps you manage your business easily and efficiently. Organize your finances all in one place, track money going in and out of your business, and spot areas where you can save. Built for Mac OS – Looks and works like you’d expect Create invoices, pay bills, and manage expenses Gain insight into your […]"}]