[{"link":"https://nmac.to/blog/patterns-1-1/","image":"https://nmac.to/wp-content/uploads/2016/09/Patterns.png","title":"Patterns 1.1 – Powerful tool for working with regular expressions","content":"Patterns is a simple yet powerful tool for working with regular expressions. Build great patterns quickly and effortlessly with syntax coloring, and with matching and replacing occurring in real time.   Features: Regular expression syntax coloring makes it easy to see how your pattern is interpreted by the regex engine. No more confusion about what […]"},{"link":"https://nmac.to/blog/cashew-1-10-2/","image":"https://nmac.to/wp-content/uploads/2016/09/Cashew.png","title":"Cashew 1.10.2 – Desktop client for Github issues","content":"Cashew is a simple, fast, and elegant app to manage your Github issues.   Features GitHub.com and GitHub Enterprise support Ability to view issue details, assign to users, add labels, attach milestone, comment on issues and much more Ability to save common search queries for quick access Fast and powerful offline issue search Batch update […]"},{"link":"https://nmac.to/blog/set-for-ms-office-2-9-1/","image":"https://nmac.to/wp-content/uploads/2015/07/Set.for_.MS_.Office2.png","title":"Set for MS Office 2.9.1 – Bundle of themes and templates for MS Office","content":"Set for MS Office is the ultimate bundle of all designs for Word, PowerPoint, and Excel for Mac offered by Jumsoft. It gives numerous options for producing professional and exciting content ranging from striking themes for your slideshows to smart multi-layout templates for brochures and catalogs. Set for MS Office will make your work more […]"},{"link":"https://nmac.to/blog/moxile-3-0-1/","image":"https://nmac.to/wp-content/uploads/2016/02/Moxile.png","title":"Moxile 3.0.1 – Productive markdown editor app","content":"Moxile, the missing Markdown editor designed for productivity. It comes with **Live Preview**. It offers full support for regular Markdown Syntax as well as Github flavored markdown extension.   syntax highlight auto save powerful actions featured picture inserter full github flavored markdown extension support light and dark theme built-in, support customize HTML and PDF export […]"},{"link":"https://nmac.to/blog/bundle-for-iwork-4-9-3/","image":"https://nmac.to/wp-content/uploads/2016/09/Bundle-for-iWork.png","title":"Bundle for iWork 4.9.3 – Pages, Numbers, and Keynote templates","content":"Bundle for iWork provides you with unique designs for Pages documents, spreadsheet templates for Numbers, first-class slideshow themes for Keynote, and images for illustrating your content. All templates are available in the US and international paper sizes.   Version 4.9.3: New 95 Pages templates.   Intel, 64-bit processor OS X 10.10 or later    "},{"link":"https://nmac.to/blog/recordee-1-0/","image":"https://nmac.to/wp-content/uploads/2016/09/Recordee.png","title":"Recordee 1.0 – A drop-dead easy app to record audio on your Mac","content":"Recordee is a drop-dead easy app to record audio on your Mac. It resides on your Menu bar as a small icon and requires just two clicks to initiate a recording. It is one of the distraction less recording app that leaves no trace of its existence on the desktop. It keeps doing its job […]"},{"link":"https://nmac.to/blog/macpay-business-edition-4-7-13/","image":"https://nmac.to/wp-content/uploads/2016/09/MacPay-Business.png","title":"MacPay Business Edition 4.7.13 – Pro version of financial app for Swiss banking system","content":"MacPay Business Edition is a pro version of our existing MacPay Standard payment management application. It adds the following features to the basic Swiss payment management functions of the Standard version:   Full PDF scan and management of invoices. Payment data are extracted from the PDF and the PDF is linked to the payment and […]"},{"link":"https://nmac.to/blog/space-rogue-1-45/","image":"https://nmac.to/wp-content/uploads/2016/09/Space-Rogue.png","title":"Space Rogue 1.45 – Take on the role of a spaceship captain","content":"Lead your crew across the galaxy, where the ultimate goal is up to you. Fight for peace or piracy as you explore new worlds, improve your ship, recruit crew members and engage in intense ship-to-ship battles.   Space Rogue combines strategy, tactics and adventure in a game that gives you complete freedom to explore the […]"},{"link":"https://nmac.to/blog/stardust-galaxy-warriors-stellar-climax-1-0/","image":"https://nmac.to/wp-content/uploads/2016/09/Stardust-Galaxy-Warriors.png","title":"Stardust Galaxy Warriors: Stellar Climax 1.0 – Co-op action shooter game","content":"Stardust Galaxy Warriors: Stellar Climax is an engaging 1-4 player couch co-op action shooter game, combining SHMUP and Brawler-like gameplay with light RPG elements. Choose from different game modes, gameplay settings, mechs, weapons and upgrades to customize your experience freely. Soar through space, defeat evil and save the future… from itself!   Local co-op for […]"},{"link":"https://nmac.to/blog/rive-1-0/","image":"https://nmac.to/wp-content/uploads/2016/09/RIVE.png","title":"RIVE 1.0 – 360-degree shooter/platformer game","content":"RIVE is the metal wrecking, robot hacking shooter you’ve been waiting for! This 360-degree shooter/platformer hybrid lets you choreograph a ‘dance of destruction’ in insanely spectacular battles and set-pieces. RIVE feels like the explosive games of yore, pumping megapixels in true 21st century style.   Endless variety: fight on land, underwater, in zero gravity or […]"}]