[{"link":"https://nmac.to/blog/plisterine-2-0/","image":"https://nmac.to/wp-content/uploads/2014/02/Plisterine.png","title":"Plisterine 2.0 – Easily create launch agents","content":"Plisterine is an application that will help you easily create launch agents.    What are launch agents, you ask? Launch agents are magic little files with which you can automate the launching/running of applications and scripts when certain conditions you define are met.   With Plisterine you can create launch agents that launch an application/script: […]"},{"link":"https://nmac.to/blog/hopper-disassembler-2-8-8/","image":"https://nmac.to/wp-content/uploads/2014/02/Hopper.Disassembler.png","title":"Hopper Disassembler 2.8.8 – Binary disassembler, decompiler, and debugger","content":"Hopper Disassembler is a binary disassembler, decompiler, and debugger for 32-bit and 64-bit executables.    This tool will let you disassemble any binary you want, and provide you all the information about its content, like imported symbols, or the control flow graph! Hopper can retrieve procedural information about the disassembled code like the stack variables, […]"},{"link":"https://nmac.to/blog/picsketch-1-2/","image":"https://nmac.to/wp-content/uploads/2014/02/PicSketch.png","title":"PicSketch 1.2 – Powerful photo sketcher with helpful presets","content":"PicSketch is powerful photo-sketch software which can easily turn a photo into a sketch with just a few mouse clicks. Not much of an artist? That’s OK. PicSketch will amaze you with its results. As you would expect of professional sketching software, it offers basic editing tools such as rotation, contrast and brightness adjustment, and […]"},{"link":"https://nmac.to/blog/zend-studio-10-6-0/","image":"https://nmac.to/wp-content/uploads/2014/02/ZendStudio.png","title":"Zend Studio 10.6.0 – Professional-strength PHP development environment","content":"Zend Studio is the only Integrated Development Environment (IDE) designed for professional developers that encompasses all the development components necessary for the full PHP application lifecycle.   Through a comprehensive set of editing, debugging, analysis, optimization, database tools and testing Zend Studio 5 speeds development cycles and simplifies complex projects.   To reflect varying developers’ […]"},{"link":"https://nmac.to/blog/business-mix-set-1-5/","image":"https://nmac.to/wp-content/uploads/2014/02/Business-Mix-Set.png","title":"Business Mix Set 1.5 – Professional and stylish business templates for Apple’s Pages","content":"Business Mix Set gives a boost to the chemistry between you and your clients! Pick up 146 professional and stylish business templates for Apple’s Pages application.   Business Mix Set presents an excellent kit of 146 templates for Pages, from business cards and newsletters to proposals and various project management forms. Some of the templates […]"},{"link":"https://nmac.to/blog/set-for-ms-office-1-2/","image":"https://nmac.to/wp-content/uploads/2014/02/Set-for-MS-Office.png","title":"Set for MS Office 1.2 – Word, PowerPoint, and Excel designs bundle","content":"Set for MS Office is the ultimate bundle of all designs for Word, PowerPoint, and Excel for Mac offered by Jumsoft. It gives numerous options for producing professional and exciting content ranging from striking themes for your slideshows to smart multi-layout templates for brochures and catalogs. Set for MS Office will make your work more […]"},{"link":"https://nmac.to/blog/inspiration-set-2-8/","image":"https://nmac.to/wp-content/uploads/2014/02/Inspiration-Set.png","title":"Inspiration Set 2.8 – Unique page-template designs","content":"Inspiration Set includes a large range of templates, providing a wide selection of documents, from business cards and jewel case covers to brochures and books.   Some templates contain up to 28 different sections, so the package provides an ample array of over 700 layouts to meet your most exclusive requirements. Each and every layout […]"},{"link":"https://nmac.to/blog/clipart-prime-1-5-1/","image":"https://nmac.to/wp-content/uploads/2014/02/Clipart-Prime.png","title":"Clipart Prime 1.5.1 – More than 500 high-quality clipart images","content":"The Clipart Prime collection contains 556 clipart images of the highest quality available on the market. Each image speaks volumes about the immense skill and attention to detail that went into it. Now you can use Clipart Prime images to create icons or illustrate a variety of text content. Image themes range from business and […]"},{"link":"https://nmac.to/blog/connect-1-2-2/","image":"https://nmac.to/wp-content/uploads/2014/01/Connect.png","title":"Connect 1.2.2 – Phone calls using Bluetooth connection","content":"Connect lets you connect with your friends by allowing you to place phone calls and receive phone calls from your Mac using a Bluetooth connection to your phone. You may also press the keys 0-9 * # during a call, to use the dialer.   Version 1.2.2: Bug Fixes Restored menubar functionality   OS X […]"},{"link":"https://nmac.to/blog/speedtools-utilities-pro/","image":"https://nmac.to/wp-content/uploads/2014/02/SpeedTools.Utilities.Pro_.png","title":"SpeedTools Utilities Pro 3.9 – Collection of disk utilities","content":"With SpeedTools Utilities Pro, Mac disk repair and maintenance has never been easier, faster or more automated. And, with its unparalleled collection of performance and problem-solving utilities, you’ll have your Mac tuned to perfection and protected from disaster in minutes!   SpeedTools provides the advanced features you need: Safe and fast Disk Defragmenting, Bad Sector […]"}]