[{"link":"https://nmac.to/blog/apocalipsis/","image":"https://nmac.to/wp-content/uploads/2019/05/Apocalipsis.png","title":"Apocalipsis Wormwood Edition 2.0 – A point-and-click adventure game","content":"In Apocalipsis you play as Harry, for whom the loss of his beloved was the end of his world. Now he has to venture out into the strange, unwelcoming lands to get her back. On his journey he will meet fantastical creatures, straight from the minds of artists from the 15th century Europe, and ultimately […]"},{"link":"https://nmac.to/blog/fahrenheit-indigo-prophecy-remastered/","image":"https://nmac.to/wp-content/uploads/2019/05/Fahrenheit.png","title":"Fahrenheit: Indigo Prophecy Remastered 1.0.4 – Quick-Time Events Adventure Game","content":"Originally released in 2005, Fahrenheit (known as Indigo Prophecy in North America) was a breakthrough in interactive narrative, teetering between the worlds of cinema and gaming while also embracing them, carving its own unique genre in the entertainment landscape. This newly remastered edition features updated graphics, full controller support AND is based on the uncut/uncensored […]"},{"link":"https://nmac.to/blog/the-lord-of-the-rings-war-in-the-north/","image":"https://nmac.to/wp-content/uploads/2019/05/The-Lord-of-the-Rings-War-in-the-North.png","title":"The Lord of the Rings War in the North 1.0.1 – Play an untold story in J. R. R. Tolkien’s renowned","content":"In The Lord of the Rings: War in the North a new Fellowship is born in the battle for Middle-earth.   Sauron’s dark forces are marching and a small band of heroes is all that stands before them. Together, Eradan the Ranger, Andriel the Elf and Farin the Dwarf embark on an epic journey across […]"},{"link":"https://nmac.to/blog/steermouse/","image":"https://nmac.to/wp-content/uploads/2016/11/SteerMouse.png","title":"SteerMouse 5.3.7 – Powerful third-party mouse driver software","content":"SteerMouse is an advanced driver for USB and Bluetooth mice. It also supports Apple Mighty Mouse very well.   SteerMouse can assign various functions to buttons that Apple’s software does not allow, including double-clicks, modifier clicks, application switching, assignment of shortcut keys, “snap to” cursor movement, which moves the cursor to target (such as an […]"},{"link":"https://nmac.to/blog/framer/","image":"https://nmac.to/wp-content/uploads/2016/05/Framer.png","title":"Framer 124 – Pioneer new patterns and groundbreaking designs","content":"Framer is a design tool that uses code to make anything possible. Pioneer new patterns and groundbreaking designs. Find the best solution, not just the expected one.   Set Your Creativity Loose Framer does a lot more than transitions or quick animations. Design using real data. Build real interfaces with customizable components. Test and validate […]"},{"link":"https://nmac.to/blog/prof-media/","image":"https://nmac.to/wp-content/uploads/2019/05/Prof.Media_.png","title":"Prof Media 8.1.0 – A media converter toolbox","content":"Far more than a media converter toolbox, this all-inclusive media solution could convert, download, burn, backup, edit, enhance, organize, capture, and play any videos on your Mac. Convert between 180+ formats of DVD movies, up to 1080P videos, online videos and audio files. Backup DVD movies onto computer hard drive or blank discs in 3 […]"},{"link":"https://nmac.to/blog/war-for-the-overworld/","image":"https://nmac.to/wp-content/uploads/2016/12/War.for_.the_.Overworld.png","title":"War for the Overworld 2.0.6f1 – Strategy & Fantasy Game","content":"Do you feel you are in a slump? Monotonously disembowelling evil guys in endless quests for gold and a slightly better pair of boots? You are starting to wonder… are heroics really your calling? Welcome to the War for the Overworld!   War for the Overworld is a Dungeon Management Game that employs your favourite […]"},{"link":"https://nmac.to/blog/batman-arkham-city-goty/","image":"https://nmac.to/wp-content/uploads/2014/05/Batman.Arkham.City_.GOTY_.png","title":"Batman Arkham City GOTY 1.2.1 – The Dark Knight descends","content":"A year after the events of Batman: Arkham Asylum, Quincy Sharp, the new mayor of Gotham, has turned its slums into Arkham City, a terrifying open-air prison where violent thugs and insane super-villains are incarcerated within heavily fortified walls.   When Batman is imprisoned alongside Gotham’s most notorious, he must discover Arkham City’s true purpose […]"},{"link":"https://nmac.to/blog/f1-2012/","image":"https://nmac.to/wp-content/uploads/2019/05/F1.2012.png","title":"F1 2012 1.0.1 – Realistic F1 Racing Game","content":"Codemasters Racing presents F1 2012, the next game in the BAFTA-winning series featuring all the official drivers, teams and circuits from the 2012 FIA FORMULA ONE WORLD CHAMPIONSHIP™. Learn the basics and master the challenge of driving the best machines on the planet in the Young Driver Test.    Experience the next generation in weather […]"},{"link":"https://nmac.to/blog/disk-diag/","image":"https://nmac.to/wp-content/uploads/2015/07/Disk-Diag1.png","title":"Disk Diag 1.6 – Quickly discover and clean up unneeded files in your home folder","content":"Disk Diag scans your home folder for useless files and removes them to free up disk space with only a few clicks.   Features: Modular Architecture: seven built-in modules for the most efficient cleanup functions Smart Gauge: overview the details of your disk usage at a glance Fast Cleanup: quickly remove unneeded files   Modules: […]"}]