[{"link":"https://nmac.to/blog/xview-1-6-0/","image":"https://nmac.to/wp-content/uploads/2015/05/XView.png","title":"XView 1.6.0 – Powerful file viewer","content":"With XView, you can easily view images, audios and videos in the archives and the local folders. It is an easy-to-use app and perfectly compatible with OS X.   Features: Supports Archive formats, Picture formats, and Audio and video formats View images Get File Details, including file EXIF data Easy Operation – interactive interface makes […]"},{"link":"https://nmac.to/blog/ssh-tunnel-15-05/","image":"https://nmac.to/wp-content/uploads/2015/03/SSH.Tunnel.png","title":"SSH Tunnel 15.05 – Easily manage and control ssh tunnels","content":"SSH Tunnel allows you to easily manage and precisely control your ssh tunnels.   SSH Tunnel is able to remember the ssh login password and save it to OS X’s keychain. Furthermore, SSH Tunnel is designed to automatically reconnect when your Mac is waking up from sleep.   Notable Features: Auto launch when log in […]"},{"link":"https://nmac.to/blog/degrees-pro-4-2-1/","image":"https://nmac.to/wp-content/uploads/2015/05/Degrees.Pro_.png","title":"Degrees Pro 4.2.1 – Get basic weather info in your menu bar","content":"The weather app that Apple should have made. Simply the best weather app for your Mac. Delightful, elegant and unobtrusive, Degrees Pro shows current weather in the menu bar, where you can always easily see it.   More than 250,000 users can’t be wrong!   Features: Automatically detects your location Option to manually enter a […]"},{"link":"https://nmac.to/blog/stache-1-2/","image":"https://nmac.to/wp-content/uploads/2015/05/Stache.png","title":"Stache 1.2 – A smarter way to bookmark web pages","content":"Stache makes it quick and easy to collect and re-discover pages you find useful, interesting or inspiring, in a beautiful, visual and fully searchable library. Say goodbye to cluttered browser bookmarks and overwhelming reading lists. In one click a web page becomes part of your personal repository of useful information, archived, fully searchable and accessible […]"},{"link":"https://nmac.to/blog/astropad-1-2/","image":"https://nmac.to/wp-content/uploads/2015/02/Astropad.png","title":"Astropad 1.2 – Transform your ipad into a professional graphics tablet","content":"Use the Mac creative tools you know & love, like Photoshop, with the touch experience of your iPad.   Creating Astropad required innovative new technology we call LIQUID. The result is stunning image quality and responsiveness never before seen in similar tools.   LIQUID is true to your source material with color corrected output and […]"},{"link":"https://nmac.to/blog/annotate-2-0-4/","image":"https://nmac.to/wp-content/uploads/2015/05/Annotate.png","title":"Annotate 2.0.4 – Screenshot capture and annotation tool (was Glui)","content":"Annotate (was Glui) is the simplest way to capture, annotate and share screenshots.   This is a complete rewrite that builds on what made Glui popular and adds some of the most requested features. It’s way faster, far better, and most importantly, just as simple.   Key features: Capture a screenshot or drag and drop […]"},{"link":"https://nmac.to/blog/timelime-1-3-3/","image":"https://nmac.to/wp-content/uploads/2014/01/Timelime.png","title":"Timelime 1.3.3 – Track and visualize your working hours","content":"Timelime is the easiest and most beautiful way to track and visualize your working hours. Timelime is the perfect assistant for:   Freelancers and independent contractors who have to track their time spent on projects Students who want to spend more time studying by monitoring their daily/weekly/monthly workload Individuals who are interested in how they […]"},{"link":"https://nmac.to/blog/smartdown-1-0-4/","image":"https://nmac.to/wp-content/uploads/2015/05/smartdown.png","title":"SmartDown 1.0.4 – A MultiMarkdown editor with outliner capabilities","content":"SmartDown is a MultiMarkdown editor with outliner capabilities… and more.   Main features: Outliner mode Highlight feature to stay focussed on the active part of your document Customizable to fit your needs (theme, colors, layout, zoom, …) Multiple export formats (PDF, RTF, HTML, OPML,…) MultiMarkdown and Critic Markup support Goal and statistics   Version 1.0.4: […]"},{"link":"https://nmac.to/blog/networkplayer-2-1/","image":"https://nmac.to/wp-content/uploads/2015/05/NetworkPlayer.png","title":"NetworkPlayer 2.1 – The next generation media player","content":"Most awaited “Network Player” is now here. The next generation media player to amaze you! Your OS X machine can become host station from where you can watch movies and audios on any browser or any devices without downloading them.   Reloaded with many features to amaze you more & having unique features not found […]"},{"link":"https://nmac.to/blog/macaw-1-5-15/","image":"https://nmac.to/wp-content/uploads/2014/04/Macaw1.png","title":"Macaw 1.5.15 – The code-savvy web design tool","content":"Stop writing code. Start drawing it.   Macaw provides the same flexibility as your favorite image editor but also writes semantic HTML and remarkably succinct CSS. It’s time to expect more from a web design tool.   Fluid canvas and grid Macaw is engineered for fluid widths. Resize the canvas and your grids and elements […]"}]