[{"link":"https://nmac.to/blog/time-stamp/","image":"https://nmac.to/wp-content/uploads/2021/01/Time-Stamp.png","title":"Time Stamp 2.50 – Generate text or image time stamp in any situation with a global hotkey","content":"Generate text or image time stamp in any situation with a global hotkey!   All functions and settings can be reached from the status menu too.   Version 2.50: option added via user request: font color of picture stamp can be customized support menu modified   Intel, 64-bit processor macOS 10.15 or later    "},{"link":"https://nmac.to/blog/contexts/","image":"https://nmac.to/wp-content/uploads/2017/04/Contexts3.png","title":"Contexts 3.8.1 – Fast window switcher","content":"Contexts is a radically faster and simpler window switcher. It gives you 4 ways to switch windows: Switch with one click to any window: An auto-hiding sidebar shows your windows organized in groups. To switch to a window just click its title in the list. It is as simple as that. Switch with one keystroke […]"},{"link":"https://nmac.to/blog/airport-ceo/","image":"https://nmac.to/wp-content/uploads/2021/08/Airport-CEO.png","title":"Airport CEO 1.0-26 – 2D Management & Simulation Game","content":"Airport CEO is a tycoon and management game in development for PC and Mac where you take the seat as a CEO of your own airport. You will build the airport’s infrastructure with everything from runways and taxiways, gates and aprons to constructing terminals with check-in, security, restaurants and shops. You will manage the business […]"},{"link":"https://nmac.to/blog/counter-terrorist-agency/","image":"https://nmac.to/wp-content/uploads/2021/08/Counter-Terrorist-Agency.png","title":"Counter Terrorist Agency 1.0.3 – Fight international terrorism and prevent attacks","content":"Join CTA – Counter Terrorist Agency, an international organisation developed to fight terrorism.   Use modern invigilation techniques, gather information, search for important members of terrorist networks and prevent devastating attacks. Decide who should be spied on and who should be neutralized. Discover Islamic World Caliphate cells all over the world. Fight far-right terrorism in […]"},{"link":"https://nmac.to/blog/detonation-racing/","image":"https://nmac.to/wp-content/uploads/2021/08/Detonation-Racing.png","title":"Detonation Racing 1.0.3 – The most dangerous racing game","content":"Welcome to Detonation Racing, the most dangerous, least sensible racing series ever devised! I’m Dr Boom and it’s all my fault…   Why are we here? So you can drive far too quickly and, ooh, I dunno, how about drop a nuclear powered submarine onto the track to destroy the other racers? Just to claim […]"},{"link":"https://nmac.to/blog/streets-of-rage-4/","image":"https://nmac.to/wp-content/uploads/2020/11/Streets-of-Rage-4.png","title":"Streets of Rage 4 07g r13038 – Classic 2D Streets Fighting Game","content":"The all-time classic Streets of Rage, known as Bare Knuckle (ベア·ナックル Bea Nakkuru) in Japan, is a trilogy of beat ‘em up known for this timeless gameplay and electronic dance influenced music. Streets of Rage 4 builds upon the classic trilogy’s gameplay with new mechanics, beautiful hand drawn visuals and a God tier soundtrack.   […]"},{"link":"https://nmac.to/blog/wolf/","image":"https://nmac.to/wp-content/uploads/2017/09/Wolf-2.png","title":"Wolf 2 3.03 – Build responsive Web sites","content":"Wolf lets you build beautiful and mobile-friendly websites. Wolf is a Mac app that focuses exclusively on responsive layout design, with support for unlimited number of websites and full offline editing. Once you are done with your design, you can export all design into responsive source code, ready for publishing to any web host using […]"},{"link":"https://nmac.to/blog/vectorworks/","image":"https://nmac.to/wp-content/uploads/2018/10/Vectorworks.png","title":"VectorWorks 2021 SP4 – Industry standard CAD program","content":"VectorWorks is currently the best selling CAD software on the Mac and an industry standard on Windows. With over 400,000 users in over 80 countries, it is one of the world’s most popular CAD programs. Engineered to meet the specific needs of smart-sized companies, VectorWorks has everything you need for precision 2D drafting, powerful 3D […]"},{"link":"https://nmac.to/blog/dvd-creator/","image":"https://nmac.to/wp-content/uploads/2020/06/DVD-Creator6.png","title":"DVD-Creator 6.1.6.1 – Turn videos, photos and music into DVD films","content":"Wondershare DVD-Creator can easily turn videos, photos and music into DVD films that everyone loves to watch. • Create personalized DVD movies from footage of favorite family moments. • Make a DVD slideshow with your favorite photos and music. • Burn movies and TV shows to DVD with high quality and at fast speed.   […]"},{"link":"https://nmac.to/blog/big-sur-cache-cleaner/","image":"https://nmac.to/wp-content/uploads/2021/04/Big-Sur-Cache-Cleaner.png","title":"Big Sur Cache Cleaner 16.1.6 – Clear caches, access hidden OS X settings","content":"Big Sur Cache Cleaner is an award winning general purpose tool for macOS X. BSCC makes system maintenance simple with an easy point and click interface to many macOS X functions. Novice and expert users alike will appreciate the powerful toolset BSCC provides. Big Sur Cache Cleaner is one of the world’s leading maintenance tools […]"}]