[{"link":"https://nmac.to/blog/battle-supremacy/","image":"https://nmac.to/wp-content/uploads/2014/06/Battle-Supremacy.png","title":"Battle Supremacy 1.3.1 – Sensational WWII tank game","content":"Battle Supremacy, a sensational WWII tank game with thrilling gameplay and showoff-worthy visuals.   Feast your eyes on amazing landscapes and landmarks: entire forests teeming with wildlife, sprawling real-world cities with tunnels and bridges, overrun by tanks, trains, warships; there are even fish in the water!   The gameplay is so immersive and engaging that […]"},{"link":"https://nmac.to/blog/the-initial/","image":"https://nmac.to/wp-content/uploads/2017/08/The-Initial.png","title":"The Initial 1.0 – A hyper action game about pretty schoolgirls battling against evil","content":"The game takes place in a special area called SPE, with a school for students gifted with ESP powers. Every student of the school is skilled in battle, and an evil organization wants to create an artificial girl who has the ultimate power. They have secretly collected combat data and are close to achieving their […]"},{"link":"https://nmac.to/blog/calories-counter/","image":"https://nmac.to/wp-content/uploads/2017/08/Calories-Counter.png","title":"Calories Counter 3.3 – Personal food diary","content":"Calories Counter is your personal food diary, a powerful, easy-to-use tool that will help you to reach your goals. If you want to lose weight, gain weight, or keep fit, this is the app for you. You can track food intake and workouts, record your weight, and see your progress thanks to the charts–all in […]"},{"link":"https://nmac.to/blog/plugshield/","image":"https://nmac.to/wp-content/uploads/2014/09/plugSHIELD.png","title":"plugSHIELD 1.50 – Prevent plug & mount attempts from USB slot","content":"As long as plugSHIELD is running, no one can plug and copy anything from your Mac!   Attention: (feed back to user’s review), please just disable the app’s dock icon from setting(default) to make plugSHIELD can NOT be simply FORCE QUIT either.   Remember how in the movie Iron Man, Stark’s girlfriend managed to steal […]"},{"link":"https://nmac.to/blog/easy-pass/","image":"https://nmac.to/wp-content/uploads/2014/02/Easy.Pass_.png","title":"Easy Pass 1.11 – Easy, simple and powerful password manager","content":"Easy Pass provide a simple way to store and access your passwords and private information. There’s no need to remember your username, and passwords.   Easy Pass is secure because the data that you entered will be stored with AES encryption.   Features & Benefits   Protects Against Hackers Secures and safeguards your passwords.   […]"},{"link":"https://nmac.to/blog/itab-pro/","image":"https://nmac.to/wp-content/uploads/2017/08/iTab-Pro.png","title":"iTab Pro 1.4 – A new way to access your Instagram","content":"iTab Pro is new way to access your Instagram. Doesn’t have enough space for a menubar app? Not a problem. We introduce InstaTab Pro that will stick on edges of your screen.   iTab Pro with these Charming features:   Access your Instagram with “1 click” from your menubar，red camera icon in menubar, Desktop mode […]"},{"link":"https://nmac.to/blog/rar-sharp/","image":"https://nmac.to/wp-content/uploads/2014/08/Rar-Sharp.png","title":"Rar Sharp 1.6.0 – Simple decompression app","content":"Rar Sharp is a simple, practical decompression software, can fast, simple and efficient extracting file its easy-to-use interface, personalized settings let you easily office.   Features Supports to unzip password protected RAR files . Double click to BROWSE images and PREVIEW files inside an archive without extracting. Supports to automatic mode and manual mode with […]"},{"link":"https://nmac.to/blog/together/","image":"https://nmac.to/wp-content/uploads/2014/01/Together.png","title":"Together 3.8.8 – Store and organizes all your files","content":"Together helps you organize your Mac, giving you the ability to store, edit and preview your files in a single clean, uncluttered interface.   Smart storage. With simple drag-and-drop functionality, Together lets you gather up images, text, bookmarks, and files for safekeeping. With built-in note-taking capabilities and easy inter-app file transfers, take control of cluttered, […]"},{"link":"https://nmac.to/blog/pimp-my-picture/","image":"https://nmac.to/wp-content/uploads/2013/08/Pimp-My-Picture.png","title":"Pimp My Picture 1.3.0 – Adding amusing graphics, text balloons, or quotes for your photos","content":"Pimp My Picture is a fun image editor that allows you to quickly customize your photos by adding amusing graphics, text balloons, or quotes.   Pimp My Picture includes a collection of 600+ graphics covering almost any occasion. The app allows you to add glasses or mustaches, text balloons, your own comments and more.   […]"},{"link":"https://nmac.to/blog/menutab-pro-for-gmail/","image":"https://nmac.to/wp-content/uploads/2017/08/MenuTab-Pro-for-Gmail.png","title":"MenuTab Pro for Gmail 1.7 – Real-time Gmail access from your menu bar","content":"MailPopup Pro for Gmail is new way to access your Gmail. MailPopup Pro with these Charming features:   Access your email with “1 click” from your menubar，red mail icon in menubar, Desktop mode with attachments, Google chat, Popup notifications, Stealth mode, Full screen support and much more!   It is Convenient to access to Gmail […]"}]