[{"link":"https://nmac.to/blog/youtube-hunter-5-5-8/","image":"https://nmac.to/wp-content/uploads/2014/08/YouTubeHunter.png","title":"YouTube Hunter 5.5.8 – Download and convert YouTube videos","content":"YouTubeHunter is a video downloader and converter.   It takes only seconds to find and download videos from YouTube, Vimeo, DailyMotion, VEVO and others. YouTubeHunter downloads videos 15x faster than real time playing and supports simultaneous downloads. YouTubeHunter has built-in search and preview capabilities. Get video by URL feature is available. YouTubeHunter keeps subtitles for […]"},{"link":"https://nmac.to/blog/translateq-2-0-6/","image":"https://nmac.to/wp-content/uploads/2015/06/TranslateQ.png","title":"TranslateQ 2.0.6 – Online translator","content":"TranslateQ is an online translator with Automatic Clipboard Translation.   Services: Google Microsoft Yandex   Dictionaries: ImTranslator Systran Bab.la   Supported languages (Google): English, German, Chinese (Simplified), Chinese (Traditional), Spanish, Japanese, Russian, French, Portuguese, Arabic, Korean, Basque, Catalan, Czech, Danish, Dutch, Esperanto, Estonian, Finnish, Galician, Georgian, Greek, Haitian, Creole, Hebrew, Hungarian, Icelandic, Indonesian, Irish, Italian, […]"},{"link":"https://nmac.to/blog/jaksta-1-4-2/","image":"https://nmac.to/wp-content/uploads/2014/01/Jaksta.png","title":"Jaksta 1.4.2 – Record and download streaming audio and video","content":"Jaksta is the easiest way to download and convert Video, Audio and MP3s from the Web to your Mac. Just open Jaksta, then play a video or song in your browser, and Jaksta saves a perfect digital copy to your Mac’s hard disc, or converts it to several popular device formats. Jaksta is the only […]"},{"link":"https://nmac.to/blog/haven-1-1/","image":"https://nmac.to/wp-content/uploads/2015/06/Haven.png","title":"Haven 1.1 – A writing tool, and a place to write","content":"Haven is not a tool but a place to write…   Simply put, Haven helps all kinds of amateur and professional writers get inspired and focused on their writing, stimulating their creativity while setting a peaceful mind-set and offering bullet-proof creative writing aids. As a place to write, Haven offers several different locations/themes as well […]"},{"link":"https://nmac.to/blog/bee-2-1/","image":"https://nmac.to/wp-content/uploads/2015/03/Bee.png","title":"Bee 2.1 – Client for tracking in FogBugz, GitHub, and JIRA","content":"Bee syncs with GitHub Issues, JIRA, and FogBugz. You can also use Bee to keep track of your plain text notes.   Features: Flight Path. Flight Path lives in your menu bar and helps you by intelligently selecting the task you should be working on next. Notifications. Bee uses Notification Center to inform you of […]"},{"link":"https://nmac.to/blog/atlas-for-google-maps-1-0/","image":"https://nmac.to/wp-content/uploads/2015/08/Atlas.for_.Google.Maps_.png","title":"Atlas for Google Maps 1.0 – Information, directions and street-level on Google Maps","content":"Find local business information, directions, and street-level imagery around the world with GMaps.   Comprehensive, accurate maps in 220 countries and territories Transit directions and maps for over 15,000 cities and towns Live traffic conditions, incident reports, and automatic rerouting to find the best route Detailed information on more than 100 million places Street View […]"},{"link":"https://nmac.to/blog/apowersoft-mac-screen-recorder-2-4-0/","image":"https://nmac.to/wp-content/uploads/2015/08/Apowersoft.Mac_.Screen.Recorder.png","title":"Apowersoft Mac Screen Recorder 2.4.0 – Feature-rich screen recording software","content":"Apowersoft Mac Screen Recorder makes it super easy and fast to record your entire screen. It offers great features that you can enjoy, including the ability to capture your video camera, create picture-in-picture videos, make software training videos, record any audio you hear on Mac, and more. One of the coolest features of this Mac […]"},{"link":"https://nmac.to/blog/unetcams-2-1-2/","image":"https://nmac.to/wp-content/uploads/2015/08/uNetCams.png","title":"uNetCams 2.1.2 – Multicam Monitor Software for Mac","content":"uNetCams allows you to monitor multiple live video and audio feeds directly from network cameras (1000+ models of network cameras from 100+ manufacturers) and built-in/FireWire/USB webcams with top notch performance and speed.   Main Features Up to 100 cameras can be configured Direct access to audio and video streams from cameras. No NVR or 3rd […]"},{"link":"https://nmac.to/blog/thumbtack-2-1/","image":"https://nmac.to/wp-content/uploads/2015/08/Thumbtack2.png","title":"Thumbtack 2.1 – Easy access to your Pinboard bookmarks","content":"Thumbtack is a menu-bar utility that provides quick and easy access to the most recently saved bookmarks in your Pinboard account. It was developed around one core feature, allowing it be polished, reliable, and extremely efficient.   You don’t have to be a Pinboard power-user to enjoy the benefits of having a Pinboard account. The […]"},{"link":"https://nmac.to/blog/news-for-google-news-1-0/","image":"https://nmac.to/wp-content/uploads/2015/08/News-for-Google-News.png","title":"News for Google News 1.0 – Comprehensive, up-to-date news coverage","content":"Comprehensive, up-to-date news coverage, aggregated from sources all over the world.   Available for more than 70 countries : United States, China, India, France, Germany, Italia, Spain, United Kingdoms, and more !   You can find all your favorites newspaper : New York Times, Le Monde, Le Figaro, Le Point, 20 minutes, Le Parisien, BFMTV, […]"}]