[{"link":"https://nmac.to/blog/ultraedit/","image":"https://nmac.to/wp-content/uploads/2016/11/UltraEdit18.png","title":"UltraEdit 21.00.0.36 – Mac version of the Windows text editor","content":"UltraEdit is the world’s best text editor, now available for Mac. UltraEdit for Mac is a native Mac application based on the popular Windows text editor, UltraEdit! UE Mac offers a myriad of tools that make it ideal for anything from basic text editing, to a full-fledged development in languages such as C, Objective C, […]"},{"link":"https://nmac.to/blog/viper-ftp/","image":"https://nmac.to/wp-content/uploads/2017/01/Viper-FTP.png","title":"Viper FTP 6.1.4 – Handy FTP client (was ViaFTP)","content":"Viper FTP (was ViaFTP) is a handy and powerful file manager for OS X, with a tremendous user interface that makes it effortless to use. Quickly access your remote servers to manage and transfer your files. The new user interface was redesigned to be cool, clean and functional. Viper FTP handles WebDav servers, Amazon S3 […]"},{"link":"https://nmac.to/blog/taskpaper/","image":"https://nmac.to/wp-content/uploads/2016/10/TaskPaper.png","title":"TaskPaper 3.8.17 – Plain text to-do lists","content":"TaskPaper is a plain-text to-do list that’s surprisingly adept. Thoroughly modernized. TaskPaper 3 is all new, while still retaining the same plain-text design that’s been getting things done since 2006.   What’s New in 3 All new app More powerful searches Flexible and unique folding interface More powerful text editor and outliner Saved searches; one […]"},{"link":"https://nmac.to/blog/aicopy/","image":"https://nmac.to/wp-content/uploads/2021/08/AICopy.png","title":"AICopy 2.8 – Copywriting & paper detection","content":"AICopy‘s Paraphraser helps you write better, faster, and clearer   With AICopy’s automated creativity tools,you can generate marketing copy in seconds.   1. Features Introduce the original and generate intelligent original text within 2 minutes with one click 100% safe and secure Copy / paste the text, link to identify the imported text, and check […]"},{"link":"https://nmac.to/blog/airtool/","image":"https://nmac.to/wp-content/uploads/2020/11/Airtool.png","title":"Airtool 2.3.6 – Check the state and channel configuration for built-in Wi-Fi","content":"Airtool is a system menu-bar application that provides basic functions to check the state and channel configuration of the built-in Wi-Fi adapter, as well as to perform frame captures on single and multiple channels. It can be used together with Wireshark to let you change channel settings while performing live frame captures. In addition, captures […]"},{"link":"https://nmac.to/blog/app-icon-generator/","image":"https://nmac.to/wp-content/uploads/2020/08/App_Icon_Generator_1.png","title":"App Icon Generator 1.4 – Generate app icons","content":"App Icon Generator allows you to generate your app icons in milliseconds for iOS, watchOS and macOS with just a drag, a drop and a click.   Features Drag your app icon image into the drop zone. Choose the devices that you would like to export for. Click export.   Version 1.4: New UI design. […]"},{"link":"https://nmac.to/blog/phawuo/","image":"https://nmac.to/wp-content/uploads/2022/02/Phawuo.png","title":"Phawuo 3.0.1 – experimental monophonic synth","content":"Phawuo is an experimental monophonic virtual-analog synth with “dirty” oscillators. Good for bass sound and special effects.   The original version was developed for iPad, the current version 3 is now available on both iOS and macOS. Presets can be shared across your devices.   This app can work as standalone or as an AudioUnit […]"},{"link":"https://nmac.to/blog/coming-soon/","image":"https://nmac.to/wp-content/uploads/2018/05/Coming_soon_3.png","title":"Coming Soon 3.14 – Information about future movie releases","content":"Coming soon is a simple OS X app that will enable you to get the latest information on upcoming movie releases on themoviedb.org.   Supported features: Movies calendar Movie details Movie trailers Movie photos Movie releases Crew and casts Search Person details IMDB rating Rotten Tomatoes rating   Version 3.14: bug fixes added poster/backdrops view   macOS […]"},{"link":"https://nmac.to/blog/timecode-pro/","image":"https://nmac.to/wp-content/uploads/2022/02/Timecode_Pro.png","title":"Timecode Pro 3.2.1 – Calculator and Unit Converter","content":"Timecode by Panoptik is the most attractive Timecode calculator on the market (if we do say so ourselves). It is the only professional choice for performing fast, ultra-precise timecode calculations and film unit conversions. Using Timecode, you can calculate and convert any timecode into any other timecode or unit at the touch of a button. […]"},{"link":"https://nmac.to/blog/click-search/","image":"https://nmac.to/wp-content/uploads/2022/02/Click-Search.png","title":"Click Search + 1.1.0 – More than a browser","content":"This is the Mac version of Touch Search +   For this information era Touch Search + is the most convenient tool for most of users   Before “Touch Search +” – Tedious & inefficient Open Web Browser. Type keywords Open another tab for another search engine type keywords again, again and again   With […]"}]