[{"link":"https://nmac.to/blog/beancounter/","image":"https://nmac.to/wp-content/uploads/2014/06/BeanCounter-1.png","title":"BeanCounter 2.1.1 – Book keeping, time tracking, and invoicing for small businesses","content":"BeanCounter is a powerful yet easy-to-use professional bookkeeping, time tracking, and invoicing application. It features double-entry accounting, multiple-currency support, and a simple one-window user interface. Manage accounts, clients, projects, merchants, and bills for an unlimited number of businesses. Stay on top of your business with detailed reports and graphs.   Add new transactions with support […]"},{"link":"https://nmac.to/blog/sneaky-sasquatch/","image":"https://nmac.to/wp-content/uploads/2021/03/Sneaky-Sasquatch.png","title":"Sneaky Sasquatch 1.6.2 – Stealthy shenanigans","content":"Live the life of a Sasquatch and do regular, everyday Sasquatch stuff like: Sneak around campsites Disguise yourself in human clothing Eat food from unguarded coolers and picnic baskets Play a quick 9 holes at the golf course Go fishing at the lake Cook sausages on an engine block Get chased around by the park […]"},{"link":"https://nmac.to/blog/securityspy/","image":"https://nmac.to/wp-content/uploads/2016/07/SecuritySpy4.png","title":"SecuritySpy 5.3.2 – Multi-camera video surveillance app","content":"SecuritySpy is a multi-camera video surveillance app. With features such as motion detection, real-time compression and network video streaming, SecuritySpy has everything required for demanding video surveillance applications. Combined with OS X, the rock-solid operating system from Apple, SecuritySpy offers unsurpassed speed, stability, and ease-of-use.   SecuritySpy’s flexibility and comprehensive list of features allows users […]"},{"link":"https://nmac.to/blog/grid-app/","image":"https://nmac.to/wp-content/uploads/2020/10/Grid.png","title":"Grid 1.4 – Organize windows on your Mac","content":"The fast, easy way to organize windows on your Mac. Grid allows you to snap windows by dragging, keyboard shortcuts, or menu bar.   Version 1.4: Improvements: Cancel gesture when idle for more than 1.5 seconds. New app icon.   Intel, 64-bit processor OS X 10.10 or later    "},{"link":"https://nmac.to/blog/switchresx/","image":"https://nmac.to/wp-content/uploads/2014/09/SwitchResX.png","title":"SwitchResX 4.11.1 – Monitor resolution utility","content":"SwitchResX gives you unparalleled control over your monitor’s resolution.   Resolution Management   Whether you prefer to use the menu bar or nested contextual menus, SwitchResX gives you constant, simplified access to the resolution management options you need.   Controls include: Monitor Resolution Color Depth Video Mirroring Display Rotation Display Overscan   Bountiful Features Save […]"},{"link":"https://nmac.to/blog/agent-intercept/","image":"https://nmac.to/wp-content/uploads/2020/12/Agent-Intercept.png","title":"Agent Intercept 3.0 – Fast cars and spy missions","content":"The global criminal organization CLAW has returned, and we need our best agent back in the field to stop them! Chase the bad guys and race against time to save the world in your slick, souped-up, transforming vehicle. Drive, drift, and duel in missions across exotic locales, deploying high-tech gadgets and avoiding hazards to save […]"},{"link":"https://nmac.to/blog/shing/","image":"https://nmac.to/wp-content/uploads/2020/12/Shing.png","title":"Shing 1.0.09 – Become a ninja and slice some demons in style","content":"Experience the most exciting and immersive beat-em-up combat system ever – become a kickass ninja and slice some demons in style! Join a band of wisecracking warriors in a bloody adventure through the land of mythical monsters and mysterious machines.   FEATURES Play solo or with friends: 4 player local and online co-op (Online co-op […]"},{"link":"https://nmac.to/blog/artboard/","image":"https://nmac.to/wp-content/uploads/2015/08/Artboard2.png","title":"Artboard 2.3 – Simple and direct vector drawing software","content":"Artboard is a full-featured vector drawing application for new and experienced creatives to draw crisp vector graphics, scalable logos, sharp icons, and stunning layered illustrations. Templates help small businesses, students, hobbyist and 2D game designers get started on their projects quickly, such as making business cards, posters, pixel perfect icons, and right-sized social media graphics. […]"},{"link":"https://nmac.to/blog/dsp-quattro/","image":"https://nmac.to/wp-content/uploads/2019/08/DSP-Quattro.png","title":"DSP-Quattro 5.6 – Audio file editing, plug-in hosting and audio-CD mastering","content":"DSP-Quattro is the complete solution for audio file editing, plug-in hosting and audio-CD mastering.   Main features Universal Binary support: DSP-Quattro runs natively on Macs based on Intel processors. Fully programmable PlayList with real time and non-destructive internal and/or plug-in effects and crossfades between tracks. Built-in audio CDROM burning capability that conforms to the Redbook […]"},{"link":"https://nmac.to/blog/chaotica/","image":"https://nmac.to/wp-content/uploads/2015/06/Chaotica2.png","title":"Chaotica 2.2.2 – Next-generation fractal art creation environment","content":"Chaotica is a next-generation fractal art creation environment, designed for both novices and experienced professionals.   Novice users can enjoy editing the included examples and randomly generated fractals to easily produce gorgeous, customised desktop wallpapers, perfect for HD displays.   Professional users can produce stunningly detailed print renders effortlessly thanks to the modern, high-powered rendering […]"}]