[{"link":"https://nmac.to/blog/planner-pro-1-1-1/","image":"https://nmac.to/wp-content/uploads/2017/01/Planner-Pro.png","title":"Planner Pro 1.1.1 – Daily Calendar & Personal Organizer","content":"Designed for those people who’re looking for a full-featured app to manage daily life better. Planner Plus, which costs years for designing and coding is now coming out for everybody. We combine events, tasks and notes in one place so that you do not need to spend extra money for other apps.   Planner Plus […]"},{"link":"https://nmac.to/blog/the-wolf-among-us/","image":"https://nmac.to/wp-content/uploads/2014/03/The-Wolf-Among-Us.png","title":"The Wolf Among Us EP1-5 1.0 – Beautiful comic-noir art style game","content":"From the makers of the 2012 Game of the Year: The Walking Dead comes a gritty, violent and mature thriller based on the award-winning Fables comic books (DC Comics/Vertigo). As Bigby Wolf – THE big bad wolf – you will discover that a brutal, bloody murder is just a taste of things to come in […]"},{"link":"https://nmac.to/blog/torn-tales-1-0/","image":"https://nmac.to/wp-content/uploads/2017/01/Torn-Tales.png","title":"Torn Tales 1.0 – Real time squad based RPG game","content":"Lead your party of 3 heroes on their quest to repair the torn pages of folklore. Evil has destroyed the tales you love. Hack monsters and slash enemies throughout the Torn Tales in this real time squad based RPG.   You will wield the powers of Robin Hood, Snow White and Dr Jekyll & Mr […]"},{"link":"https://nmac.to/blog/siegecraft-commander-1-2/","image":"https://nmac.to/wp-content/uploads/2017/01/Siegecraft-Commander.png","title":"Siegecraft Commander 1.2 – Real-time Turn-Based Strategy Game","content":"Siegecraft Commander offers a real-time strategy (RTS) single-player campaign, while providing both turn-based and RTS options for high-stakes multiplayer matches!   In turn-based matches, plan the location of the towers, units and walls in your fortress to outmaneuver your foes, then tactically think and precisely aim when starting your attack! In real-time, quickly construct a […]"},{"link":"https://nmac.to/blog/ryan-black-1-0/","image":"https://nmac.to/wp-content/uploads/2017/01/Ryan-Black.png","title":"Ryan Black 1.0 – Action & Adventure Shooter Game","content":"You, Ryan Black, a seasoned operator of secret service were summoned to get what looked like an ordinary mission. Investigate, gather information, return. But everything went wrong from the very beginning – strange savage creatures, genetic experiments, ravage, destruction and a faint smell of foul conspiracy. Fight, run, jump and climb making your way through […]"},{"link":"https://nmac.to/blog/review-command-1-51/","image":"https://nmac.to/wp-content/uploads/2017/01/Review-Command.png","title":"Review Command 1.51 – Track app ratings","content":"Review Command is a tool for developers that gathers your ratings & reviews for all of your apps, from all countries, and all major app stores, and displays them in 1 simple feed. Review Command supports the iOS App Store, Mac App Store, Google Play, Amazon App Store and Windows Store.   In addition to […]"},{"link":"https://nmac.to/blog/deputy-dangle-1-0/","image":"https://nmac.to/wp-content/uploads/2017/01/Deputy.Dangle.png","title":"Deputy Dangle 1.0 – Funny Action & Adventure Game","content":"You are Deputy Dangle and today you’re getting deputized. Everything is going great until the elusive criminal, known only as GMA, decides to crash the party. Within minutes of becoming a deputy you’re now hot on the trail of Dangleton’s most infamous criminal. Use your powers of climbing, flopping, grappling, and flailing along with your […]"},{"link":"https://nmac.to/blog/dragon-dictate-6-0-5/","image":"https://nmac.to/wp-content/uploads/2015/11/Dragon.Dictate5.png","title":"Dragon Dictate 6.0.5 – Premium voice recognition solution","content":"With Dragon Dictate speech recognition software, you can use your voice to create and edit text or interact with your favorite Mac applications. Far more than just speech-to-text, Dragon Dictate lets you create and edit documents, manage email, surf the Web, update social networks, and more – quickly, easily and accurately, all by voice. Open […]"},{"link":"https://nmac.to/blog/pinball-hd-2-8/","image":"https://nmac.to/wp-content/uploads/2017/01/Pinball-HD.png","title":"Pinball HD 2.8 – Pinball simulator with 3D graphics and realistic physics","content":"Pinball HD is simply the best Pinball for OS X awaiting you. Each table — Wild West, The Deep, and Jungle Style — is its own masterpiece. You’ll be stunned by the action’s degree of realism. This is a real, professional pinball simulator with stunning 3D graphics and realistic physics.   Features Three tables with […]"},{"link":"https://nmac.to/blog/primitive-1-1/","image":"https://nmac.to/wp-content/uploads/2017/01/Primitive.png","title":"Primitive 1.1 – Recreate your photos with vector-based geometric primitives","content":"A brand new and totally unique way of transforming your photos. Give Primitive a picture and watch as it recreates it using simple shapes like triangles, rectangles, ellipses, or bezier curves. The result is vector-based, so it can be saved as SVG. An intuitive settings panel provides you with creative control.   The program looks […]"}]