[{"link":"https://nmac.to/blog/photo-perspective-pro/","image":"https://nmac.to/wp-content/uploads/2021/12/Photo-Perspective-Pro.png","title":"Photo Perspective Pro 1.6.4 – Photo perspective editor","content":"Photo Perspective Pro is a professional tool designed to automatically and quickly correct perspective distortion.   Photo Perspective Pro straighten and adjust distorted pictures; correct non-rectangular distorted pictures into rectangular images; it can also distort photos or graphics. The Photo Perspective Pro has two alternatives in correcting perspective distortion: the automatic mode and the manual […]"},{"link":"https://nmac.to/blog/disk-analyzer-pro/","image":"https://nmac.to/wp-content/uploads/2016/08/Disk-Analyzer-Pro.png","title":"Disk Analyzer Pro 4.2 – Easy way to free up disk space","content":"Disk Analyzer Pro helps you identify large files and folders, delete obsolete ones, and de-clutter your data to recover precious disk space and keep your storage organized! Disk analysis shows the usage statistics of the storage in terms of file count, size, and percentage of the storage being used by various file types. It gives […]"},{"link":"https://nmac.to/blog/historyinfilm/","image":"https://nmac.to/wp-content/uploads/2020/09/HistoryInFilm.png","title":"HistoryInFilm 1.8.5 – Cataloging your film archive has never been easier","content":"Cataloging your film archive has never been easier, with HistoryInFilm you can mark scene breaks and annotate your films with a clean visual interface. After annotating you can export a fully detailed Finding Aid complete with SMPTE time codes for all of your annotations.   You can create top level catalogs to help group your […]"},{"link":"https://nmac.to/blog/file-juicer/","image":"https://nmac.to/wp-content/uploads/2016/04/File-Juicer4.png","title":"File Juicer 4.96 – Extract images, video, or sound from files and folders","content":"File Juicer is a drag-and-drop can opener and data archaeologist. Its specialty is to find and extract images, video, audio or text from files which are hard to open in other ways.   It finds and extracts: JPEG, JP2, PNG, GIF, PDF, BMP, WMF, EMF, PICT, TIFF, Flash, ZIP, HTML, WAV, AVI, MOV, MP4, MPG, […]"},{"link":"https://nmac.to/blog/caps-lock-tone/","image":"https://nmac.to/wp-content/uploads/2021/12/Caps-Lock-Tone.png","title":"Caps Lock Tone 1.72 – Toggle Key Tone & Display","content":"Get a tone alert and/or pop-up interface whenever you turn Caps Lock On and Off. And the sound file can be customized…   If you often accidentally strike the Caps Lock key, you need this app; If you’re nostalgic for the Toggle Keys Tone in other systems, this app brings it back.   Version 1.72: […]"},{"link":"https://nmac.to/blog/videoproc-vlogger/","image":"https://nmac.to/wp-content/uploads/2021/12/VideoProc-Vlogger.png","title":"VideoProc Vlogger 1.2 – Video editing software","content":"VideoProc Vlogger is intuitive and capable video editing software for all creators. Make cinematic videos for everyday creativity, special moments, or fun.   Visualized Speed Ramping – Control Speed Like a Pro Change video speed constantly or variably, and liven up your videos with speed ramping. Alter the tone and tempo of your GoPro/DJI footage. […]"},{"link":"https://nmac.to/blog/noise-machine/","image":"https://nmac.to/wp-content/uploads/2015/09/Noise-Machine1.png","title":"Noise Machine 1.18 – White noise and soundscape generator [FIX]","content":"Noise Machine is a white noise and soundscape generator designed to help you block out workplace noise and create a more productive work environment to suit your mood.   It can be very hard and tiring to try to concentrate in a noisy work environment. The chatter of co-workers can be especially hard to block […]"},{"link":"https://nmac.to/blog/super-photo-ups/","image":"https://nmac.to/wp-content/uploads/2021/12/Super-Photo-Upscaler.png","title":"Super Photo Upscaler 2.0.0 – Enlarge photos with smooth and crisp edges.","content":"Powered by AI image upscaling technology, Super Photo Upscaler is an image enhancer which intelligently enlarges photos from low-resolution to high-resolution while maintaining clean edges without losing quality.   The newest version of Super Photo Upscaler incorporates the Waifu2x “Deep Convolutional Neural Networks” that specializes in extremely increasing resolution of Manga and Anime images to […]"},{"link":"https://nmac.to/blog/musicmath/","image":"https://nmac.to/wp-content/uploads/2021/06/musicMath.png","title":"musicMath 5.5 – Music Calculator","content":"musicMath is a musical tool that includes a timecode calculator, a tap tempo, a tempo to delay in millisecond and hertz converter, a note to frequency table converter, a sample length converter, a tempo change converter, and a frequency to note converter.   Timecode calculator: Add and subtract timecodes or frames Convert a number of […]"},{"link":"https://nmac.to/blog/scroll/","image":"https://nmac.to/wp-content/uploads/2021/12/Scroll.png","title":"Scroll 2.3 – Limit Magic Mouse Scroll","content":"Fix overly sensitive scrolling on certain apps with the Magic Mouse, or scroll with just one trackpad touch.   Limit Magic Mouse Scroll. Scroll with one trackpad touch.   Supports Magic Mouse 1 & 2 and any Apple trackpad   Version 2.3: Release notes were unavailable when this listing was updated.   Intel, 64-bit processor […]"}]