[{"link":"https://nmac.to/blog/jihosoft-pdf-password-remover/","image":"https://nmac.to/wp-content/uploads/2018/01/Jihosoft-PDF-Password-Remover.png","title":"Jihosoft PDF Password Remover 1.2 – Remove Password and Restrictions form PDF Files","content":"Jihosoft PDF Password Remover for Mac instantly removes password and restrictions from PDF on Mac, helps you gain full access to protected PDF files. Remove Password and Restrictions from PDF on Mac in seconds Batch decryption mode lets you process multiple PDF files at a time Standalone, no need to install Adobe Reader or Adobe […]"},{"link":"https://nmac.to/blog/ipnetmonitorx/","image":"https://nmac.to/wp-content/uploads/2015/11/IPNetMonitorX2.png","title":"IPNetMonitorX 2.7.2 – Tools help monitor your Internet connection","content":"IPNetMonitorX is a powerful Internet/network troubleshooting toolkit for debugging Internet service problems and optimizing performance. Featuring 24 integrated tools, IPNetMonitorX is designed to help you quickly locate where the problem is and gather data which can be used to solve the problem either directly or through your Internet service provider.   IPNetMonitorX combines an intuitive […]"},{"link":"https://nmac.to/blog/stripes/","image":"https://nmac.to/wp-content/uploads/2016/10/Stripes.png","title":"Stripes 1.7 – Minimalistic RSS reader","content":"Stripes is a minimalistic RSS reader created to help you enjoy your daily news.   Read, share, star and search your favorite feeds by using clean and intuitive interface.   Supports formats: RSS RDF Atom   Version 1.7: Bug fix   OS X 10.11 or later, 64-bit processor    "},{"link":"https://nmac.to/blog/placeholder-wizard/","image":"https://nmac.to/wp-content/uploads/2018/01/Placeholder-Wizard.png","title":"Placeholder Wizard 1.2 – Create Web banner placeholders","content":"Placeholder Wizard is a placeholder/banner creator for your Mac! It’s super-easy to use and has an intuitive interface. Just set the details (dimensions, colors) and caption, and generate the resulting PNG file with a single click — no muss no fuss!   Are you a designer? Are you developing a website and want to attract […]"},{"link":"https://nmac.to/blog/notelife/","image":"https://nmac.to/wp-content/uploads/2017/10/Notelife.png","title":"Notelife 1.0.6 – Premium note manager","content":"Notelife is a premium note manager designed for everyday users. No special formatting syntax required. Notes will sync to an iOS companion app via iCloud.   Features Add notes from a menu bar item Organize notes with tags Attach any file to your notes Geotag your location automatically with each new note   Notelife is […]"},{"link":"https://nmac.to/blog/photodesk/","image":"https://nmac.to/wp-content/uploads/2016/08/PhotoDesk5.png","title":"PhotoDesk 5.0.638 – Instagram client for photo sharing","content":"PhotoDesk lets you view, like, comment, and download Instagram pictures/videos. (NO Uploads! / Image Posting! Instagram forbids that! AND you need an existing Instagram account). But you can do so much more.   Of all Mac clients, Photodesk allows you to use the most features of Instagram on your Mac and even exceeds Instagram’s functionality: […]"},{"link":"https://nmac.to/blog/diagrammix/","image":"https://nmac.to/wp-content/uploads/2016/08/Diagrammix2.png","title":"Diagrammix 2.16 – Create diagrams for presentations and projects","content":"Diagrammix is a tool for building better-looking diagrams with minimal effort.   If you are office worker, developer, manager, supervisor, student or home user you can draw just about anything in an easy and intuitive way.   You’ll be able to focus on what really matters. Diagrammix automatically connects elements, autosizes elements when entering text, […]"},{"link":"https://nmac.to/blog/logo-lab-for-iwork/","image":"https://nmac.to/wp-content/uploads/2017/06/Logo.Lab_.for_.iWork_.png","title":"Logo Lab for iWork 1.3 – Templates Bundle","content":"Be recognized! Jumsoft’s Logo Lab for iWork offers an unmatched treasure chest of customizable logo templates, editable on Apple Pages or Keynote. With the ample collection of designs and a huge variety of styles, you will feel like having a creative agency fully at your service, just without the bill! With thousands of available professional […]"},{"link":"https://nmac.to/blog/musicextractor/","image":"https://nmac.to/wp-content/uploads/2018/01/MusicExtractor.png","title":"MusicExtractor 1.0 – Extract the audio track from common video formats","content":"With MusicExtractor you can extract the audio track from common video formats with a single click, and save it as an MP3 file.   The tool uses a straightforward single click operation for high audio quality, without having to navigate burdensome menus. Simply load a video, press the button, and save the audio track as […]"},{"link":"https://nmac.to/blog/camerabag-cinema/","image":"https://nmac.to/wp-content/uploads/2017/05/CameraBag-Cinema.png","title":"CameraBag Cinema 3.0.210 – Video filtering, color correction, and film emulation","content":"CameraBag Cinema offers video filtering, color correction, and film emulation, all in a stand-alone package (which can be used alongside Final Cut, Premier, or any other NLE). It’s built around the core principles and technology of CameraBag Photo, which was chosen by Apple as Mac App Of The Year runner-up.   Professional Video And Image […]"}]