[{"link":"https://nmac.to/blog/xplan-3-5-9/","image":"https://nmac.to/wp-content/uploads/2014/01/xPlan.png","title":"xPlan 3.5.9 – Track your projects","content":"With xPlan, creating, tracking, and managing your projects is easier than ever! xPlan is designed to keep track of tasks, milestones, and calculate a project’s cost.   If you’re not a professional project manager, you probably want something that’s easy to learn and inexpensive, but it’s got to pump out a professional project-management plan too. […]"},{"link":"https://nmac.to/blog/connect-1-2-1/","image":"https://nmac.to/wp-content/uploads/2014/01/Connect.png","title":"Connect 1.2.1 – Phone calls using Bluetooth connection","content":"Connect lets you connect with your friends by allowing you to place phone calls and receive phone calls from your Mac using a Bluetooth connection to your phone. You may also press the keys 0-9 * # during a call, to use the dialer.   Version 1.2.1: Minor bug fixes   OS X 10.9 or […]"},{"link":"https://nmac.to/blog/pear-note-3-1-2/","image":"https://nmac.to/wp-content/uploads/2014/01/Pear-Note.png","title":"Pear Note 3.1.2 – Integrates audio, video, and slides with traditional text notes","content":"Pear Note integrates audio, video, and slides with traditional text notes. By recording all activity, Pear Note keeps track of what’s going on while taking notes as well as what the user has to say about it. This makes Pear Note incredibly useful for important meetings, class settings, or speeches.   Recording Notes Pear Note […]"},{"link":"https://nmac.to/blog/great-photo-pro-3-1-0/","image":"https://nmac.to/wp-content/uploads/2014/01/Great-Photo-Pro.png","title":"Great Photo Pro 3.1.0 – All-in-one photo editing","content":"Great Photo Pro is an exceptional all-in-one Photo Editing app.    Highlights Perfectly produce amazing photos with the one tool that gives you all you need! Class-leading tools, from the brilliant Editing and FX Effects, photo-realistic HDR, DSLR Depth-of-field Effect, Automatic Image Enhancement, Color Splash, Collage, comprehensive image editing tools, rotate, corp, paris comparison etc […]"},{"link":"https://nmac.to/blog/violett/","image":"https://nmac.to/wp-content/uploads/2014/01/Violett.png","title":"Violett 1.0 – Remarkable adventure game with world full of wonders","content":"Set in a world full of wonders, quirks and things from beyond our reality, Violett is a remarkable adventure game that will push your brain to the limits and engross you completely.   Dragged by her parents, a young and rebellious teenage girl – Violett, moves to an old spooky house in the middle of […]"},{"link":"https://nmac.to/blog/phoneview-2-9-8/","image":"https://nmac.to/wp-content/uploads/2013/12/25347.png","title":"PhoneView 2.9.8 – Use your iPhone for file storage, data syncing, and much more","content":"PhoneView is the Mac companion for iPhone, iPad and iPod Touch. Access voicemail, SMS/MMS, call history, photos, App Store app data, notes, file storage, iTunes media, voice memos and contacts with one click. PhoneView also automatically archives your messages, call history and voicemails, so you can access them even when your iPhone is not available. […]"},{"link":"https://nmac.to/blog/mr-unrar-1-0/","image":"https://nmac.to/wp-content/uploads/2014/01/Mr.unRAR_.png","title":"Mr.unRAR 1.0 – Extracts files contained in RAR archives","content":"Mr. unRAR is a program which extracts the files contained in RAR archives. It supports both single and multi- part archives, and has support for password-protected archives as well. It uses the official unRAR library internally so it is fully compatible with archives produced by WinRAR.   Features: Drag and drop rar files to the […]"},{"link":"https://nmac.to/blog/night-sky-1-3/","image":"https://nmac.to/wp-content/uploads/2014/01/The.Night_.Sky_.png","title":"The Night Sky 1.3 – Identify stars, planets, galaxies and satellites","content":"The Night Sky is a magical app that enables you to identify stars, planets, galaxies, constellations and even satellites. This Mac version of The Night Sky enables you to view the stars, planets, galaxies, constellations and satellites from any location in the world no matter where you are located yourself!   Here’s an example – […]"},{"link":"https://nmac.to/blog/wondershare-video-editor-2-8-0/","image":"https://nmac.to/wp-content/uploads/2014/01/Wondershare-Video-Editor.png","title":"Wondershare Video Editor 2.8.0 – Video and photo editing","content":"Wondershare video Editor for Mac is an easy-to-use yet powerful Mac video editing software to edit and retouch videos with rich video and photo editing functions like trimming, cropping, rotating, adding stylish titles, applying filter effects, inserting transition and motion effects, etc. Furthermore, you can export videos to various popular video formats and portable devices […]"},{"link":"https://nmac.to/blog/guitar-jam-tracks-1-1/","image":"https://nmac.to/wp-content/uploads/2014/01/Guitar-Jam-Tracks.png","title":"Guitar Jam Tracks 1.1 – Scale Trainer & Practice Buddy","content":"Welcome! Join our growing family of 300,000 users worldwide! This award-winning app includes five essential styles for mastering your guitar: Rock, Acoustic Blues, Humbucker Blues, Jazz, Reggae.   MAKES LEARNING GUITAR FUN Practice jamming, learning the Pentatonic scale and soloing to 5 great sounding jam tracks right from your Mac! Our easy-to-read scale charts show […]"}]