[{"link":"https://nmac.to/blog/episode-7-1-0-7423/","image":"https://nmac.to/wp-content/uploads/2014/02/Episode.png","title":"Episode 7.1.0.7423 – Professional media encoding application","content":"Episode is a powerful cross-platform desktop media encoding application for Mac and Windows. It offers the highest quality and fastest desktop encoding for content repurposing for distribution to Web, DVD, mobile phones and portable devices. Includes: extensive format support in/out including superior quality Flash 8/9 encoding, presets and filters, watch folders, batch processing of 25 […]"},{"link":"https://nmac.to/blog/thumbtack-2-3/","image":"https://nmac.to/wp-content/uploads/2015/08/Thumbtack2.png","title":"Thumbtack 2.3 – Easy access to your Pinboard bookmarks","content":"Thumbtack is a menu-bar utility that provides quick and easy access to the most recently saved bookmarks in your Pinboard account. It was developed around one core feature, allowing it be polished, reliable, and extremely efficient.   You don’t have to be a Pinboard power-user to enjoy the benefits of having a Pinboard account. The […]"},{"link":"https://nmac.to/blog/the-detail/","image":"https://nmac.to/wp-content/uploads/2016/05/The-Detail.png","title":"The Detail 1.0 – A crime noir adventure in a modern American city","content":"Controlling the actions of a bitter veteran detective investigating a brutal gangland murder and a reformed criminal trying to protect his family, the player is forced to make tough choices and deal with the resulting consequences of those moral dilemmas. The gameplay focuses on branching narrative mixed with interactive comics, and is completed by a […]"},{"link":"https://nmac.to/blog/merlin-project-3-1-4/","image":"https://nmac.to/wp-content/uploads/2015/06/Merlin.Project.png","title":"Merlin Project 3.1.4 – Project management software (was Merlin)","content":"Merlin Project is for those of you who are responsible for complex projects. Simple lists of tasks won’t suffice.   Good planning raises questions about the dependencies of activities on each other, the impact of delays on the project completion date, and budget planning. Here, a spreadsheet quickly runs up against its limitations.   These […]"},{"link":"https://nmac.to/blog/otomatic-1-0-7/","image":"https://nmac.to/wp-content/uploads/2016/05/Otomatic.png","title":"Otomatic 1.0.7 – The easiest way to get the content you care about","content":"Otomatic aims to help you keep tabs on media content with ease, and download video files both from private and public sources. The app comes with a built-in TV shows collection to which you can subscribe, or you can add new RSSs and set private download sources.   Monitor RSS feeds and get the associated […]"},{"link":"https://nmac.to/blog/emulsion-1-3-6/","image":"https://nmac.to/wp-content/uploads/2015/06/Emulsion.png","title":"Emulsion 1.3.6 – Photo library catalog","content":"Emulsion is a new photo catalog app. Emulsion can adjust exposure, colors, and almost everything else. You can also add gradients to your images to darken skies, or even add dust and scratches for a cool retro look. Emulsion can apply adjustments, effects, and metadata changes to one or hundreds of images at once. Want […]"},{"link":"https://nmac.to/blog/music-tag-pro-3-1-3/","image":"https://nmac.to/wp-content/uploads/2016/05/Music-Tag-Pro.png","title":"Music Tag Pro 3.1.3 – Batch ID3 Edit","content":"Music Tag Pro is a professional application to help you organize your music collection.   With the app you can easily edit information such as a song’s artist, title, album, cover, year, track, disc number, composer, grouping, genre, bpm, rating, comments and lyrics .   Batch edit your music tag, you can apply your editing […]"},{"link":"https://nmac.to/blog/family-tree-maker-3-22-2-5/","image":"https://nmac.to/wp-content/uploads/2016/05/Family.Tree_.Maker_.png","title":"Family Tree Maker 3 22.2.5 – Family history software","content":"Family Tree Maker 3 … For more than 20 years, Family Tree Maker has been the #1-selling family history software. Millions of people have used it to discover, preserve and share their family stories. Now Mac users can too. Family Tree Maker for Mac, makes organizing, researching and sharing your family history easier than ever, […]"},{"link":"https://nmac.to/blog/recordings-pro-7-0/","image":"https://nmac.to/wp-content/uploads/2016/05/Recordings.png","title":"Recordings Pro 7.0 – The easiest recording app ever!","content":"Recordings Pro is the easiest recording app ever! The same choice from millions of users.   FEATURES: Record with a Selected Audio or Video Record with Now Playing Record at Scheduled Time Record Only When Speaking Increase Volume for Recording Make a Ringtone Save to Album Trim & Mix & Merge & Encrypt   Version 7.0: […]"},{"link":"https://nmac.to/blog/uploader-hd-1-0-0/","image":"https://nmac.to/wp-content/uploads/2016/05/Uploader.HD_.png","title":"Uploader HD+ 1.0.0 for Instagram – Post pictures to Instagram","content":"From the makers of the original Uploader for Instagram featured on CNN, TheNextWeb, CNET, ArsTechnica, iDownloadBlog, ProductHunt, and SlashGear!   Finally, upload pictures to Instagram in FULL-RESOLUTION and FULL-SIZE* directly from your Mac!   To share pictures, simply right click them, go to “Share” from the dropdown menu, and select “Uploader HD+”. It’s that simple! […]"}]