[{"link":"https://nmac.to/blog/nzb-drop-2-43/","image":"https://nmac.to/wp-content/uploads/2013/12/NZBDrop.175x175-75.jpg","title":"NZB Drop v2.43 – Usenet downloading utility","content":"NZB Drop is a sophisticated Usenet downloading utility, specifically designed to work with .nzb files, a new file format used to identify binaries posted to Usenet newsgroups. Used in conjunction with a growing number of Usenet search engines, NZB Drop allows you to download the content you want directly, without having to wade through thousands […]"},{"link":"https://nmac.to/blog/play-by-play-1-3-1/","image":"https://nmac.to/wp-content/uploads/2013/12/icon.175x175-7546.jpg","title":"Play by Play v1.3.1 – Follow the best designers in the world at Dribble.com","content":"Play by Play is your courtside announcer for the popular design community dribbble.com. The app gives you a play-by-play of all the action with customizable notifications. Browse shots by players you follow, popular shots, shots from everyone, debuts, and your activity stream. Play by Play works for Players, Spectators, Prospects, and even if you don’t […]"},{"link":"https://nmac.to/blog/hibari-1-5-7/","image":"https://nmac.to/wp-content/uploads/2013/12/hibari.175x175-75.jpg","title":"Hibari v1.5.7 – Powerful Twitter client with tweet filtering and user muting","content":"Hibari is a powerful Mac Twitter app that blocks annoyances and reveals gems.   Block Keywords: Hibari blocks tweets you don’t want to see based on keywords you choose. You can also block all retweets. Mute Users: No more stressing about whether to follow someone-in Hibari, you can temporarily mute any user if their tweets […]"},{"link":"https://nmac.to/blog/filechute-4-5-5/","image":"https://nmac.to/wp-content/uploads/2013/12/116321.jpg","title":"FileChute v4.5.5 – Quick Internet file transfer tool","content":"FileChute offers an easier way to send large files. How many times have you tried to email a large file only to have it bounce? FileChute makes sending files easy. Just drag a file and drop it on FileChute. FileChute puts the file on your Dropbox or website and generates a Web link for retrieving the […]"},{"link":"https://nmac.to/blog/live-wallpaper-2-5/","image":"https://nmac.to/wp-content/uploads/2013/03/Live-Wallpaper.png","title":"Live Wallpaper 2.5 – Wallpapers with live clock and weather forecasts","content":"Live Wallpaper is a beautiful wallpaper application with live clock and weather forecast. It provides a variety of themes which has different layouts and unique styles. Currently, we have 12 themes and we are adding themes continuously (All themes are free). Each theme has the unique layout, clock, text, and weather forecast.   The application provides […]"},{"link":"https://nmac.to/blog/livequartz-2-0-3/","image":"https://nmac.to/wp-content/uploads/2013/12/LQ.175x175-751.jpg","title":"LiveQuartz 2.0.3 – Simple image editor","content":"LiveQuartz is simple and powerful photo editor for the Mac. It is based on non-destructive layers and Filters. The layers are at the left and the Filters are at the right of the window.   To edit a photo, just drag it into the window (or layers’ list) and it will be added as a new […]"},{"link":"https://nmac.to/blog/screentaker-1-2-4/","image":"https://nmac.to/wp-content/uploads/2013/12/Icon.175x175-7514.jpg","title":"Screentaker v1.2.4 – Snap iOS screenshots","content":"Screentaker is a small utility that makes creating nice screenshots for iOS apps easier by letting you apply effects to them. Simply drop the screenshot on Screentaker or even capture a screenshot from the iOS Simulator and choose the desired device, orientation and effect. The app is smart enough to detect the device and orientation automatically. […]"},{"link":"https://nmac.to/blog/wikibot-1-63/","image":"https://nmac.to/wp-content/uploads/2013/03/Wikibot.png","title":"Wikibot 1.63 – Wikipedia articles reader","content":"Wikibot makes reading Wikipedia articles a joy on your Mac. Between the beautifully crafted interface, customizable display options, and killer features like tabbed browsing, language switching, a read-later queue and offline caching, there is a lot to love about Wikibot!   Features: Browse Wikipedia articles in 36 languages! Tabbed browsing allows you to have multiple […]"},{"link":"https://nmac.to/blog/menuweather-4-2-5/","image":"https://nmac.to/wp-content/uploads/2013/12/MenuWeather.175x175-75.jpg","title":"MenuWeather v4.2.5 – Find out the weather at your current location","content":"MenuWeather is a simple, yet powerful, menu bar weather client.   – Super-accurate weather data from CustomWeather.com – Automatically determines your location – Quick access to any number of days or hours of weather right in your menu bar – 15 day forecast – 2 day hourly forecast – Radar maps – Severe weather alerts […]"},{"link":"https://nmac.to/blog/mailtab-pro-for-gmail-5-6/","image":"https://nmac.to/wp-content/uploads/2013/12/APPL-PRO.175x175-753.jpg","title":"MailTab Pro for Gmail v5.6 – Access Gmail from the menu bar","content":"MailTab Pro for Gmail is an incredibly slick and gorgeous app for quickly accessing your Gmail account directly from your Mac’s menu bar.   Why is MailTab Pro the best Mac app for your Gmail needs? Good question, allow us to explain just how fully loaded this app is:   – Instant access to Gmail […]"}]