[{"link":"https://nmac.to/blog/hear-1-1-6/","image":"https://nmac.to/wp-content/uploads/2014/05/Hear.png","title":"Hear 1.1.6 – Improves audio quality and adds audio options system-wide","content":"Hear greatly improves audio quality in movies and music throughout all of your Mac OS X applications. With Hear, music is richer, movie sound and dialog is clearer and games will blow you out of your chair!   3D Sound – Like movies? like’em more with virtual cinema quality sound experience. Sound will approach you […]"},{"link":"https://nmac.to/blog/msecure-3-5-3/","image":"https://nmac.to/wp-content/uploads/2014/05/mSecure.png","title":"mSecure 3.5.3 – Safely store sensitive information","content":"mSecure safely stores sensitive and important information like web logins and passwords, credit card numbers, frequent flyer and social security numbers, and any other data you want quick, easy access. mSecure uses an industry-proven data encryption method so your information is safe guarded should your computer be lost or stolen.   mSecure comes with 17 […]"},{"link":"https://nmac.to/blog/due-1-2-6/","image":"https://nmac.to/wp-content/uploads/2014/05/Due.png","title":"Due 1.2.6 – Set reminders in your own words","content":"Due lets you type “Make dinner reservation at 9am tomorrow” and your reminder is set for 9 AM tomorrow.    “Cancel subscription in 1 month” and you get a buzz a month later.   Just tell Due in your own words what you’d like to do, and when you’d like to be reminded.   There […]"},{"link":"https://nmac.to/blog/dropbook-2-3/","image":"https://nmac.to/wp-content/uploads/2014/05/DropBook.png","title":"DropBook 2.3 – Drag-and-drop items to post them to your Facebook feed","content":"DropBook is all about posting things to your Facebook profile. Just drag images, links, or text onto the Facebook icon on your desktop.   You can also post a status-update message simply by double-clicking on the “f” logo on your desktop. A form window will pop up allowing you to enter and post your message. […]"},{"link":"https://nmac.to/blog/clear-1-1-1/","image":"https://nmac.to/wp-content/uploads/2014/05/Clear.png","title":"Clear 1.1.1 – Popular to-do list manager","content":"Clear is the revolutionary to-do and reminders app that makes you more productive. Just start typing to add to-dos, and once you start organizing your life with Clear you’ll wonder how you ever managed without it.   Simple gestural design that allows you to focus on your to-dos. Designed for the Magic Trackpad, but works […]"},{"link":"https://nmac.to/blog/outlinely-1-0-4/","image":"https://nmac.to/wp-content/uploads/2014/05/Outlinely.png","title":"Outlinely 1.0.4 – An outliner in the form of a text editor","content":"Outlinely is an outliner in the form of a text editor. It’s a tool that helps you organize your plans, take notes, write a blog post, or keep a journal with ease and delight.   Features: Create lists inside lists. Easy to organize the outline. Expand to reveal detail, collapse to hide detail. Add notes […]"},{"link":"https://nmac.to/blog/livequartz-2-3/","image":"https://nmac.to/wp-content/uploads/2014/05/lq.png","title":"LiveQuartz 2.3 – Simple image editor","content":"LiveQuartz is a simple and powerful photo editor for the Mac. It is based on non-destructive layers and filters. The layers are at the left and the filters are at the right of the window.   To edit a photo, just drag it into the window (or layers list) and it will be added as […]"},{"link":"https://nmac.to/blog/macaw-1-0-7/","image":"https://nmac.to/wp-content/uploads/2014/04/Macaw1.png","title":"Macaw 1.0.7 – The code-savvy web design tool","content":"Stop writing code. Start drawing it.   Macaw provides the same flexibility as your favorite image editor but also writes semantic HTML and remarkably succinct CSS. It’s time to expect more from a web design tool.   Fluid canvas and grid Macaw is engineered for fluid widths. Resize the canvas and your grids and elements […]"},{"link":"https://nmac.to/blog/the-walking-dead/","image":"https://nmac.to/wp-content/uploads/2014/04/The.Walking.Dead_.png","title":"The Walking Dead Episode 5 1.0.22 – Five-part game series based on the award-winning comics","content":"The Walking Dead is a five-part game series set in the same universe as Robert Kirkman’s award-winning comic book series. Play as Lee Everett, a convicted criminal, who has been given a second chance at life in a world devastated by the undead. With corpses returning to life and survivors stopping at nothing to maintain […]"},{"link":"https://nmac.to/blog/shiny-groove-1-0-5/","image":"https://nmac.to/wp-content/uploads/2014/04/Shiny.Groove.png","title":"Shiny Groove 1.0.5 – Client for the popular Grooveshark music service","content":"Shiny Groove provide the best online music experience: you can browse Grooveshark’s infinite music library, save and share playlists, discover new songs; everything on the cloud.   GROOVESHARK WITHOUT A BROWSER You can finally gain full control on your music without bury it under a stack of tabs.   GORGEOUS MINIPLAYER Flip on song change, […]"}]