[{"link":"https://nmac.to/blog/rapidweaver/","image":"https://nmac.to/wp-content/uploads/2021/06/RapidWeaver_9.png","title":"RapidWeaver 9.0.21040b – Create template-based websites rapidly","content":"RapidWeaver is a next-generation Web design application to help you easily create professional-looking Web sites in minutes. No knowledge of complex code is required, RapidWeaver will take care of all that for you. RapidWeaver produces valid XHTML & CSS based websites.   One of the perks about using RapidWeaver is that it has a strong […]"},{"link":"https://nmac.to/blog/join-any-audio/","image":"https://nmac.to/wp-content/uploads/2021/06/Join-Any-Audio.png","title":"Join Any Audio 2.1 – Any size, type, format or .ext","content":"Just Drag & Drop any number of Audio files. Click Join. That’s it!   Want to join multiple audio files one after the other to a single mp3?   Just 2 Steps. Add any number of audio files & Click Join as MP3. That’s it!   Steps : Add any number of audio files. Change […]"},{"link":"https://nmac.to/blog/tweetshot/","image":"https://nmac.to/wp-content/uploads/2021/04/TweetShot.png","title":"TweetShot 4.9.1 – Tweet at ultra speed","content":"This app makes it possible to Tweet at ultra speed with a shortcut. You can set your favorite keyboard shortcut and start up in a moment. You can post Tweet by pressing command + return. You can close the Tweet Window by pressing the escape key. You can attach a total of 4 images (PNG […]"},{"link":"https://nmac.to/blog/pdfpen/","image":"https://nmac.to/wp-content/uploads/2019/10/PDFpen_13.png","title":"PDFpen 13.1 – Edit and annotate PDFs with ease","content":"PDFpen allows users to easily edit PDF’s. Add text, images and signatures. Fill out PDF forms. Merge or split PDF documents. Reorder and delete pages. Even correct text and edit graphics!   Features Add text, images and signatures to PDF Correct text in original PDF with editable text blocks Fill out interactive PDF forms and […]"},{"link":"https://nmac.to/blog/klokki/","image":"https://nmac.to/wp-content/uploads/2019/08/Klokki.png","title":"Klokki 1.3.4 – A rule-based time-tracking app","content":"Klokki is a rule-based time-tracking that will start/pause the timer for you automatically. The automation is based on the rules you configure and that gives you full control over what should be tracked and what not.   Features: Auto-Tracking: The Auto-Tracking technology automatically tracks the time for you, based on what you tell it to […]"},{"link":"https://nmac.to/blog/diallist/","image":"https://nmac.to/wp-content/uploads/2021/01/Dial_List.png","title":"Dial!List 1.9.3 – Call manager for Fritz!Box","content":"Dial!List (was Dial!Fritz) is a call manager for use with the Fritz!Box Fon of AVM. Incoming calls are displayed on your Mac with caller details from Address Book/Contacts — if these are missing, it tries to get the name by reverse-lookup.   With Dial!Fritz you also have the ability to display the call list from […]"},{"link":"https://nmac.to/blog/websonar-pro/","image":"https://nmac.to/wp-content/uploads/2021/06/WebSonar-Pro.png","title":"WebSonar Pro 3.3 – Archive Share & Collaborate","content":"Use with CREATEit to provide a web based Distance Learning Instruction Platform that is not tracked.   WebSonar is based on Virginia Systems’ Sonar Professional search engine that was originally developed in 1988. WebSonar combines this search engine with a standard web server to provide a flexible and scaleable, browser based document management solution.   […]"},{"link":"https://nmac.to/blog/system-eye/","image":"https://nmac.to/wp-content/uploads/2021/05/system-eye.png","title":"system-eye 1.3.36 – Frequency Response Analyser","content":"Real-time sound system tuning, optimisation and diagnostics tool for your Mac. Performs Dual FFT Frequency Response measurement using your audio interface as input.   System-eye is a dual – channel FFT audio analyser. It allows You to measure the Transfer Function of the sound system under test by comparison of reference signal and signal produced […]"},{"link":"https://nmac.to/blog/rss-menu/","image":"https://nmac.to/wp-content/uploads/2020/01/RSS_Menu_3.png","title":"RSS Menu 3.2.1 – System-wide, menu-accessible RSS/Atom reader","content":"RSS Menu is a systemwide menu that allows you to read and organize your favourite RSS or Atom feeds.   The articles are automatically updated and you will get a notification when new articles are available or when some other event occurs. In addition to visual notification, you can also enable speech notification and choose […]"},{"link":"https://nmac.to/blog/product-manager/","image":"https://nmac.to/wp-content/uploads/2021/04/Product_Manager_2.png","title":"Product Manager ‪2.6 – Manage, market your company products","content":"Product Manager lets you manage company products from different standpoints. It’s document-based and can manage an unlimited number of documents each with an unlimited number of products, subdivided in families.   Product Manager allows you to: Organize products in a logical subdivision in families of products and products owned by a family Define a custom […]"}]