[{"link":"https://nmac.to/blog/dupezap/","image":"https://nmac.to/wp-content/uploads/2017/03/DupeZap4.png","title":"DupeZap 4.1.4 – Find duplicate files for syncing and deleting [FIX]","content":"DupeZap (was DupeZap Plus) is a modern duplicate finder with a stylish interface, is easy to use, and is powerful. It is extremely fast, and scans your computer accurately.   Features Search for any file: Scan for Photos and iTunes duplicate files Find any duplicate file type (PDFs, images, movies, etc…) Search for duplicate folders […]"},{"link":"https://nmac.to/blog/aerate-pro/","image":"https://nmac.to/wp-content/uploads/2019/12/Aerate.png","title":"Aerate Pro 2.0.1 – Effortlessly compress your images without loss of quality [FIX]","content":"Effortlessly compress your images without loss of quality. Aerate offers an industry leading default mode, as well as new fast and extreme presets. Switch between modes quickly using the new compression slider.   Aerate also includes a first of its kind multi-core mode, that allows you to take full advantage of your CPU and compress images simultaneously. Exclusively available […]"},{"link":"https://nmac.to/blog/note-studio/","image":"https://nmac.to/wp-content/uploads/2021/12/Note_Studio_2.png","title":"Note Studio 2.2 – Create audio and video notes","content":"Note Studio allows you to stop focusing on note taking, and start focusing on learning. By keeping your notes synced with the source material, Note Studio allows you to take much briefer notes without fear of missing information. This lets you focus on absorbing the content rather than putting all your effort into writing it […]"},{"link":"https://nmac.to/blog/website-watchman/","image":"https://nmac.to/wp-content/uploads/2020/01/Website-Watchman.png","title":"Website Watchman 3.1.1 – Monitor, archive, go back in time","content":"Website Watchman is an easy to use website archival utility.   Note: this app’s name has had to be changed slightly because of a pre-existing project called Watchman. Existing licence holders shouldn’t be affected.   Features: Monitor a whole website, part of a website or a single page Set up configs for multiple sites / […]"},{"link":"https://nmac.to/blog/disk-xray/","image":"https://nmac.to/wp-content/uploads/2017/06/Disk-Xray2.png","title":"Disk Xray 2.8.1 – Disk optimiser and duplicates detector","content":"Disk Xray is a disk-usage statistics viewer, duplicate files and folders finder and cleanup tool for OS X. It performs three fundamental functions, and it performs them extremely well. It also provides you maximum security, restoring all files if you removed something accidentally.   Features Folder Scanner – Folder scanner is a visual disk/folder analyser […]"},{"link":"https://nmac.to/blog/dj-mix-pads-2-remix-version/","image":"https://nmac.to/wp-content/uploads/2021/01/DJ-Mix-Pads-2.png","title":"DJ Mix Pads 2 Remix Version 15.5.7 – Virtual Mix Machine","content":"DJ Mix Pads 2 Remix Version is a unique music making board that includes everything you need to create beats.   CREATE TRACKS WITHOUT SPECIAL SKILLS Sound board with various beats Professional sound effects MIC recording for custom sounds ALL ESSENTIAL MUSIC GENRES Dubstep EDM Future Bass and more. THAT MUST BE INTERESTING Upload and […]"},{"link":"https://nmac.to/blog/pasta/","image":"https://nmac.to/wp-content/uploads/2019/01/Pasta.png","title":"Pasta 1.3.9 – Clipboard manager","content":"Pasta is a beautiful and flexible clipboard manager for the mac. It saves everything you copy to your clipboard so you can reuse it later.   Features: Pasta’s flexible grid interface helps you to better see your clipboard history so you can quickly find what you’re looking for. Bring up Pasta with a keyboard shortcut […]"},{"link":"https://nmac.to/blog/loopback/","image":"https://nmac.to/wp-content/uploads/2016/01/Loopback.png","title":"Loopback 2.2.7 – Cable-free audio routing for mac","content":"Suddenly, it’s easy to pass audio between applications on your Mac. Create virtual audio devices to take the sound from applications and audio input devices, then send it to audio processing applications. Loopback gives you the power of a high-end studio mixing board, right inside your computer!   A TRANSIT SYSTEM FOR YOUR AUDIO   […]"},{"link":"https://nmac.to/blog/gluemotion/","image":"https://nmac.to/wp-content/uploads/2020/09/GlueMotion_1.png","title":"GlueMotion 2.0.3 – Create timelapse videos from photos","content":"GlueMotion is the perfect tool for time lapse photographers. The application allows you to batch edit, deflicker and assemble sequences of images into time lapse movies. GlueMotion has been made to save your time and guide you during the process of creation. By using the included batch editing tool, you will not have to use […]"},{"link":"https://nmac.to/blog/smultron/","image":"https://nmac.to/wp-content/uploads/2020/11/Smultron_12.png","title":"Smultron 12.5.3 – An elegant and powerful text editor that is easy to use.","content":"Use Smultron to create or edit any text document. Everything from a web page, a note or a script to any single piece of text or code.   Since Smultron is easy to use, quick and uses powerful technologies like auto save, it helps you to do what you want to do without getting in your […]"}]