[{"link":"https://nmac.to/blog/earth-3d-v200-turn-your-monitor-into/","image":"https://nmac.to/wp-content/uploads/2013/12/earth.175x175-75.jpg","title":"Earth 3D 3.0.1 – Turn your monitor into a realistic space","content":"Earth 3D turns your monitor into a realistic space shuttle window! Our planet looks exactly as it’s seen by astronauts. You see the blackness of outer space with sparks of stars on it. You are flying around the Earth, a colorful ball with a veil of atmosphere.   Features: explore our planet with Interactive mode […]"},{"link":"https://nmac.to/blog/iwork-2013/","image":"https://nmac.to/wp-content/uploads/2013/12/iwork.jpg","title":"iWork 2013 – Productivity software suite ( Pages + Numbers + Keynote )","content":"An all new iWork for Mac makes creating, editing and sharing documents easier than ever. iWork introduces a new, unified file format, delivering perfect document fidelity across Mac, iOS and iCloud, and the iWork for iCloud beta now includes support for real-time collaboration. Now you can create your document on iPad®, edit it on your […]"},{"link":"https://nmac.to/blog/earth-3d-amazing-atlas/","image":"https://nmac.to/wp-content/uploads/2013/12/earth101.175x175-75.jpg","title":"Earth 3D – Amazing Atlas 1.1.0 – 3D globe wonders of the world","content":"This interactive 3D globe features wonders of the world, political and geographic maps, and weather. Discover a lot of fascinating facts and useful information about our planet! Original and colorful graphics, user-friendly interface and accurate information – this is what Earth 3D – Amazing Atlas is all about!   FEATURES: Relief model of the Earth […]"},{"link":"https://nmac.to/blog/chit-chat-for-facebook-messenger/","image":"https://nmac.to/wp-content/uploads/2013/12/facebook_chat.175x175-75.jpg","title":"Chit-Chat 1.2 – App for Facebook Messenger","content":"Message your friends for free. Download Chit-Chat for Facebook Messenger to instantly reach friends on their smart phones, feature phones or desktop computers. Chat with a group Send voice messages, photos, stickers, smileys and other emoji Push notifications Know who’s seen your messages Include your location WHAT’S NEW Version 1.2: Improvements and Bug Fixes.   […]"},{"link":"https://nmac.to/blog/awecal/","image":"https://nmac.to/wp-content/uploads/2013/10/icon.175x175-752.jpg","title":"AweCal 1.6 – Manage and organize tasks, events, and notes","content":"AweCal allows you to easily manage your time and organize your days! AweCal is the best organizer for your tasks, events and notes. It is an all-in-one calendar with a rich set of features including: Advanced Calendar: Supports multiple calendars, color code and put them in the same view. Calendars can be merged. Show or […]"},{"link":"https://nmac.to/blog/swordsoft-screenink/","image":"https://nmac.to/wp-content/uploads/2013/12/screenink.175x175-75.png","title":"SwordSoft Screenink 1.0.7 – Capture and annotate anything on the screen","content":"SwordSoft Screenink allows you to easily capture and annotate anything on the screen including full-screen, rectangle and freeform shape. It features a powerful capture tool, whiteboard, screen color picker, screen magnifier and etc. You can use all these tools freely. SwordSoft Screenink save files in BMP, JPG, JPEG and PNG formats.   WHAT’S NEW Version […]"},{"link":"https://nmac.to/blog/evershare/","image":"https://nmac.to/wp-content/uploads/2013/12/Evershare.175x175-75.jpg","title":"Evershare 1.1.0 – A simple, elegant and easy-to-use sharing service","content":"Evershare is a simple, elegant and easy-to-use sharing service. You can easily share thumbnails, icons, cover artworks and snapshots of your favorite photos, apps, musics and video clips via email, or on social networking sites like Facebook, Twitter, Flickr, Droplr or Weibo, or open it with an app in your Mac. All you need to […]"},{"link":"https://nmac.to/blog/xslimmer/","image":"https://nmac.to/wp-content/uploads/2013/12/23200.jpg","title":"Xslimmer 1.9.4 – Save hard drive space by reducing the size of applications","content":"Xslimmer removes wasted space on your Mac’s hard drive by removing the binary from either its PowerPC or Intel code (depending on the system architecture used). The result users report is that you can save 47% of your disk space. For example, when running Xslimmer on Google Earth 4, it shrinks the size from 101MB […]"},{"link":"https://nmac.to/blog/disc-cover-309/","image":"https://nmac.to/wp-content/uploads/2013/12/AppIcon.175x175-753.jpg","title":"Disc Cover 3.0.10 – Design and print CD/DVD labels","content":"Disc Cover is slick and intuitive software to create CD and DVD labels, covers, tray inserts, folding booklets, slim cases, super jewel boxes as well as mini-CD labels, business card CDs, VHS wraps and more. Over 250 template sets and 1,000+ clipart imahes (40,000+ with Extras Pack) provide a great help for a quick start. […]"},{"link":"https://nmac.to/blog/magic-window-v14-time-lapse-sunrises/","image":"https://nmac.to/wp-content/uploads/2013/12/MagicWindow.png","title":"Magic Window 1.6 – Wallpaper featuring time-lapse sunrises and sunsets","content":"Magic Window is the absolute best and most beautiful live wallpaper and screen saver available for your Mac. It includes complete timelapse views of coasts, beaches, cities, mountains, lakes, and more. Watch as time and light slowly paint the skies beautiful colors and the cities transform from day to night and back again. Created by […]"}]