[{"link":"https://nmac.to/blog/aperture-345/","image":"https://nmac.to/wp-content/uploads/2013/12/19717.jpg","title":"Aperture 3.5.1 – Post-production photography solution","content":"Aperture is designed from the ground up for professional photographers and provides everything you need for after the shoot, delivering the first all-in-one post-production tool for photographers.   Featuring a RAW-focused workflow, Aperture makes RAW as easy as JPEG, letting you import, edit, catalog, organize, retouch, publish, and archive your images more effectively and efficiently […]"},{"link":"https://nmac.to/blog/window-magnet-v15-snap-windows-into/","image":"https://nmac.to/wp-content/uploads/2013/12/icon.1.png","title":"Window Magnet 1.6 – Snap windows into various sizes and positions","content":"Window Magnet will change the way you work with your Mac! Easily snap windows into various sizes and positions by simply dragging them to the edges and corners of the screen. Maximize them, place them side by side or deploy them into all four quarters of your screen in the blink of an eye.    […]"},{"link":"https://nmac.to/blog/instacast/","image":"https://nmac.to/wp-content/uploads/2013/12/47819.jpg","title":"Instacast 1.0.6 – Podcasts for the next generation","content":"Instacast brings you podcasts like no other. The popular iOS app is moving onto the Desktop! With managed podcast subscriptions, advanced playback controls, the ability to follow show notes, and WiFi download capability to save on your mobile broadband allowance, Instacast is the perfect solution for the mobile viewer.   WHAT’S NEW Version 1.0.6: The […]"},{"link":"https://nmac.to/blog/pixa-v101-quickly-and-easily-organize/","image":"https://nmac.to/wp-content/uploads/2013/12/PixaIcon.png","title":"Pixa 1.1.2 – Quickly and easily organize your images","content":"Pixa, a new image organizing application for OS X 10.7. The new app functions well, is easy to use, and helps people organize their images quickly and easily on their computers. For those who prefer not to use the Pixa library, the application can still find the images when the user searches for them. So, either […]"},{"link":"https://nmac.to/blog/photo-effect-studio-pro-400/","image":"https://nmac.to/wp-content/uploads/2013/11/Photo-Effect-Studio.png","title":"Photo Effect Studio Pro 4.1.1 – Package of artistic photo effects","content":"Photo Effect Studio Pro is among the top 10 Mac apps in Top Grossing list of photography category in the US, United Kingdom, Germany, Australia, Switzerland, Sweden, Singapore, Russia, Portugal, Netherlands, Mexico, Italy, Denmark, Canada, China, Czech Republic, Malaysia, Malta, Poland, Saudi Arabian etc. Photo Effect Studio includes a large number of powerful photo effects carefully […]"},{"link":"https://nmac.to/blog/template-mix-for-pages/","image":"https://nmac.to/wp-content/uploads/2013/12/template_mix_icon.175x175-75.png","title":"Template Mix for Pages 1.2 – Collection of 50+ template designs","content":"Template Mix for Pages is a collection of original template lines, giving a unified look to all your printed materials. Each line contains five eye-catching categories: brochures, invoices, letters, envelopes, and business cards. Suddenly, your everyday documents are sales agents.   Every object in Template Mix for Pages — text, text boxes, images, fonts — […]"},{"link":"https://nmac.to/blog/desktopshelves-v213-display-folders-as/","image":"https://nmac.to/wp-content/uploads/2013/12/image321s.png","title":"DesktopShelves 2.1.4 – Display folders as desktop shelves","content":"DesktopShelves can help clean up a desktop cluttered by dozens of different files. You can display any folder as a shelf on your Desktop. On a shelf the size of 5 normal Desktop items you can fit 20 files, because items on a shelf are slightly rotated like books on a real-world shelf. That saves a lot […]"},{"link":"https://nmac.to/blog/news/","image":"https://nmac.to/wp-content/uploads/2013/12/icon.175x175-75.png","title":"News Notifications 1.1.3 – RSS feeds directly on your notification centre","content":"News Notifications takes advantage of Mountain Lion’s brand new Notification Center to keep you on top of the news! Add RSS feeds of your favorite websites to News Notifications. As soon as there’s a new post, article or blog, you’ll get a subtle notification at the top of your screen. Past notifications will be shown in […]"},{"link":"https://nmac.to/blog/dialogue-101/","image":"https://nmac.to/wp-content/uploads/2013/12/Dialogue.jpg","title":"Dialogue 1.2 – Connect your Mac with your phone","content":"Dialogue is a simple Mac application that uses bluetooth to connect your Mac with your phone. It allows you to answer and make normal phone calls over your Mac. It’s as simple as that.   After connecting your phone, Dialogue warns you for incoming calls. You can also search a contact from your addressbook or […]"},{"link":"https://nmac.to/blog/flamingo/","image":"https://nmac.to/wp-content/uploads/2013/12/AppIcon.175x175-751.png","title":"Flamingo 1.0.7 – Messaging client that supports Hangouts/Gtalk, Facebook, and XMPP","content":"Flamingo is a beautiful, native instant messaging client for OS X that supports Hangouts/Gtalk, Facebook, and XMPP.   Features: All-in-One design. Buddies, conversations, and chats in a single window. Multiple, detachable chats in a single window. Inline previews for images, videos, and tweets. Supports CloudApp, Droplr, Instagram, and YouTube. File transfer via direct connection (compatible […]"}]