[{"link":"https://nmac.to/blog/exlibris/","image":"https://nmac.to/wp-content/uploads/2020/07/ExLibris.png","title":"ExLibris 10.1.0 – Library Database","content":"ExLibris is an Library Database   Create, manage, save, print sheets of books in your library Easy and intuitive search of your books Integrated web browser for online search   Version 10.1.0: Fixed a critical bug where notes could not be saved Icons updated Dark mode enabled Code updated to the latest version   Intel, […]"},{"link":"https://nmac.to/blog/mia-for-gmail/","image":"https://nmac.to/wp-content/uploads/2017/07/Mia-for-Gmail.png","title":"Mia for Gmail 2.4.5 – Gmail without a browser (was Notifier Pro for Gmail)","content":"Mia for Gmail (was Notifier Pro for Gmail) is a desktop Gmail client which sits politely in your menu bar. Multiple Gmail accounts – Add as many as Gmail accounts as you want. A pleasant notification sound will let you know if you’ve got a new email. It’s up to you to choose any notification […]"},{"link":"https://nmac.to/blog/photo-mechanic/","image":"https://nmac.to/wp-content/uploads/2014/12/Photo-Mechanic6.png","title":"Photo Mechanic 6.0 Build 5029 – Quality digital camera image browser","content":"Photo Mechanic is a photographer’s image browser tool. It is the answer for professional digital photographers looking for a fast and easy-to-use image browser for digital camera files. Photo Mechanic’s innovative batch captioning, renaming, speedy browsing, and Photoshop connectivity features have made it the choice of thousands of photojournalists and professional photographers worldwide. Optimized for […]"},{"link":"https://nmac.to/blog/antivirus-zap/","image":"https://nmac.to/wp-content/uploads/2017/12/Antivirus-Zap.png","title":"Antivirus Zap 3.10.2.0 – Scan and remove malware and other malicious software","content":"Antivirus Zap is a comprehensive solution that scans and removes malware and other malicious software from your Mac. It detects threats or suspicious files that are already on your Mac and protects you from being exposed in the future.   Features: Detects and Removes malware and viruses to safeguard your Mac Quick Scan: Checks the […]"},{"link":"https://nmac.to/blog/monit-2/","image":"https://nmac.to/wp-content/uploads/2016/11/MONIT.png","title":"Monit 2.0.2 – Check your mac performance data from Notification Center","content":"Slide out Notification Center to quickly see key performance data for your Mac, such as CPU, Memory, Disk, Network and Battery. Click the charts to drill down and reveal more details. Click the Network and Disk Icons to view even more data.   Monit Widget is a modest, but ambitious, Notification Center Widget for monitoring […]"},{"link":"https://nmac.to/blog/dwarrows/","image":"https://nmac.to/wp-content/uploads/2020/09/Dwarrows.png","title":"Dwarrows 1.4 – A peaceful 3rd person adventure game","content":"Build and grow a new settlement and explore the lands surrounding it in this Peaceful Action-Adventure & Town-Builder. Search the lush forests of the Dusken Woodlands for resources, and adventure through mysterious new places to find lost artifacts.   Meet strange and quirky characters along the way, invite wandering people to join your town, and […]"},{"link":"https://nmac.to/blog/the-dungeon-of-naheulbeuk/","image":"https://nmac.to/wp-content/uploads/2020/09/The-Dungeon-Of-Naheulbeuk.png","title":"The Dungeon Of Naheulbeuk: The Amulet Of Chaos 1.0.160 – Turn-Based Strategy Game","content":"Are you ready to dive into a tactical RPG chock-full of charm, humor and crazy characters?!   They are clumsy, inexperienced and feisty but…they’ll have to endure each other’s company to get the dungeon’s treasure.    However, a feeling of déjà-vu quickly arises…    Guide this team of unlikely heroes in an adventure full of […]"},{"link":"https://nmac.to/blog/turbo-boost-switcher-pro/","image":"https://nmac.to/wp-content/uploads/2020/09/Turbo-Boost-Switcher-Pro.png","title":"Turbo Boost Switcher Pro 2.9.1 – Allows users to enable and/or disable the Turbo Boost feature","content":"Turbo Boost Switcher is a little application for Mac computers that allows to enable and/or disable the Turbo Boost feature. It installs a precompiled kernel extension (32 or 64 bits depending on your system) that updates the Turbo Boost MSR register, so It will ask for your admin password when using it. It’s installed on […]"},{"link":"https://nmac.to/blog/macleaner-x/","image":"https://nmac.to/wp-content/uploads/2017/06/MaCleaner-X-14.png","title":"MaCleaner X 14.5.0 – Cleaning and optimizing Software","content":"The main distinctive feature is a customizable design. Now the app automatically determines your Mac device and adjusts the special interface for it, what makes the user experience much more convenient.   SYSTEM OPTIMIZATION Privacy protection: chat & browser histories, online & offline activities Distinguishing Voice Control function Detailed monitoring: Disc, CPU, RAM, Battery File […]"},{"link":"https://nmac.to/blog/master-of-typing-2/","image":"https://nmac.to/wp-content/uploads/2017/02/Master-of-Typing-2.png","title":"Master of Typing 2 8.5.2 – Learn touch typing","content":"Master of Typing 2 – TOUCH TYPING using all 10 FINGERS without watching the keyboard will help: SAVE TIME; Work on ACCURACY and ATTENTION; Increase EFFICIENCY at work.   TUTORIAL: Read helpful topics of the LEARNING MODE; Use PROMPTS, when something isn’t clear; Try your typing skills in practice; Select EXAM MODE and choose the […]"}]