[{"link":"https://nmac.to/blog/airbeam-pro-1-5/","image":"https://nmac.to/wp-content/uploads/2014/04/AirBeam1.png","title":"AirBeam Pro 1.5 – Monitor cameras on your iPhone or iPad","content":"AirBeam Pro allows you to watch on your Mac what the cameras of your iPhones, iPods or iPads see.It receives high resolution video in realtime and with up to 30 frames per second from any number of iPhones, iPods or iPads with a camera on a WiFi network – even from multiple devices simultaneously.   AirBeam […]"},{"link":"https://nmac.to/blog/macaw-1-0/","image":"https://nmac.to/wp-content/uploads/2014/04/Macaw1.png","title":"Macaw 1.0 – The code-savvy web design tool","content":"Stop writing code. Start drawing it.   Macaw provides the same flexibility as your favorite image editor but also writes semantic HTML and remarkably succinct CSS. It’s time to expect more from a web design tool.   Fluid canvas and grid Macaw is engineered for fluid widths. Resize the canvas and your grids and elements […]"},{"link":"https://nmac.to/blog/ephnic-video-converter-1-1-0/","image":"https://nmac.to/wp-content/uploads/2014/04/Ephnic.Video_.Converter.png","title":"Ephnic Video Converter 1.1.0 – Convert your videos to any video file format","content":"Ephnic Video Converter is the best video & audio conversion software for users that converts your videos and audio to a format optimized for iPhone, iPad, Apple TV, or a variety of other video/audio formats. And now you can convert your videos for sharing on facebook, YouTube and more. Watching home movies in the living […]"},{"link":"https://nmac.to/blog/archimedes-1-2-1/","image":"https://nmac.to/wp-content/uploads/2014/04/Archimedes.png","title":"Archimedes 1.2.1 – Elegant mathematical writing","content":"Archimedes is a text editor that uniquely combines Markdown and LaTeX to make mathematical writing fun and easy.   Markdown Editing At its core, Archimedes is a fully-featured plain text and Markdown editor. It includes a fast syntax highlighter and provides convenient keyboard shortcuts for common actions, such as inserting images and links. With complete […]"},{"link":"https://nmac.to/blog/ringer-2-0-4/","image":"https://nmac.to/wp-content/uploads/2014/01/Ringer.png","title":"Ringer 2.0.4 – Create iPhone ringtones","content":"Ringer allows you to create iPhone ringtones.    Choose any non-protected file from your iTunes library or any media file on your system and turn it into a custom ringtone for your iPhone. Make as many as you want, there is no limit to the number of ringtones you can make with Ringer.   Easily […]"},{"link":"https://nmac.to/blog/porthole-1-6-1/","image":"https://nmac.to/wp-content/uploads/2014/02/Porthole.png","title":"Porthole 1.6.1 – AirPlay all audio to multiple speakers","content":"Porthole is a tool that lets you stream the music from your favorite music player such as Spotify or Pandora to your Airplay speakers, Apple AirPort Express and Apple TV.   Porthole focuses on being elegant and simple to use. The setup wizard will have you going in no-time. De-cable your living room and start […]"},{"link":"https://nmac.to/blog/datagraph-3-2/","image":"https://nmac.to/wp-content/uploads/2014/04/DataGraph.png","title":"DataGraph 3.2 – Simple and powerful graphing program","content":"DataGraph is a powerful and easy to use graphing and charting application. DataGraph minimizes the fuss and frustration associated with creating clean and accurate publication quality graphs and charts. DataGraph also includes powerful function fitting and statistical analysis capabilities, which enables high quality analysis of the data. Import data from files, paste in numbers from […]"},{"link":"https://nmac.to/blog/picgif-2-0-0/","image":"https://nmac.to/wp-content/uploads/2014/03/PicGIF.png","title":"PicGIF 2.0.0 – Convert photos and videos into incredible GIFs quickly.","content":"PicGIF enables you to quickly create incredible animated GIFs from photos or short videos. It’s easy to customize GIF Size, Sequence, Frame Delay, and to add text and stickers, etc. After a satisfying GIF is done, you can share the GIF with your friends via E-Mail, iMessage, Tumblr or simply save it in Finder on […]"},{"link":"https://nmac.to/blog/pdf-suite-1-6/","image":"https://nmac.to/wp-content/uploads/2014/03/PDFSuite.png","title":"PDF-Suite 1.6 – Separate, connect and extract PDF files","content":"PDF-Suite for Mac allows you to separate, connect, extract, insert, rotate and assort PDF files using a straightforward interface. All functions are well designed and easy to handle.   Version 1.6: Reduce File Size Save Encrypted   Intel, 64-bit processor OS X 10.7 or later   Usersfiles          Uploaded         1fichier  […]"},{"link":"https://nmac.to/blog/diskaid-6-6-2/","image":"https://nmac.to/wp-content/uploads/2014/01/DiskAid.png","title":"DiskAid 6.6.2 – Use your iOS device as an external disk and more","content":"DiskAid is the ultimate transfer tool for accessing the iPod, iPhone or iPad directly from the desktop. Access data such as: music, video, photos, contacts, notes, call history, text messages (SMS), voicemail, and voice memos. With DiskAid you can also transfer files and folders betwen your iPhone, iPad or iPod touch and your computer and […]"}]