[{"link":"https://nmac.to/blog/muse/","image":"https://nmac.to/wp-content/uploads/2017/10/Muse.png","title":"Muse 2.2.0 – Music Player for YouTube","content":"Muse is the native desktop client for YouTube Music. It plays and organizes music directly from YouTube. In it you can get recommendation for the hottest songs, find tracks you seek, build your personal playlists, and more. Best of all? It lives right in your menu bar and is super easy to control!   Here […]"},{"link":"https://nmac.to/blog/snapheal/","image":"https://nmac.to/wp-content/uploads/2015/10/Snapheal2.png","title":"Snapheal 3.1 – Quickly remove objects and people from photos","content":"Snapheal magically removes unwanted objects and people, and fixes your images. Get rid of skin imperfections in one click, retouch photos and much more. It’s fast, powerful and you can rely on Snapheal with any photos that you take.   Unique image healing technologies, that are not available in other apps. Get rid of unwanted […]"},{"link":"https://nmac.to/blog/design-templates-for-excel/","image":"https://nmac.to/wp-content/uploads/2017/10/DesiGN-Templates-for-Excel.png","title":"DesiGN Templates for Excel 3.9 – High-quality Design Templates for Excel","content":"The high-quality DesiGN Templates for Excel collection offers 340 diverse and practical templates for MS Excel. Use them for your business or personal needs to make your daily tasks a lot more manageable. Personalize the templates to your requirements: create tables, make calculations, draw diagrams, and insert images, attending to your job efficiently and without […]"},{"link":"https://nmac.to/blog/exposure-x3/","image":"https://nmac.to/wp-content/uploads/2017/10/Exposure-x3.png","title":"Exposure x3 bundle 3.0.3.59 – The fastest way to bring your vision to life","content":"Introducing Exposure X3, the advanced non-destructive RAW editor that enables you to easily create beautiful images and master your entire workflow.   Fast performance, powerful organizing tools, and unmatched creative editing make Exposure the only app you need to quickly transform your photos into works of art.   Use Exposure as a complete photo editor […]"},{"link":"https://nmac.to/blog/valhalla-hills/","image":"https://nmac.to/wp-content/uploads/2015/12/ValhallaHills.png","title":"Valhalla Hills 2.2.0.10 – Lead your people. Survive the wilderness. Fight for honor","content":"You spent your whole life in service to the gods of Asgard. You died an honorable death. You earned your place in the halls of Valhalla.   But when you knocked on its gates to receive your final reward, none answered. Odin has turned his back on your people. He underestimates the Viking spirit. He […]"},{"link":"https://nmac.to/blog/highlights/","image":"https://nmac.to/wp-content/uploads/2015/05/Highlights1.png","title":"Highlights 1.5.1 – Turns PDF annotations into Markdown","content":"Highlights is a PDF reader that extracts highlighted text, notes, and image selections from PDFs and lets you share them via email, archive them to shoebox applications such as Evernote, DEVONthink, and VoodooPad, or just save them to portable formats such as Markdown and HTML.   PDFs are like paper, abundant and made for reading. […]"},{"link":"https://nmac.to/blog/interact-scratchpad/","image":"https://nmac.to/wp-content/uploads/2017/05/Interact-Scratchpad.png","title":"Interact Scratchpad 1.0.5 – Convert text to contacts","content":"Interact Scratchpad is a tool to easily and quickly create rich, complete contact records from plain text. Copy text from email signatures, web pages, or any document, and let the Interact Scratchpad turn it into a contact for you! Interact sits in your menu bar, or is available in the “Share” contextual (right-click) menu on […]"},{"link":"https://nmac.to/blog/stellar-phoenix-video-repair/","image":"https://nmac.to/wp-content/uploads/2016/07/StellarPhoenix.Video_.Repair.png","title":"Stellar Phoenix Video Repair 2.0.0.1 – Easily repair video files","content":"Stellar Phoenix Video Repair is an efficient video repair tool which repairs corrupt or damaged videos including MOV files that are unplayable in QuickTime. The tool repairs video affected from various issues like sound corruption, header corruption, movement corruption, duration corruption, and change in format. In addition, it allows simultaneous repair of multiple video files. […]"},{"link":"https://nmac.to/blog/pencilsketch/","image":"https://nmac.to/wp-content/uploads/2017/10/PencilSketch2.png","title":"PencilSketch 2.5.1 – Turn your digital photo into a pencil sketch","content":"PencilSketch is a powerful software to turn your digital photo into a pencil sketch. It’s very ease to use, to sketch a photo, you just need drop the photo into PencilSketch.   You can personalize your picture sketch by adjust brightness, change frame and background type.   FEATURES Produce natural pencil sketch easy and cool […]"},{"link":"https://nmac.to/blog/m4vconverter-plus/","image":"https://nmac.to/wp-content/uploads/2013/03/m4vconverterplus.png","title":"M4VConverter Plus 4.3.8 – Convert videos and extract audio","content":"M4VConverterPlus uses multiple-speed recording technology to record M4V, then decodes to unprotect MOV, M4V or MP4 format. It has been designed for removing DRM from iTunes, such as purchased iTunes movies and iTunes movies rental. It can also convert any video on your iTunes library. It supports extracting the audio from M4V files. Batch conversion […]"}]