[{"link":"https://nmac.to/blog/direqual/","image":"https://nmac.to/wp-content/uploads/2021/10/DirEqual_4.png","title":"DirEqual 4.4.2 – Compare directories and show differences using colors","content":"DirEqual is an advanced directory compare utility for Mac. It allows detecting the tiniest changes between folders and display the result with a clear and intuitive way. The differences are highlighted using colors and icons indicating the difference type (size, date or item content).    DirEqual displays compared directories side by side as expandable trees, […]"},{"link":"https://nmac.to/blog/adobe-indesign-cc/","image":"https://nmac.to/wp-content/uploads/2020/06/Adobe-InDesign-2020.png","title":"Adobe InDesign 2022 17.2.0 – Professional print and digital publishing solution","content":"Adobe InDesign CC is part of Creative Cloud. That means you have access to all the latest updates and future releases the moment they’re available. Sharpen your skills and master new tools with a rich and growing library of training videos. And Creative Cloud is integrated with Behance, so you can share your projects and get […]"},{"link":"https://nmac.to/blog/adobe-incopy-cc/","image":"https://nmac.to/wp-content/uploads/2020/06/Adobe-InCopy-2020.png","title":"Adobe InCopy 2022 17.2.0 – Create streamlined editorial workflows","content":"Adobe InCopy, ideal for large team projects involving both written copy and design work, provides copywriters and editors with a powerful tool to style text, collaborate through track changes, and make simple layout modifications that integrate effortlessly with InDesign.   Version 17.2.0: Release notes were unavailable when this listing was updated.   Intel, 64-bit processor […]"},{"link":"https://nmac.to/blog/luminar-ai/","image":"https://nmac.to/wp-content/uploads/2020/12/Luminar-AI.png","title":"Luminar AI 1.5.2 – AI photo editing software","content":"The first image editor fully powered by artificial intelligence.   More Possibilities. Innovative technologies give a whole new world of possibilities to express your ideas.   Less Routine. AI deals with the boring tasks so you can focus on your creative story.   No Learning Barrier. Whether you’ve been a photographer for 20 years or […]"},{"link":"https://nmac.to/blog/smart-shooter/","image":"https://nmac.to/wp-content/uploads/2017/05/Smart-Shooter.png","title":"Smart Shooter 4.24 – Fully control your camera from from your Mac","content":"Smart Shooter allows you to fully control your camera from your Mac, giving you freedom to explore and experiment to help take the perfect picture.   Automatic download and display means you can fully evaluate your photos in seconds, and real time live view output will help you focus and compose the scene.   Scripting […]"},{"link":"https://nmac.to/blog/capturegrid/","image":"https://nmac.to/wp-content/uploads/2019/12/CaptureGRID.png","title":"CaptureGRID 4.24 – Remote capture and advanced camera control","content":"CaptureGRID 4 is a digital photography work flow application for tethered shooting, remote capture and advanced camera control.   Multi-Camera Control allows you to fully control and synchronise all your cameras simultaneously, including camera settings, triggering, live view, photo download and filename management.   Networked Operation across multiple computers allows you to scale up the […]"},{"link":"https://nmac.to/blog/meta-music-tag/","image":"https://nmac.to/wp-content/uploads/2017/10/Meta1.png","title":"Meta 2.1.3 – Music Tag Editor, Audio Metadata","content":"Meta helps you manage your ever-growing digital music collection.   With Meta you can easily edit information such as a song’s artist, title, album, album cover, etc. It supports editing of most audio formats such as mp3, mp4, m4a, flac, ogg, oga, spx, wav, aiff… and a variety of metadata formats including ID3v1, ID3v2.3, ID3v2.4, […]"},{"link":"https://nmac.to/blog/nik-collection-by-dxo/","image":"https://nmac.to/wp-content/uploads/2018/10/Nik-Collection-by-DxO.png","title":"Nik Collection by DxO 4.3.4 – Rendering and photography retouching tools","content":"Nik Collection by DxO is a series of 7 renowned creative MacOS and Windows plugins for Adobe Photoshop, Adobe Photoshop Elements and Adobe Lightroom, providing filters, rendering and photography retouching tools to create stunning images.   It leverages the U-Point technology for localized adjustments, and adds a full set of editing functionalities for amazing pictures: […]"},{"link":"https://nmac.to/blog/staruml/","image":"https://nmac.to/wp-content/uploads/2021/04/StarUML.png","title":"StarUML 5.0.1 – A sophisticated software modeler","content":"StarUML is compatible with UML 2.x standard, and supports in total 11 kinds of UML diagrams: class, object, use-case, component, deployment, composite structure, sequence, communication, statechart, activity, and profile diagrams. You can also create Entity-Relationship Diagrams (ERD). ERD is one of the most frequently used diagram for database modeling. Our ERD is based on crow’s-foot […]"},{"link":"https://nmac.to/blog/bigasoft-video-downloader-pro/","image":"https://nmac.to/wp-content/uploads/2016/09/Bigasoft-Video-Downloader.png","title":"Bigasoft Video Downloader Pro 3.24.6 – Download Online Video, Audio in HD, 3D or SD","content":"Bigasoft Video Downloader Pro for Mac can download and convert online videos in HD 1080p/720p, 3D or stand definition 360p/480p to MP4, WMV, AVI, DivX, Xvid, MOV, MKV, MPG, FLV, RMVB, VOB, DV, ASF, SWF and etc on Mac.   This powerful Video Downloader Pro Mac is also a professional Video to MP3 Downloader for […]"}]