[{"link":"https://nmac.to/blog/sentinel-3-homeworld-1-0/","image":"https://nmac.to/wp-content/uploads/2017/01/Sentinel.3.png","title":"Sentinel 3: Homeworld 1.0 – Sci-fi & Strategy Tower Defense Game","content":"The biggest installment of the award winning Sentinel sci-fi tower defense series. Take the fight to the alien homeworld and unleash a massive arsenal of weaponry. Get up close and personal on the battlefield in your power armor to execute devastating attacks and support your defenses!   An epic campaign across 20 levels. A powerful commander […]"},{"link":"https://nmac.to/blog/msg-converter-pro-1-6-1/","image":"https://nmac.to/wp-content/uploads/2016/10/Msg-Converter-Pro.png","title":"Msg Converter Pro 1.6.1 – Easily convert Microsoft Outlook .msg","content":"Msg Converter Pro: A simple, efficient way to batch converts Microsoft Outlook .msg files into EML, VCF, HTML, PDF, RTF and TXT files.   KEY FEATURES: Support contact and e-mail message type input. Support EML, VCF, HTML, PDF, RTF and TXT ouput. Batch conversion at lightning fast speed. Easy to use, simply Drag & Drop […]"},{"link":"https://nmac.to/blog/clamxav-2-11/","image":"https://nmac.to/wp-content/uploads/2017/01/ClamXav.png","title":"ClamXav 2.11 – Virus checker based on ClamAV","content":"ClamXav is a popular virus checker for OS X.   I have been working on ClamXav for more than 10 years now, and over those years, I have invested a huge amount of my own time and energy into bringing ClamXav to where it is today — one of the most trusted and recommended anti-virus […]"},{"link":"https://nmac.to/blog/pluraleyes-3-5-5/","image":"https://nmac.to/wp-content/uploads/2016/12/PluralEyes.png","title":"PluralEyes 3.5.5 – Instantly sync multi-camera audio and video","content":"PluralEyes will synch your audio and video in seconds   Videographers and filmmakers win by telling a good story. Now you can win at the workflow behind that story too. By synchronizing audio and multi-camera video automatically, PluralEyes revolutionizes post-production and speeds your sync in seconds rather than days. The new PluralEyes for Mac is […]"},{"link":"https://nmac.to/blog/home-remote-activator-1-9/","image":"https://nmac.to/wp-content/uploads/2016/12/Home-Remote.png","title":"Home Remote – Activator 1.9 – Companion app for Home Remote on iOS","content":"Home Remote – Activator is a companion app for the well received Home Remote app for iOS. It will sync your iOS actions via iCloud and allow them to be called from your Mac. If you don’t have iCloud enabled you can still export a configuration file from the iOS app and import it here! […]"},{"link":"https://nmac.to/blog/orion-markup-3-02/","image":"https://nmac.to/wp-content/uploads/2016/11/Orion-Markup.png","title":"Orion Markup 3.02 – Add image notes and annotations","content":"Orion Markup lets you express your thoughts and comments though images. It makes it easy to add notes, zoom-in bubbles, outlines boxes, lines, and arrows to images and screenshots.   Supports a full suite of annotation objects, including: zoom bubbles: creates magnified versions of selected image regions multiple sized outline boxes and text labels hundreds […]"},{"link":"https://nmac.to/blog/instastack-3-1-3/","image":"https://nmac.to/wp-content/uploads/2015/03/Instastack.png","title":"Instastack 3.1.3 – Instagram Mac desktop client","content":"Instastack is the most elegant way to browse Instagram on the Mac.   MenuBar Panel InstaStack is a new tool to help you to discover Instagram social media network. if you want to connect your instagram account from menubar on your mac , InstaStack is your tool.   Browse Photo Feeds Browse your Instagram feed, […]"},{"link":"https://nmac.to/blog/ibackupbot-5-4-4/","image":"https://nmac.to/wp-content/uploads/2015/11/iBackupBot.png","title":"iBackupBot 5.4.4 – Browse, view, export and modify iTunes backup files","content":"iBackupBot gives you the ability to browse, view, export, and modify iTunes backup files. With its built-in plist editor, hex editor, text editor, database viewer, image viewer, SMS message viewer, notes viewer, address book viewer, and media browser, you can view and edit any file that iTunes backed up from iPad/iPhone/iPod Touch to your computer. […]"},{"link":"https://nmac.to/blog/gridsutra-1-1/","image":"https://nmac.to/wp-content/uploads/2016/12/gridsutra.png","title":"Gridsutra 1.1 – Window arranging and positioning tool","content":"GridSutra is a window arranging and positioning tool for Apple macOS.   Features It helps you in working with different windows at the same time. Launcher gives you multiple layout options to select. It can assign shortcut keys to your favourite window arrangement.   Version 1.1: Drag-and-snap the windows to the edges of the desktop […]"},{"link":"https://nmac.to/blog/panoramical-1-0/","image":"https://nmac.to/wp-content/uploads/2016/12/PANORAMICAL.png","title":"PANORAMICAL 1.0 – An interactive sensory journey game","content":"Prepare your fragile human mind for PANORAMICAL, an interactive sensory journey unlike anything you’ve ever played before.   Manipulate the look, sound, and feel of more than a dozen mesmerizing landscapes in this immersive musical adventure through space and time. Turn peaceful mountains into thumping valleys into jazz solo forests into ominous caves, turn day […]"}]