[{"link":"https://nmac.to/blog/king-arthur-ii-dead-legions-1-0/","image":"https://nmac.to/wp-content/uploads/2015/05/King-Arthur-II.png","title":"King Arthur II: Dead Legions 1.0 – The Role-Playing Wargame","content":"This is a tale of revival, resurrection and revenge; the chronicle of how the greatest adversary of King Arthur came into power – and the terrible price he had to pay.   Our journey begins in Eboracum, in one of the greatest cities built in the Roman provinces of Britannia. But that was a long […]"},{"link":"https://nmac.to/blog/andy-os-0-43/","image":"https://nmac.to/wp-content/uploads/2015/05/Andy.png","title":"Andy OS 0.43 – Run your Android apps directly from your Mac with this full Android OS for Mac","content":"Andy OS is the first full featured mobile operating system that runs on any Mac, and in the Cloud – it breaks the barrier between desktop and mobile computing, while keeping you up-to-date with the latest Android OS feature upgrades. It also provides users with unlimited storage capacity, Mac compatibility, and the freedom to run […]"},{"link":"https://nmac.to/blog/reformator-1-2-0/","image":"https://nmac.to/wp-content/uploads/2014/09/Reformator.png","title":"Reformator 1.2.0 – Multi-functional batch photo converter","content":"Reformator helps you convert a bulk of images into the most popular image formats, give your files meaningful names, watermark with text and image, adjust photos (brightness/saturation/exposure/grayscale/etc.), fit geometry (scale/crop/trim/etc.), remove private metadata, add your own copyrights, and much more. Also, Reformator is a great tool to browse your photos with an up-to-date photo Browser, […]"},{"link":"https://nmac.to/blog/assassins-creed-brotherhood-1-0/","image":"https://nmac.to/wp-content/uploads/2015/05/Assassins.Creed_.Brotherhood.png","title":"Assassin’s Creed Brotherhood 1.0 – Live and breathe as Ezio, a legendary Master Assassin","content":"Live and breathe as Ezio, a legendary Master Assassin, in his enduring struggle against the powerful Templar Order. He must journey into Italy’s greatest city, Rome, center of power, greed and corruption to strike at the heart of the enemy.   Defeating the corrupt tyrants entrenched there will require not only strength, but leadership, as […]"},{"link":"https://nmac.to/blog/totals-3-0-15/","image":"https://nmac.to/wp-content/uploads/2015/05/Totals.png","title":"Totals 3.0.15 – Create stylish invoices and more","content":"Totals is a full-featured invoice application for SOHO or business users. Designed from scratch for the power and beauty of the Mac OS, it makes life easy for its users.   Totals is a combination of powerful features and a simple user interface. Every single step, every single process is well thought-out. One window for […]"},{"link":"https://nmac.to/blog/airport-simulator-2015/","image":"https://nmac.to/wp-content/uploads/2015/04/Airport-Simulator-2015.png","title":"Airport Simulator 2015 1.0 – Step into the shoes of an airport employee","content":"Experience exciting and varied tasks in the field of aircraft handling at a major international airport and take control of high-powered aircraft tractors, de-icing vehicles, and many more! Airport Simulator 2015 features a total of five popular aircraft types and 14 different vehicles, offering a huge range of different tasks on the apron and taxiway. […]"},{"link":"https://nmac.to/blog/webbla-1-6-2/","image":"https://nmac.to/wp-content/uploads/2015/04/Webbla.png","title":"Webbla 1.6.2 – A visual bookmark manager","content":"Webbla allows you to organize your Bookmarks visually with Delicious and Pinboard support.   If you like to handle your music and photos with iTunes and iPhoto, Webbla is the right application to handle your bookmarks.   Webbla is a modern bookmark manager that helps you in organizing your bookmarks visually. It also offers you […]"},{"link":"https://nmac.to/blog/textexpander-4-3-6/","image":"https://nmac.to/wp-content/uploads/2014/01/TextExpander.png","title":"TextExpander 4.3.6 – Expand custom keyboard shortcuts into frequently-used text and pictures","content":"TextExpander saves your fingers and your keyboard, expanding custom keyboard shortcuts into frequently-used text and pictures. Type more with less effort!   Here are a few examples for what you can do with TextExpander: Insert standard greetings, phrases, boilerplate paragraphs, and signatures – including formatted text and pictures. Correct typos automatically Organize snippets into groups […]"},{"link":"https://nmac.to/blog/pinegrow-web-designer-2-01/","image":"https://nmac.to/wp-content/uploads/2015/04/Pinegrow.Web_.Designer.png","title":"Pinegrow Web Designer 2.01 – Mockup and design webpages faster","content":"Pinegrow Web Designer is desktop app that lets you mockup and design webpages faster with multi-page editing, CSS and LESS styling, and smart components for Bootstrap, Foundation, Angular JS, and WordPress.   Version 2.01: App window disappeared on Windows after being minimised. Theme could not be exported in trial mode on Windows. Attributes enclosed in […]"},{"link":"https://nmac.to/blog/photostyler-6-8-2/","image":"https://nmac.to/wp-content/uploads/2014/09/PhotoStyler.png","title":"PhotoStyler 6.8.2 – Add a sense of realism to your digital photos","content":"PhotoStyler is the easiest way to style your digital photos with your Mac. This simple, fast and accurate native solution combines the powers of Apple’s core technologies with the flexibility and efficiency of proprietary application-specific modules. PhotoStyler supports all image formats that are supported by MacOS including RAW images.   PhotoStyler doesn’t require any special […]"}]