[{"link":"https://nmac.to/blog/turok/","image":"https://nmac.to/wp-content/uploads/2019/01/Turok.png","title":"Turok 2.0 – Classic Action & Adventure Game","content":"Turok is back and no dinosaur is safe! When it was first released in 1997, Turok introduced gamers to a world teeming with cunning enemies, traps, puzzles and deadly weapons all within a vast 3D environment ready to explore. Now the classic game has been restored and enhanced with a new visual engine and exciting […]"},{"link":"https://nmac.to/blog/donut-county/","image":"https://nmac.to/wp-content/uploads/2019/01/Donut-County.png","title":"Donut County 1.1.0 – A story-based physics puzzle game","content":"Donut County is a story-based physics puzzle game where you play as an ever-growing hole in the ground. Meet cute characters, steal their trash, and throw them in a hole.   WHERE TRASH IS TREASURE Raccoons have taken over Donut County with remote-controlled trash-stealing holes. You play as BK, a hole-driving raccoon who swallows up […]"},{"link":"https://nmac.to/blog/return-of-the-obra-dinn/","image":"https://nmac.to/wp-content/uploads/2019/01/Return.of_.the_.Obra_.Dinn_.png","title":"Return of the Obra Dinn 1.0.96 – An Insurance Adventure with Minimal Color","content":"In 1802, the merchant ship Obra Dinn set out from London for the Orient with over 200 tons of trade goods. Six months later it hadn’t met its rendezvous point at the Cape of Good Hope and was declared lost at sea.    Early this morning of October 14th, 1807, the Obra Dinn drifted into […]"},{"link":"https://nmac.to/blog/tinybooks-pro/","image":"https://nmac.to/wp-content/uploads/2016/09/TinyBooks-Pro9.png","title":"TinyBooks Pro 10.0.2 – Streamlined bookkeeping and accounting system","content":"TinyBooks Pro is a simple, flexible, non-bloated, single-entry bookkeeping and accounting system for the Mac. TinyBooks Pro is designed for sole proprietors, home and other small businesses, and family finances. Unlike many tax-related programs, TinyBooks Pro does not have to be re-purchased year after year. TinyBooks Pro can easily help you with your taxes this […]"},{"link":"https://nmac.to/blog/drivedx/","image":"https://nmac.to/wp-content/uploads/2017/01/DriveDx1.png","title":"DriveDx 1.8.2 – Advanced drive health diagnostic utility","content":"DriveDx is advanced drive health diagnostic and monitoring utility. Save yourself from data loss and downtime that is associated with unexpected drive failures. Don’t worry about losing your important data, music, and photographs.   Unlike most drive utilities, DriveDx does not only monitor the drive’s built-in S.M.A.R.T. status, but also analyzes the changes of all […]"},{"link":"https://nmac.to/blog/treadnauts/","image":"https://nmac.to/wp-content/uploads/2019/01/Treadnauts.png","title":"Treadnauts 1.0 – Funny 2D Casual Action Game","content":"Treadnauts gives competitive platform fighters a kiss of physics finesse. Gracefully pilot your tank through gorgeous arenas to land a deadly shot on your opponents! You’ve got a slew of useful tricks at your disposal, including treads that stick to any wall, boosters for midair hops, zero-friction slides, and rocket jumps for soaring into the […]"},{"link":"https://nmac.to/blog/design-brochures-templates/","image":"https://nmac.to/wp-content/uploads/2017/10/DesiGN-Brochures-Templates.png","title":"Brochures Templates DesiGN 3.0.2 – Brochure templates for Pages","content":"Brochures Templates DesiGN is a top-quality collection of original templates for Apple’s Pages word processor. Whether you’re starting a new business, organizing an event, or trying to give your sales a boost, it will help you.   Every object can be easily recolored, reshaped, moved, or removed. Type or paste your own text, add or […]"},{"link":"https://nmac.to/blog/adobe-captivate/","image":"https://nmac.to/wp-content/uploads/2016/12/Adobe.Captivate.png","title":"Adobe Captivate 2019 11.0.1.266 – An efficient elearning authoring software","content":"Adobe Captivate is designed to be the industry-leading elearning authoring software and allows you to rapidly create and maintain interactive eLearning content.   Import your existing Microsoft PowerPoint content and make it more engaging with rich media, application simulations, branching scenarios, and quizzes.   Easily publish to leading SCORM- and AICC-compliant Learning Management Systems and […]"},{"link":"https://nmac.to/blog/borderlands-goty/","image":"https://nmac.to/wp-content/uploads/2019/01/Borderlands-GOTY.png","title":"Borderlands GOTY 1.0.3 – Co-op Action Shooter Game","content":"    Gearbox Software’s acclaimed sci-fi hit comes to the Mac, complete with all four Add-On packs. Borderlands Game of the Year Edition is a unique hybrid of first person shooter and role-playing game with a super sharp visual style and a compelling four player co-op mode.   Planet Pandora is a sparsely populated wasteland […]"},{"link":"https://nmac.to/blog/bioshock-2/","image":"https://nmac.to/wp-content/uploads/2019/01/BioShock-2.png","title":"BioShock 2 1.3 – Singleplayer FPS Action & Horror Game","content":"Deep within the ruined undersea city of Rapture, your beloved Little Sister, Eleanor, awaits your return. As her Big Daddy, you protected her from a world of insanely selfish adults, now you must shield her again from those who demand that everything must be shared.   Ten years after the events of BioShock, Rapture has […]"}]