[{"link":"https://nmac.to/blog/bumpr/","image":"https://nmac.to/wp-content/uploads/2017/04/Bumpr.png","title":"Bumpr 1.3.6 – Choose the app to open various Web links","content":"Bumpr lets you choose where to open links. Anytime you click on a Web link, a compact, elegant menu pops up right in place and lets you choose which browser to use. Bumpr also works with mail links.   Bumpr is particularly effective if you use more than one browser to run separate Google accounts, […]"},{"link":"https://nmac.to/blog/crypto-against-all-odds/","image":"https://nmac.to/wp-content/uploads/2021/03/Crypto-Against-All-Odds.png","title":"Crypto: Against All Odds 2.3.8 – A tower defense game","content":"Crypto: Against All Odds is a tower defense game, that explores the rise of crypto culture by fusing blockchain security concepts into a stylish gameplay. Discover the world of cryptocurrencies while battling against bugs, hackers, ransomware and other deadly cybersecurity attacks. One of the best hacking meets tower defense game on Steam. Tip: Keep calm […]"},{"link":"https://nmac.to/blog/audiofinder/","image":"https://nmac.to/wp-content/uploads/2020/04/AudioFinder6.png","title":"AudioFinder 6.0.6 – Manage your audio sample library","content":"AudioFinder is an audio asset management system and music production hub. It gathers all the most useful tools in one quick and intuitive application, enabling you to be more creative by handling all the time consuming tasks that slow down your music production.   AudioFinder can build a catalog of every sound on your system, […]"},{"link":"https://nmac.to/blog/webtolayers/","image":"https://nmac.to/wp-content/uploads/2019/06/WebToLayers.png","title":"WebToLayers 1.2.3 – Converts websites to Photoshop documents","content":"WebToLayers converts websites to Photoshop documents. In other words, the app allows you to screenshot webpages by keeping each element in a separated layer. The app will save you lots of time when re-designing or improving existing web pages.   Additional features: Safari extension Custom page size Custom web agent JS Injections   This version […]"},{"link":"https://nmac.to/blog/marble-age-remastered/","image":"https://nmac.to/wp-content/uploads/2021/03/Marble-Age-Remastered.png","title":"Marble Age: Remastered 1.08 – A turn-based historical strategy game","content":"One of the most popular games of Clarus Victoria, Marble Age, is back, better than ever! Your task is to lead a small village at the dawn of Aegean civilization to its glorious future as one of the most powerful Polises – Athens, Corinth, or Sparta.   Together with the citizens, you will have to […]"},{"link":"https://nmac.to/blog/remote-wake-up/","image":"https://nmac.to/wp-content/uploads/2017/08/Remote-Wake-Up1.png","title":"Remote Wake Up 1.4.1 – Remotely switch on every Wake On Lan capable device","content":"Remote Wake Up is a tool that allows you to remotely switch on every Wake On Lan capable device in a network you are connected to. You can also wake up devices over the internet. Additionally Remote Wake Up allows you to reboot, shut down or send other Macs to sleep if they are running […]"},{"link":"https://nmac.to/blog/keymou/","image":"https://nmac.to/wp-content/uploads/2020/11/Keymou.png","title":"Keymou 1.2.9 – Keyboard control of your mouse","content":"Take control of the mouse pointer via the keyboard. Keymo allows you to move the mouse, scroll, click, right-click, and even find the mouse’s onscreen location, all without touching your mouse (or trackpad).   Version 1.2.9: Keymou is now a universal app, built for both Apple silicon and Intel Macs. Resolved some minor user interface […]"},{"link":"https://nmac.to/blog/fury-unleashed/","image":"https://nmac.to/wp-content/uploads/2020/10/Fury-Unleashed.png","title":"Fury Unleashed 1.7.0.2 – A combo-driven roguelite action platformer game","content":"Fury Unleashed was created by combining inspiration from modern roguelite platformers, like Dead Cells and Rogue Legacy, with nostalgic memories of old-school platformer shooters, like Contra and Metal Slug. We have spent five years polishing our creation to make sure that your experience with the game will be as memorable as the aforementioned titles and […]"},{"link":"https://nmac.to/blog/super-mega-mini-party/","image":"https://nmac.to/wp-content/uploads/2021/03/Super-Mega-Mini-Party.png","title":"Super Mega Mini Party 2.6.1 – Many mega mini-games","content":"Compete with players from around the world in hyper casual competitive mini-games or throw a Super Mega Mini Party with friends! 20 challenging multiplayer mini-games. Perfect your skills and earn achievements in solo training mode. Explore Super Mega Mini World as your favorite character. Take your favorite game into a 1v1 battle against other players. […]"},{"link":"https://nmac.to/blog/picture-colorizer/","image":"https://nmac.to/wp-content/uploads/2021/02/Picture-Colorizer.png","title":"Picture Colorizer 2.0.3 – Colorize Black and White Photo","content":"Picture Colorizer is an AI-powered app that colorizes black and white photos, pictures and images automatically. Based on the deep learning technology, Picture Colorizer could help you to convert black & white images to full color and give a new life to your old photos.   How to use Picture Colorizer: Step 1: Run Picture […]"}]