[{"link":"https://nmac.to/blog/pdfpenpro/","image":"https://nmac.to/wp-content/uploads/2021/04/PDFpenPro_13.png","title":"PDFpenPro 13.1 – Advanced PDF toolkit for HTML conversion and more [FIX]","content":"PDFpenPro allows users to edit PDF’s easily. Add text, images and signatures. Fill out PDF forms. Merge or split PDF documents. Reorder and delete pages. Even correct text and edit graphics!   Create fillable forms and tables of content with PDFpenPro!   The Pro version adds three additional features that the regular version does not: […]"},{"link":"https://nmac.to/blog/dxo-viewpoint/","image":"https://nmac.to/wp-content/uploads/2013/05/DxO-ViewPoin3.png","title":"DxO ViewPoint 3.2.0.254 – Spectacular perspective and volume correction","content":"DxO ViewPoint is the indispensable companion to your wide-angle lens, correcting perspectives and easily restoring the natural shapes of the subjects located along image edges. As both a standalone application and as a plugin, it offers simple visual tools for making spectacular corrections, along with advanced controls for unrivaled precision.   Version 3.2.0.254: Release notes […]"},{"link":"https://nmac.to/blog/nxpowerlite/","image":"https://nmac.to/wp-content/uploads/2019/10/NXPowerLite_9.png","title":"NXPowerLite 9.1.2 – Compress files into other formats","content":"NXPowerLite will compress PDF, JPEG, Microsoft PowerPoint and Word files simply and effectively, making them easy to email as attachments. It is especially effective on files that don’t zip well. Optimized files stay in the same format – a PDF remains a PDF. It will look and feel identical to the original, just much smaller. […]"},{"link":"https://nmac.to/blog/ultracompare/","image":"https://nmac.to/wp-content/uploads/2019/12/UltraCompare.png","title":"UltraCompare 22.00.0.5 – Compare files and folders on Mac","content":"Powerful 2-way or 3-way file compare and folder compare, folder sync, Excel file compare, and a lot more.   Sessions With UltraCompare’s session functionality, you can have multiple comparison and merge sessions open in multiple tabs, each only a click away. Each session is like a new instance of UltraCompare, letting your run multiple types […]"},{"link":"https://nmac.to/blog/ithoughtsx/","image":"https://nmac.to/wp-content/uploads/2020/11/iThoughtsX_5.png","title":"iThoughtsX 5.31 – Mind mapping app","content":"iThoughtsX is a mind mapping app for the Mac. It is based upon and fully compatible with iThoughts on iPad and iPhone.   Mindmapping enables you to visually organise your thoughts, ideas and information.   Typical Uses: Course Notes/Revision Project planning Task lists Brainstorming Goal setting WBS Meeting Notes GTD   Import and export many […]"},{"link":"https://nmac.to/blog/010-editor/","image":"https://nmac.to/wp-content/uploads/2014/12/010-Editor8.png","title":"010 Editor 12.0.1 – Professional text and hex editing","content":"010 Editor is a professional-grade text editor and hex editor designed to quickly and easily edit any file or drive on your computer. Combining an easy-to-use interface with a whole range of editing tools, 010 Editor is a valuable tool for anyone working with text or binary files.   One of the most powerful features […]"},{"link":"https://nmac.to/blog/wattagio-manage/","image":"https://nmac.to/wp-content/uploads/2018/04/Wattagio.png","title":"Wattagio 1.12.11 – Manage your MacBook battery health","content":"Wattagio informs you about current battery health and helps to decrease power usage. Flexible settings in application give options to customize your profile to meet your needs.   Features Helps you to keep battery healthy Reads out the raw battery data to give you more precise information Detailed stats & health Information for MacBook’s battery […]"},{"link":"https://nmac.to/blog/disk-diet/","image":"https://nmac.to/wp-content/uploads/2020/02/Disk_Diet_5.png","title":"Disk Diet 5.5.1 – Clean your drive and get more space for your Mac","content":"Trust Disk Diet to safely and easily clean your Mac. Ever had your Mac almost (or completely) run out of disk space? If so, you’ve probably also tried to find out what’s taking up so much space and how to get rid of junk. Sometimes this is easy, although most of the time a lot […]"},{"link":"https://nmac.to/blog/mininote-pro/","image":"https://nmac.to/wp-content/uploads/2016/06/MiniNote.Pro_.png","title":"MiniNote Pro 5.91 – Take notes from the menu bar","content":"MiniNote Pro is an indispensable app and is the easiest piece of software you will ever use. Try it for a day and you’ll be hooked for life! This nifty app sits on your Mac’s menu bar and is available at the click of a button. It is perfect for jotting down a few lines […]"},{"link":"https://nmac.to/blog/jettison/","image":"https://nmac.to/wp-content/uploads/2019/12/Jettison_1.png","title":"Jettison 1.8.4 – Ejects external disks when you put your Mac to sleep","content":"Jettison automatically ejects external disks from your Mac before your computer goes to sleep.   Simplify those last few seconds when you grab your MacBook and run out the door. Just close the lid and Jettison will automatically eject your backup drive, iPod, or whatever is connected so you can safely unplug it. Say goodbye […]"}]