[{"link":"https://nmac.to/blog/xilisoft-video-joiner-2-0-1/","image":"https://nmac.to/wp-content/uploads/2015/01/Xilisoft.Video_.Joiner.png","title":"Xilisoft Video Joiner 2.0.1 – Join, merge and customize video files","content":"Xilisoft Video Joiner for Mac is an advanced software that will allow you to join and merge up to 30 different kinds of formats of video like AVI, MPEG, MP4, WMV, 3GP, H.264, MOV and many more.   Xilisoft Video Joiner for Mac is also a video editor to customize your video joins by adding […]"},{"link":"https://nmac.to/blog/stuffit-deluxe-16-0/","image":"https://nmac.to/wp-content/uploads/2014/02/StuffIt-Deluxe.png","title":"StuffIt Deluxe 16.0 – File compression tool","content":"StuffIt Deluxe packages your files and sends them where you want them as easily as drag-and-drop. Need security? Destinations uses strong AES 256-bit encryption. Destinations combines DropStuff and StuffIt Expander into one powerful tool. It’s an expansion tool that supports nearly any file type you download from the Internet or receive as an attachment. Destinations […]"},{"link":"https://nmac.to/blog/sapiens-1-3/","image":"https://nmac.to/wp-content/uploads/2015/01/Sapiens.png","title":"Sapiens 1.3 – Application launcher","content":"Sapiens is an application launcher, it helps you access all the applications in your Mac. Sapiens is clever because it learns from you, so unlike any other launcher it predicts the applications you will likely need and offers a visualization of this prediction in an intuitive way. Sapiens is activated by moving the mouse in […]"},{"link":"https://nmac.to/blog/macdive-2-3-6/","image":"https://nmac.to/wp-content/uploads/2014/03/MacDive.png","title":"MacDive 2.3.6 – Log scuba dives directly from your dive computer","content":"MacDive is your digital logbook for downloading and logging your dives right from your dive computer! Supporting over 50 models of computer from Atomic Aquatics, Aeris, Mares, Oceanic, Suunto, and more, it’s back for version 2!   Version 2 provides a brand-new interface, bringing with it smart divelogs, iOS syncing, improved gear management, maps, and […]"},{"link":"https://nmac.to/blog/imuscle-3-9-6/","image":"https://nmac.to/wp-content/uploads/2014/05/iMuscle.png","title":"iMuscle 3.9.6 – Everything you need to plan and track your fitness program","content":"iMuscle is a highly visual, award-winning health and fitness app that has everything you need to plan and track your fitness program.   iMuscle provides users with the ability to zoom into an area on our 3D human body and tap on a muscle to reveal exercises and stretches targeted to the development and/or rehabilitation […]"},{"link":"https://nmac.to/blog/outland/","image":"https://nmac.to/wp-content/uploads/2014/12/Outland.png","title":"Outland 1.0 – Ambitious 2D adventure game","content":"Outland is a fast-paced, dynamic platformer where the player uses powers of light and dark in an epic journey to save the world from forces of chaos.   In-between Balance and Chaos stands one man, whose efforts will either bridge the ancient divide or doom the world to destruction. Outland is an ambitious 2D-platformer with […]"},{"link":"https://nmac.to/blog/crushftp-professional-7-2/","image":"https://nmac.to/wp-content/uploads/2014/12/CrushFTP.png","title":"CrushFTP Professional 7.2 – Full-featured file server","content":"CrushFTP is a powerful file server well ahead of its time. Not only does it handle serving FTP, but it also does SFTP (SSH FTP), FTPS (FTP over SSL), HTTP, HTTPS, WebDAV, and WebDAV SSL. From that list you can see it is serious about security and encryption.   CrushFTP Professional a allows an unlimited […]"},{"link":"https://nmac.to/blog/dockphone-1-0/","image":"https://nmac.to/wp-content/uploads/2014/12/DockPhone.png","title":"DockPhone 1.0 – Make iPhone calls from the Desktop","content":"DockPhone lets you make calls right from your Mac.   Keep it in your pocket…  Starting with iOS 8 and OS X Yosemite, your Mac and your iPhone perfectly work together. DockPhone for OS X is the missing piece to conveniently use your Mac as your phone.   Just dictate whom you want to call…  […]"},{"link":"https://nmac.to/blog/window-tidy-2-01/","image":"https://nmac.to/wp-content/uploads/2014/12/Window.Tidy_.png","title":"Window Tidy 2.01 – Manage windows with ease","content":"Window Tidy lets you quickly and easily arrange your application windows on your Desktop onto a customizable grid using nothing but drag and drop! When you want to reposition a window, there are no hot-keys to remember or menus to click, you simply drag and drop the window onto customisable pop-up Layout Icon and it […]"},{"link":"https://nmac.to/blog/tonality-pro-1-1-3/","image":"https://nmac.to/wp-content/uploads/2014/08/Tonality-Pro.png","title":"Tonality Pro 1.1.3 – Professional-grade monochrome image editor","content":"Tonality Pro gives you the power to create stunning and dramatic black & white images. This is a complete monochrome image editor with more than 150 one-click style presets, totally unique creativity tools, stackable layers, adjustable brushes, RAW file support and so much more will blow you away.   Features: Professional image quality with a […]"}]