[{"link":"https://nmac.to/blog/memoires/","image":"https://nmac.to/wp-content/uploads/2020/08/Memoires.png","title":"Memoires 5.0.0 – Daily journal with style","content":"Memoires is the best way to keep your journal on OS X. Choose a day and write as many notes as you like. Then browse your journal by day using calendar, or search for notes using the instant-search feature.   Memoires has a gorgeous user interface. Even though it’s a powerful application, it is very […]"},{"link":"https://nmac.to/blog/screen-record-it/","image":"https://nmac.to/wp-content/uploads/2021/01/Screen-Record-It.png","title":"Screen Record It 2.7 – Record screen video with audio","content":"A useful app that performs well in recording screen and sound activity. Record video at full screen or any size (partial screen or single-app window) Record screen video with audio Record the screen as high quality video Export video to MOV Drag mouse to select area to be recorded   Version 2.7: Release notes were […]"},{"link":"https://nmac.to/blog/jaksta-deluxe/","image":"https://nmac.to/wp-content/uploads/2022/03/Jaksta-Deluxe-Bundle.png","title":"Jaksta Deluxe 3.0.2 – Convert Almost Anything","content":"Jaksta Deluxe is a bundle of 4 Powerful Products   Jaksta Media Recorder Rip Video and Music from 100,000+ sites! Video Downloader Music Downloader iTunes Friendly Automatic Conversions Fast – upto 10x faster than playback Easy – Captures as you watch or listen   Jaksta Music Recorder Download from streaming music sites! YouTube, Pandora, Grooveshark […]"},{"link":"https://nmac.to/blog/aimersoft-video-converter/","image":"https://nmac.to/wp-content/uploads/2017/01/Aimersoft-Video-Converter-Ultimate10.png","title":"Aimersoft Video Converter Ultimate 11.6.7.1 – Convert video files to multiple formats","content":"Why Choose Aimersoft Video Converter Ultimate? It is an all-in-one video converter, video editor, online video down loader, DVD ripper and DVD burner.   Convert Video/Audio Convert HD and SD videos. Convert downloaded or homemade videos. Extract audio from videos and convert them to popular audio formats for playback on your music player. Fetch and […]"},{"link":"https://nmac.to/blog/animated-wallpapers/","image":"https://nmac.to/wp-content/uploads/2021/01/Animated-Wallpapers.png","title":"Animated Wallpapers 1.0.5 – Animated scenes on your desktop","content":"Animated Wallpapers lets you feel the breeze of your desktop, your desktop is not boring anymore! Select from many HD themes: Nature, Space and more. Show/Hide Desktop Icons : it can be used as a curtain to hide desktop icons ,in case you are having a work presentation and you want to hide all the […]"},{"link":"https://nmac.to/blog/desktop-stickers/","image":"https://nmac.to/wp-content/uploads/2022/03/Desktop-Stickers.png","title":"Desktop Stickers 1.3 – Positive Daily Affirmations","content":"Your thoughts are the source of your emotions and mood. The conversations you have with yourself can be destructive or beneficial. Most people need to learn how to cultivate positive thoughts and dispel the negative ones.   Self-talk can enhance your performance and general well-being. For example, research shows self-talk can help athletes with performance. […]"},{"link":"https://nmac.to/blog/maxcommander/","image":"https://nmac.to/wp-content/uploads/2021/06/MaxCommander.png","title":"MaxCommander 2.4.3 – Dual-Panel File Manager","content":"Manage files as always – using two panels and the keyboard (and sometimes the mouse). Introducing the MaxCommander application.   MaxCommander is all you need to manage files on your local drives and remote file servers. The app supports the following operations: Browsing folders Previewing files with QuickLook Editing files Copying, moving, deleting, renaming files […]"},{"link":"https://nmac.to/blog/slidepad/","image":"https://nmac.to/wp-content/uploads/2019/08/Slidepad.png","title":"Slidepad 1.3.2 – A Slide Over browser on your Mac","content":"By slide in and slide out, Slidepad brings iPad style multitasking to your Mac. Using Slidepad is as easy as using your dock.   A simple sidebar to switch between apps Slidepad borrowed the concept of sidebar from Franz and Station. It is much smoother than tabs, and it helps you quickly switch between different […]"},{"link":"https://nmac.to/blog/endurance/","image":"https://nmac.to/wp-content/uploads/2016/01/Endurance.png","title":"Endurance 3.2 – Helps your Mac battery by 20%","content":"Endurance helps your Mac run 20% longer.   No matter how good your battery is, everyone could use a little more battery power! Endurance is an app that helps your Mac run longer. Endurance runs in the background and when your battery level drops to a certain level, it automatically starts adjusting your settings and […]"},{"link":"https://nmac.to/blog/image-optimizer-pro/","image":"https://nmac.to/wp-content/uploads/2022/03/Image_Optimizer_.png","title":"Image Optimizer 2.6 – Lossless Photo Compressor","content":"Image Optimizer is an image (•PNG, JPG, TIF, GIF, BMP, PSD, HEIC•) lossless compression software.   Reduce file size by 75%-98% with lossless compression   Convert picture to PNG, TIF, GIF   Main Functions Support lossless compression of multiple images Support drag and drop pictures & folders to automatically identify images Support batch lossless compression […]"}]