[{"link":"https://nmac.to/blog/airserver/","image":"https://nmac.to/wp-content/uploads/2017/10/AirServer7.png","title":"AirServer 7.2.6 – Stream audio, video and photos via AirPlay","content":"AirServer is an application that adds AirPlay/AirTunes audio, video, photo, slideshow, and mirroring receiving capabilities to your Mac. With AirServer you can now receive audio, videos, photos, or slideshows from any AirPlay-compatible application running on your Mac, PC, or iOS device.   Version 7.2.6: Fixed protocol compatibility with Oculus update 18. Improved Google Cast discovery. […]"},{"link":"https://nmac.to/blog/launch-bar/","image":"https://nmac.to/wp-content/uploads/2020/07/Launch-Bar.png","title":"Launch Bar 1.0.4 – Launch & Browse from Menu Bar","content":"Launch apps and open files with just one click in the system menu bar. Quickly browse folders without leaving a trail of opened windows. Customize the bar by adding your favorite apps, files and folders as icons or menu items. Launch Bar eases and speeds up your workflow, by combining the most essential features of […]"},{"link":"https://nmac.to/blog/comparemerge/","image":"https://nmac.to/wp-content/uploads/2020/07/CompareMerge.png","title":"CompareMerge 2.13 – Comparison and merging files tool","content":"CompareMerge is a software tool for file comparison and merging text-like files.   It is useful for determining what has changed between versions, and then merging changes between versions.   Functions of the application: SUPPORT MULTI-LANGUAGES: English Deutsch Français 日本語 한국어 Español Português Čeština Dansk Suomi Italiano Nederlands Norsk Polski Русский Svenska ไทย Türkçe Tiếng […]"},{"link":"https://nmac.to/blog/wallpaper-wizard/","image":"https://nmac.to/wp-content/uploads/2017/11/Wallpaper-Wizard.png","title":"Wallpaper Wizard 2.2.0 – Access over 100,000 desktop backgrounds","content":"Wallpaper Wizard allows you to choose from from hundreds of curated desktop pictures in HD, and the app will set you a new background every day, hour, or minute. Finally, you can spare yourself the pain of sifting through Google Images – with Wallpaper Wizard 2, you’ll have enough fresh wallpapers for your Mac’s entire […]"},{"link":"https://nmac.to/blog/pine/","image":"https://nmac.to/wp-content/uploads/2019/10/Pine.png","title":"Pine patch 10 – An open-world action adventure game","content":"Pine is an open world action adventure simulation game. Set in the beautiful world of Albamare, you take on the role of Hue, a smart young adult who will have to explore, trade, and fight his way through a vibrant world filled with creatures much smarter than humans.   Their Story Becomes Yours As you’re […]"},{"link":"https://nmac.to/blog/lightwave-3d/","image":"https://nmac.to/wp-content/uploads/2014/05/LightWave-3D2019.png","title":"LightWave 3D 2020.0.2 – 3D animation software","content":"LightWave 3D is the most complete and flexible software solution for 3D graphics and animation.   LightWave 3D is versatile enough to make the transition to and from all kinds of projects. Proven for years in television, film, and games, LightWave 3D is also being used to create graphics for print, web, industrial design, architecture, […]"},{"link":"https://nmac.to/blog/beyond-compare/","image":"https://nmac.to/wp-content/uploads/2017/05/Beyond-Compare4.png","title":"Beyond Compare 4.3.5.24893 – Visually compare and merge files and folders","content":"Beyond Compare allows you to quickly and easily compare your files and folders. By using simple, powerful commands you can focus on the differences you’re interested in and ignore the rest. You can then merge the changes, synchronize your files, and generate reports for your records. You can compare entire drives and folders at high […]"},{"link":"https://nmac.to/blog/catalina-cache-cleaner/","image":"https://nmac.to/wp-content/uploads/2019/10/Catalina-Cache-Cleaner.png","title":"Catalina Cache Cleaner 15.0.5 – Clear caches, access hidden OS X settings, and more","content":"Catalina Cache Cleaner is an award-winning general-purpose tool for macOS X. CCC makes system maintenance simple with an easy point-and-click interface to many macOS X functions. Novice and expert users alike will appreciate the powerful toolset CCC provides. Catalina Cache Cleaner is one of the world’s leading maintenance tools, with millions of downloads around the […]"},{"link":"https://nmac.to/blog/simlab-composer/","image":"https://nmac.to/wp-content/uploads/2019/04/SimLab-Composer.png","title":"Simlab Composer 10.10 – Import 3D models from many standard file formats","content":"SimLab Composer supports importing 3D models from many of the standard file formats, including: SketchUp, Rhino, STEP, IGES, Collada, 3D PDF, 3D XML, FBX, Obj, 3DS, DXF, U3D, STL, and DWG. 3D models and scenes can be exported to the following files formats, OBJ, FBX, Collada, STL, U3D, BIP and OSG.   Building 3D Scenes: […]"},{"link":"https://nmac.to/blog/the-last-sky/","image":"https://nmac.to/wp-content/uploads/2020/07/The-Last-Sky.png","title":"The Last Sky 1.0 – Story Rich Adventure & Puzzle Game","content":"The Last Sky is a narrative puzzle adventure about life, loss, and love. Through its meditative, dreamlike atmosphere you are invited to embark on a journey into Jake’s mind, contemplating the opposites of life & death, fear & love, and loss & hope.   A visual odyssey about the beauty and sorrow of life, explore […]"}]