[{"link":"https://nmac.to/blog/certificates-studio-1-3/","image":"https://nmac.to/wp-content/uploads/2017/06/Certificates-Studio.png","title":"Certificates Studio 1.3 – Templates for Pages","content":"Certificates Studio – Templates for Pages is an excellent collection of over 140 templates for unique diplomas, testimonials, and certifications. Whether you want to issue training accreditations, award your best employees, or congratulate your boss on being the best boss ever, Graphic Node’s certificates will help you do that with skill and style.   Every […]"},{"link":"https://nmac.to/blog/drifting-lands-1-0/","image":"https://nmac.to/wp-content/uploads/2017/06/Drifting-Lands.png","title":"Drifting Lands 1.0 – An hybrid of classical horizontal shoot’em’up game","content":"That’s what is Drifting Lands in essence: first and foremost an action-RPG (Hack’n’Slash or however you may call this). Then and only then a different kind of shoot’em’up, accessible to a wider audience than usual.   Drifting Lands main characteristics are: randomy generated missions for replayability 100 levels of difficulty to climb with your skill […]"},{"link":"https://nmac.to/blog/cold-waters-1-0/","image":"https://nmac.to/wp-content/uploads/2017/06/Cold-Waters.png","title":"Cold Waters 1.0 – Spiritual Successor to the Microprose Classic “Red Storm Rising”","content":"After tracking a Soviet landing force bound for Iceland it is time to plan your attack. Do you silently close in to torpedo the landing ships and escape during the resulting chaos? Or strike with long-range missiles but risk counterattack from the enemy escorts? Have you detected them all, could another submarine be out there […]"},{"link":"https://nmac.to/blog/lights-out-3-1-4/","image":"https://nmac.to/wp-content/uploads/2017/06/Lights-Out.png","title":"Lights Out 3.1.4 – Expands the functionality of Energy Saver","content":"Lights Out enables hot corners to put your Mac to sleep or keep it awake. Lights Out can set sleep on or off for individual applications. Lights Out cures Energy-Saver insomnia.   Many software packages, scanners, and peripherals can interfere with your Mac’s normal sleeping patterns. Lights Out offers a secondary idle timer to put […]"},{"link":"https://nmac.to/blog/scrollstickies-3-28/","image":"https://nmac.to/wp-content/uploads/2016/07/ScrollStickies.png","title":"ScrollStickies 3.28 – Resizable Reminders, notes, clippings stickies on your desktop","content":"A sticker/post it app with a teleprompter-like text scrolling mode!   Leave as many colorful, resizable stickies on your desktop with reminders, notes, clippings as you want. Contents are automatically saved with backups and can be restored at startup. Includes a very useful teleprompter mode that allows single line scrolling text.   Version 3.28: bug […]"},{"link":"https://nmac.to/blog/denied-1-4-2/","image":"https://nmac.to/wp-content/uploads/2016/11/Denied.png","title":"Denied 1.4.2 – Skip Terrible Music","content":"Denied sees what you’re playing in Spotify and iTunes and automatically skips songs that you dislike.   Tracks can be skipped by their artist, title, album, whether they contain explicit lyrics*, or if you’ve heard them before in the past few hours.   Denied allows you to truly enjoy Top 40 playlists, the Christmas season, […]"},{"link":"https://nmac.to/blog/bitcoin-monitor-2-0-2/","image":"https://nmac.to/wp-content/uploads/2017/06/Bitcoin-Monitor.png","title":"Bitcoin Monitor 2.0.2 – Live updates of Bitcoin conversion rate in menu bar","content":"Bitcoin Monitor provides live updates of the Bitcoin conversation rate on your menu bar. Additional information is included in Bitcoin Monitor’s popup. Price and market-depth information is provided by mtgox.com (price information is requested every minute, market depth every 20 minutes).   Features Price-history chart Market-depth chart Currencies: USD, EUR, JPY, GBP, AUD, CAD, CHF […]"},{"link":"https://nmac.to/blog/help-crafter-2-0-4/","image":"https://nmac.to/wp-content/uploads/2017/06/Help-Crafter.png","title":"Help Crafter 2.0.4 – An essential tool for the Mac developer for authoring help content","content":"Help crafter’s full featured word processor includes support for tables, lists, resizable images and more. Style based editing allows you to maintain a consistent look across pages, and make global changes easily.   Available output formats include Apple Help Bundle for Mac applications, Html, print and PDF.   Apple Help Bundle is fully indexed, and […]"},{"link":"https://nmac.to/blog/posterist-1-0-6/","image":"https://nmac.to/wp-content/uploads/2017/06/Posterist.png","title":"Posterist 1.0.6 – Create gorgeous collages, posters and cards","content":"Posterist makes creating exceptional collages easier than ever! You can make gorgeous collages, posters, and cards from your favorite photos in a matter of minutes.   Posterist makes the collage creation effortless. Just choose a template from 6 template styles of Modern, Classic, Art, Holiday, 3D, and Creative, totally 140+ stunning templates to get started. […]"},{"link":"https://nmac.to/blog/aaaaa-for-the-awesome-1-0/","image":"https://nmac.to/wp-content/uploads/2014/01/AaaaaAAaaaAAAaaAAAAaAAAAA-for-the-Awesome.png","title":"Aaaaa AAaaa AAAaa AAAAa AAAAA !!! for the Awesome 1.0 – Dive from a skyscraper. AWESOME!","content":"Aaaaa! took place in an alternate 2011, where BASE jumpers leapt from the skies and executed stunts around the floating buildings of Upper Boston. This semi-sequel picks up six years later — the sport’s been outlawed, and you’re jumping as a form of protest. High in Earth’s stratosphere, you’ll thread a path through the rotating […]"}]