[{"link":"https://nmac.to/blog/email-address-extractor/","image":"https://nmac.to/wp-content/uploads/2021/01/eMail_Address_Extractor_3.png","title":"eMail Address Extractor 3.5.9 – Get email addresses from text files","content":"eMail Address Extractor allows you to extract valid email addresses from virtually any kind of text file. No configuration required, it just works! Select your output file format, then drop data files onto eMail Address Extractor to quickly produce a list of all valid email addresses with no duplicates. Easily retrieve addresses from your entire […]"},{"link":"https://nmac.to/blog/colorwell/","image":"https://nmac.to/wp-content/uploads/2020/12/ColorWell_7.png","title":"ColorWell 7.3.4 – Instant access to the OS X color wheel","content":"ColorWell provides instant access to the macOS Color Wheel by configuring hotkeys. Generate unlimited Color Palettes with quick access to all color information, and on the fly code generation for app development. Easily create Color Palettes from any source image(s) via drag and drop.   ColorWell is also great for quick conversion of hex / […]"},{"link":"https://nmac.to/blog/xliff-editor/","image":"https://nmac.to/wp-content/uploads/2020/10/Xliff_Editor_2.png","title":"Xliff Editor 2.9.8 – Xcode localization made easy","content":"Xliff Editor provides the easiest way of editing your XLIFF files. No more messing around with the XML format, or worrying about file corruption. Xliff Editor includes full search support, handy keyboard shortcuts, and even basic read support for SDLXliff files!   XLIFF files are based on the standard XML format, and are used specifically […]"},{"link":"https://nmac.to/blog/webscraper/","image":"https://nmac.to/wp-content/uploads/2017/11/WebScraper.png","title":"WebScraper 4.15.3 – Scan and output website data as CSV or JSON [FIX]","content":"WebScraper uses the Integrity v6 engine to quickly scan a website, and can output the data (currently) as CSV or JSON. Easy to scan a site – just enter the starting URL and press “Go” Easy to export – choose the columns you want Plenty of extraction options, including HTML elements with certain classes or […]"},{"link":"https://nmac.to/blog/hides/","image":"https://nmac.to/wp-content/uploads/2020/01/Hides_5.png","title":"Hides 5.6.1 – Keep a squeaky-clean workspace","content":"Hides allows you to effortlessly clear your desktop in one quick keystroke to quickly hide sensitive information. Enable Focus Mode, to focus on the task at hand. What is Focus Mode? Focus Mode will hide all open applications automatically except the one you’re currently working in! You have no excuse to procrastinate. Once enabled, Focus […]"},{"link":"https://nmac.to/blog/invisible/","image":"https://nmac.to/wp-content/uploads/2020/01/Invisible_2.png","title":"Invisible 2.5.7 – Easily hide your personal files","content":"Invisible is the quickest way to keep personal documents away from unwanted eyes. Drop files onto Invisible to instantly hide them from view, and make them visible again just as easily with the click of a button. All your private files are kept safely out of view, and password-protected for even greater peace-of-mind.   Keeping […]"},{"link":"https://nmac.to/blog/usbclean/","image":"https://nmac.to/wp-content/uploads/2020/12/USBclean_3.png","title":"USBclean 3.6.5 – Keep your thumb drives free from annoying junk files","content":"USBclean quickly and easily removes all those pesky junk and ghost files from your external Windows formatted USB drives. .DS_Store, Thumbs.db, .Spotlight, and trashes files take up precious space, and can cause issues on some devices. Remove them all quickly and easily with USBclean. Configure USBclean the way you want! Remove files by dragging your […]"},{"link":"https://nmac.to/blog/classic-color-meter/","image":"https://nmac.to/wp-content/uploads/2022/01/Classic_Color_Meter_2.png","title":"Classic Color Meter 2.1.1 – An enhanced color meter replacement","content":"Classic Color Meter is a enhanced color meter replacement with added functionality:   Display modes RGB percentage RGB decimal RGB hexadecimal Hue/Saturation/Brightness (HSB) Hue/Saturation/Lightness (HSL) Y’PbPr and Y’CbCr CIE 1931, CIE 1976, CIE LAB, and Tristimulus values Commands Lock cursor position / X axis / Y axis Adjust magnification (1x/2x/4x/8x) Adjust aperture size Show/hide cursor […]"},{"link":"https://nmac.to/blog/conceptdraw-office/","image":"https://nmac.to/wp-content/uploads/2017/08/ConceptDraw-Office.png","title":"ConceptDraw Office 8.0.0.5 – Intelligent approach to organization of information flow in business","content":"ConceptDraw Office is the comprehensive toolset aimed at helping knowledge workers in businesses of any size to streamline daily work and to increase competitive edge with intelligent approach to organization of information flow in business processes.   Features: ConceptDraw PRO: professional business-graphics package, excellent for CAD floor-plan drawings and more ConceptDraw MINDMAP: business-productivity tool ConceptDraw […]"},{"link":"https://nmac.to/blog/my-metronome/","image":"https://nmac.to/wp-content/uploads/2018/11/My-Metronome.png","title":"My Metronome 1.3.3 – Advanced metronome app for mac","content":"My Metronome is the perfect practice tool for every person who is fond of music. It was created by professional musicians and it lets you feel a real metronome as close as it could ever be.   PRECISE INSTRUMENT FOR MUSICIANS Very steady tempo: ranges from 10 to 500 BPM (beats per minute) Flexible time […]"}]