[{"link":"https://nmac.to/blog/yemuzip-246/","image":"https://nmac.to/wp-content/uploads/2013/12/icon.175x175-7525.jpg","title":"YemuZip 2.4.6 – Easy-to-use Zip compression utility","content":"YemuZip is a simple, no-frills, easy-to-use application for making ZIP files. Unlike the built-in compress function, YemuZip lets you choose between preserving Mac specific metadata and making clean PC-friendly ZIP files. YemuZip also includes convenience like the ability to zip straight into a new email.   WHAT’S NEW Version 2.4.6: YemuZip is now 64-bit and […]"},{"link":"https://nmac.to/blog/audiorefurb-43/","image":"https://nmac.to/wp-content/uploads/2013/12/30011.jpg","title":"AudioRefurb 4.3 – Sound enhancer for audio files","content":"AudioRefurb allows you to enhance the sound quality of your audio files and apply numerous audio filters such as distortion, delay, reverb, etc. A 31-band graphic equalizer allows very detailed control of the sound of your audio files. All alterations can be exported to new audio files. Multiple audio control panels to allow you to improve […]"},{"link":"https://nmac.to/blog/imagelobe-55/","image":"https://nmac.to/wp-content/uploads/2013/12/26856.jpg","title":"ImageLobe 5.5 – Includes more than 40 visual effects for images","content":"ImageLobe allows you to easily apply powerful visual effects to your images. It uses new Quartz Composition effects that are built into OS X. Over 40 sophisticated visual effects available. Simply drag an image onto the app, select an effect, and then drag the image back out to save it. It’s automatically expandable: when Apple […]"},{"link":"https://nmac.to/blog/comic-collector-551/","image":"https://nmac.to/wp-content/uploads/2013/07/Comic-Collector.png","title":"Comic Collector 5.5.1 – Catalog and organize comics","content":"Comic Collector catalogs your comics automatically, no typing. Just type the series name and select the issues you own to download all data from our online Collectorz.com Comic Database, including publisher, publication date, creators, character, genre and the cover. Browse your collection by series, publisher, artist, etc., or use the Image View to view your […]"},{"link":"https://nmac.to/blog/movie-chapterizer-54/","image":"https://nmac.to/wp-content/uploads/2013/12/23322.png","title":"Movie Chapterizer 5.4 – Add chapter names to your movies","content":"MovieChapterizer provides an easy way to add chapter names into movies you can view with QuickTime Player. Use MovieChapterizer to add chapter names to numerous points in your movies by simply moving the playhead slider and entering chapter names wherever you want. Then open the movie in QuickTime Player and the chapter popup button allows you […]"},{"link":"https://nmac.to/blog/soho-organizer-935/","image":"https://nmac.to/wp-content/uploads/2013/12/1549.jpg","title":"SOHO Organizer 9.3.5 – Includes SOHO Organizer, SOHO Notes, and SOHO Print Essentials","content":"SOHO Organizer is the official successor to Personal Organizer and Group Organizer and represents a 100% Cocoa rewrite of the former products. This means SOHO Organizer presents a first-class Mac OS X experience complete with all the features Mac OS X users expect: Aqua interface, Unicode compliance, built-in spell checking, Service support, etc. Finally, the […]"},{"link":"https://nmac.to/blog/lights-out-313/","image":"https://nmac.to/wp-content/uploads/2013/12/Lights_Out.175x175-75.jpg","title":"Lights Out 3.1.3 – Expands the functionality of Energy Saver","content":"Lights Out enables hot corners to put your Mac to sleep or keep it awake. Lights Out can set sleep on or off for individual applications. Lights Out cures Energy-Saver insomnia.Many software packages, scanners, and peripherals can interfere with your Mac’s normal sleeping patterns. Lights Out offers a secondary idle timer to put your Mac […]"},{"link":"https://nmac.to/blog/spotlife-107/","image":"https://nmac.to/wp-content/uploads/2013/12/DesktopCalApp.175x175-75.jpg","title":"Spotlife 1.0.7 – Desktop-based calendar viewer","content":"Spotlife is the fastest, easiest way to view the important happenings in your life.   Spotlife puts your calendar directly on your desktop, so it’s always available to you. Press a keyboard shortcut at any time from any application, and the Desktop Calendar will zoom forward above all other windows — now you’ll truly be […]"},{"link":"https://nmac.to/blog/socialite-154/","image":"https://nmac.to/wp-content/uploads/2013/12/Socialite.175x175-75.jpg","title":"Socialite 1.5.4 – Creates a single interface for multiple social websites","content":"Socialite is a revolutionary social application. It seamlessly integrates many social websites, including Flickr, Facebook, Twitter, Reddit, RSS and Google Reader. It allows you to interact with them and receive notifications, all from a stunning user interface. WHAT’S NEW Version 1.5.4: Fixes Twitter search following Twitter API 1.1 changes Removes support for adding new Google […]"},{"link":"https://nmac.to/blog/actionify/","image":"https://nmac.to/wp-content/uploads/2013/12/Icon.175x175-755.jpg","title":"Actionify 1.0.5 – Efficient Task Manager","content":"Actionify is a clean, simple and efficient Task Manager, inspired by Getting Things Done™ (GTD). It has been designed to free your mind by organizing your Tasks for you. Actionify automatically categorizes all your Tasks into Focus Lists to help you stay on top of your work load.   Focus Lists allow you to see quickly […]"}]