[{"link":"https://nmac.to/blog/masquerade-1-3-0/","image":"https://nmac.to/wp-content/uploads/2016/08/Masquerade.png","title":"Masquerade 1.3.0 – Mask, hide and cover parts of your desktop","content":"Mask, hide and cover parts of your desktop, so to only see a certain area while the rest is hidden to your eyes. Use Masquerade App to mask parts on your screen for better focus or any other reason – hide away all clutter you don’t want to see.   Freely resizable mask Adjustable mask […]"},{"link":"https://nmac.to/blog/anymp4-avchd-converter-6-2-13/","image":"https://nmac.to/wp-content/uploads/2016/08/AnyMP4-AVCHD-Converter.png","title":"AnyMP4 AVCHD Converter 6.2.13 – MTS and M2TS video converter","content":"AnyMP4 AVCHD Converter lets you convert AVCHD video MTS and M2TS to any popular video formats like MKV, MP4, MOV, M4V, AVI, MPEG, WMV, FLV, and WebM. Thus importing MTS and M2TS file to Final Cut Pro, iMovie, and Avid Media Composer and watching AVCHD video on any digital device like iPad, iPhone, iPod and […]"},{"link":"https://nmac.to/blog/browserism-2-2-1/","image":"https://nmac.to/wp-content/uploads/2016/08/Browserism.png","title":"Browserism 2.2.1 – Easily switch your default browser","content":"Browserism is a little app that helps you quickly switch your Mac’s default web browser. Out of the box it supports Safari, Chrome, Firefox, and Opera. You can add up to 4 additional browsers as well.   Use a different browser at work than you do at home? Browserism can schedule your work browser to […]"},{"link":"https://nmac.to/blog/wi-fi-speedtest-2-1/","image":"https://nmac.to/wp-content/uploads/2016/08/Wi-Fi-SpeedTest.png","title":"Wi-Fi SpeedTest 2.1 – Test and troubleshoot your wifi network","content":"Wi-Fi SpeedTest is available on Mac OS X and iOS. It will allow you to test and troubleshoot your wifi network. It will be very useful when you want to test bandwidth of your wifi, ethernet or mixed network, but your internet connection is too slow(for example 10 Megabits per second), and your router can […]"},{"link":"https://nmac.to/blog/cloudmagic-email-8-6-51/","image":"https://nmac.to/wp-content/uploads/2016/01/CloudMagic.png","title":"CloudMagic Email 8.6.51 – One app for all of your email accounts","content":"CloudMagic is the perfect app to handle your email accounts.   Instant push notifications for ALL types of email accounts: Gmail, Exchange, Yahoo, Outlook, iCloud, Google Apps, Office 365, IMAP – you name it! Supports all versions of Exchange: ActiveSync (EAS), EWS and IMAP. Handoff: Effortlessly hand off what you’re doing on iPhone, iPad or […]"},{"link":"https://nmac.to/blog/mighty-no-9-1-0/","image":"https://nmac.to/wp-content/uploads/2016/08/Mighty-No-9.png","title":"Mighty No. 9 1.0 – A 2D Side-scrolling Action game","content":"Mighty No. 9 is a Japanese 2D Side-scrolling Action game that takes the best elements from 8 and 16-bit classics that you know and love and transforms them with modern tech, fresh mechanics, and fan input into something fresh and amazing!   You play as Beck, the 9th in a line of powerful robots, and […]"},{"link":"https://nmac.to/blog/world-clock-1-3-2/","image":"https://nmac.to/wp-content/uploads/2015/04/World.Clock_.png","title":"World Clock 1.3.2 – International time simplified","content":"World Clock is a simple and powerful world clock.   Features: Add cities and timezones like GMT and UTC with a few key strokes. Convert international time with a drag of a cursor. Schedule international calls and meetings and add them to your calendar. Add Interactive Widget to your Today’s View (OSX Yosemite only): quickly […]"},{"link":"https://nmac.to/blog/word-air-1-6-2/","image":"https://nmac.to/wp-content/uploads/2016/08/Word-Air.png","title":"Word Air 1.6.2 – for Microsoft Word Edition & Open Office Format","content":"Word Air is a beautiful, easy-to-use text editor that is designed to make writing convenient, efficient and comfortable. Word Air is ease, fast and uncluttered. It starts up quickly, has a live word count, easy on the eyes and you can export all the common formats: .pdf, .rtf, .doc, .txt and more .   Features […]"},{"link":"https://nmac.to/blog/plisterine-3-0-1/","image":"https://nmac.to/wp-content/uploads/2016/08/Plisterine3.png","title":"Plisterine 3.0.1 – Easily create launch agents","content":"Plisterine is an application that will help you easily create launch agents.   What are launch agents, you ask? Launch agents are magic little files with which you can automate the launching/running of applications and scripts when certain conditions you define are met.   With Plisterine you can create launch agents that: launch an application/script: […]"},{"link":"https://nmac.to/blog/iphone-data-recovery-6-8-0-0/","image":"https://nmac.to/wp-content/themes/nmac/images/placeholder-320.png","title":"iPhone Data Recovery 6.8.0.0 – Recover all what you want back on iPhone","content":"There are various situations when you just simply need to save personal messages and important contacts from your phone to your PC. However, due to virus attacks or phone damages, you might lose your sensitive data.   Tenorshare iPhone Data Recovery is a comprehensive and reliable piece of software geared toward users who need to […]"}]