[{"link":"https://nmac.to/blog/msg-converter-pro-1-5-2/","image":"https://nmac.to/wp-content/uploads/2016/10/Msg-Converter-Pro.png","title":"Msg Converter Pro 1.5.2 – Easily convert Microsoft Outlook .msg","content":"Msg Converter Pro: A simple, efficient way to batch converts Microsoft Outlook .msg files into EML, VCF, HTML, PDF, RTF and TXT files.   KEY FEATURES: Support contact and e-mail message type input. Support EML, VCF, HTML, PDF, RTF and TXT ouput. Batch conversion at lightning fast speed. Easy to use, simply Drag & Drop […]"},{"link":"https://nmac.to/blog/data-rescue-4-3-1/","image":"https://nmac.to/wp-content/uploads/2014/03/Data.Rescue.png","title":"Data Rescue 4.3.1 – Powerful hard drive data recovery solution","content":"Data Rescue is a robust and reliable data recovery solution for your Mac. Data Rescue has a 5-star average rating on the Mac App Store a 4.5 star rating on Amazon, in addition to over 150 industry awards for best-in-class Mac recovery since it’s debut in 2002. Works on all Mac hard drives even if […]"},{"link":"https://nmac.to/blog/wi-fi-speedtest-2-1-1/","image":"https://nmac.to/wp-content/uploads/2016/08/Wi-Fi-SpeedTest.png","title":"Wi-Fi SpeedTest 2.1.1 – Test and troubleshoot your wifi network","content":"Wi-Fi SpeedTest is available on Mac OS X and iOS. It will allow you to test and troubleshoot your wifi network. It will be very useful when you want to test bandwidth of your wifi, ethernet or mixed network, but your internet connection is too slow(for example 10 Megabits per second), and your router can […]"},{"link":"https://nmac.to/blog/quick-ringtone-1-0-1/","image":"https://nmac.to/wp-content/uploads/2016/10/Quick.Ringtone.png","title":"Quick Ringtone 1.0.1 – Easily create iPhone ringtones","content":"DIY ringtone with music and recording.   Ringtone directly sync to iPhone by iTunes.   Share the ringtone with your friends at the touch of a button.   Version 1.0.1: Release notes were unavailable when this listing was updated.   OS X 10.10 or later, 64-bit processor    "},{"link":"https://nmac.to/blog/quick-recorder-1-2-5/","image":"https://nmac.to/wp-content/uploads/2016/10/Quick-Recorder.png","title":"Quick Recorder 1.2.5 – A personal voice recorder app","content":"Quick Recorder is now running. You can find its icon in the Dock. Click it to record, and click it again to stop. Right-click(or ⌘-click) the dock bar icon to show the menu.   Version 1.2.5: Context menu for list; Long name display; Fix bugs.   OS X 10.10 or later, 64-bit processor    "},{"link":"https://nmac.to/blog/amberlight-2-1-0/","image":"https://nmac.to/wp-content/uploads/2016/10/Amberlight.png","title":"Amberlight 2.1.0 – Unique fractal-flame generator","content":"Amberlight 2 is a new release of art software which creates computer-generated images and animations. The beautiful connection of mathematics and art is a visualization of the algorithm based on magnetic fields developed by Peter Blaškovič. In the world of computer graphics this is a one-of-a-kind tool that broadens creative horizons and adds animated magic […]"},{"link":"https://nmac.to/blog/appdelete-4-3/","image":"https://nmac.to/wp-content/uploads/2015/02/AppDelete.png","title":"AppDelete 4.3 – The speedy and efficient way to delete your unwanted apps","content":"AppDelete is an uninstaller for Macs that will remove not only applications but also widgets, preference panes, plugins, and screensavers along with their associated files. Without AppDelete these associated items will be left behind to take up space and potentially cause issues.   There are several ways to activate AppDelete: Drag items onto main window […]"},{"link":"https://nmac.to/blog/lossless-photo-squeezer-1-70/","image":"https://nmac.to/wp-content/uploads/2016/10/Lossless-Photo-Squeezer.png","title":"Lossless Photo Squeezer 1.70 – Reduce Image Size","content":"Lossless Photo Squeezer reduces image size No Loss in Quality.   It is a professional image size compressor which will reduce your PNG, JPEG and GIF photos and images size with LOSSLESS quality. You can optimize all your photos to save much hard drive space, web space and share full-resolution photos online more faster.   […]"},{"link":"https://nmac.to/blog/calcpad-1-1/","image":"https://nmac.to/wp-content/uploads/2016/10/CalcPad.png","title":"CalcPad 1.1 – Notepad and Calculator Reinvented","content":"CalcPad is a note taking app with powerful calculator built in. It can perform basic calculations as well as complex unit conversions, real time currency conversions and percentages. It can even handle variables and custom functions if you need them.   With a handy menubar icon, global access shortcut and window options, it will be […]"},{"link":"https://nmac.to/blog/app-box-for-dropbox-1-0-7/","image":"https://nmac.to/wp-content/uploads/2016/10/App-Box-for-Dropbox.png","title":"App Box for Dropbox 1.0.7 – Access dropbox from your menu bar","content":"App Box for Dropbox (was App Drive for Dropbox) allows you to access dropbox from your menu bar.   Features Menu bar viewer – Click to view and search your Dropbox from the menu bar Desktop and mobile views Preview files Responsive design based on app size Window mode – When you want view Dropbox […]"}]