[{"link":"https://nmac.to/blog/hogwasher-5-08/","image":"https://nmac.to/wp-content/uploads/2016/09/Hogwasher.png","title":"Hogwasher 5.08 – Internet news reader","content":"Hogwasher is a full-featured newsreader for OS X. File downloads in multiple connections across multiple servers, thread trees, and extensive filtering for keeping your discussions accessible, with a beautiful interface built for OS X 10.10 Yosemite.   Threaded discussions – Follow complex discussions at a glance with a graphical thread tree display. Powerful filtering – […]"},{"link":"https://nmac.to/blog/disk-cleaner-suite-2-2/","image":"https://nmac.to/wp-content/uploads/2016/09/Disk-Cleaner-Suite.png","title":"Disk Cleaner Suite 2.2 – Clean Your Drive, Remove Adware & Duplicate, Uninstall","content":"Disk Cleaner / Adware Cleaner / Duplicate File Cleaner / Application Uninstaller / File Shredder   Disk Cleaner Frees up your disk space and makes your Mac run faster. Scans junk files (such as Trash Can, Downloads, Logs, Caches, Mail, iTunes, etc ) which you might no long need Cleans and reclaims disk space.   […]"},{"link":"https://nmac.to/blog/photo-collage-maker-pro-3-1-9/","image":"https://nmac.to/wp-content/uploads/2016/09/Photo-Collage-Maker-Pro3.png","title":"Photo Collage Maker Pro 3.1.9 – Image Picture Poster Creator HD","content":"Allows you to create photo collages, scrapbooks, greeting cards, photo calendars, and posters quickly. With an intuitive interface, create stunning picture collages on your mac. You can sharing these self-made collages with your friends and families.   Function Support all photo formats . Add exquisite text to collage. Create collage in any custom size. Pan […]"},{"link":"https://nmac.to/blog/posters-templates-for-pages-1-1/","image":"https://nmac.to/wp-content/uploads/2016/09/Posters-Templates-for-Pages.png","title":"Posters Templates for Pages 1.1 – A collection of over 180 original templates for Pages","content":"Posters Templates for Pages is a collection of over 180 original templates of the highest quality, created to lend a unique look to your promo material. Whether you’re trying to hype up a cool new product, starting a season sale, or announcing a mind-blowing event, Graphic Node’s posters will help you make sure your promotion […]"},{"link":"https://nmac.to/blog/mov-converter-pro-6-5-17/","image":"https://nmac.to/wp-content/uploads/2016/08/MOV-Converter-Pro.png","title":"MOV Converter Pro 6.5.17 – Convert MOV to 4K MP4/WMV/AVI","content":"Aiseesoft MOV Converter Pro can convert videos to and from MOV format conveniently. MOV Converter Pro can convert MOV to MP4, WMV, AVI, MPG and other video formats easily. Also, 4K videos are supported. It also helps you to convert MP4/WMV/AVI video to MOV for playing and editing in QuickTime, Final Cut Pro, etc.   […]"},{"link":"https://nmac.to/blog/letterspace-1-7-2/","image":"https://nmac.to/wp-content/uploads/2015/11/Letterspace.png","title":"Letterspace 1.7.2 – Multi-platform note-taking app with #hashtag and @mention support","content":"Letterspace is a multi-platform, cloud-syncing note-taking app with Markdown, #hashtag, and @mention support. Easily organize notes and even create to-do lists with Letterspace.   Think about all of the notes you have to take on a daily basis. It’s something we all do. Good note taking is based on being able to get your thoughts […]"},{"link":"https://nmac.to/blog/intensify-ck-1-2-2/","image":"https://nmac.to/wp-content/uploads/2015/10/Intensify-CK.png","title":"Intensify CK 1.2.2 – Create clarity and intensity in your photos (was Intensify Pro)","content":"Intensify CK (was Intensify Pro) lets discerning photographers of all skill levels create powerful photographic images with unprecedented drama and detail. Precise control of contrast, structure, detail and sharpening across different tonal ranges delivers high quality results every time.   Special algorithms to prevent image artifacts, image layer stacking with opacity control, dozens of professionally […]"},{"link":"https://nmac.to/blog/four-sided-fantasy-1-0/","image":"https://nmac.to/wp-content/uploads/2016/09/Four.Sided_.Fantasy.png","title":"Four Sided Fantasy 1.0 – 2D Puzzle-Platformer Game","content":"Four Sided Fantasy is a game about pushing the limits of the screen. In this world, you can wrap the screen at any time, so that you emerge from the left when exiting right, and falling down a pit turns into falling from the ceiling. Discover a strange world where a man and woman journey […]"},{"link":"https://nmac.to/blog/bundle-for-wedding-1-1/","image":"https://nmac.to/wp-content/uploads/2016/09/Bundle-for-Wedding.png","title":"Bundle for Wedding 1.1 – Templates for wedding planning","content":"Bundle for Wedding is an excellent tool for organizing the beautiful and memorable wedding you’ve been dreaming of, providing you with unique templates for Pages documents, spreadsheet templates for Numbers, first-class slideshow themes for Keynote, and illustrations. Focus on your exciting plans and leave the invitations and other paperwork to us to us!   All […]"},{"link":"https://nmac.to/blog/zend-studio-13-5-1/","image":"https://nmac.to/wp-content/uploads/2014/02/ZendStudio.png","title":"Zend Studio 13.5.1 – Professional-strength PHP development environment","content":"Zend Studio is the only Integrated Development Environment (IDE) designed for professional developers that encompasses all the development components necessary for the full PHP application lifecycle.   Through a comprehensive set of editing, debugging, analysis, optimization, database tools and testing Zend Studio 5 speeds development cycles and simplifies complex projects.   To reflect varying developers’ […]"}]