[{"link":"https://nmac.to/blog/photoscan-pro-1-2-4/","image":"https://nmac.to/wp-content/uploads/2014/04/PhotoScan.png","title":"PhotoScan Pro 1.2.4 – Builds textured 3D models using digital photos","content":"PhotoScan Pro is 3D reconstruction software that automatically builds textured 3D models using digital photos of the scene. It allows for precise textured mesh models reconstruction. The program provides robust photo alignment, no coded targets or special shooting conditions are required.   Features: Photo alignment Point cloud generation (sparse / dense) Polygonal model generation Texture […]"},{"link":"https://nmac.to/blog/m3-drive-mounter-2-2/","image":"https://nmac.to/wp-content/uploads/2017/01/M3-Drive-Mounter.png","title":"M3 Drive Mounter 2.2 – Manage network drives and external drives with ease","content":"M3 Drive Mounter allows you to mount, unmount, or eject network drive or external drive with only one click. Connect your network drives only once, set it and forget it Automatically detect network drives and connect them Mount file share (FTP, SFTP) server storage as a local disk in the Finder, open remote files with […]"},{"link":"https://nmac.to/blog/fine-photo-collage-pro-3-5-2/","image":"https://nmac.to/wp-content/uploads/2017/01/Fine-Photo-Collage-Pro.png","title":"Fine Photo Collage Pro 3.5.2 – Create stunning picture collages","content":"Find out just how easy it can be to turn photos into a collage! Create stunning picture collages on your Mac. Tie fond memories together into gorgeous picture mosaics. Fine Photo Collage Pro is the app for quickly assembling your pictures into great-looking collages. With an intuitive interface, Fine Photo Collage Pro gives you complete […]"},{"link":"https://nmac.to/blog/window-tidy-2-1-4/","image":"https://nmac.to/wp-content/uploads/2014/12/Window.Tidy_.png","title":"Window Tidy 2.1.4 – Manage windows with ease","content":"Window Tidy lets you quickly and easily arrange your application windows on your Desktop onto a customizable grid using nothing but drag and drop! When you want to reposition a window, there are no hot-keys to remember or menus to click, you simply drag and drop the window onto customisable pop-up Layout Icon and it […]"},{"link":"https://nmac.to/blog/pdf-to-image-pro-3-3-13/","image":"https://nmac.to/wp-content/uploads/2016/12/PDF.to_.Image_.Pro_.png","title":"PDF to Image Pro 3.3.13 – PDF to JPG/PNG and more","content":"Convert PDF to almost any image formats quickly and stay or improve original quality.   PDF to Image Pro can convert PDF to JPEG, PNG, GIF, BMP, TGA, PPM, TIFF and JPEG2000 with high quality. Also, it allows you to finish batch PDF conversion and convert one page PDF. And before you convert PDF to […]"},{"link":"https://nmac.to/blog/galaxy-pro-live-wallpaper-1-0/","image":"https://nmac.to/wp-content/uploads/2017/01/Galaxy-Pro.png","title":"Galaxy Pro – Live Wallpaper 1.0 – A clock, calendar and iCal task galaxy backgrounds","content":"Galaxy Pro – it is a clock, calendar and iCal task list with gorgeous rotating spiral galaxy in the background.   Galaxy Pro is the one of the most amazing interactive 3D background for your Mac. You can completely customize it and make your own galaxy: change the perspective and angle by clicking on the […]"},{"link":"https://nmac.to/blog/cross-dj-3-4-3/","image":"https://nmac.to/wp-content/uploads/2015/10/Cross.DJ_.png","title":"Cross DJ 3.4.3 – Professional DJ software","content":"Cross DJ is the best pro DJ app on Mac. Mix tracks in perfect sync on a powerful audio engine. Engineered by Mixvibes, digital DJing pioneer for 15 years.   MIX AUDIO & VIDEO  2 full featured video players Control audio & video at the same time or separately 37 video transitions Webcam input Text/image […]"},{"link":"https://nmac.to/blog/smart-dvd-creator-1-4-0/","image":"https://nmac.to/wp-content/uploads/2017/01/Smart-DVD-Creator.png","title":"Smart DVD Creator 1.4.0 – Burn popular video formats to DVD","content":"Smart DVD Creator can be used to burn popular video formats including MP4, MKV, FLV, AVI, etc., to DVD. This DVD burner can not only burn video to DVD disc that will playback in any DVD player or computer’s DVD drive, but also can create ISO files, which are suitable for virtual-drive users.   Beside, […]"},{"link":"https://nmac.to/blog/lightpaper-1-4/","image":"https://nmac.to/wp-content/uploads/2016/03/LightPaper.png","title":"LightPaper 1.4 – Markdown editor","content":"LightPaper is a simple, beautiful, powerful, yet free text editor for passionate writers. You can use LightPaper to write any kind of text documents — blogs, articles, notes, READMEs, TODOs, or the next chapter of your new novel. Its simple interface gets out of your way, allowing you to focus on writing. To remove distractions, […]"},{"link":"https://nmac.to/blog/layouts-for-keynote-3-1-3/","image":"https://nmac.to/wp-content/uploads/2017/01/Layouts.-for-Keynote3.png","title":"Layouts for Keynote 3.1.3 – Keynote themes with customizable elements","content":"Layouts for Keynote is a collection of themes created for unique slideshows. Outline your ideas, proposals, contracts, and solutions.Then, enhance them with stylish backgrounds, charts, diagrams, tables, and other data-visualization elements to attain all you have been working for.   Each theme contains 20 master slides, covering everything from basic bullet layouts to complex diagrams […]"}]