[{"link":"https://nmac.to/blog/the-masterplan-1-2-2/","image":"https://nmac.to/wp-content/uploads/2016/01/The.Masterplan.png","title":"The Masterplan 1.2.2 – Tactical squad-based heist game set in 1970s","content":"The Masterplan is an award-winning tactical squad-based heist game set in 1970s. The 2D top-down view gives you a great overview of what’s happening at any given moment, allowing you to be a real criminal mastermind. Features hand-drawn 2D graphics and fun group control, granting you total control – at least until someone calls the […]"},{"link":"https://nmac.to/blog/star-wars-empire-at-war-1-05/","image":"https://nmac.to/wp-content/uploads/2016/01/Star-Wars-Empire-At-War.png","title":"Star Wars : Empire At War 1.05 – You are the supreme galactic commander","content":"From the lives of soldiers to the deaths of planets, you are the supreme galactic commander. It is a time of galactic civil war. Take up the reins of the Rebellion or assume control for the Empire. Whichever you choose, it will be up to YOU to steer your side to ultimate victory. Command everything […]"},{"link":"https://nmac.to/blog/calcbot-1-0-4/","image":"https://nmac.to/wp-content/uploads/2015/02/Calcbot.png","title":"Calcbot 1.0.4 – Intelligent calculator and unit converter","content":"Calcbot is an intelligent calculator and unit converter for the rest of us. Featuring an easy-to-read history tape, expression view, intuitive conversion, and much more!   Features History Tape – Every calculation you enter gets saved to the history tape and optionally sent to your clipboard for quick pasting. Refer to calculations later or send […]"},{"link":"https://nmac.to/blog/mobikin-doctor-for-ios-1-0-11/","image":"https://nmac.to/wp-content/uploads/2016/01/MobiKin.Doctor.for_.iOS_.png","title":"MobiKin Doctor for iOS 1.0.11 – Recover All iOS Data with One-click","content":"MobiKin Doctor for iOS is an all-in-one third-party program to recover call history, text messages, contacts, photos and more from your iPhone, iPad and iPod touch easily.   Recover All iOS Data with One-click iPad, iPhone and iPod touch can be regarded as a mini-computer in the daily life. You can use it to contact […]"},{"link":"https://nmac.to/blog/mobikin-assistant-for-ios-1-0-21/","image":"https://nmac.to/wp-content/uploads/2016/01/MobiKin-Assistant-for-iOS.png","title":"MobiKin Assistant for iOS 1.0.21 – Backup or Transfer the Whole iOS Contents to Mac","content":"MobiKin Assistant for iOS is specially developed for Mac OS X users. With it, you can easily and quickly transfer files like music, movie, photos, playlist, iTunes U, etc. from iPhone, iPad or iPod to Mac computer.   Version 1.0.21: Release notes were unavailable when this listing was updated.   Intel OS X 10.6.6 or […]"},{"link":"https://nmac.to/blog/mushroom-11-1-0/","image":"https://nmac.to/wp-content/uploads/2016/01/Mushroom.png","title":"Mushroom 11 1.0 – Adventure, Puzzle & Platformer game","content":"Mold an amorphous organism into any shape by pruning its cells. New cells will immediately grow, allowing you to traverse a mysteriousworld across brain-twisting obstacles, overcome swarms of bizarre mutated creatures, and understand the true nature of the devastation from which you emerged. The eerily beautiful visuals are complemented by the exquisite, ethereal soundtrack of […]"},{"link":"https://nmac.to/blog/menu-radius-1-0/","image":"https://nmac.to/wp-content/uploads/2016/01/Menu.Radius.png","title":"Menu Radius 1.0 – Quick access to your favourite apps","content":"Menu Radius is a great alternative to Dock that provides quick access to all apps you need. Add apps to the circular menu or create groups so that you favorite apps were always at hand.   You can also set a shortcut key, menu location and skin for more convenient and pleasant use.   Add […]"},{"link":"https://nmac.to/blog/sixtyfour-1-7-2/","image":"https://nmac.to/wp-content/uploads/2016/01/SixtyFour.png","title":"SixtyFour 1.7.2 – Boost your old Mac’s performance","content":"SixtyFour facilitates the setting of a preference to force a 64-bit app to open in 32-bit mode. Forcing a 64-bit app to open in 32-bit mode reduces its memory usage significantly.   Running most if not all apps in 32-bit mode on systems that have little memory available can potentially lead to an increase in […]"},{"link":"https://nmac.to/blog/dolphins-3d-1-1-0/","image":"https://nmac.to/wp-content/uploads/2016/01/Dolphins.3D.png","title":"Dolphins 3D 1.1.0 – Watch dolphins in a 3D ocean scene","content":"Dive into the deep ocean with no aqualung and swim with the dolphins, without leaving your computer! With Dolphins 3D, your desktop will be transformed into a porthole to spy on the underwater world. You’ve never experienced this before.   Features: realistic dolphins animation detailed ocean floor with corals coral fish special observation mode tracking […]"},{"link":"https://nmac.to/blog/noiseless-1-3-0/","image":"https://nmac.to/wp-content/uploads/2016/01/Noiseless.png","title":"Noiseless 1.3.0 – Remove luma and chroma noise from photos","content":"Either you shoot with an iPhone or with a DSLR, get Noiseless to fix your shots in seconds. PLUS you can now use Noiseless as the Photos for Mac extension.   Disappointed by how grainy your photos look the morning after a night out? How about indoor smartphone shots that look ‘noisy’ when you view […]"}]