[{"link":"https://nmac.to/blog/lyn/","image":"https://nmac.to/wp-content/uploads/2019/11/Lyn2.png","title":"Lyn 2.1.3 – Lightweight image browser and viewer","content":"Lyn is a lightweight and fast image browser and viewer designed for photographers, graphic artists and Web designers. Featuring an extremely versatile and aesthetically pleasing interface, it delivers an easy-to-use geotagging technology and a complete solution for sharing your photographs.   Lyn natively supports all popular image formats like JPEG, TIFF, JPEG 2000, PNG, PPM, […]"},{"link":"https://nmac.to/blog/icompta/","image":"https://nmac.to/wp-content/uploads/2017/12/iCompta_6.png","title":"iCompta 6.0.55 – Manage personal finances","content":"iCompta is a simple and powerful personal finance management application. iCompta is designed to be as easy to use as possible while maintaining an array of features to help you track your money down and start saving!   Main features: Multiple currencies: Each account can have its own currency and you can organize transactions by […]"},{"link":"https://nmac.to/blog/keep-it/","image":"https://nmac.to/wp-content/uploads/2021/09/Keep_It_1_1.png","title":"Keep It 1.11.15 – Write notes, keep things, and find them again","content":"Keep It is for writing notes, keeping web links and documents, and finding them again. Available on Mac, and as a separate app for iPhone and iPad, Keep It is the destination for all those things you want to put somewhere, confident you will find them again later.   Notes and Links Make Notes Create […]"},{"link":"https://nmac.to/blog/path-finder/","image":"https://nmac.to/wp-content/uploads/2022/02/Path_Finder_2121.png","title":"Path Finder 2131 – Powerful, award-winning Finder alternative","content":"Organization is key, and Path Finder offers the tools you need to access, browse, and manage all of your files quickly on OS X. Packed with a plethora of powerful features, Path Finder allows you to take complete control of your documents, photos, videos, music, and so much more. Say goodbye to the days of […]"},{"link":"https://nmac.to/blog/wifi-explorer/","image":"https://nmac.to/wp-content/uploads/2020/07/WiFi_Explorer_3.png","title":"WiFi Explorer 3.3.5 – Scan, find, and troubleshoot wireless networks","content":"WiFi Explorer will scan, find, and troubleshoot wireless networks.   Quickly identify channel conflicts, signal overlapping, or configuration problems that may be affecting the connectivity and performance of your home or office wireless network.   Get an insight into the network details: name (SSID), MAC address (BSSID), device manufacturer, signal strength (RSSI), noise, channel, band, […]"},{"link":"https://nmac.to/blog/neooffice/","image":"https://nmac.to/wp-content/uploads/2017/08/NeoOffice2017.png","title":"NeoOffice 2017.33 – Mac-tailored, OpenOffice-based productivity suite","content":"NeoOffice is a complete office suite for OS X. With NeoOffice, users can create and edit text documents, spreadsheets, and presentations. NeoOffice can open OpenOffice documents. NeoOffice can also open most Microsoft Word, Excel, and PowerPoint documents.   Do you already use NeoOffice or OpenOffice? We recommend that you click on the NeoOffice support link […]"},{"link":"https://nmac.to/blog/infuse-pro/","image":"https://nmac.to/wp-content/uploads/2021/09/Infuse.png","title":"Infuse PRO 7.3.10 – An elegant video player","content":"Ignite your video content with Infuse – the beautiful way to watch almost any video format on your iPhone, iPad, Apple TV, and Mac. No need to convert files! Infuse is optimized for macOS 11, with powerful streaming options, Trakt sync, and unmatched AirPlay & subtitle support. Gorgeous interface. Precise controls. And silky-smooth playback.   […]"},{"link":"https://nmac.to/blog/one-switch/","image":"https://nmac.to/wp-content/uploads/2019/04/One-Switch.png","title":"One Switch 1.25 – All your powerful switches in one place","content":"One Switch is a tiny app designed to improve your efficiency by providing quick access to a few important switches. It can be opened from your menu bar, and it allows you to toggle certain system features with just a couple of clicks.   Helpful switches right in your menu bar After installing and launching […]"},{"link":"https://nmac.to/blog/graphicconverter/","image":"https://nmac.to/wp-content/uploads/2019/04/GraphicConverter11.png","title":"GraphicConverter 11.6.1 – Graphics editor with powerful features","content":"GraphicConverter is an all-purpose image-editing program that can import 200 different graphic-based formats, edit the image, and export it to any of 80 available file formats.   The high-end editing tools are perfect for graphic manipulation as well as the ability to use Photoshop-compatible plug-ins. It offers batch-conversion capabilities, a slide-show window, batch rename, batch […]"},{"link":"https://nmac.to/blog/future-dj-pro/","image":"https://nmac.to/wp-content/uploads/2016/04/future.dj_.pro_.png","title":"future.dj pro 1.10.2 – Professional DJ mixing for audio, video, and karaoke","content":"future.dj pro (was FutureDecks DJ pro) is our flagship product, packed with the latest professional DJ features that answer the needs of both professional and aspiring DJs. Future.dj pro can easily be used by all manner of DJs, from bedroom DJs who enjoy creating their own mashups and mixes in the comfort of their home, […]"}]