[{"link":"https://nmac.to/blog/desk-1-4/","image":"https://nmac.to/wp-content/uploads/2015/02/Desk.png","title":"Desk 1.4 – A Writing, Blogging, and Notetaking App","content":"Desk is a premium writing experience for all types of writers.   Whether you’re a casual enthusiast, the weekend writer, blogger, or digital publishing professional, you’ll find Desk to be a much-needed breath of fresh air.   Designed to marry both function and form, it is the desktop publishing client that you’ve always wanted: Simple, […]"},{"link":"https://nmac.to/blog/clo3d-modelist-2-2-95/","image":"https://nmac.to/wp-content/uploads/2015/06/clo3d-modelist.png","title":"CLO3D Modelist 2.2.95 – Virtual fit models design software","content":"With our simple placement gadgets and intelligent sewing tools, you’ll be surprised at how quick and easy it is to make a Virtual Garment. Confirm the virtual before you cut, make, trim and ship the physical. No more yardage wasted, no more loose threads. Literally.   EFFORTLESS INTEGRATION In addition to standard DXF AAMA file […]"},{"link":"https://nmac.to/blog/translateq-2-0-3/","image":"https://nmac.to/wp-content/uploads/2015/06/TranslateQ.png","title":"TranslateQ 2.0.3 – Online translator","content":"TranslateQ is an online translator with Automatic Clipboard Translation.   Services: Google Microsoft Yandex   Dictionaries: ImTranslator Systran Bab.la   Supported languages (Google): English, German, Chinese (Simplified), Chinese (Traditional), Spanish, Japanese, Russian, French, Portuguese, Arabic, Korean, Basque, Catalan, Czech, Danish, Dutch, Esperanto, Estonian, Finnish, Galician, Georgian, Greek, Haitian, Creole, Hebrew, Hungarian, Icelandic, Indonesian, Irish, Italian, […]"},{"link":"https://nmac.to/blog/textexpander-5-0-1/","image":"https://nmac.to/wp-content/uploads/2014/01/TextExpander.png","title":"TextExpander 5.0.1 – Expand custom keyboard shortcuts into frequently-used text and pictures","content":"TextExpander saves your fingers and your keyboard, expanding custom keyboard shortcuts into frequently-used text and pictures. Type more with less effort!   Here are a few examples for what you can do with TextExpander: Insert standard greetings, phrases, boilerplate paragraphs, and signatures – including formatted text and pictures. Correct typos automatically Organize snippets into groups […]"},{"link":"https://nmac.to/blog/reveal-1-5-1/","image":"https://nmac.to/wp-content/themes/nmac/images/placeholder-320.png","title":"Reveal 1.5.1 – Developer tool for editing iOS apps","content":"Reveal is a powerful, smart iOS developer tool that allows you to interact with your apps in fine, visually-stunning detail. Runtime inspection for iOS apps… Reveal brings the power of tools like Firebug and Web Inspector to iOS developers. See your application’s view hierarchy at runtime with advanced 2D and 3D visualisations. Debug view layout […]"},{"link":"https://nmac.to/blog/page-layers-1-9-1/","image":"https://nmac.to/wp-content/uploads/2015/06/PageLayers.png","title":"Page Layers 1.9.1 – Convert website into Photoshop layers","content":"Page Layers saves your Web site as layered Photoshop image. The Mac app is unique in its capability to export pixel-perfect Web site screenshots featuring a masked layer for every page element. And it can capture traditional website screenshots, too. Converting a website to PSD format allows to import existing pages into design tools like […]"},{"link":"https://nmac.to/blog/magic-calculator-2-10/","image":"https://nmac.to/wp-content/uploads/2015/06/Magic.Calculator.png","title":"Magic Calculator 2.10 – A scientific calculator","content":"Magic Calculator is a scientific calculator that allows you to write calculations directly with the keyboard.   A Magic Calculator document looks like a text editor. Each line of the text is a calculation. Just type expressions and get immediately the results. If you make a change, everything is automatically updated.   It also allows […]"},{"link":"https://nmac.to/blog/lens-blur-1-4-3/","image":"https://nmac.to/wp-content/uploads/2014/04/LensBlur.png","title":"Lens Blur 1.4.3 – True out-of-focus bokeh lens effect","content":"Let Lens Blur transform your existing photo into true SLR-quality out-of-focus bokeh effect! Everyone needs a gorgeous personalized background for a social profile, blog, Web/UI design, presentation, or wallpaper, right? So equip yourself with this easy-to-use app and transform your photos with this blurred effect!   Bokeh is the pleasing or aesthetic quality of out-of-focus […]"},{"link":"https://nmac.to/blog/infographics-2-0/","image":"https://nmac.to/wp-content/uploads/2015/06/Infographics.png","title":"Infographics 2.0 – Visualization graphics for Keynote","content":"The Infographics collection contains a wide range of high-quality designs for illustrating your Keynote presentations. Whether your slideshow is focused on a specific country, explains intricacies of an industry, or presents annual financial results Infographics is a go-to selection of quality visualization tools.   All images include transparent backgrounds that allow placing them on various […]"},{"link":"https://nmac.to/blog/appbolish-1-0-4/","image":"https://nmac.to/wp-content/uploads/2014/09/AppBolish.png","title":"AppBolish 1.0.4 – Thoroughly uninstall apps","content":"AppBolish is a thorough app uninstallation solution.   Dragging apps to the Trash can leave numerous caches, logs, and support files littered all over the hard drive. This clogs up valuable disk space! Every app is analyzed, after which AppBolish begins to deeply scan the computer for all related items and presents a final list […]"}]