[{"link":"https://nmac.to/blog/cleanmyphone-1-0-5/","image":"https://nmac.to/wp-content/uploads/2014/01/CleanMyPhone.png","title":"CleanMyPhone 1.0.5 – Keep your iPhone, iPad, or iPod touch clean and well-organized","content":"CleanMyPhone is an ingeniously simple and powerful application that will help you keep your iPhone, iPad, or iPod touch clean and running smoothly. It includes useful tools such as Disk Manager, App Cleaner, Removal of Document and Data, Find Large Files, One-Click-Copy, and more.   Configure, Organize and Manage Files and Apps on Your iOS […]"},{"link":"https://nmac.to/blog/smartday-3-1-0/","image":"https://nmac.to/wp-content/uploads/2013/12/SmartDay.png","title":"SmartDay 3.1.0 – Integrated organizer with automatic scheduling","content":"SmartDay is an integrated organizer that automatically schedules tasks into the free time in your calendar. SmartDay uses adaptive logic to organize your projects, tasks, appointments and check-lists. The included Cloud hub (free) keeps you connected across all of your Macs and PC’s, and syncs with our iPad organizer, SmartPad.   Beauty in Simplicity… SmartDay […]"},{"link":"https://nmac.to/blog/quickbooks-pro-2014-15-0-4-r5/","image":"https://nmac.to/wp-content/uploads/2014/03/QuickBooks-Pro.png","title":"QuickBooks Pro 2014 15.0.4 R5 – Financial management and accounting for small businesses","content":"QuickBooks Pro 2014 helps you manage your business easily and efficiently. Organize your finances all in one place, track money going in and out of your business, and spot areas where you can save.   Built for Mac OS – Looks and works like you’d expect Create invoices, pay bills, and manage expenses Gain insight […]"},{"link":"https://nmac.to/blog/project-statistics-for-xcode-2-0-2/","image":"https://nmac.to/wp-content/uploads/2014/03/Project-Statistics-for-Xcode.png","title":"Project Statistics for Xcode 2.0.2 – Get statistics regarding Xcode projects","content":"Project Statistics for Xcode helps developers and managers all around the world to get fast and easy to understand statistics regarding their project. Just drag and drop your project folder into Project Statistics for Xcode in order to start viewing your statistics and you will be 1 step closer to a better understanding of your […]"},{"link":"https://nmac.to/blog/moneywiz-1-5-4/","image":"https://nmac.to/wp-content/uploads/2014/01/MoneyWiz.png","title":"MoneyWiz 1.5.4 – Personal finance solution","content":"MoneyWiz lets you do more with your money. View all your accounts, budgets and bills in one place. Experience reports on a whole new level. Sync Everything across devices!   Meet MoneyWiz – the personal finance assistant that just works!   HOW IS MONEYWIZ BETTER? Automatically keeps data consistent across multiple devices Gives you beautiful […]"},{"link":"https://nmac.to/blog/appdelete-4-1-2/","image":"https://nmac.to/wp-content/uploads/2014/03/AppDelete.png","title":"AppDelete 4.1.2 – The speedy and efficient way to delete your unwanted apps","content":"AppDelete is an uninstaller for Macs that will remove not only applications but also widgets, preference panes, plugins, and screensavers along with their associated files. Without AppDelete these associated items will be left behind to take up space and potentially cause issues.   There are several ways to activate AppDelete: Drag items onto main window […]"},{"link":"https://nmac.to/blog/real-boxing/","image":"https://nmac.to/wp-content/uploads/2014/03/RealBoxing.png","title":"Real Boxing 1.0.1 – The undisputed champion of boxing games","content":"Real Boxing brings you a combat experience like no other, putting you in the shoes of your own custom-designed, expertly motion-captured fighter. With the full power of the almighty Unreal Engine, painstaking detail is packed into every punch, letting you feel the full force of every jab, hook and uppercut given and received. Local multiplayer […]"},{"link":"https://nmac.to/blog/zip-expert-1-20/","image":"https://nmac.to/wp-content/uploads/2014/03/Zip.Expert.png","title":"Zip Expert 1.20 – Extract / create archive files","content":"Zip Expert, a small and easy to use app that can extract / create many different kinds of archive files.   Extraction formats supported: Zip, RAR, 7z, TAR, Gzip, CAB, PAX, Lzma, Bzip2 and more.   Compression formats supported: Zip, 7z, TAR, Gzip, Bzip2   Features: Supports password protected archive files extracting. Supports compress files […]"},{"link":"https://nmac.to/blog/you-need-a-budget-4-3-451/","image":"https://nmac.to/wp-content/uploads/2013/12/You-Need-a-Budget-4.png","title":"You Need a Budget 4.3.451 – Easy-to-use budget software","content":"You Need a Budget is easy-to-use budget software paired with a powerful methodology.    The software is built around the YNAB Method, which is comprised of our Four Rules. These Four Rules help you break the paycheck to paycheck cycle, get out of debt, and save more money faster. Where other software packages tend to […]"},{"link":"https://nmac.to/blog/sparkbox-1-2-3/","image":"https://nmac.to/wp-content/uploads/2014/03/Sparkbox.png","title":"Sparkbox 1.2.3 – Smart Web image-capture application","content":"Sparkbox helps you manage images for design projects. Unlike iPhoto, it catalogues all of your images, not just the photographs you’ve taken yourself. Sparkbox is a tidy and easily navigable image library for your Mac, perfect for designers looking to organize their image collections and find sources of visual inspiration.   Features: Drag-and-drop functionality, menu […]"}]