[{"link":"https://nmac.to/blog/final-cut-library-manager/","image":"https://nmac.to/wp-content/uploads/2017/08/Final-Cut-Library-Manager.png","title":"Final Cut Library Manager 3.23 – Housekeeping for your Final Cut Pro libraries","content":"Final Cut Library Manager instantly displays all of the Final Cut Pro X 10.1 libraries and associated media that it finds on your Spotlight-indexed drives. You can also add other sources: disks, Xsan volumes or folders, including those not indexed by spotlight.   Events & Projects You can now look into your library without having […]"},{"link":"https://nmac.to/blog/paragraphs/","image":"https://nmac.to/wp-content/uploads/2015/07/Paragraphs.png","title":"Paragraphs 1.1.4 – Writing tool just for writers","content":"Paragraphs is an app just for writers. It was built for one thing and one thing only: writing. It gives you everything you need to create brilliant prose and does away with the rest.   Everything in context.  Don’t stress trying to memorize confusing markup. Paragraphs’ quick context menu provides simple, easy-to-use formatting options right […]"},{"link":"https://nmac.to/blog/tune4mac-itunes-video-converter-platinum/","image":"https://nmac.to/wp-content/uploads/2017/08/Tune4mac-iTunes-Video-Converter-Platinum.png","title":"Tune4mac iTunes Video Converter Platinum 4.3.4 – Remome DRM from purchased iTunes M4V videos","content":"Tune4mac iTunes Video Converter performs as a professional and powerful M4V DRM removal software, which can help you to remove DRM from purchased M4V videos easily and legally.   Convert iTunes M4V files to MOV, MP4, AVI easily. Tune4mac iTunes M4V Converter for mac can convert purchased iTunes M4V videos while playing them on iTunes […]"},{"link":"https://nmac.to/blog/triumph/","image":"https://nmac.to/wp-content/uploads/2015/09/Triumph.png","title":"Triumph 2.5.11 – Multi-channel audio designer","content":"Triumph is the most powerful, innovative and versatile mutli-channel audio designer.   As the sequel to the popular Wave Editor audio editing application, Triumph has been completely redesigned and takes full advantage of all of the latest technologies OS X has to offer.   Version 2.5.11: Resolves an issue where the app might crash when […]"},{"link":"https://nmac.to/blog/topaz-remask/","image":"https://nmac.to/wp-content/uploads/2015/09/Topaz-ReMask.png","title":"Topaz ReMask 5.0.3 – The quickest and easiest way to mask your photo","content":"Topaz ReMask is the quickest and easiest way to extract a subject from your photo.   Fast  Masking shouldn’t take forever, with endless tweaking and adjusting. ReMask gets the job done in a shockingly short amount of time, while requiring a bare minimum of your input.   Easy  No need to go through all kinds […]"},{"link":"https://nmac.to/blog/solid-converter/","image":"https://nmac.to/wp-content/uploads/2016/01/Solid-Converter.png","title":"Solid Converter 2.1.7640 – Convert PDF to Microsoft Word, Excel, and more","content":"PDF to Office conversion made easy: convert PDF to Microsoft Word, Excel, and more with Solid Converter Mac!   Turn your PDFs into Word documents you can edit. Solid Converter Mac converts PDF files into Microsoft® Word (.docx), Rich Text Format (.rtf), or plain text files (.txt). Extract data to Excel (.xlsx and .csv). Convert […]"},{"link":"https://nmac.to/blog/original-journey/","image":"https://nmac.to/wp-content/uploads/2017/08/Original-Journey.png","title":"Original Journey 1.0 – A 2D hand drawn, sci-fi action & adventure game","content":"You are a rookie soldier in the army of a space faring race, under the command of a legendary war hero. Your mission is dangerous, but the fate of your people depends on your success. Battle your way across the ever-changing surface of Planet Shadow with an arsenal of sci-fi weapons and mech armor, improve […]"},{"link":"https://nmac.to/blog/jihosoft-photo-recovery/","image":"https://nmac.to/wp-content/uploads/2017/08/Jihosoft.Photo_.Recovery.png","title":"Jihosoft Photo Recovery 2.0.1 – Photos, videos and audios recovery software","content":"Jihosoft Photo Recovery for Mac helps you recover photos, videos and audios from Mac-based hard drive, USB, memory card, digital camera, etc. Recover all types of lost photo, video and audio files Recover photos from Mac computer and many other storage devices Preview recoverable files before recovery and retrieve selectively Resume recovery from previously auto-saved […]"},{"link":"https://nmac.to/blog/igallery-pro/","image":"https://nmac.to/wp-content/uploads/2017/04/iGallery-Pro.png","title":"iGallery Pro 1.6.10 – Best Instagram Uploader","content":"iGallery Pro is an excellent app that provides the best Instagram experience on your Mac.   Besides view feeds, popular and nearby photos & videos, you can also like & comment photos & videos from Instagram directly on your Mac.   Features: Browsing Feed, Popular and Nearby Like, comment, follow, search people, tags and places. […]"},{"link":"https://nmac.to/blog/app-pier/","image":"https://nmac.to/wp-content/uploads/2017/03/App-Pier.png","title":"App Pier 1.6.2 – Application launcher and switcher with support for Touch Bar","content":"App Pier is a keyboard-friendly application launcher and switcher with Touch Bar support for the new Macbook Pro. It allows you to save screen space by hiding the macOS Dock, as App Pier will let you perform many of the tasks using keyboard shortcuts. It resides in the menu bar so that you can reach […]"}]