[{"link":"https://nmac.to/blog/filerecovery-2016-enterprise-5-5-8-5/","image":"https://nmac.to/wp-content/uploads/2016/03/FILERECOVERY.2016.png","title":"FILERECOVERY 2016 Enterprise 5.5.8.5 – Recover lost data from HFS+ and other file systems","content":"FILERECOVERY Enterprise runs natively under the OS X file systems 10.5 and higher, and recovers lost data and volumes from HFS/HFS+, HFS+, HFSX , HFS Wrapper, all FAT and NTFS file systems. Will recover from local hard drives, optical media, digital media, iPOD’s, some mobile phones and image files. Also supports Supports RAID recoveryincluding Stripe […]"},{"link":"https://nmac.to/blog/lego-indiana-jones-2-1-0-1/","image":"https://nmac.to/wp-content/uploads/2016/03/LEGO-Indiana-Jones-2.png","title":"LEGO Indiana Jones 2 1.0.1 – LEGO-style adventure game starring Indiana Jones","content":"LEGO Indiana Jones 2: The Adventure Continues combines the fun and creative construction of LEGO bricks with the wits, daring and non-stop action of one of cinema’s best loved adventure heroes. With a unique and hilarious take on all the Indiana Jones films – including for the first time ever Indiana Jones and the Kingdom […]"},{"link":"https://nmac.to/blog/imagemini-1-60/","image":"https://nmac.to/wp-content/uploads/2016/03/IMAGEmini.png","title":"IMAGEmini 1.60 – Photo resizer and optimizer","content":"IMAGEmini, a powerful photo resizer and optimizer, allows you to optimize all your photos while keeping their original resolution, quality, and format. With IMAGEmini, you can save huge space and share full-resolution photos with your friends much faster. IMAGEmini also supports batch resizing hundreds of photos quickly and easily with one click. It supports 70 […]"},{"link":"https://nmac.to/blog/icon-tool-for-developers-1-5/","image":"https://nmac.to/wp-content/uploads/2016/03/Icon-Tool-for-Developers.png","title":"Icon Tool for Developers 1.5 – Easy icons for iOS, OSX and Android","content":"Using Icon Tool for Developers you can build from a single large file – or provide multiple files and let Icons Tool fill in the gaps. iOS – save as XCAsset or plist OSX – save as XCAsset or .icns file Android – Just save!   Icns Builder relies on iconutil which should be installed […]"},{"link":"https://nmac.to/blog/gif-creator-2-1-0/","image":"https://nmac.to/wp-content/uploads/2016/03/Gif-Creator.png","title":"Gif-Creator 2.1.0 – Create GIF images from most popular image formats","content":"Have you wondered that you can create your own animated GIF images one day? Unbelievable? Now, iStonsoft GIF Creator for Mac can help you achieve your goal. With it, you can create or make your own GIF animation and edit the created GIF images on Mac system freely.   Create GIF images from most popular […]"},{"link":"https://nmac.to/blog/dock-preview-1-1/","image":"https://nmac.to/wp-content/uploads/2016/03/Dock-Preview.png","title":"Dock Preview 1.1 – Dock icon viewer designers and developers","content":"Dock Preview is utility for designers and developers who what to know how icon will look when placed in Dock.   If you have several icons to choose from you can drag all of them into the Dock Preview and navigate through them using arrow keys or numeric 1-9 keys.   Version 1.1: Now you […]"},{"link":"https://nmac.to/blog/docx-to-pdf-3-0-0/","image":"https://nmac.to/wp-content/uploads/2016/03/DOCX-to-PDF.png","title":"DOCX to PDF 3.0.0 – Easily convert docx to PDF sheets","content":"DOCX to PDF Converter is the best PDF Creator for you to convert DOCX to PDF. It can easily convert docx to PDF files. If you want to convert doc to PDF, you need to save the doc file as docx file using Office 2007, Office 2010, or Office 2011 (Mac version). When you create […]"},{"link":"https://nmac.to/blog/airword-pro-1-1/","image":"https://nmac.to/wp-content/uploads/2016/03/airWord.Pro_.png","title":"airWord Pro 1.1 – A powerful and versatile word processor","content":"airWord Pro is a powerful and versatile word processor that create and edit Microsoft Word, Open Document, plain text, rich text, HTML, and other kinds of documents. airWord Pro lets you create, edit, save all kinds of text documents; lets you format your documents as you like; lets you add photo, music or even movie […]"},{"link":"https://nmac.to/blog/special-characters-1-0-2/","image":"https://nmac.to/wp-content/uploads/2016/03/Special-Characters.png","title":"Special Characters 1.0.2 – Access special characters","content":"Special Characters makes it easy for web developer to use HTML Entities. All reserved characters can be easily founded and copied into clipboard. You can choose to copy character entities as entity name, decimal, or hex number. To make your life even easier, the program automatically record recently used character and also let you save […]"},{"link":"https://nmac.to/blog/franz-0-9-9/","image":"https://nmac.to/wp-content/uploads/2016/03/Franz.png","title":"Franz 0.9.9 – A free messaging app for Slack, Facebook Messenger, WhatsApp and more","content":"Franz is a free messaging app/former Emperor of Austria and combines chat & messaging services into one application. He currently supports Slack, HipChat, Facebook Messenger, Telegram, WhatsApp, Google Hangouts, Skype and Grape. You can download Franz for Mac and he is soon coming to Windows as well.   Franz allows you to add every service several […]"}]