[{"link":"https://nmac.to/blog/expanse-1-0-4/","image":"https://nmac.to/wp-content/uploads/2014/02/Expanse.png","title":"Expanse 1.0.4 – Access to your iTunes video library from anywhere in the world","content":"Expanse is a Web server to access your iTunes video library, allowing you to watch your videos from anywhere in the world. It also creates video podcasts using your iTunes library as a source of movies and TV shows.   Features: Accessibility of your collection. Expanse is essentially a Web server which allows you, using […]"},{"link":"https://nmac.to/blog/movie-database-1-1/","image":"https://nmac.to/wp-content/uploads/2014/02/Movie-Database.png","title":"Movie Database 1.1 – Turn your computer into multimedia center","content":"Turn your computer into an attractive and uncomplicated multimedia center.   MDB (Movie Database) is a simple manager for your movies, series ,TV shows …   Search the contents of your hard drives , Movie Database is responsible for finding additional information on the Internet and create a display where you can easily view your […]"},{"link":"https://nmac.to/blog/font-sleuth-2-4-4/","image":"https://nmac.to/wp-content/uploads/2014/01/Font-Sleuth.png","title":"Font Sleuth 2.4.4 – Font browser and organizer","content":"Font Sleuth is a font browser and organizer with a focused feature set enabling users to find fonts fast. Create font groups according to your own criteria for even faster font location.   Using the Font Sleuth Viewer window, you can view your installed or uninstalled fonts in a wysiwyg list (displayed in their font […]"},{"link":"https://nmac.to/blog/motorbike/","image":"https://nmac.to/wp-content/uploads/2014/02/Motorbike.png","title":"Motorbike 7.0.0 – Casual bike skills game","content":"Motorbike is a casual bike skills game full of action and real physics dynamics.    Motorbike comes with 40 original tracks, a growing number of online tracks and a track editor to create you own tracks and share with other players.   Select from different landscapes and pilots. You will find Motorbike easy to play […]"},{"link":"https://nmac.to/blog/linkinus-2-4-3/","image":"https://nmac.to/wp-content/uploads/2014/02/Linkinus.png","title":"Linkinus 2.4.3 – Advanced IRC client","content":"Linkinus provides a rich, social IRC experience; featuring detaching, embedded media, short URL expansion, message starring, combined chats, emoticons, and much more!   Linkinus Core: core improvements. Linkinus 2 is up to 10 times faster than the previous version. As far as core features go: detaching instead of quitting, UPnP, support for all major text […]"},{"link":"https://nmac.to/blog/episode-6-4-2-44/","image":"https://nmac.to/wp-content/uploads/2014/02/Episode.png","title":"Episode 6.4.2.44 – Professional media encoding application","content":"Episode is a powerful cross-platform desktop media encoding application for Mac and Windows. It offers the highest quality and fastest desktop encoding for content repurposing for distribution to Web, DVD, mobile phones and portable devices. Includes: extensive format support in/out including superior quality Flash 8/9 encoding, presets and filters, watch folders, batch processing of 25 […]"},{"link":"https://nmac.to/blog/anime-studio-pro-9-5/","image":"https://nmac.to/wp-content/uploads/2014/02/Anime-Studio-Pro.png","title":"Anime Studio Pro 9.5 – Create 2D vector animation","content":"Anime Studio Pro is a complete animation program for creating movies, cartoons, anime, or cut animations. Create your own desktop animated shorts in the style of South Park and JibJab, or use Anime Studio Pro to produce full-length animation for film, video, or streaming over the web.   Create sophisticated special effects. Anime Studio Pro […]"},{"link":"https://nmac.to/blog/movie-database-1-0/","image":"https://nmac.to/wp-content/uploads/2014/02/Movie-Database.png","title":"Movie Database 1.0 – Turn your computer into multimedia center","content":"Turn your computer into an attractive and uncomplicated multimedia center.   MDB (Movie Database) is a simple manager for your movies, series ,TV shows …   Search the contents of your hard drives , Movie Database is responsible for finding additional information on the Internet and create a display where you can easily view your […]"},{"link":"https://nmac.to/blog/rohos-logon-key-2-6/","image":"https://nmac.to/wp-content/uploads/2014/02/rohos.logon_.png","title":"Rohos Logon Key 2.6 – Turns any USB flash drive into a security key","content":"Rohos Logon Key turns any USB flash drive into a security key for your Mac. With Rohos Logon your Mac is protected but you don’t need to enter your password manually each time you login/unlock your Mac. Rohos will automatically lock your Mac screen when USB Key is unplugged. Unlocking your Mac with a USB […]"},{"link":"https://nmac.to/blog/scan-1-0-2/","image":"https://nmac.to/wp-content/uploads/2014/02/Scan.png","title":"Scan 1.0.2 – QR Code and Barcode Reader","content":"Scan is the fastest and most user-friendly QR reader and barcode scanner available. If your Mac came with a built-in scanner, this would be it. Here is what our reviewers are saying:   “Quick and very reliable. I’d give it six stars if it were possible.” “No ads, beautiful design, and even caught blurry QR […]"}]