[{"link":"https://nmac.to/blog/ivolume-3-7-4/","image":"https://nmac.to/wp-content/uploads/2014/10/iVolume.png","title":"iVolume 3.7.4 – Improves iTunes’ built-in sound level","content":"iVolume ensures that all your iTunes songs play at the same volume level.   iVolume calculates the volume perceived by the human ear for each song of your iTunes music collection. Thereby iVolume gets the most out of the approved Replay Gain algorithm and adjusts your songs accordingly.   Compatible With Your Digital Life: iVolume […]"},{"link":"https://nmac.to/blog/itoner-3-0-2/","image":"https://nmac.to/wp-content/uploads/2014/09/iToner.png","title":"iToner 3.0.2 – Create and transfer custom ringtones to your iPhone","content":"iToner enables you to quickly transfer custom ringtones for your iPhone – without modifying, hacking or having to reset your iPhone. Simply drag and drop your MP3 or AAC audio files on iToner’s window, click the Sync button, and you’re done! Even better, your ringtones will continue to work with future iOS updates.   Version […]"},{"link":"https://nmac.to/blog/fake-1-8-9-2/","image":"https://nmac.to/wp-content/uploads/2014/09/Fake.png","title":"Fake 1.8.9.2 – Browser that simplifies Web automation","content":"Fake is a new browser for Mac OS X that makes web automation simple. Fake allows you to drag discrete browser Actions into a graphical Workflow that can be run again and again without human interaction. The Fake Workflows you create can be saved, reopened, and shared.   Inspired by Apple’s Automator application, Fake looks […]"},{"link":"https://nmac.to/blog/grid-2-rd/","image":"https://nmac.to/wp-content/uploads/2014/09/GRID.2.Reloaded.Edition.png","title":"GRID 2 Reloaded Edition 1.0 – Be fast. Be first. Be famous Racing on the Mac just got exciting again","content":"Speed your way to the front as the star driver of ‘World Series Racing’, a disruptive new championship with global ambitions. Hold your nerve and do whatever it takes to win in nerve-jangling duels on mountain roads, experience full-contact sprints through city streets, get sideways in high-stakes drift events and carve your way around famous […]"},{"link":"https://nmac.to/blog/madmapper/","image":"https://nmac.to/wp-content/uploads/2014/09/MadMapper.png","title":"MadMapper 1.6.1 – Simply and easily map projections","content":"MadMapper lets you map projections simply and easily.   As of this writing, ‘projection mapping’ is one of the fastest growing mediums, and it’s being used in a wide variety of artistic and commercial projects. The basic idea: take a projector, point it an an object or a building, project an image onto it.   […]"},{"link":"https://nmac.to/blog/macaw-1-5-4/","image":"https://nmac.to/wp-content/uploads/2014/04/Macaw1.png","title":"Macaw 1.5.4 – The code-savvy web design tool","content":"Stop writing code. Start drawing it.   Macaw provides the same flexibility as your favorite image editor but also writes semantic HTML and remarkably succinct CSS. It’s time to expect more from a web design tool.   Fluid canvas and grid Macaw is engineered for fluid widths. Resize the canvas and your grids and elements […]"},{"link":"https://nmac.to/blog/data-rescue-4-0-1/","image":"https://nmac.to/wp-content/uploads/2014/03/Data.Rescue.png","title":"Data Rescue 4.0.1 – Powerful hard drive data recovery solution","content":"Data Rescue is a robust and reliable data recovery solution for your Mac. Data Rescue has a 5-star average rating on the Mac App Store a 4.5 star rating on Amazon, in addition to over 150 industry awards for best-in-class Mac recovery since it’s debut in 2002. Works on all Mac hard drives even if […]"},{"link":"https://nmac.to/blog/reformator-1-0-1/","image":"https://nmac.to/wp-content/uploads/2014/09/Reformator.png","title":"Reformator 1.0.1 – Multi-functional batch photo converter","content":"Reformator helps you convert a bulk of images into the most popular image formats, give your files meaningful names, watermark with text and image, adjust photos (brightness/saturation/exposure/grayscale/etc.), fit geometry (scale/crop/trim/etc.), remove private metadata, add your own copyrights, and much more. Also, Reformator is a great tool to browse your photos with an up-to-date photo Browser, […]"},{"link":"https://nmac.to/blog/pixplant-2-1-69/","image":"https://nmac.to/wp-content/uploads/2014/09/PixPlant.png","title":"PixPlant 2.1.69 – 3D texturing tool","content":"PixPlant 2 is a smart 3D texturing tool that creates high quality normal, displacement, specular maps and seamless textures from plain photos.   Based on photos, PixPlant adds an unlimited choice of realistic materials for your projects: pick an interesting photo, run PixPlant and get a perfect seamless 3D texture.   Version 2.1.69: Release notes […]"},{"link":"https://nmac.to/blog/notify-pro-2-1-6/","image":"https://nmac.to/wp-content/uploads/2014/09/Notify.png","title":"Notify Pro 2.1.6 – Gmail notifier supports multiple accounts","content":"Notify is a new Gmail notifier for OS X which supports multiple accounts. Each account has individual notification options, and you can easily check what’s in each account via the tabbed interface.   Features: More than just Gmail: The biggest feature request we got for Notify 1.0 was Google Apps support, so here it is. […]"}]