[{"link":"https://nmac.to/blog/alien-isolation/","image":"https://nmac.to/wp-content/uploads/2019/01/Alien-Isolation.png","title":"Alien Isolation 1.0.1 – Sci-fi Survival Horror Game","content":"Marooned on a decaying space station, the Sevastopol, you’ll enter a desperate struggle for survival as you are stalked by a terrifying, deadly Alien. As Ellen Ripley’s daughter Amanda, stay alert and out of sight as you search to uncover the secrets of your mother’s fate in this superbly-realised survival horror game set fifteen years […]"},{"link":"https://nmac.to/blog/mac-data-recovery-guru/","image":"https://nmac.to/wp-content/uploads/2017/02/Mac-Data-Recovery-Guru.png","title":"Mac Data Recovery Guru 5.0 – Data recovery software","content":"Mac Data Recovery Guru is the most modern, the most technologically advanced, and the easiest to use Mac data recovery software available. We would not state that if we could not back it up. But back it up we can, and instantly and risk free. Download the Free Demo to be able to quickly see […]"},{"link":"https://nmac.to/blog/rome-total-war/","image":"https://nmac.to/wp-content/uploads/2019/01/Rome-Total-War.png","title":"Rome: Total War – Gold Edition 1.4.2 – Turn-Based Strategy & Historical Game","content":"Uniting multi-award winning Rome: Total War and its official expansion pack, Barbarian Invasion, you must guide history’s greatest armies to victory in a game of epic real-time warfare, empire building, politics and treachery.   Play as one of three great Roman families, whose thirst for power will stop at nothing. This is the world of […]"},{"link":"https://nmac.to/blog/total-war-napoleon/","image":"https://nmac.to/wp-content/uploads/2019/01/Total.War_.NAPOLEON.png","title":"Total War: NAPOLEON 1.3.0 – Turn-Based Strategy & Historical Game","content":"Complete your Total War collection with this Definitive Edition of Total War: NAPOLEON, which includes all DLC and feature updates since the game’s release   Take on the Peninsular Campaign, based on the intense conflict that raged over the Spanish Peninsula between 1811 and 1814. Choose one of the three nations at war – France, […]"},{"link":"https://nmac.to/blog/widsmob-image-viewer/","image":"https://nmac.to/wp-content/uploads/2018/07/WidsMob-Viewer.png","title":"WidsMob Image Viewer 2.10 – Fast photo viewing speeds","content":"WidsMob Image Viewer provides super fast photo viewing speed and excellent preview experience. Whether you need to view all photos in the same folder, manage photos from different locations, or even make a beautiful slideshow, it should always be your first choice.   Version 2.10: Release notes were unavailable when this listing was updated.   […]"},{"link":"https://nmac.to/blog/battlestations-midway/","image":"https://nmac.to/wp-content/uploads/2019/01/Battlestations-Midway.png","title":"Battlestations Midway 1.1 – World War II Flight Strategy Game","content":"Battlestations: Midway is an immense action game that drops players into massive air, sea, and undersea battles from Pearl Harbor to Midway. Players command massive fleet attacks and take direct, real-time, control of every plane, battleship, and submarine in the battle.   Battlestations: Midway’s blends intense 3rd-person action with epic, large-scale naval combat and brings […]"},{"link":"https://nmac.to/blog/battlestations-pacific/","image":"https://nmac.to/wp-content/uploads/2019/01/Battlestations-Pacific.png","title":"Battlestations Pacific 1.2 – World War II Strategy & Action Game","content":"Experience one war through two epic sagas where you will be a part of history or change it. Feel the power of the historically authentic and decisive battles of the Pacific War. Relive some of the grandest and most critical naval battles of recent history and for the first time, choose to lead your fleet […]"},{"link":"https://nmac.to/blog/total-war-empire/","image":"https://nmac.to/wp-content/uploads/2018/12/Total.War_.EMPIRE.png","title":"Total War: EMPIRE 1.5.0 – Historical Strategy Game","content":"Complete your Total War collection with this Definitive Edition of Total War: EMPIRE, which includes all DLC and feature updates since the game’s release   Take on the Warpath Campaign and lead one of 5 new Native American factions in an epic war to defend your lands and drive out the invaders.   Build up […]"},{"link":"https://nmac.to/blog/tenorshare-any-data-recovery/","image":"https://nmac.to/wp-content/uploads/2018/12/Tenorshare-Any-Data-Recovery.png","title":"Tenorshare Any Data Recovery 2.6.0.6 – Recover Everything without Risk","content":"Tenorshare Any Data Recovery is an macOS application that provides support for file recovery from local hard drive partitions, trash, external drives, memory cards and anything else in between. Get back deleted, formatted or lost data from Mac Recover from hard drive, memory card, and removable devices High data recovery rate and 100% secure   […]"},{"link":"https://nmac.to/blog/perfect-diet-tracker/","image":"https://nmac.to/wp-content/uploads/2015/08/Perfect-Diet-Tracker.png","title":"Perfect Diet Tracker 3.10.3 – Lose weight through diet monitoring","content":"Perfect Diet Tracker is award-winning software for your Mac that can help you monitor your diet and achieve safe and consistent weight loss, maintaining that weight loss once you reach your target.   It’s easy to use, and it works.   The Perfect Diet Tracker is not a ‘fad’ diet, it is a software application […]"}]