[{"link":"https://nmac.to/blog/cloudplay-1-5/","image":"https://nmac.to/wp-content/uploads/2014/06/CloudPlay.png","title":"CloudPlay 1.5 – Music Player for YouTube & SoundCloud","content":"CloudPlay is a menu-bar music player that plays local music in iTunes and also searches for music on YouTube, SoundCloud, exfm, Jamendo, and other sites. Make playlists by combining music from different sources. It’s like Spotlight for music.   Version 1.5: Break free from the menu bar! Click anywhere on the background and drag to […]"},{"link":"https://nmac.to/blog/videoget-7-0-3-89/","image":"https://nmac.to/wp-content/uploads/2014/06/VideoGet.png","title":"VideoGet 7.0.3.89 – Download video clips from YouTube and similar sites","content":"VideoGet for Mac is a tool for OS for downloading your favorite video clips from more than 900+ video (YouTube-alike) websites. It supports such websites like YouTube, Vimeo, Google Video, Yahoo Video, VSocial and a lot more. Most of these video websites are keeping video in FLV format, and a lot of people don’t know […]"},{"link":"https://nmac.to/blog/videobox-4-0-7/","image":"https://nmac.to/wp-content/uploads/2014/04/Videobox.png","title":"Videobox 4.0.7 – Download Flash video through your browser","content":"Videobox allows you to quickly and easily download Flash video from most all of the popular video sites on the internet. Videobox will convert the video into a native Quicktime format so it’s ready to view on your Mac, iPod, iPhone or iTunes.   Version 4.0.7: [NEW] Support for facebook.com videos [NEW] Support for gorillavid.in […]"},{"link":"https://nmac.to/blog/templatebox-1-0/","image":"https://nmac.to/wp-content/uploads/2014/06/TemplateBox.png","title":"TemplateBox 1.0 – Create documents in your working folder quickly and easily","content":"Starting with a template instead of starting from scratch can bring a huge speed boost to your workflow. First you drag frequently used templates into TemplateBox. By using a template to create new documents, you conserve the time and effort spent recreating the wheel every time you want to do a task.   Templates can […]"},{"link":"https://nmac.to/blog/sizzlingkeys-5-1-2/","image":"https://nmac.to/wp-content/uploads/2014/06/SizzlingKeys.png","title":"SizzlingKeys 5.1.2 – iTunes controller","content":"SizzlingKeys Lets you control iTunes without leaving your current application. Control all aspects of iTunes with hot keys that are fully-customizable via an intuitive user interface.   Version 5.1.2: Fixed some performance issues   Intel, 64-bit processor OS X 10.7 or later iTunes 11.2.2 or later     Tusfiles          Uploaded      […]"},{"link":"https://nmac.to/blog/easycrop-2-6-1/","image":"https://nmac.to/wp-content/uploads/2014/06/EasyCrop.png","title":"EasyCrop 2.6.1 – Crops, rotates, and resizes pictures","content":"EasyCrop is an easy-to-use application that crops, rotates, and resizes pictures. EasyCrop works completely by drag-n-drop.   You no longer need to: Navigate through confusing file dialog boxes Make temporary files to delete Make a copy of the original picture   Use EasyCrop to quickly: Prepare photos for emails Add faces to contacts in your […]"},{"link":"https://nmac.to/blog/toast-dvd-1-5/","image":"https://nmac.to/wp-content/uploads/2014/04/Toast.DVD_.png","title":"Toast DVD 1.5 – Burn discs from the movies you create on your Mac","content":"Toast DVD is the easiest and fastest way to create DVDs on your Mac. Toast DVD is the perfect companion for iMovie, making it easy to share your movies with friends and family.   Toast DVD makes it simple for you to burn discs from the movies you create on your Mac.   Burn standard […]"},{"link":"https://nmac.to/blog/weather-live-1-3/","image":"https://nmac.to/wp-content/uploads/2014/06/Weather-Live.png","title":"Weather Live 1.3 – Beautiful weather for multiple locations around the world","content":"Meet Weather Live, the most beautiful weather app. Ever.   Don’t let bad weather take you by surprise! Whether it is cloudy, rainy, snowy, or even stormy outside, Weather Live will provide you with current weather conditions and forecast in your city and multiple locations all around the world. You won’t even have to look […]"},{"link":"https://nmac.to/blog/videomark-2-1/","image":"https://nmac.to/wp-content/uploads/2014/04/VideoMark.png","title":"VideoMark 2.1 – Easily add watermarks to your videos","content":"VideoMark is a fully-featured yet easy-to-use video and movie watermark software which can be used to overlay a digital watermark for video protection or placing a logo for branding your products. VideoMark is the only viable and affordable watermarking solution on the Mac operating system.   VideoMark can help you easily add simple text or […]"},{"link":"https://nmac.to/blog/quickmailer-2-0/","image":"https://nmac.to/wp-content/uploads/2014/03/QuickMailer.png","title":"QuickMailer 2.0 – Send emails quickly and easily through your menu bar","content":"With QuickMailer, sending emails have never been more snappy than with the help of this neat tool in your menubar. QuickMailer sends emails using your primary Mail App account, so no configuration is needed. It also looks up your previous recipients to provide auto-completion. You have the possibility of making the app remember individual fields […]"}]