[{"link":"https://nmac.to/blog/video-editor-enhancer-1-0-59/","image":"https://nmac.to/wp-content/uploads/2016/08/Video.Editor.Enhancer.png","title":"Video Editor Enhancer 1.0.59 – Video editing/video quality enhancer","content":"Video Editor Enhancer does everything to supply you a visual feast by improving video quality better and better. It is the best video editing software to edit your video, enhance the video quality and the viewing experience. It is capable of increasing video resolution, automatically adjusting video brightness and contrast ratio, and removing video noise. […]"},{"link":"https://nmac.to/blog/scriptflow-1-5/","image":"https://nmac.to/wp-content/uploads/2017/05/ScriptFlow.png","title":"ScriptFlow 1.5 – Simple and lightweight code snippets manager","content":"ScriptFlow for macOS is helper tools to keep your code snippets on iCloud , simple and lightweight code snippets manager made for developers with ease of use.   Securely stores your code snippets on iCloud, keeps them updated across all your devices. So you can access from all your devices anywhere.   It comes with: […]"},{"link":"https://nmac.to/blog/nuke-2-0/","image":"https://nmac.to/wp-content/uploads/2017/05/Nuke.png","title":"Nuke 2.0 – Thorough file uninstaller","content":"Nuke removes all the files that would otherwise be left behind when sending your old apps to the trash. With Nuke, you can also reset apps to like-new status, removing all preferences and save-data, prefect for troubleshooting an app that fails to launch. The app also provides uninstallers for software packages like Microsoft Office, Adobe […]"},{"link":"https://nmac.to/blog/cleanusbdrive-1-5-1/","image":"https://nmac.to/wp-content/uploads/2016/09/CleanUSBDrive.png","title":"CleanUSBDrive 1.5.1 – The fastest DS_Store remover for external drives","content":"CleanUSBDrive is an utility to eject any external drive removing those files that you don’t want to see in your smartTV multimedia-browser, for example. It cleans all drives from system junk before ejecting, with a very high performance.   Features Simple and fast Very minimalist design Status bar App Remove .DS_Store, ._AppleDouble, Thumbs.db, .Trashes, .Spotlight, […]"},{"link":"https://nmac.to/blog/ziptite-1-0/","image":"https://nmac.to/wp-content/uploads/2017/05/ZipTite.png","title":"ZipTite 1.0 – So easy, even a caveman can zip it","content":"ZipTite makes creating Zip archives so easy that even a caveman can zip it!   Features ZipTite archives are created with nothing more than drag-and-drop ZipTite can create password-protected Zip archives ZipTite intelligently names archives based on the files being archived ZipTite lives in the menu bar so it is available at all times ZipTite […]"},{"link":"https://nmac.to/blog/pinstripe-1-0-3/","image":"https://nmac.to/wp-content/uploads/2017/05/Pinstripe.png","title":"Pinstripe 1.0.3 – An emotionally charged adventure game","content":"Pinstripe is an emotionally charged adventure through Hell created entirely by a one-man team over the course of five years. Play as Teddy, an estranged ex-minister forced to venture through the frozen afterlife in search of his three-year-old daughter Bo, and her perverse kidnapper. Discover the dark secrets of Teddy’s past, and confront his sleazy, […]"},{"link":"https://nmac.to/blog/picatext-2-0-1/","image":"https://nmac.to/wp-content/uploads/2016/01/picatext.png","title":"picatext 2.0.1 – OCR made simple","content":"pica text is OCR made simple. We included just the functionality you need – nothing that might distract you. That helps focusing on the important things and saves you a lot of time. You need to get the text out of an image or from anywhere on your screen? With picatext this is as easy […]"},{"link":"https://nmac.to/blog/offline-pages-pro-1-4/","image":"https://nmac.to/wp-content/uploads/2016/11/Offline-Pages-Pro.png","title":"Offline Pages Pro 1.4 – Browse the internet without an internet connection","content":"Offline Pages Pro is an offline browser. Download entire websites with all formatting, lightboxes, galleries, and video, so you can browse offline without any Internet connection.   Version 1.4: New feature: Export as local website Improved stability Improved support for Slider Revolution and other WordPress plugins   Intel, 64-bit processor OS X 10.10 or later […]"},{"link":"https://nmac.to/blog/world-to-the-west-1-0/","image":"https://nmac.to/wp-content/uploads/2017/05/World-to-the-West.png","title":"World to the West 1.0 – Adventure, Action & RPG Game","content":"World to the West is an action adventure game developed by Rain Games. It builds upon the universe of indie hit Teslagrad, which has been played by over 1.6 million people so far.   World to the West is a pulpy, cartoony top down action adventure inspired by European adventure comics. Take control of four […]"},{"link":"https://nmac.to/blog/pdf-to-image-pro-3-3-23/","image":"https://nmac.to/wp-content/uploads/2016/12/PDF.to_.Image_.Pro_.png","title":"PDF to Image Pro 3.3.23 – PDF to JPG/PNG and more","content":"Convert PDF to almost any image formats quickly and stay or improve original quality.   PDF to Image Pro can convert PDF to JPEG, PNG, GIF, BMP, TGA, PPM, TIFF and JPEG2000 with high quality. Also, it allows you to finish batch PDF conversion and convert one page PDF. And before you convert PDF to […]"}]