[{"link":"https://nmac.to/blog/bequiet/","image":"https://nmac.to/wp-content/uploads/2017/02/beQUIET-simple.png","title":"beQUIET simple 3.40 – Mute your internal speakers in any condition","content":"beQUIETsimple is designed for journalist, teacher, students and other Macbook users who would like to hear the sound but do not want to disturb others, such as in meetings, classrooms, courts, lectures, theaters, etc.   Benefiting from your Mac’s high-end hardware design, beQUIET guarantees that your speakers stay quiet and your headphones working no matter […]"},{"link":"https://nmac.to/blog/batchgif/","image":"https://nmac.to/wp-content/uploads/2016/07/batchGIF.png","title":"batchGIF 1.92 – Animated GIF Creator Software","content":"With just one click, all your pictures in a folder will be linked into one animated GIF picture.   Unlike other apps that advertise to perform the same function, however, batchGIF will keep your pictures in HIGH resolution. A must-have app for making animated photo albums!   Version 1.92: startup tip modified, please read it […]"},{"link":"https://nmac.to/blog/word-count-popup/","image":"https://nmac.to/wp-content/uploads/2020/02/Word-Count-Popup.png","title":"Word Count Popup 2.50 – Display character, word, and line counts","content":"Pop up a window to display character, word, and line counts whenever and wherever you are copying.   All counted text can also be automatically copied, grouped and saved to daily log files.   Not only can this app count Western alphabets (Latin and Cyrillic), it can even count UTF-8 foreign characters, such as Chinese, […]"},{"link":"https://nmac.to/blog/clone-fighter/","image":"https://nmac.to/wp-content/uploads/2021/01/Clone-Fighter.png","title":"Clone Fighter 1.2 – Find duplicate files","content":"Clone Fighter frees up disk space by finding and deleting duplicate files and folders, giving you a chance to recover gigabytes of your disk space. This scan can reveal just how many copies of the same document, photo or other type of file you have saved, scattered through your disk. All duplicate files are checked […]"},{"link":"https://nmac.to/blog/screensavernow/","image":"https://nmac.to/wp-content/uploads/2021/01/ScreenSaverNow.png","title":"ScreenSaverNow 1.70 – Screen Saver Global Hotkey","content":"A Customizable Global Hotkey or a mouse click activate your screensaver instantly.   Using a screensaver is still the most effective way of protecting your privacy while you are away from your Mac (even for this day and age).   In fact, a screensaver in conjunction with a password may very well be the only […]"},{"link":"https://nmac.to/blog/scrappers/","image":"https://nmac.to/wp-content/uploads/2021/01/Scrappers.png","title":"Scrappers 1.2 – Trash your way to the top!","content":"In Scrappers, up to 4 players can team up to clean up the streets of a futuristic city teeming with garbage — and trash anyone who gets in their way!   You take on the role of the Scrappers, a squad of robot garbage collectors working to clean up a grimy city of the not-so-distant […]"},{"link":"https://nmac.to/blog/big-time-sports/","image":"https://nmac.to/wp-content/uploads/2021/01/Big-Time-Sports.png","title":"Big Time Sports 1.0.13 – Tap, spin, swipe, boom!","content":"Big time arms, big time legs, small time heads. This is the wide world of whacky sports. Big Time Sports pays homage to an era when video games were exhilarating and competitive in spite of their simplicity. Tap that button as fast as you can. Slam that joystick side to side. Up, down, left, right, […]"},{"link":"https://nmac.to/blog/red-reign/","image":"https://nmac.to/wp-content/uploads/2021/01/Red-Reign.png","title":"Red Reign 1.5 – Big Armies – Clever Strategies","content":"Secure your stronghold, prepare your army, and battle to victory in this fun, fast-paced real time strategy game from the makers of Bloons TD.   Whether playing as the fast, well-armored Humans or the fierce, heavy-hitting Orcs, each game plays differently as you choose how to manage your focus and your resources before launching the […]"},{"link":"https://nmac.to/blog/file-multi-tool/","image":"https://nmac.to/wp-content/uploads/2017/03/File-Multi-Tool.png","title":"File Multi Tool 6.24 – File tweaking tool","content":"File Multi Tool is the ultimate file-tweaking tool. It combines the features of Photo Date Changer and File Date Changer 5 and adds a few tricks of its own.   Change JPEG EXIF timestamps at will  Just like Photo Date Changer, File Multi Tool allows you to manipulate JPEG EXIF timestamps at will by setting […]"},{"link":"https://nmac.to/blog/decoherence/","image":"https://nmac.to/wp-content/uploads/2021/01/Decoherence.png","title":"Decoherence 1.2 – Tactical Robot Arena","content":"Build robots from a wide variety of components. Plan a strategy to carry you to victory. Fight as a pilot alongside your bots in exciting PvP matches or test your mettle in the single player Entropy Tribunals experience!   Customize your bots and assign them specific commands to carry out your strategy!   Pilot your […]"}]