[{"link":"https://nmac.to/blog/smart-tunes/","image":"https://nmac.to/wp-content/uploads/2021/01/Smart-Tunes.png","title":"Smart Tunes 1.1.14 – Monitor, manage, save and restore state of iTunes application","content":"Smart Tunes is a small tool to monitor, manage, save and restore state of iTunes application from macOS status menu as iTunes currently lacks these basic features.   Currently available features Automatic starting and stopping of iTunes at Smart Tunes startup and exit Monitoring, saving and restoring iTunes last played track and playing/paused state on […]"},{"link":"https://nmac.to/blog/exif-cleaner-pro/","image":"https://nmac.to/wp-content/uploads/2019/11/EXIF-Cleaner-PRO.png","title":"EXIF Cleaner PRO 3.0.0 – Remove information from your photos","content":"EXIF Cleaner PRO is an application for the removal of information from the photos.   This is necessary when you want to hide your location, model of the camera, and other information contained in the EXIF.   Features: cleaning the EXIF (Author, software, geolocation, device info, others tags); cleaning other metadata; batch processing (Search files […]"},{"link":"https://nmac.to/blog/drop/","image":"https://nmac.to/wp-content/uploads/2016/11/Drop.png","title":"Drop 1.6.4 – Color picker","content":"Drop allows you to pick a color and it will be copied in your preferred format. It’s that easy.   Features: Zooming picker Accurate Touch Bar support Palette   Version 1.6.4: Fixed: The color fields not updating simultaneously Tabbing issues Unwanted characters allowed to be entered into fields   Intel, 64-bit processor OS X 10.11 […]"},{"link":"https://nmac.to/blog/visualgrep/","image":"https://nmac.to/wp-content/uploads/2021/01/VisualGrep.png","title":"VisualGrep 1.2.8 – Non-indexed full text search","content":"Non-indexed full text search of files supporting filters and many folder traversal options.   Version 1.2.8: Fixed memory leak   Intel, 64-bit processor OS X 10.9 or later    "},{"link":"https://nmac.to/blog/wingspan/","image":"https://nmac.to/wp-content/uploads/2021/01/Wingspan.png","title":"Wingspan 15 – Award-winning strategy card game","content":"The officially licensed digital adaptation of Wingspan, the winner of the prestigious 2019 Kennerspiel des Jahres board game award.   You are bird enthusiasts—researchers, bird watchers, ornithologists, and collectors—seeking to discover and attract the best birds to your network of wildlife preserves. Each bird extends a chain of powerful combinations in one of your habitats. […]"},{"link":"https://nmac.to/blog/marble-it-up-mayhem/","image":"https://nmac.to/wp-content/uploads/2021/01/Marble-It-Up.png","title":"Marble It Up: Mayhem 1.3 – Get Ready to Roll!","content":"Marble It Up: Mayhem! is the newest chapter in marble platforming – fresh from the minds behind Marble It Up! and Marble Blast. World-class level design, buttery-smooth controls, and absolutely gorgeous cosmetic options – welcome to the best marble experience yet!   Roll through an expanded single-player campaign and unlockable bonus chapters filled with dangerous […]"},{"link":"https://nmac.to/blog/rollercoaster-tycoon-3-platinum/","image":"https://nmac.to/wp-content/uploads/2015/10/RollerCoaster_Tycoon_3.png","title":"RollerCoaster Tycoon 3 3.3.4 – Theme park management game with expansion packs","content":"Rediscover the critically acclaimed rollercoaster simulation bestseller and feel the thrill of a genre-defining classic, complete with two huge expansion packs.   Your Park. Your Way Whatever you want to create, RollerCoaster Tycoon 3 gives you the tools and freedom to build the amusement park of your dreams.   Manage like a tycoon and make […]"},{"link":"https://nmac.to/blog/train-valley-2/","image":"https://nmac.to/wp-content/uploads/2021/01/Train-Valley-2.png","title":"Train Valley 2 1.4.3.3 – Single player Trains Simulation Game","content":"Train Valley 2 is a train tycoon puzzle game. Take your railroad company from the days of the Industrial Revolution and into the future, meeting the needs of the valley’s cities and industries. Build railroads, upgrade your locomotives, and keep your trains on schedule without delays or accidents. All aboard — the train is leaving […]"},{"link":"https://nmac.to/blog/ilove-video-compressor/","image":"https://nmac.to/wp-content/uploads/2021/01/iLove-Video-Compressor.png","title":"iLove Video Compressor 2.1.0 – Reduce video file size quickly","content":"Large videos often take quite a lot of storage space on your Mac. Do not worry, iLove Video Compressor can help you to reduce the size of your videos. After shrinking using this application, your videos will be slimmer which save more space for you.   Compressing video with ‘iLove Video compressor’ is very easy. […]"},{"link":"https://nmac.to/blog/visual-attributed-string/","image":"https://nmac.to/wp-content/uploads/2017/12/Visual-Attributed-String.png","title":"Visual Attributed String 2.4 – WYSIWYG editor for creating NSAttributedStrings","content":"Visual Attributed String lets you create NSAttributedStrings for your iOS and Mac applications by simply writing text and applying effects to words and paragraphs in the document like you would in any word processing application! Visual Attributed String is the most advanced WYSIWYG (what you see is what you get) editor for attributed strings.   […]"}]