[{"link":"https://nmac.to/blog/zombie-solitaire-2/","image":"https://nmac.to/wp-content/uploads/2018/05/Zombie-Solitaire-2.png","title":"Zombie Solitaire 2 Chapter 3 0.0.14 – Casual Zombies Card Game","content":"Your madcap escape from the genetically altered tofu burger infested Zombies eventually leads you to Egypt. But even there the Zombie invasion is spreading relentlessly. Is there still any hope? A hint leads you to the ultimate Zombie hangout, and off you go, straight through the country, well equipped with plenty of sweets to chase […]"},{"link":"https://nmac.to/blog/sound-forge-pro/","image":"https://nmac.to/wp-content/uploads/2017/02/Sound-Forge3.png","title":"Sound Forge Pro 3.0.0.100 – Record, edit, process, and render broadcast-quality audio","content":"Built on a clean slate for OS X, Sound Forge Pro provides a contemporary application environment that’s perfect for recording, editing, processing, and rendering broadcast-quality audio master files. A fresh statement on audio editing software, Sound Forge Pro Mac includes a comprehensive suite of mastering, restoration, and repair tools for immediate results.   Focused editing […]"},{"link":"https://nmac.to/blog/instant-convert/","image":"https://nmac.to/wp-content/uploads/2016/10/Instant-Convert.png","title":"Instant Convert 1.1.3 – The easiest way to convert images to another format","content":"Instant Convert is probably the easiest way to convert images to another format: simply drag and drop the images to the app icon in the dock then select a format, done!   Version 1.1.3: Fixed an issue which may cause app unable to save multiple images   OS X 10.11 or later, 64-bit processor   […]"},{"link":"https://nmac.to/blog/instant-effect/","image":"https://nmac.to/wp-content/uploads/2016/10/Instant-Effect.png","title":"Instant Effect 1.1.3 – The easiest way to filter your images","content":"Instant Effect is probably the easiest way to filter your images, simply drag and drop them to the app icon then choose your favorite filter, done!   Version 1.1.3: Fixed an issue which may cause app unable to save multiple images   OS X 10.11 or later, 64-bit processor    "},{"link":"https://nmac.to/blog/instant-resize/","image":"https://nmac.to/wp-content/uploads/2016/10/Instant-Resize.png","title":"Instant Resize 1.2.4 – The easiest way to resize images","content":"Instant Resize is probably the easiest way to resize images, just drag and drop them to the app icon then choose a proper size, done!   Version 1.2.4: Fixed an issue which may cause app unable to save multiple images   OS X 10.11 or later, 64-bit processor    "},{"link":"https://nmac.to/blog/advanced-network-care/","image":"https://nmac.to/wp-content/uploads/2018/05/Advanced-Network-Care.png","title":"Advanced Network Care 1.0.1 – Repair, optimize, and maintain your Internet","content":"Advanced Network Care is an app used to repair, optimize, and maintain your Internet.   Features Scanning and fixing your network problems to make your Internet run smoothly. Always keeps an eye on your network’s health.   Version 1.0.1: Fixed occasional crash issues in some situation Improved the compatibility with OS X 10.12 Fixed all […]"},{"link":"https://nmac.to/blog/syncios-data-transfer/","image":"https://nmac.to/wp-content/uploads/2016/11/Syncios-Data-Transfer.png","title":"Syncios Data Transfer 1.3.0 – Recover lost data for iDevices","content":"Syncios Data Transfer provides 3 recovery modes to retrieve data from your iDevice, iTunes backup, and iCloud backup: Recover photos, messages on your iPhone, iPad or iPod Touch, as well as contacts, reminders, calendars, bookmarks, videos, notes, call history, voicemail, voice memos, WhatsApp messages, and other files Restore lost data due to deletion, device damage, […]"},{"link":"https://nmac.to/blog/duplicate-finder/","image":"https://nmac.to/wp-content/uploads/2016/03/Duplicate.Finder.png","title":"Duplicate Finder 1.4.3 – Retrieve and Remove Duplicate Files","content":"Stop cluttering your disk space with meaningless copies of files. With just one click, Duplicate Finder finds all duplicate files on your hard disk. It quickly scans your disk and clearly presents all the duplicates so you can selectively choose which to delete.   A newly added feature, “Photo Clean”, helps you clean duplicate photos […]"},{"link":"https://nmac.to/blog/flix-player-for-youtube/","image":"https://nmac.to/wp-content/uploads/2018/05/Flix-Player-for-YouTube.png","title":"Flix Player for YouTube 2.1.1 – Fast access to YouTube from the menubar","content":"Flix Player gives you fast access to YouTube via the menubar with an option to watch videos Ad-Free in the built in native video player.    Also includes web cam recorder built in.    FEATURES: Quickly access YouTube from your menu bar.  Watch videos from the drop down web viewer or transfer to the built-in […]"},{"link":"https://nmac.to/blog/empire-tv-tycoon/","image":"https://nmac.to/wp-content/uploads/2018/05/EmpireTV.png","title":"Empire TV Tycoon 1.6 – 2D Management & Simulation Game","content":"Empire TV Tycoon is a game in which you manage a TV channel and fight for audiences taking decisions that will project your channel to fame and fortune.You will decide the content of your channel, select advertisers, hire workers, make your own productions, hire actors, and engage in much more activities! It’s inspired by games […]"}]