[{"link":"https://nmac.to/blog/frame-king-v1-0/","image":"https://nmac.to/wp-content/uploads/2013/12/Icon.175x175-7519.png","title":"Frame King v1.0 – Compose pictures into beautiful frames","content":"Frame King is a great application for incorporating several photos into frames and composing amazing pictures. Application has intuitive layout and helps you to create amazing collages in a few simple steps. Unique compositions of framed photos are ideal for sharing with your family, friends and colleagues via e-mail or in social network profile. Furthermore, […]"},{"link":"https://nmac.to/blog/fragment-v1-3-0/","image":"https://nmac.to/wp-content/uploads/2013/12/frag.175x175-75.png","title":"Fragment v1.3.0 – alternative image viewer for the Desktop","content":"Fragment is a cool, alternative image viewer for the Desktop –  Unique HUD UI. Both attractive and useful for keeping image content at maximum screen real-estate. Unique “Fill view” viewing option. Equivalent to Pan-And-Scan, this mode maximizes the use of application window, perfect for Panoramic pictures long tall funny pics from the net. Unique unconstrained […]"},{"link":"https://nmac.to/blog/face4pass-v1-1/","image":"https://nmac.to/wp-content/uploads/2013/12/Face4Pass.175x175-752.png","title":"Face4Pass v1.1 – Create photos for your documents","content":"Face4Pass is an application that allows you to easily create photos for your documents (i.e passport).Drag and drop or open an existing file. What’s New in Version 1.1 – new zoom/pan function– new grid interface ScreenShots :          BitShare Click Here Uploaded Click Here SlingFile Click Here CroCko Click Here FileFactory Click Here […]"},{"link":"https://nmac.to/blog/easy-gif-maker-v1-0/","image":"https://nmac.to/wp-content/uploads/2013/12/icon.175x175-7551.png","title":"Easy GIF Maker v1.0 – GIFs in 3 easy steps","content":"Easy GIF maker lets you quickly make your own animated GIFs in 3 easy steps. You can take as many still images as you want and they will put together into an animated GIF. ScreenShots :         BitShare Click Here Uploaded Click Here SlingFile Click Here CroCko Click Here FileFactory Click Here affiliate […]"},{"link":"https://nmac.to/blog/due-v1-2-1/","image":"https://nmac.to/wp-content/uploads/2013/12/DueOSXIcon.175x175-751.png","title":"Due 1.2.1 – Set reminders in your own words","content":"Due lets you type “Make dinner reservation at 9am tomorrow” and your reminder is set for 9 AM tomorrow.   “Cancel subscription in 1 month” and you get a buzz a month later.   Just tell Due in your own words what you’d like to do, and when you’d like to be reminded.   There […]"},{"link":"https://nmac.to/blog/custommenu-v1-0/","image":"https://nmac.to/wp-content/uploads/2013/12/application.175x175-75.png","title":"CustomMenu v1.0 – Global menu containing your favorite apps, files and folders","content":"CustomMenu lets you build your own global menu containing your favorite apps, files and folders. Once created, you can easily open apps and files or browse folders and access their contents from any app with your CustomMenu. An OS X Dock usually contains running apps, often used apps, files, folders, and minimized windows. By adding items to […]"},{"link":"https://nmac.to/blog/battery-time-remaining-v1-6-1/","image":"https://nmac.to/wp-content/uploads/2013/12/icon.175x175-7553.png","title":"Battery Time Remaining v1.6.1 – Battery time remaining on top of your screen","content":"Show battery time remaining on top of your screenExtra features:– Get notifications when battery is fully charged or on a certain percent– Languages: Dutch, English, French, German, Slovak, Swedish– Show battery temperature, power usage, cycle count and battery in mAh What’s New in Version 1.6.1 Language updates– Added Italian language– Added Korean language– Updated French, […]"},{"link":"https://nmac.to/blog/active-clock-v1-0/","image":"https://nmac.to/wp-content/uploads/2013/12/icon.175x175-7554.png","title":"Active Clock v1.0 – Clock for you desktop","content":"Active Clock is a well organized and functional time piece that will keep you on top of your daily routines. The unique designs are very appealing and the complex interface is well tucked away behind an easy user experience. Lots of choices and set up options. Enjoy all apps from iLifeTouch that make your life […]"},{"link":"https://nmac.to/blog/knox-v2-2-0/","image":"https://nmac.to/wp-content/uploads/2013/12/program-icon.png","title":"Knox v2.2.0 – Secure, integrated encryption and backup solution","content":"Knox is a uniquely integrated encryption and backup solution that makes securing your files easier than ever. Create as many encrypted vaults as you want, each with separate passwords. Then schedule automatic backups. You can even reformat USB sticks and external drives as encrypted Knox vaults – moving files between Macs has never been so […]"},{"link":"https://nmac.to/blog/sweetie-v1-1/","image":"https://nmac.to/wp-content/uploads/2013/12/Sweetie+11.png","title":"Sweetie 1.1 – Turn images into beautiful text art","content":"Sweetie app stylizes images and turns them into beautiful text art. The app has a simple and clean interface that allows one to choose tile type and size, font, charset, color option etc.   Features: Total control over text generator: font, used symbols set, colors. Two layout kinds Accurate edges processing Various colorization and background […]"}]