[{"link":"https://nmac.to/blog/asset-catalog-creator-2-0/","image":"https://nmac.to/wp-content/uploads/2015/12/Asset.Catalog.Creator.png","title":"Asset Catalog Creator 2.0 – Creates a full set of icons and splash screens from an image","content":"Asset Catalogue Creator takes any image and creates the full set of icons and splash screens for you. Unlike other icon generators these are produced in the latest Asset Catalog format allowing you to drag a single file into Xcode and have all the correctly sized and named icons identified and in the right place. […]"},{"link":"https://nmac.to/blog/mischief-2-1-3/","image":"https://nmac.to/wp-content/uploads/2015/12/Mischief.png","title":"Mischief 2.1.3 – Drawing app with infinite definition and canvas","content":"Mischief is an intuitive sketching, drawing, and painting app unlike any other. Mischief uses a revolutionary new stroke representation. Get the richness of pixel-based brushes AND the scalability of vectors. Zoom in to any size and get a perfect edge. Export at any size and resolution. Mischief has a truly infinite canvas. Your artwork can […]"},{"link":"https://nmac.to/blog/portfolio-2016-2-0-2/","image":"https://nmac.to/wp-content/uploads/2015/12/Portfolio.png","title":"Portfolio 2016 2.0.2 – Set of powerful tools for managing digital content","content":"Portfolio is the digital asset management tool for the rest of us. It’s simple to set up, easy to use, and requires little to no ongoing maintenance. Within moments, you can organize your digital files and share them throughout your organization and beyond, allowing everyone to find what they need when they need it.   […]"},{"link":"https://nmac.to/blog/grid-autosport/","image":"https://nmac.to/wp-content/uploads/2015/12/GRID.Autosport.png","title":"GRID Autosport 1.0 – Be fast. Be first. Be famous Racing on the Mac just got exciting again","content":"It’s all about the teams, the rivals and the race in an intense new world of professional motorsport. Racing alongside a teammate, you must overcome key rivals and satisfy team sponsors in ferocious races where every pass and position counts. In a huge career, specialise in your favourite racing discipline or conquer them all feel […]"},{"link":"https://nmac.to/blog/teeny-tokyo-1-2/","image":"https://nmac.to/wp-content/uploads/2015/12/Teeny.Tokyo_.png","title":"Teeny Tokyo 1.2 – A Small Yet Powerful Image & Photo Resizing App","content":"Teeny Tokyo was created with one single goal in mind: Bulk-resize and edit images fast without compromising image quality.   I wanted to create make it as easy as DRAG, DROP, DONE!   Teeny Tokyo allows you to quickly: Mass resize images quickly by simply dragging images or folders Save and lock advanced settings for […]"},{"link":"https://nmac.to/blog/jaksta-screen-recorder-1-0-8/","image":"https://nmac.to/wp-content/uploads/2015/12/Jaksta-Screen-Recorder.png","title":"Jaksta Screen Recorder 1.0.8 – Record videos from thousands of web sites","content":"More than just an ordinary screen recorder, Jaksta Screen Recorder makes it incredibly easy to record videos from thousands of web sites directly to your mac.   THE BEST MAC SCREEN RECORDER Using our unique technology, all you need to do is select the window that video will be played in. Jaksta Screen Recorder does […]"},{"link":"https://nmac.to/blog/tuck-1-0/","image":"https://nmac.to/wp-content/uploads/2015/12/Tuck.png","title":"Tuck 1.0 – Dock any window to the edge of your screen","content":"Tuck allows you to dock any window to the edge of your screen and automatically hide/show when you mouse to that screen edge, like the Dock in OS X.   Version 1.0: Initial release.   Intel OS X 10.6.6 or later Accessibility enabled                             […]"},{"link":"https://nmac.to/blog/macdive-2-5-2/","image":"https://nmac.to/wp-content/uploads/2014/03/MacDive.png","title":"MacDive 2.5.2 – Log scuba dives directly from your dive computer","content":"MacDive is your digital logbook for downloading and logging your dives right from your dive computer! Supporting over 50 models of computer from Atomic Aquatics, Aeris, Mares, Oceanic, Suunto, and more, it’s back for version 2!   Version 2 provides a brand-new interface, bringing with it smart divelogs, iOS syncing, improved gear management, maps, and […]"},{"link":"https://nmac.to/blog/jaksta-media-recorder-1-4-6/","image":"https://nmac.to/wp-content/uploads/2015/12/Jaksta-Media-Recorder.png","title":"Jaksta Media Recorder 1.4.6 – The Best Video and Music Downloader","content":"More than just an ordinary video and music downloader, Jaksta Media Recorder makes it incredibly easy to save and convert videos and music from thousands of web sites directly to your mac.   THE BEST YOUTUBE DOWNLOADER Jaksta Media Recorder can download YouTube videos. Use Jaksta Media Recorder for your YouTube downloads as it is […]"},{"link":"https://nmac.to/blog/switch-galaxy-ultra-1-1/","image":"https://nmac.to/wp-content/uploads/2015/12/Switch-Galaxy-Ultra.png","title":"Switch Galaxy Ultra 1.1 – An insanely addictive, fast-paced arcade challenge","content":"Switch Galaxy Ultra is an insanely addictive, fast-paced arcade challenge. Weave your way past obstacles and enemies as you travel across the galaxy collecting Tantalum for Dakur Technology. It’s loaded with content and features that will have you blazing across the galaxy at breakneck speeds.   Earn credits to spend on new ships and upgrades, […]"}]