[{"link":"https://nmac.to/blog/atom-0-65/","image":"https://nmac.to/wp-content/uploads/2014/03/atom.png","title":"Atom 0.65 – A hackable text editor for the 21st Century","content":"Atom is a desktop application based on web technologies. Like other desktop apps, it has its own icon in the dock, native menus and dialogs, and full access to the file system.   Open the dev tools, however, and Atom’s web-based core shines through. Whether you’re tweaking the look of Atom’s interface with CSS or […]"},{"link":"https://nmac.to/blog/voila-3-7-1/","image":"https://nmac.to/wp-content/uploads/2014/02/Voila.png","title":"Voila 3.7.1 – Capture, annotate, organize, and share media","content":"Voila is a screen-capture, recording, and annotation tool that is a full-featured replacement for Mac’s screen-capture and screen-recording capabilities. It has a large and robust set of editing, organizing, annotation, and effects tools that allows the user to create and add details to screenshots, tutorials, videos, and presentations.   Voila lets you capture any shape, […]"},{"link":"https://nmac.to/blog/intermission-1-0-3/","image":"https://nmac.to/wp-content/uploads/2014/03/Intermission.png","title":"Intermission 1.0.3 – Pause and rewind live audio on your Mac","content":"Intermission allows you to pause and rewind live audio from any application on your Mac. Intermission will buffer up to 3 hours of audio, allowing users to skip through any assortment of audio content.   Version 1.0.3: Intermission now offers full support for OS X 10.9 Mavericks. An issue where Bluetooth audio devices could cause […]"},{"link":"https://nmac.to/blog/cleanmyphone-1-0-2/","image":"https://nmac.to/wp-content/uploads/2014/01/CleanMyPhone.png","title":"CleanMyPhone 1.0.2 – Keep your iPhone, iPad, or iPod touch clean and well-organized","content":"CleanMyPhone is an ingeniously simple and powerful application that will help you keep your iPhone, iPad, or iPod touch clean and running smoothly. It includes useful tools such as Disk Manager, App Cleaner, Removal of Document and Data, Find Large Files, One-Click-Copy, and more.   Configure, Organize and Manage Files and Apps on Your iOS […]"},{"link":"https://nmac.to/blog/robopostman-1-2-7/","image":"https://nmac.to/wp-content/uploads/2014/03/RoboPostman.png","title":"RoboPostman 1.2.7 – Simplify the process of customizing email messages","content":"RoboPostman lets you create a personal look and feel to every message you send out, without the extra effort! RoboPostman allows you to custom tailor messages to include dynamic content specific to each recipient. Include birthdays, custom notes, links with rotating affiliate codes, and more. Use the “Visual” editor to create brilliant messages with fonts, […]"},{"link":"https://nmac.to/blog/instatab-pro-for-instagram-1-02/","image":"https://nmac.to/wp-content/uploads/2014/01/InstaTab-Pro-for-Instagram.png","title":"InstaTab Pro for Instagram 1.02 – Access Instagram directly from your mac desktop","content":"InstaTab Pro for Instagram is new way to access your Instagram. Doesn’t have enough space for a menubar app? Not a problem. We introduce InstaTab Pro that will stick on edges of your screen.   InstaTab Pro for Instagram with these Charming features:   Access your Instagram with “1 click” from your menubar，red camera icon […]"},{"link":"https://nmac.to/blog/iclipboard-4-2-1/","image":"https://nmac.to/wp-content/uploads/2014/03/iClipboard.png","title":"iClipboard 4.2.1 – A flexible clipboard manager","content":"iClipboard is the #1 clipboard manager. Its polished interface and class-leading features set it apart from all others. With the regular copy & paste commands on your computer, you can only paste the very LAST thing you copied. iClipboard makes copy & paste infinitely more useful. It works in the background by keeping a history […]"},{"link":"https://nmac.to/blog/chocolat-2-2/","image":"https://nmac.to/wp-content/uploads/2014/01/Chocolat.png","title":"Chocolat 2.2 – Native Cocoa text editor","content":"Chocolat is a new text editor that combines native Cocoa with powerful text editing tools.    Features: Split editing Code completion Live errors Folding Symbol list Blockedit Vim mode Jump to definition Project find Go to file Web preview Documentation   Version 2.2: Feature: Go to… everything! Bug: Improved Go to File search ordering considerably […]"},{"link":"https://nmac.to/blog/boinxtv-1-9-6/","image":"https://nmac.to/wp-content/uploads/2014/03/BoinxTV.png","title":"BoinxTV 1.9.6 – Live-production software for video podcasters","content":"BoinxTV is the pioneering live-production software for video podcasters that turns any recent Mac into a TV studio “for the rest of us”.   Record stunning studio shows, podcasts, sports events, concerts, interviews, sermons, seminars and more using your Mac, multiple cameras, microphones and other footage. With its innovative user interface, BoinxTV makes it easy […]"},{"link":"https://nmac.to/blog/astro-1-95/","image":"https://nmac.to/wp-content/uploads/2014/01/Astro.png","title":"Astro 1.95 – Facebook Messenger on Mac","content":"Astro is the best Facebook Messenger app on Mac. For the first time, you can use lightening fast FB chat, just like iMessage on Mac   (1) Super fast interface, just like iMessage (2) The only app that supports group chat (3) Drag & Drop to send files (4) Shortcut to make screenshot (5) Background […]"}]