[{"link":"https://nmac.to/blog/blues-and-bullets/","image":"https://nmac.to/wp-content/uploads/2016/04/Blues-And-Bullets.E2.png","title":"Blues and Bullets E2 1.0 – A Dark and violent crime thriller game","content":"Blues and Bullets is a dark and violent crime thriller. Set in an alternative Eliot Ness & Al Capone story, Blues and Bullets blends a stunning script with detective work to deliver an amazing interactive experience.   Eliot Ness, the former leader of the legendary Untouchables, wished only to spend the rest of his days […]"},{"link":"https://nmac.to/blog/monstrum-1-0/","image":"https://nmac.to/wp-content/uploads/2016/04/Monstrum.png","title":"Monstrum 1.0 – Traditional survival & horror game","content":"Monstrum takes the traditional survival horror formula and remixes it completely with procedurally generated levels, permadeath, and AI driven predators, ensuring that nowhere on its derelict cargo ship is ever truly safe.   Offering up a challenge to even the hardiest of gamers, Monstrum will force you to use your wits and whatever tools you […]"},{"link":"https://nmac.to/blog/into-a-black-hole-2-0/","image":"https://nmac.to/wp-content/uploads/2016/04/Into.A.Black_.Hole_.png","title":"Into A Black Hole 2.0 – Learn more about black hole riddle of the Universe","content":"Black Hole is one of the most mysterious phenomenon ever known!   Now, with Into A Black Hole, you have the opportunity to learn more about this riddle of the Universe! You’ll find out new interesting facts and dip into the enigmatic world full of secrets!   Do you know why black holes look very […]"},{"link":"https://nmac.to/blog/habitat-1-0/","image":"https://nmac.to/wp-content/uploads/2016/04/Habitat.png","title":"Habitat 1.0 – A physics-based space game","content":"Earth is doomed and our only hope is getting a survivable habitat up in space using whatever resources are scattered in orbit. You’re left with debris, junk, and other oddities to use for humanity’s survival. Build, upgrade, and control the Habitats that you create as you see fit. The main Campaign will take you through […]"},{"link":"https://nmac.to/blog/epistory-1-0-3/","image":"https://nmac.to/wp-content/uploads/2016/04/Epistory.png","title":"Epistory 1.0.3 – An atmospheric action/adventure game","content":"Epistory is an atmospheric adventure typing game that tells the story of a writer lacking inspiration who asks her muse to help write her latest book.   In Epistory you play the muse, a fictional character in a world where everything is untold. Your adventure begins on a blank page, but the world will soon […]"},{"link":"https://nmac.to/blog/dwellclick-2-2-4/","image":"https://nmac.to/wp-content/uploads/2014/04/DwellClick.png","title":"DwellClick 2.2.4 – Control your Mac with mouse movements only","content":"DwellClick is an app that clicks the mouse for you, and lets you give your fingers a rest!   Click and drag with mouse movements only. No clicking required! Save thousands of clicks per day. No more tired and sore hands. Drag and resize windows so easily it’s like magic! Works great with any trackpad […]"},{"link":"https://nmac.to/blog/drawnstrips-reader-3-1/","image":"https://nmac.to/wp-content/uploads/2016/04/DrawnStrips.Reader.png","title":"DrawnStrips Reader 3.1 – Read comics and manga on your Mac","content":"DrawnStrips Reader is a new reading experience for your comics, manga, on your Mac with Retina display. Reading, with Multi-Touch on your Trackpad and Magic Mouse. It’s like touching your comic book. Reading your manga with interface controls that fade out when they’re not needed. Navigating your comic with thumbnails. Reading your preferred comics in […]"},{"link":"https://nmac.to/blog/sleeping-dogs-definitive-edition/","image":"https://nmac.to/wp-content/uploads/2016/04/Sleeping-Dogs-Definitive-Edition.png","title":"Sleeping Dogs: Definitive Edition 1.1 – Award winning open-world action adventure Game","content":"The Definitive Edition of the critically acclaimed, award winning open-world action adventure, reworked, rebuilt and re-mastered for the new generation. All 24 previously available DLC extensions have been integrated into the game, including the story-extending episode Year of the Snake and the horror-themed Nightmare in North Point. Alongside a wealth of new technological, audio and […]"},{"link":"https://nmac.to/blog/the-guest-1-0/","image":"https://nmac.to/wp-content/uploads/2016/04/The.Guest_.png","title":"The Guest 1.0 – Mystery, Horror, Adventure And Puzzle Game","content":"The Guest is a gloomy adventure full of enigmas where the exploration of your surroundings comes to prominence; puzzles, secrets and riddles will help you discover who has locked you in this somber hotel room and most importantly, why.   KEY FEATURES:   Immersive storytelling.  The mood and the feel of the game, and the […]"},{"link":"https://nmac.to/blog/lucid-1-0-5/","image":"https://nmac.to/wp-content/uploads/2015/11/Lucid1.png","title":"Lucid 1.0.5 – An easy to use software program that makes your pictures look great","content":"LUCiD was designed to help every photo look its best without the work. We all want great-looking photos, a chance to capture a memory and share it with others. But sometimes your smartphone doesn’t quite get the job done. LUCiD lets you improve photos in an instant while you’re on the go and share those […]"}]