[{"link":"https://nmac.to/blog/presentation-helper/","image":"https://nmac.to/wp-content/uploads/2021/11/Presentation-Helper.png","title":"Presentation Helper 1.8 – Assistant for Demo Presentaion","content":"Present anything from your desktop like a charm. Explain more effectively with help of annotation tools that appear over any screen. Draw circles, rectangles and lines.   Presentation Helper is a light weight menu bar app that assists you, when you are presenting anything from your desktop, to highlight, annotate, mark anything to explain things […]"},{"link":"https://nmac.to/blog/webcachebrowser/","image":"https://nmac.to/wp-content/uploads/2021/11/WebCacheBrowser.png","title":"Web(Cache)Browser 1.7 – Browse Safari’s cache content","content":"Web(Cache)Browser is an application that allows to browse Safari’s cache content. So it is possible to retrieve resources that have been downloaded by the web browser, for example to use them offline.   You can find specific elements thanks to the search field or by selecting a type of resources to display.   Just press […]"},{"link":"https://nmac.to/blog/video-subtitler/","image":"https://nmac.to/wp-content/uploads/2021/11/Video-Subtitler.png","title":"Video Subtitler 3.0 – 2-in-1. Soft or Hard Subltitle","content":"2-in-1. Subtitle any Video (Both Hard or Soft) using a single App!   Super simple to use. Just 3 steps: Drag & Drop any video. Add Subtitle(s). Save Video. That’s it!   Two Modes. Switch between them just with a click of a button.   Hard Subtitle mode: Subtitle text permanently embeds above the video […]"},{"link":"https://nmac.to/blog/yummy/","image":"https://nmac.to/wp-content/uploads/2020/12/Yummy.png","title":"Yummy 3.4 – The only video downloader you’ll ever need","content":"Download videos, music, or both from any website and instantly export to the format you want.   FEATURES:   Easy-to-use Either add your links one by one, or drag’n’drop them directly. Yep, that’s it! With its super simple user interface, your biggest trouble will be to choose all the videos you want to download.   […]"},{"link":"https://nmac.to/blog/extract-any-audio-pro/","image":"https://nmac.to/wp-content/uploads/2021/11/Extract-Any-Audio-Pro.png","title":"Extract Any Audio Pro 2.0 – Two modes: As it is. / As .mp3","content":"Best .mp3 convertor. Extract & convert any audio track from any Video or Audio file to .mp3.   Super simple to use. Just 3 steps: Drag & Drop any number of video or audio files. Select whether the audio needs to be extracted as is or converted to .mp3. Click Extract Audio. That’s all!   […]"},{"link":"https://nmac.to/blog/mute-any-video-pro/","image":"https://nmac.to/wp-content/uploads/2021/11/Mute-Any-Video-Pro.png","title":"Mute Any Video Pro 2.0.1 – Zero quality loss. Super fast","content":"Multiple files. Just one click. Mute them All.   Super simple to use. Just 2 steps: Drag & Drop any number of videos. Click Mute Videos. That’s it!   Any Input Video. Supports almost all video formats, codecs, containers and file extensions. Lossless. Zero loss of Video Quality. Thanks to No Encoding Logic. Incredibly Fast. […]"},{"link":"https://nmac.to/blog/anyrec-screen-recorder/","image":"https://nmac.to/wp-content/uploads/2021/11/AnyRec-Screen-Recorder.png","title":"AnyRec Screen Recorder 1.0.12 – Unlimited Screen Recording","content":"Explore Unlimited Screen Recording Like a Pro. AnyRec Screen Recorder is the easiest and most reliable screen recorder for Mac. You can record gameplay, meetings, and any other video and audio activities losslessly. No lag. No quality loss.   Record Video Capture any screen video with custom screen size and annotations.   Capture Audio Record […]"},{"link":"https://nmac.to/blog/studies/","image":"https://nmac.to/wp-content/uploads/2017/03/Studies.png","title":"Studies 1.8.4 – Flashcards for Serious Students","content":"Studies (was Mental Case) is a flashcard app for the serious student, with editions for Mac, iPhone and iPad. It’s a tool to extend your knowledge, and it doesn’t matter what it is you want to learn – medicine, law, history, driving, aviation, fine art, music, or martial arts – from simple day-to-day tidbits, to […]"},{"link":"https://nmac.to/blog/iexplorer/","image":"https://nmac.to/wp-content/uploads/2016/08/iExplorer4.png","title":"iExplorer 4.5.0 – View and transfer all the files on your iOS device or iPod [FIX]","content":"iExplorer is an iPhone browser for Mac lets you view the files on your iOS device. By using a drag and drop interface, you can quickly copy files and folders between your Mac and your iPhone or iTouch. It works with both jailbroken and non-jailbroken iPhones and works quickly with a standard USB cable.   […]"},{"link":"https://nmac.to/blog/banktivity/","image":"https://nmac.to/wp-content/uploads/2020/02/Banktivity_7.png","title":"Banktivity 7.5.3 – Intuitive personal finance manager; widget available (was iBank) [FIX]","content":"Banktivity (was iBank) is a new standard for Mac money management. With its intuitive user interface and a full set of money-management features, Banktivity is the most complete software available for Mac personal finance. It lets you enter and edit your transactions with ease, pay bills online and on time, download your online account data, […]"}]