[{"link":"https://nmac.to/blog/bcanalyze3-light/","image":"https://nmac.to/wp-content/uploads/2021/03/bcAnalyze3-Light.png","title":"bcAnalyze3 Light 1.3.6 – High resolution bat call recordings","content":"bcAnalyze 3 is specialized on working with high resolution bat call recordings either in wav or raw format. It was written for bat researchers as well as hobbyists. This version enables you to do what you need to identify species. And that with the lightning speed. Visualize bat calls as sonogram or spectrum and use […]"},{"link":"https://nmac.to/blog/statistics-pro/","image":"https://nmac.to/wp-content/uploads/2021/03/Statistics-Pro.png","title":"Statistics Pro 1.4 – Accurately calculate formulas in Statistics, Business Statistics … etc","content":"Statistics is a great class, but the nature of the calculations in homework, quizes and tests can be tedious and time-consuming. You can fully understand the formula you’re working with and the calculation you’re doing, but one slight miscalculation will affect the entire formula and produce a wrong answer!   Introducing Statistics Pro — the […]"},{"link":"https://nmac.to/blog/live-performer/","image":"https://nmac.to/wp-content/uploads/2021/03/Live-Performer.png","title":"Live Performer 1.0.1 – Audio Unit Host that captures music inspiration","content":"Live Performer is a new Audio Unit Host for macOS designed for capture your music inspiration. It offers an always recording mode so you can improvise with your keyboards and all your midi events will be always recorded.   Live Performer is also meant for play live, with a rack of 4 Audio Units and […]"},{"link":"https://nmac.to/blog/client-folder-maker/","image":"https://nmac.to/wp-content/uploads/2021/03/Client-Folder-Maker.png","title":"Client Folder Maker 5.0 – Quickly make folder structures","content":"Client Folder Maker utilizes a very simple approach to building custom folder sets for any job. Easily add, rename, or delete folders in the hierarchy and create new files under the folder tree. You can use any other variables in addition to, or in place of, the client name or job number, so the possibilities […]"},{"link":"https://nmac.to/blog/xstab/","image":"https://nmac.to/wp-content/uploads/2021/03/XSTab.png","title":"XSTab 2.0 – Generate guitar tabs","content":"XSTab is a tool designed to assist guitar players to find out what is really played in an Audio File focusing on classical guitar music pieces. Based on WAV-audio files XSTab generates guitar tabs and provides many filters to optimize and simplify these tabs to your needs.   All tabs and subsets of these tabs […]"},{"link":"https://nmac.to/blog/range/","image":"https://nmac.to/wp-content/uploads/2021/03/Range.png","title":"Range 3.0 – Random Number Generato‪r‬","content":"Range let’s you easily generate random numbers.   Simply select a From value and a To value and Range will select a number between those two. Keep tapping Generate and Range will keep selecting integers!   Get started with the following key features:   RANDOM NUMBER GENERATOR Range makes it quick and simple to generate […]"},{"link":"https://nmac.to/blog/photo-effects-pro/","image":"https://nmac.to/wp-content/uploads/2016/07/Photo-Effects-Pro.png","title":"Photo Effects Pro 6.2 – Add professional effects to your photos","content":"Photo Effects Pro brings large number of creative colourful image effects (more than 270 effects) to get amazing results instantly.   large number of eye catching effects to make your photos look stunning. 270+ colourful filters. Live preview Save as TIFF, JPEG and other formats more than 50+ raw image format supported. easy and efficient […]"},{"link":"https://nmac.to/blog/pop-dot-comics/","image":"https://nmac.to/wp-content/uploads/2018/10/Pop-Dot-Comics.png","title":"Pop Dot Comics 2.14 – Create comic-book illustrations from your photos","content":"Pop Dot Comic is a fun way to create comic-book style illustrations from your snapshot or ones taken of your friends and family. Pop Dot Comic applies thick outlines, bold colors, and plenty of benday dots to newsprint or pulp papers to give every creation the look of one that’s been printed or published.   […]"},{"link":"https://nmac.to/blog/image-enhance-pro/","image":"https://nmac.to/wp-content/uploads/2020/04/Image-Enhance-Pro.png","title":"Image Enhance Pro 5.2 – Enhance color and details of your photos","content":"Image Enhance Pro is a tool to produce HDR image, with extended range of dynamic lighting and detail. Our advance HDR algorithm will take a single picture as an input and provide it amazing HDR look by enhancing color and details. Other than HDR look you can also use other filters to get desired output. […]"},{"link":"https://nmac.to/blog/data-creator/","image":"https://nmac.to/wp-content/uploads/2016/05/Data-Creator.png","title":"Data Creator 1.8.1 – Create datasets for database testing and demos","content":"Data Creator can create sample tables (rows and columns) as you like and fill them with pseudo-random proper content (rows of content) with a single click.   You can select which kind of fields (columns) you like (name of animals, colors, fruits, english surname, german names and so on with over 50 different kind of […]"}]