[{"link":"https://nmac.to/blog/shellcraft-1-0-8/","image":"https://nmac.to/wp-content/uploads/2016/12/ShellCraft.png","title":"ShellCraft 1.0.8 – Modern and Powerful SSH Client","content":"A modern and powerful SSH/Telnet client with entire fresh design and excellent experience.   With convenient and powerful user interface, ShellCraft significantly improve your efficiency. ShellCraft implements the standard SSH/Telnet protocol, it can simply connect to various servers. The session management function make you managing sessions easily, connecting to session is very convenient from anywhere. […]"},{"link":"https://nmac.to/blog/guru-designs-3-0/","image":"https://nmac.to/wp-content/uploads/2017/03/Guru-Designs.png","title":"Guru Designs 3.0 – Templates for Pages","content":"The premium-quality Templates for Pages – Guru Templates selection offers 87 beautiful and functional designs for Apple’s Pages.   Leave design for us – focus on content!   Features:   More than 200 layouts Themes for Pages – Templates Guru – brochures, reports set gives a large selection of templates from Invitations to Posters and […]"},{"link":"https://nmac.to/blog/falcon-1-5/","image":"https://nmac.to/wp-content/uploads/2016/06/Falcon.png","title":"Falcon 1.5 – A simple, markdown based note-taking app","content":"Falcon is a simple, markdown based note-taking app.   Features Write notes, journals and research Organise notes in multiple notebooks for various topics Supports adding images to your notes Search notes easily by their title, content or tags Editor-only and Preview-only modes allow to edit and read notes in an uncluttered and focused way. Backup […]"},{"link":"https://nmac.to/blog/intensify-1-2-3/","image":"https://nmac.to/wp-content/uploads/2014/05/Intensify.png","title":"Intensify 1.2.3 – Create clarity and intensity in your photos","content":"Intensify lets discerning photographers of all skill levels create powerful photographic images with unprecedented drama and detail. Precise control of contrast, structure, detail and sharpening across different tonal ranges delivers high quality results every time.   Special algorithms to prevent image artifacts, image layer stacking with opacity control, dozens of professionally created presets, adjustment brushes, RAW […]"},{"link":"https://nmac.to/blog/cleanusbdrive-1-4/","image":"https://nmac.to/wp-content/uploads/2016/09/CleanUSBDrive.png","title":"CleanUSBDrive 1.4 – The fastest DS_Store remover for external drives","content":"CleanUSBDrive is an utility to eject any external drive removing those files that you don’t want to see in your smartTV multimedia-browser, for example. It cleans all drives from system junk before ejecting, with a very high performance.   Features Simple and fast Very minimalist design Status bar App Remove .DS_Store, ._AppleDouble, Thumbs.db, .Trashes, .Spotlight, […]"},{"link":"https://nmac.to/blog/clear-day-3-1-0/","image":"https://nmac.to/wp-content/uploads/2015/02/Clear-Day.png","title":"Clear Day 3.1.0 – Weather forecasts with alerts for U.S. and Europe","content":"Clear Day (was Weather HD), the iPhone and iPad’s top-selling weather application, brings the stunning beauty and design of Weather HD tailored and specifically designed for OS X.   Features: Weather forecasts in more than 150,000 locations around the world. Stunning high-definition animations that depicts the weather conditions. Severe Alerts in the U.S. and Europe. […]"},{"link":"https://nmac.to/blog/the-lord-of-the-rings-bme-ll-2-01/","image":"https://nmac.to/wp-content/uploads/2017/03/The-Lord-Of-The-Rings.png","title":"The Lord Of The Rings BME ll 2.01 – Famous RPG & Strategy Game [Wineskine]","content":"Lord of the Rings, The Battle for Middle-Earth II: The Rise of the Witch-King expands the universe Tolkien created. This expansion pack to the fan favorite game series lets you command the rise of evil in Middle-earth while experiencing the epic battles that took place before the films.   Become the leader of an evil […]"},{"link":"https://nmac.to/blog/screenshot-maker-movavi-1-0/","image":"https://nmac.to/wp-content/uploads/2017/03/Screenshot.Maker_.Movavi.png","title":"Screenshot Maker Movavi 1.0 – Grab & Edit Screen Images","content":"Take high-quality snapshots of everything that happens on your Mac screen and save the images in most popular formats.   With Screenshot Maker Movavi, you can: Save high-resolution pictures of your desktop Edit screenshots: crop, add arrows, captions, and more Export the result in almost any format   QUICK CAPTURE Select the exact area you […]"},{"link":"https://nmac.to/blog/movie2picture-3-03/","image":"https://nmac.to/wp-content/uploads/2017/03/movie2picture.png","title":"movie2picture 3.03 – Extract all frames of your movie into high-resolution pictures","content":"Still using snapshot or screen-capture on obtaining single frame image of a movie? Tired of fast forwarding, rewinding, and rewinding some more, but still cannot find the frame you want? Then movie2picture is just the one you need.   Drag and drop a video file to movie2picture, and it will find the highest possible resolution […]"},{"link":"https://nmac.to/blog/bee-2-4-9/","image":"https://nmac.to/wp-content/uploads/2015/03/Bee.png","title":"Bee 2.4.9 – Client for tracking in FogBugz, GitHub, and JIRA","content":"Bee syncs with GitHub Issues, JIRA, and FogBugz. You can also use Bee to keep track of your plain text notes.   Features: Flight Path. Flight Path lives in your menu bar and helps you by intelligently selecting the task you should be working on next. Notifications. Bee uses Notification Center to inform you of […]"}]