[{"link":"https://nmac.to/blog/wondershare-photo-cutter/","image":"https://nmac.to/wp-content/uploads/2020/02/Wondershare-Photo-Cutter.png","title":"Wondershare Photo Cutter 1.0.7 – Crop photos or remove unwanted objects from pictures easily","content":"Anyone love or hate clicking Selfies and posting them on social media with cool effects is a modern fact of life. The right smartphone with the high quality megapixel cameras can click the right photos in high quality but this is not always true that you get the photos in the angle you are looking. […]"},{"link":"https://nmac.to/blog/edna-harvey-the-breakout/","image":"https://nmac.to/wp-content/uploads/2020/02/Edna..Harvey.The_.Breakout.png","title":"Edna & Harvey: The Breakout 0.19120404 – Anniversary Edition","content":"For “Edna & Harvey: The Breakout – Anniversary Edition”, Daedalic’s classic has been redrawn and received a complete overhaul: high resolution visuals, new technology, intuitive controls – it’s a truly insane adventure. Experience this quirky cult classic with Edna & Harvey anew, but better than ever before – or discover this gem for the first […]"},{"link":"https://nmac.to/blog/audfree-tidal-music-converter/","image":"https://nmac.to/wp-content/uploads/2020/02/AudFree-Tidal-Music-Converter.png","title":"AudFree Tidal Music Converter 1.4.0 – Convert Tidal Music/Playlist to MP3","content":"With over 60 million tracks on its music library, Tidal is famous for the HiFi streaming service. But as a subscription-based music streaming service, you can download and play Tidal music and playlists on authorized devices and music player only.   Now, with the assistance of AudFree Tidal Music Converter for Mac, it couldn’t be […]"},{"link":"https://nmac.to/blog/daylight/","image":"https://nmac.to/wp-content/uploads/2018/05/Daylight.png","title":"Daylight 5.2.12810 – Shot management and high-performance transcoding","content":"Daylight is designed as a compact yet powerful grading decision tool to help DoPs and directors establish looks and visualise what they have shot, on set or on location, as well as meeting all of the sophisticated deliverables requirements—in one application.   Full Baselight creativity Grades can of course be limited to CDL values or […]"},{"link":"https://nmac.to/blog/book-of-demons/","image":"https://nmac.to/wp-content/uploads/2019/04/Book-of-Demons.png","title":"Book of Demons 1.03.20073 – A Hack & Slash Deck-building hybrid Game","content":"Book of Demons is a Hack & Slash Deck-building hybrid in which YOU decide the length of quests. Wield magic cards instead of weapons and slay the armies of darkness in the dungeons below the Old Cathedral. Save the terror-stricken Paperverse from the clutches of the Archdemon himself!  Procedurally Generated Dungeons Roguelike Mode for fans […]"},{"link":"https://nmac.to/blog/late-shift/","image":"https://nmac.to/wp-content/uploads/2020/02/Late-Shift.png","title":"Late Shift 202020107 – A high stakes FMV crime thriller game","content":"Late Shift is a high stakes FMV crime thriller. After being forced into the robbery of a lucrative auction house, mathematics student Matt is left proving his innocence in the brutal London heist. Your choices will have consequences from the very start, right through to the very end. One small decision could change the entire […]"},{"link":"https://nmac.to/blog/clarion/","image":"https://nmac.to/wp-content/uploads/2020/02/Clarion.png","title":"Clarion 2.2 – Musical intervals quizzer","content":"Clarion is a quizzing partner that helps you focus on the specific music intervals you need the most help with. Its streamlined interface offers a number of handy features to make the most of the effort you put into ear training practice: Customize the instrument used for playing notes Interactive piano-style keyboard to for pitch […]"},{"link":"https://nmac.to/blog/wireframesketcher/","image":"https://nmac.to/wp-content/uploads/2016/06/WireframeSketcher.png","title":"WireframeSketcher 6.2.1 – Create prototype desktop, Web, and mobile apps","content":"WireframeSketcher (was WireframeSketcher Studio) is a wireframing tool that helps designers, developers, and product managers quickly create wireframes, mockups, and prototypes for desktop, Web, and mobile applications. It’s a desktop app and a plug-in for any Eclipse IDE.   Version 6.2.1: Updated: Standalone version to Eclipse 4.14 platform Font Awesome icons to version 5.12.0 Fixed: […]"},{"link":"https://nmac.to/blog/virus-scanner-plus/","image":"https://nmac.to/wp-content/uploads/2017/10/Virus-Scanner-Plus3.png","title":"Virus Scanner Plus 3.14 – Scan files, locations, or your entire system for viruses","content":"Virus Scanner Plus lets you scan running apps, scan critical locations, scan the entire system whenever you choose, or even activate Continuous Scan to keep Virus Scanner Plus running all the time. If you download or receive an infected file or attachment your Mac will be protected and your friends’ computers safe.   Version 3.14: […]"},{"link":"https://nmac.to/blog/fivenotes/","image":"https://nmac.to/wp-content/uploads/2017/07/FiveNotes.png","title":"FiveNotes 2.2.2 – Markdown-based text editor for notes","content":"FiveNotes (formerly known as Quick) is a small text editor that you can always access by clicking (or pressing shortcut keys) on its mtatus-bar icon, even if you’re working in a full-screen app. If you prefer, it can stay on top of the window so it can be used as a cheat-sheet app. FiveNotes offers […]"}]