[{"link":"https://nmac.to/blog/enolsoft-pdf-compressor/","image":"https://nmac.to/wp-content/uploads/2018/07/Enolsoft-PDF-Compressor.png","title":"Enolsoft PDF Compressor 3.4.0 – Reduce PDF Size on Mac by One Click","content":"Enolsoft PDF Compressor for Mac compresses and reduces PDF file size by optimizing the resolution and compression method of images, removing unused thumbnails and metadata, stripping dead-object and compressing other parts of PDF files. Supports drag-n-drop to batch compress multiple PDFs instantly at a time.   Smaller, Store Easily After reduced PDF files size, the […]"},{"link":"https://nmac.to/blog/swish/","image":"https://nmac.to/wp-content/uploads/2020/03/Swish.png","title":"Swish 1.4 – The missing gesture layer for macOS","content":"Control windows and applications right from your trackpad with intuitive two-finger swipe, pinch, tap and hold gestures.   More than just a window manager. Swish features 28 easy-to-use titlebar, dock and menubar gestures that will supercharge your workflow and make you a trackpad power user. Every detail is carefully designed to make it feel truly […]"},{"link":"https://nmac.to/blog/avalanche-for-lightroom/","image":"https://nmac.to/wp-content/uploads/2020/03/Avalanche-For-Lightroom.png","title":"Avalanche For Lightroom 1.1.2 – Move your pictures between apps without losing settings","content":"Avalanche allows you to migrate your Aperture or Lightroom libraries without loosing your settings, manage all your library migrations on your Mac in a few clicks. From Apple Aperture to Adobe Lightroom, Avalanche makes it easy to move your pictures between apps without ever losing your organization structure and image settings.   Version 1.1.2: Added: […]"},{"link":"https://nmac.to/blog/beamer/","image":"https://nmac.to/wp-content/uploads/2017/07/Beamer.png","title":"Beamer 3.4 – Stream any movie file from your Mac to Apple TV","content":"Beamer streams to your Apple TV….   Plays any movie file – Just like the popular desktop movie players, Beamer accepts all common formats, codecs and resolutions. AVI, MKV, MOV, MP4, WMV, FLV. To Beamer, it’s all the same.   High quality image and sound – Unlike Screen Mirroring, Beamer is specifically optimized for video […]"},{"link":"https://nmac.to/blog/beyond-the-kingdom-2/","image":"https://nmac.to/wp-content/uploads/2020/03/Beyond-the-Kingdom-2.png","title":"Beyond the Kingdom 2 Collector’s Edition 1.0 – Time Management Game","content":"The Fairy Kingdom is in trouble. Dark forces burst into all corners of the wonderland. Embark on an incredible adventure to help the King and his faithful assistants restore peace in the Fairy Kingdom and learn the secret of pirates! Various quests to complete Colorful graphics Hundreds of game objects Intriguing story Play through Bonus […]"},{"link":"https://nmac.to/blog/virtualhostx/","image":"https://nmac.to/wp-content/uploads/2017/06/VirtualHostX7.png","title":"VirtualHostX 8.7.16 – Host multiple websites on your Mac","content":"VirtualHostX is the easiest way to host and share multiple websites on your Mac. It’s the perfect solution for web designers working on more than one project at a time. With VirtualHostX you can easily create and manage unlimited Apache websites with just a few clicks.   Version 8.7.16: This is just a quick update […]"},{"link":"https://nmac.to/blog/steuererklarung/","image":"https://nmac.to/wp-content/uploads/2019/11/Steuererklärung.png","title":"Steuererklärung 2.10.4 – German finance manager","content":"Warum gibt es vom Finanzamt eigentlich keine Steuersoftware für den Mac? Das weiß niemand so genau, aber die gute Nachricht ist: Es gibt endlich Ersatz!   Mit „Steuererklärung“ reichen Sie im Handumdrehen per ELSTER Ihre Einkommensteuererklärung ein – so einfach wie der Name der App verspricht.   Auch Unternehmer und Freiberufler kommen nun ohne teure […]"},{"link":"https://nmac.to/blog/picconvert/","image":"https://nmac.to/wp-content/uploads/2017/09/PicConvert.png","title":"PicConvert 1.2 – Powerful image converter","content":"PicConvert allows you to convert, resize and rename thousands of image files in batch mode. Select the images that you want to convert, choose an image format, select the folder where you want your converted images to be saved and you’re done! Your images will be converted in a matter of seconds. Easy and effective. […]"},{"link":"https://nmac.to/blog/progressive-downloader/","image":"https://nmac.to/wp-content/uploads/2015/10/Progressive-Downloader4.png","title":"Progressive Downloader 4.6 – Download manager with multi-threading options","content":"Progressive Downloader is a free download manager for Mac that supports multi-thread downloading and mirror search.   Key features: HTTP(S), FTP and SFTP(SSH) protocols support. Auto-resume downloads. Any interrupted download will be automatically resumed when your system wakes up or the application relaunches. Multi-thread downloads. Application downloads different parts of the file at the same […]"},{"link":"https://nmac.to/blog/smartalbums/","image":"https://nmac.to/wp-content/uploads/2016/02/SmartAlbums2.png","title":"SmartAlbums 2.1.13 – Building albums so easy that they are actually fun to make","content":"SmartAlbums is a revolutionary software that will allow create photo albums fast and really fun! Easy installation, saving time, creative! Experiment with design, mix and arrange the photos … Use your predefined templates, or use the opportunity to create your own. SmartAlbums established photographers and graphic designers with the use of innovative technology, which is […]"}]