[{"link":"https://nmac.to/blog/coiney-1-0-2/","image":"https://nmac.to/wp-content/uploads/2017/01/Coiney.png","title":"Coiney 1.0.2 – Cryptocurrency ticker for the menu bar","content":"Coiney is a menu-bar cryptocurrency ticker that lets you follow current rates for all major e-coins such Bitcoin, Litecoin, Ethereum, and more. You can add the most important rates to your menu bar to make them always visible, or add them to a favourites list so they can be just one click away. With just […]"},{"link":"https://nmac.to/blog/app-for-imdb-1-5/","image":"https://nmac.to/wp-content/uploads/2017/01/App-for-IMDB.png","title":"App for IMDB 1.5 – Fast and instant access to IMDB","content":"App for Internet Movie Database that gives you fast and instant access to IMDB directly from your toolbar. Discover new and old movies or series faster than ever with IMDBs mobile web application on your computer. Easy switch to “desktop mode” for the full experience.   Just click the App for IMDB icon in your […]"},{"link":"https://nmac.to/blog/vector-36-1-0/","image":"https://nmac.to/wp-content/uploads/2017/01/Vector.36.png","title":"Vector 36 1.0 – Physics-Based Racer set on the terraformed surface of Mars","content":"Vector 36 is Physics-Based Racer set on the terraformed surface of Mars. You pilot a Skimmer, a completely customizable, surface skimming vehicle. With total control over every component, you are responsible for how your Skimmer performs. Piloting skill and engineering make the difference between winning and losing.   Race other pilots through various tracks on […]"},{"link":"https://nmac.to/blog/adobe-flash-builder-4-7/","image":"https://nmac.to/wp-content/uploads/2017/01/Adobe-Flash-Builder.png","title":"Adobe Flash Builder 4.7 – Rapidly build applications using ActionScript and Flex","content":"Adobe Flash Builder Premium software is an Eclipse based development tool for rapidly building standout mobile, web, and desktop applications using ActionScript and the open source Flex framework. Use professional testing tools to build higher performing applications.   Version 4.7: Release features AIR SDK 3.4 support for ActionScript workflows (AIR SDK 3.4 enables runtime features […]"},{"link":"https://nmac.to/blog/ssh-copy-17-01-5/","image":"https://nmac.to/wp-content/uploads/2017/01/SSH-Copy.png","title":"SSH Copy 17.01.5 – Secure File Transfer Client App","content":"SSH Copy is an intuitive SFTP (Secure File Transfer Protocol) client lets you manage remote files as in Finder.   Notable Features: Uploading / downloading your remote files or folders by drag and drop Holds multiple SFTP sessions for different servers Switch between SFTP sessions using swipe gestures with Trackpad or Magic Mouse Automatically reconnect […]"},{"link":"https://nmac.to/blog/infographics-lab-for-powerpoint-1-0-1/","image":"https://nmac.to/wp-content/uploads/2017/01/Infographics-Lab-for-PowerPoint.png","title":"Infographics Lab for PowerPoint 1.0.1 – Templates Bundle","content":"Infographics Lab for PowerPoint contains a massive collection of thousands of data visualization tools to illustrate and enhance your Microsoft PowerPoint presentations! Every single item is crafted to perfection to be visually captivating and easily customizable.   Infographics Lab for PowerPoint has items for virtually any occasion, from charts and diagrams to editable city, state, […]"},{"link":"https://nmac.to/blog/chocolat-3-3-4/","image":"https://nmac.to/wp-content/uploads/2014/12/Chocolat3.png","title":"Chocolat 3.3.4 – Native Cocoa text editor","content":"Chocolat is a new text editor that combines native Cocoa with powerful text editing tools.    Features: Split editing Code completion Live errors Folding Symbol list Blockedit Vim mode Jump to definition Project find Go to file Web preview Documentation   Version 3.3.4: New Cmd-click on a Python module import to open its documentation Copy […]"},{"link":"https://nmac.to/blog/3d-converter-6-3-93/","image":"https://nmac.to/wp-content/uploads/2016/11/3D-Converter.png","title":"3D Converter 6.3.93 – 2D to 3D video conversion","content":"3D Converter – The best 3D Video Converter with most 3D modes.   If you are 3D video lover, you shouldn’t miss this 3D Video Converter.It can convert 2D Video to 3D Effect, 3D video to other 3D modes, 3D video to common 2D video easily and fast. It provides Anaglyph, Side by Side or […]"},{"link":"https://nmac.to/blog/xview-2-0-0/","image":"https://nmac.to/wp-content/uploads/2017/01/XView-2.png","title":"XView 2.0.0 – Photo Image Viewer and Video Player","content":"XView 2 is a full-featured video player and image browsing tool to directly view images and play video & audio files in archive without unzip. It also supports lossless compress photos, browse 3D model files and find duplicate images.   Key Features: View images in normal or full screen modes and enjoy full screen slideshow: […]"},{"link":"https://nmac.to/blog/weather-5-days-1-3/","image":"https://nmac.to/wp-content/uploads/2017/01/Weather-5-days.png","title":"Weather 5 days + 1.3 – The weather app for your status bar","content":"The simplest weather app! Thanks to geolocation, you know immediately the weather for your current location. To get a forecast for any other location worldwide, you just have to ask the built-in search engine!   “5 days weather” is also one of the most complete weather apps! The data (temperature, humidity, cloud cover, visibility, wind […]"}]