[{"link":"https://nmac.to/blog/pictary-2-1-3/","image":"https://nmac.to/wp-content/uploads/2014/01/Pictary.png","title":"Pictary 2.1.3 – Captures your emotions, feelings and look on your mac","content":"Imagine an App that captures your emotions, feelings and look while you’re using your Mac! Pictary will take care of all that! It creates a personal diary but instead words it uses pictures to capture you and others in front of your Mac. Utilizing the built in Camera it takes pictures every time you start, […]"},{"link":"https://nmac.to/blog/flightradar24-1-9-8/","image":"https://nmac.to/wp-content/uploads/2014/01/Flightradar24.png","title":"Flightradar24 1.9.8 – Turns your Mac into an air traffic radar monitor","content":"Flightradar24 turns your Mac into an air traffic radar monitor. See airplane traffic around the world move in real-time. Discover why millions are already using Flightradar24. Please note that coverage will vary. We are rapidly improving Flightradar24’s coverage across the world.   Features: Planes moving in real-time Comprehensive information for each individual plane, including route, […]"},{"link":"https://nmac.to/blog/quickpick-2-1-3/","image":"https://nmac.to/wp-content/uploads/2014/01/QuickPick.png","title":"QuickPick 2.1.3 – Seamless document launcher","content":"QuickPick is an application and document launcher designed to feel as if it’s part of Mac OS X itself. Just drag and drop any number of applications or documents into the QuickPick window, and they’ll only ever be a mouse click, flick, or key press away.   QuickPick is a great place to store documents […]"},{"link":"https://nmac.to/blog/writer-pro-1-0/","image":"https://nmac.to/wp-content/uploads/2014/01/Writer-Pro.png","title":"Writer Pro 1.0 – Professional writing suite","content":"Writer Pro is a professional writing suite that gives you full control over your notes, drafts and edits.    Workflow: Note – Write – Edit – Read. Each stage has a task-specific typeface and color. Syntax Control scans the syntax of English, French, German, Italian, and Spanish text and highlights your adjectives, nouns, verbs, adverbs, […]"},{"link":"https://nmac.to/blog/moneywiz-1-5-0/","image":"https://nmac.to/wp-content/uploads/2014/01/MoneyWiz.png","title":"MoneyWiz 1.5.0 – Personal finance solution","content":"MoneyWiz lets you do more with your money. View all your accounts, budgets and bills in one place. Experience reports on a whole new level. Sync Everything across devices!   Meet MoneyWiz – the personal finance assistant that just works!   HOW IS MONEYWIZ BETTER? Automatically keeps data consistent across multiple devices Gives you beautiful […]"},{"link":"https://nmac.to/blog/lensflares-1-1/","image":"https://nmac.to/wp-content/uploads/2014/01/LensFlares.png","title":"LensFlares 1.1 – Bring your photos to life","content":"LensFlares is a brand new photo editor for adding optical effects on your Mac. You can choose from anamorphic   lens flares, lighting effects, sci-fi flares, sunlight glare, and more.   Great For: Enhancing Photos Graphics Design Logos and Titles Special Effects   LensFlares has over 70 high resolution optical effects: Anamorphic Flares Natural Sunlight […]"},{"link":"https://nmac.to/blog/jaksta-1-3-3/","image":"https://nmac.to/wp-content/uploads/2014/01/Jaksta.png","title":"Jaksta 1.3.3 – Record and download streaming audio and video","content":"Jaksta is the easiest way to download and convert Video, Audio and MP3s from the Web to your Mac. Just open Jaksta, then play a video or song in your browser, and Jaksta saves a perfect digital copy to your Mac’s hard disc, or converts it to several popular device formats. Jaksta is the only […]"},{"link":"https://nmac.to/blog/chocolat-2-1/","image":"https://nmac.to/wp-content/uploads/2014/01/Chocolat.png","title":"Chocolat 2.1 – Native Cocoa text editor","content":"Chocolat is a new text editor that combines native Cocoa with powerful text editing tools.    Features: Split editing Code completion Live errors Folding Symbol list Blockedit Vim mode Jump to definition Project find Go to file Web preview Documentation   WHAT’S NEW Version 2.1: File -> Reveal in Project Bar Added “open in browser” […]"},{"link":"https://nmac.to/blog/labels-addresses-1-6-6/","image":"https://nmac.to/wp-content/uploads/2014/01/Labels-Addresses.png","title":"Labels & Addresses 1.6.6 – Powerful label and envelope printing tool","content":"Labels & Addresses is a home and office tool for printing all sorts of labels, envelopes, inventory labels, and price tags. Merge-printing capability makes the program a great tool for holiday seasons by helping users to design and print multiple greeting envelopes and postcards with automatically substitutable addresses and postal barcodes.   Key features: Change text […]"},{"link":"https://nmac.to/blog/flipbook-creator-pro-2-0-9/","image":"https://nmac.to/wp-content/uploads/2014/01/FlipBook-Creator-Pro.png","title":"FlipBook Creator Pro 2.0.9 – Build Professional Flash & Html5 Flipbook","content":"FlipBook Creator Pro for Mac  is useful and amazing utility to convert PDF to Flash based flipbook with real page turn effect on Mac. The Professional version provides many powerful tools for you to build the flipbook. You are enabled to edit imported PDF pages with embedding native Flash or YouTube Video, adding web links, page links […]"}]