[{"link":"https://nmac.to/blog/hedge/","image":"https://nmac.to/wp-content/uploads/2016/11/Hedge.png","title":"Hedge 19.2.7 – Multiple backups of your footage, fast and easy","content":"Hedge – Multiple backups of your footage, fast and easy   Import RAW and JPGs, ditch those DCIM folders and sort your footage with Scripts. Or backup your complete Lightroom Catalog. Offload footage lightning fast. Multiple sources to multiple destinations is a cinch, taking the hassle out of multicam. Duplicate liveshow multitrack recordings, backup your […]"},{"link":"https://nmac.to/blog/command-tab-plus/","image":"https://nmac.to/wp-content/uploads/2017/05/Command-Tab-Plus.png","title":"Command-Tab Plus 1.93 – Quick, convenient, keyboard-centric application switcher","content":"Command-Tab Plus is a keyboard-centric application switcher. It is designed to let you switch between apps in a faster and more convenient way.   When you work with a lot of programs which are running, switching between them can be a problem because it often takes a long time. Command-Tab Plus gives you many improvements […]"},{"link":"https://nmac.to/blog/cut-out-shapes/","image":"https://nmac.to/wp-content/uploads/2018/01/Cut-Out-Shapes.png","title":"Cut Out Shapes 8.3.1 – Erase Elements","content":"Cut Out Shapes is a new SIMPLE tool that helps you DELETE BACKGROUND in your pics.   Your PHOTO EDITING with the ERASER application Cut Out Shapes is: Simple Easy-to-use Efficient Fast   How to Use: Click the Folder icon in order to upload a photo; Use the 1st scale to choose the brush size; […]"},{"link":"https://nmac.to/blog/triage/","image":"https://nmac.to/wp-content/uploads/2019/07/Triage.png","title":"Triage 1.0.14 – Mange photos stuck in your phone’s camera roll","content":"Triage is the best way to mange the thousands of photos stuck in your phone’s camera roll. Sort the best into albums, archive the ones worth keeping, and throw away the rest. Available now! – only for macOS. Ready for macOS Mojave Dark mode Lightning-fast browsing of folders full of photos. Sort photos into albums […]"},{"link":"https://nmac.to/blog/a-n-n-e/","image":"https://nmac.to/wp-content/uploads/2019/07/A.N.N.E.png","title":"A.N.N.E 0.3.636 – Space Action & RPG Shooter Game [Early Access]","content":"A.N.N.E is an exploration game blending fast paced platformer and flying (shmup) gameplay mechanics. A.N.N.E’s style is inspired by 8-bit and 16-bit era games; an anthology in pixels that will take you back to the early days of video games using modern technologies and a refined yet simple visual style. A handcrafted retro adventure on […]"},{"link":"https://nmac.to/blog/monity/","image":"https://nmac.to/wp-content/uploads/2016/09/Monity1.png","title":"Monity 1.4.5 – Advanced System Monitoring Widget","content":"Monity is a system-monitoring widget placed in your Today View. It oversees your components statistics just for you. Having an eye on your system’s and network usage without messing around with huge and uncomfortable symbols in the menu bar was never so easy.   Features list:   System monitoring Uptime, Processes, CPU Usage   Memory […]"},{"link":"https://nmac.to/blog/cisdem-iphonerecovery/","image":"https://nmac.to/wp-content/uploads/2016/08/Cisdem-iPhoneRecovery.png","title":"Cisdem iPhoneRecovery 3.7.0 – Recover lost or deleted data from iDevices","content":"Cisdem iPhoneRecovery helps you recover your lost or deleted iOS data, no matter whether or not you have iTunes backups or not. With an intuitive interface, iPhoneRecovery can easily pinpoint, preview, and restore multiple files, including lost photos, videos, messages, contacts, call history, Safari bookmarks, notes, calendar, etc. There is no data disaster any more. […]"},{"link":"https://nmac.to/blog/the-station/","image":"https://nmac.to/wp-content/uploads/2019/07/The-Station.png","title":"The Station 1.27 – A first-person sci-fi mystery game","content":"The Station is a first-person sci-fi mystery set on a space station sent to study a sentient alien civilization. Assuming the role of a recon specialist, players must unravel a mystery which will decide the fate of two civilizations.   How would you react if we discovered a sentient alien civilization, challenging everything we know […]"},{"link":"https://nmac.to/blog/easy-video-to-gif/","image":"https://nmac.to/wp-content/uploads/2019/07/Easy-Video-to-GIF.png","title":"Easy Video to GIF 2.4.0 – Video to GIF creator","content":"Easy Video to GIF is the best video to GIF creator, It can extract clips even frame from your video files for convert to GIFs. It supports all popular video formats, such as avi, mp4, wmv, rmvb.   Key features: Convert clips into small GIF files Rotate, flip, crop, resize the video Support multiple captions […]"},{"link":"https://nmac.to/blog/islanders/","image":"https://nmac.to/wp-content/uploads/2019/07/Islanders.png","title":"Islanders 0.2 – A minimalist strategy game","content":"ISLANDERS is a minimalist strategy game about building cities on colorful islands. Explore an infinite number of ever-changing new lands, expand your settlements from sprawling villages to vast cities and enjoy the relaxing atmosphere.   If you’re thinking about buying ISLANDERS please keep in mind that we are a very passionate but small team of […]"}]