[{"link":"https://nmac.to/blog/trine/","image":"https://nmac.to/wp-content/uploads/2019/02/Trine.png","title":"Trine Enchanted Edition 2.12 – Fantasy, Puzzle & Action Platformer Game","content":"Trine is a fantasy action game where the player can create and use physics-based objects to beat hazardous puzzles and threatening enemies. Set in a world of great castles and strange machinery, three heroes are bound to a mysterious device called the Trine in a quest to save the kingdom from evil.    The gameplay […]"},{"link":"https://nmac.to/blog/turmoil-2d-man/","image":"https://nmac.to/wp-content/uploads/2017/03/Turmoil.png","title":"Turmoil 2.0.11 – 2D Management Strategy & Simulation Game","content":"Turmoil offers players a visually charming, tongue-in-cheek take on the simulation genre inspired by the 19th century oil rush in North America. Get a taste of the rush and rivalry of the time as you earn your way to become a successful oil entrepreneur. As you make money digging up and selling oil, the town […]"},{"link":"https://nmac.to/blog/keytty/","image":"https://nmac.to/wp-content/uploads/2018/09/Keytty.png","title":"Keytty 1.2.6 – Control your mouse-pointer with your keyboard","content":"Keytty lets you control your mouse with a few key strokes.   Version 1.2.6: Notify users to allow permission for Keytty’s access in Security & Privacy if it is not permitted yet. (After Mojave)   Intel, 64-bit processor OS X 10.10 or later    "},{"link":"https://nmac.to/blog/snipper-app/","image":"https://nmac.to/wp-content/uploads/2018/12/Snipper-App.png","title":"Snipper App 1.4.1 – Snippets manager","content":"Snipper App is a native snippets manager, built with Swift4 for MacOS exclusively, aiming to be a single tool for saving your day to day working notes, snippets of code, and just a good helper in the developer’s life. With the iCloud storage, your snippets will be stored in the cloud by your Apple ID, […]"},{"link":"https://nmac.to/blog/password-vault-manager/","image":"https://nmac.to/wp-content/uploads/2016/06/Password-Vault-Manager4.png","title":"Password Vault Manager 6.2 – all-in-one solution to streamline password management","content":"Password Vault Manager lets you and your team centralize your organization’s passwords and credentials into one secure repository.   Manage user security rights and access, reduce help desk support calls and strengthen your network security by generating only strong and unique passwords.   Stop losing time retrieving forgotten passwords and enjoy the industry’s most intuitive […]"},{"link":"https://nmac.to/blog/figment/","image":"https://nmac.to/wp-content/uploads/2017/09/Figment.png","title":"Figment 1.1.8 – A musical action-adventure game","content":"A musical action-adventure set in the recesses of the human mind… Welcome to the world of Figment. A strange and surreal world; a place filled with our deepest thoughts, urges and memories, populated by the many voices we hear in our heads.   This mind has been quiet and calm for many years. But something […]"},{"link":"https://nmac.to/blog/total-war-saga-thrones-of-britannia/","image":"https://nmac.to/wp-content/uploads/2019/02/THRONES-OF-BRITANNIA.png","title":"Total War Saga: THRONES OF BRITANNIA 1.0.4 – Turn-Based Strategy & Historical Game","content":"THRONES OF BRITANNIA is a standalone Total War game that challenges you to re-write a critical moment in history, one that will shape the future of the British Isles. With ten playable factions, you must build and defend a kingdom of Anglo-Saxons, Gaelic clans, Welsh tribes or Viking settlers. Forge alliances, manage settlements, raise armies […]"},{"link":"https://nmac.to/blog/seers-isle/","image":"https://nmac.to/wp-content/uploads/2019/02/Seers-Isle.png","title":"Seers Isle 2.0.6 – Narrative & Fantasy Game","content":"Seers Isle is an interactive graphic novel, set in a fantasy version of medieval northern Europe, where your choices impact the fate of a group of characters.   A group of shaman apprentices set foot on the shores of a sacred island to be initiated to magic.   As they progress through the wilderness, looking for […]"},{"link":"https://nmac.to/blog/armello/","image":"https://nmac.to/wp-content/uploads/2017/08/Armello1.png","title":"Armello 12.09.2018 – Featured Strategy, Adventure ,Indie & RPG Game","content":"    Armello is a grand swashbuckling adventure that combines three styles of play; The deep tactics of card games with the rich strategy of table top board games, combined with a character role-playing system.   As a hero from one of the clans of Armello, you’ll quest, scheme, hire agents, explore, vanquish monsters, cast […]"},{"link":"https://nmac.to/blog/bastion/","image":"https://nmac.to/wp-content/uploads/2015/02/Bastion-1.png","title":"Bastion 1.50451 – Award-winning action RPG Game","content":"Bastion is an action role-playing experience that redefines storytelling in games, with a reactive narrator who marks your every move. Explore more than 40 lush hand-painted environments as you discover the secrets of the Calamity, a surreal catastrophe that shattered the world to pieces. Wield a huge arsenal of upgradeable weapons and battle savage beasts […]"}]