[{"link":"https://nmac.to/blog/auction-bidding-sniper-ebay-3-0-4/","image":"https://nmac.to/wp-content/uploads/2014/02/Auction.Bidding.Sniper.for_.eBay_.png","title":"Auction Bidding Sniper for eBay 3.0.4 – With sniping watchList","content":"All Auction Sniping is fee FREE FOR LIFE. no more paying a service for each auction, no fees for alerts, no more ANY fees of any kind. (click on “more” for more details)   An eBay sniper is a tool to let you bid at the last moment of an auction automatically, so no one […]"},{"link":"https://nmac.to/blog/itriumph-1-0-0/","image":"https://nmac.to/wp-content/uploads/2014/02/iTriumph.png","title":"iTriumph 1.0.0 – Your life organized: calendars, contacts, and journal.","content":"Life happens fast whether it’s personal or business. The best way to stay on top is focus. iTriumph is here to help. iTriumph integrates your calendar, contacts, and journal in a single application to provide you with clarity. Not only will iTriumph help you manage current obligations and relationships, it will help you reflect and […]"},{"link":"https://nmac.to/blog/lad/","image":"https://nmac.to/wp-content/uploads/2014/02/lad.png","title":"LAD 1.0 – Go back to the beginning, where it all started","content":"Go back to the beginning, where it all started. Experience the adventure with fast paced action, beautiful graphics and an addiction to play just one more time!   Unlock all characters, the full original soundtrack and a variety of power ups on the way.   Version 1.0: Initial release.   OS X 10.7 or later […]"},{"link":"https://nmac.to/blog/graphite/","image":"https://nmac.to/wp-content/uploads/2014/02/graphite.png","title":"Graphite 9.0.13 – CAD 2D and 3D wireframe drawing software","content":"Graphite… A user interface that lets creative people get precision drawing and drafting done without worrying about how to run their software. Create 2D and 3D precision wireframe drawings of unlimited complexity and detail.   Whether you need a simple sketch, an elaborate architectural design or a precision engineering drawing, Graphite lets creative professionals express […]"},{"link":"https://nmac.to/blog/liquid-notes-1-5-2-1/","image":"https://nmac.to/wp-content/uploads/2014/02/Liquid-Notes.png","title":"Liquid Notes 1.5.2.1 – Sophisticated music composition","content":"Liquid Notes is an intelligent music composition assistant for your desktop. The software assists any individual with a basic knowledge in music, in creating sophisticated harmonic progressions and melody lines, which are essential for making great music.   Built-in synthesizers, a simple and intuitive graphical interface, an assortment of music templates of different styles, auto-routing […]"},{"link":"https://nmac.to/blog/designs-mail-1-7/","image":"https://nmac.to/wp-content/uploads/2014/02/Designs.for_.Mail_.png","title":"Designs for Mail 1.7 – 100+ beautiful templates for Apple’s Mail","content":"Designs for Mail brings you a diverse collection of templates for creating customized email messages in Apple Mail.    Choose a lively seasonal template for a family newsletter. Or select a sharp, sophisticated design for a business proposal. Designs for Mail’s selection is constantly expanding, so you’ll always have access to the latest templates.   […]"},{"link":"https://nmac.to/blog/devbox-2-0/","image":"https://nmac.to/wp-content/uploads/2014/02/DevBox.png","title":"DevBox 2.0 – Mobile development toolbox","content":"DevBox — All-in-one (mobile) development toolbox. It’s easy, beautiful, fast, smart & up to date.    Just see for yourself.   FEATURES   ICONS iOS, Mac OSX, Android & Web exports. Handy code snippets for Xcode or html. Using the latest naming conventions and sizes. No loss in image quality. PLACEHOLDER Generate placeholders for adding […]"},{"link":"https://nmac.to/blog/browser-care-2-1/","image":"https://nmac.to/wp-content/uploads/2014/02/Browser.Care_.png","title":"Browser Care 2.1 – The perfect app to take care of your browsers","content":"Browser Care is a powerful application that allows you to keep your browsers clean and under control since navigating accumulates files on your Mac.   Features: Care. A button for everything. Take Care of your browser to recover space on your Mac. Simple presets. Convenient presets that are fast and easy (even for beginners). Items […]"},{"link":"https://nmac.to/blog/karaoketube-1-5/","image":"https://nmac.to/wp-content/uploads/2014/01/KaraokeTube.png","title":"KaraokeTube 1.5 – Sing your favorite songs right from your Mac","content":"Sing your favorite songs right from your Mac. KaraokeTube is the world’s first and only fully featured Mac karaoke application with a streaming library of over thousands of songs with lyrics!   What you get: Access to over 7000 songs from around the world High and HD quality of all the videos Intuitive song search […]"},{"link":"https://nmac.to/blog/audio-cutter-2-1-0/","image":"https://nmac.to/wp-content/uploads/2014/01/Audio.Cutter.png","title":"Audio Cutter 2.1.0 – Quick way to cut your audio files visually","content":"iFunia Audio Cutter is a neat application to quick and easy cut your music and audio file on Mac. You could cut out a desired musical fragment from almost all audio formats: mp3, mp2, wma, wav, ogg, aac, ac3, m4a, mka, aiff, ape, flac.   Simple steps to cut the music and audio files to […]"}]