[{"link":"https://nmac.to/blog/universal-studio/","image":"https://nmac.to/wp-content/uploads/2017/07/Universal-Studio.png","title":"Universal Studio 1.3 – Templates for iWork","content":"Universal Studio – Templates for iWork is the perfect tool for users of iWork who desires quickly and easy create high-quality Banners, Headers, Infographics or Twitter and Facebook covers. This set offers over 200 templates and textures.   Focus on content – leave design for us. Just in minutes create professional looking works!   FEATURES: […]"},{"link":"https://nmac.to/blog/brochures-studio/","image":"https://nmac.to/wp-content/uploads/2016/11/Brochures-Templates-for-Pages.png","title":"Brochures Studio 2.5 – Top-quality brochures templates for pages","content":"Brochures Studio (was Templates Pro for MS Word) is a top-quality collection of original templates for Apple’s Pages word processor. Whether you’re starting a new business, organizing an event, or trying to give your sales a boost, Brochures Templates for Pages will help you.   Every object in Brochures Templates for Pages can be easily […]"},{"link":"https://nmac.to/blog/kypass/","image":"https://nmac.to/wp-content/uploads/2017/07/KyPass.png","title":"KyPass 1.9 – A Mac version of KeePass","content":"KyPass Companion allows you to have auto-fill function in your Chrome or Firefox browser like Lastpass or 1Password with your Keepass database(s) using the keepasshttp plugins   It saves many different information (user names, passwords, urls, comments, …) in one single database. The entries are sorted in groups. The integrated search function allows to search […]"},{"link":"https://nmac.to/blog/simbooster-premium/","image":"https://nmac.to/wp-content/uploads/2016/07/Simbooster.Premiun.png","title":"SimBooster Premium 2.9.9 – System optimizing utility","content":"SimBooster is an all-in-one package that includes a variety of system tools to help you clean and protect your Mac.   For slow Macs, SimBooster can release RAM to increase the processing speed. It can also help users protect their personal data from malicious cookies. Users who suffer from small hard drive space, SimBooster can […]"},{"link":"https://nmac.to/blog/stationery-expert/","image":"https://nmac.to/wp-content/uploads/2017/02/ADesigns.png","title":"Stationery Expert 4.1 – 160 stationaries for Apple’s Mail","content":"Stationery Expert (was ADesigns, then was Mix Mail, then was Suite for Mail 2016, then was Stationery for Mail) provides you with 160 stationaries for Apple’s Mail. Just choose a template, add your text and photos, and send the exceptional email to your business prospect, teammate, or friend.   The 160 templates are ordered into 5 […]"},{"link":"https://nmac.to/blog/neighbours-from-hell-2/","image":"https://nmac.to/wp-content/uploads/2017/06/Neighbours-From-Hell2.png","title":"Neighbours From Hell 2 1.0 – Comedy, Adventure & Classic Puzzle Game","content":"The reality TV show of neighbourly nastiness and community commotion moves on to the next round.   The Neighbour from Hell wants to enjoy an undeserved holiday – reason enough for Woody and the camera team to sneak along onto the cruise liner to make the nasty neighbour’s holiday a living hell. This time, the […]"},{"link":"https://nmac.to/blog/translate-it/","image":"https://nmac.to/wp-content/uploads/2017/06/Translate-It2.png","title":"Translate It 2.1.1 – Access Google Translate anywhere","content":"Translate It for Google Translate allows you to access Google Translate anywhere. Just click the icon in the menu bar or in the dock and get started.   Features: Right click any text to instantly translate it Instant access to Google Translate via the menu bar Seamless design Multiple sizes Touch Bar support   Version […]"},{"link":"https://nmac.to/blog/robofont/","image":"https://nmac.to/wp-content/uploads/2017/06/RoboFont.png","title":"RoboFont 1.8.4 – The missing UFO editor","content":"RoboFont is a UFO based, mac only, font editor.   Is written from scratch in Python with scalability in mind. Has full scripting access to objects and the application interface. Can be used as a platform to build additional tools on. Does not preform any ‘auto-magic’. Does not overload the user with a multitude of […]"},{"link":"https://nmac.to/blog/musicality/","image":"https://nmac.to/wp-content/uploads/2017/02/Musicality.png","title":"Musicality 3.1.3 – Desktop client for Beats Music, Last.fm, Pandora, and more","content":"Musicality gives you AirPlay audio streaming for any website, built-in controls for over 15 of the most popular music services, keyboard shortcuts, media keys, background playback, an iOS remote control and more!   You can visit any website in Musicality, but the built-in controls and song notifications will only work with supported sites. Right now, […]"},{"link":"https://nmac.to/blog/resume-cv-expert/","image":"https://nmac.to/wp-content/uploads/2017/06/Resume-CV-Expert.png","title":"Resume & CV Expert 3.0 – Templates for MS Word","content":"Resume Themes for MS Word is a clean, modern and professional resume templates set. Let templates Guru help you to get your next job!   The modern and polished Resume Themes pack supplies a collection of 45 easy-to-use templates for MS Word.   Features:   Professional Templates are designed by experienced designers, so every template […]"}]