[{"link":"https://nmac.to/blog/desktop-groups-1-4-1/","image":"https://nmac.to/wp-content/uploads/2013/12/group.png","title":"Desktop Groups 1.4.1 – Organize your desktop items in helpful groups","content":"Desktop Groups keeps the chaos off your desktop. Keep related files in groups. The app lets you create groups of related files on your desktop. You can freely move groups of files around on your desktop and add or remove files via drag-and-drop.   Each group has a title so that you can organize your […]"},{"link":"https://nmac.to/blog/push-to-talk-1-3/","image":"https://nmac.to/wp-content/uploads/2013/05/Push-to-Talk.png","title":"Push To Talk 1.3 – Keep your voice chats worry-free","content":"Push to Talk is a slick and unobtrusive menu bar app that makes voice chats worry-free and keeps the flow of conversation clear. Simply press down the user-configurable hotkey when you want to activate your microphone, and then release when you want the microphone to be muted again.   The aim of this app is […]"},{"link":"https://nmac.to/blog/livequartz-2-1-1/","image":"https://nmac.to/wp-content/uploads/2013/12/LQ.175x175-75.jpg","title":"LiveQuartz 2.1.1 – Simple image editor","content":"LiveQuartz is simple and powerful photo editor for the Mac. It is based on non-destructive layers and Filters. The layers are at the left and the Filters are at the right of the window.   To edit a photo, just drag it into the window (or layers’ list) and it will be added as a new […]"},{"link":"https://nmac.to/blog/translation-1-1/","image":"https://nmac.to/wp-content/uploads/2013/12/Translator.175x175-75.png","title":"Translation 1.1 – Quality translate between languages","content":"Translation is a handy little app that takes care of all your language translation needs. The app lives in your Mac’s menubar and is instantly available at the click of a button. Searching the web for translation services will be a thing of the past once you make the switch to Translation.   Here is […]"},{"link":"https://nmac.to/blog/face4pass-1-3/","image":"https://nmac.to/wp-content/uploads/2013/12/Face4Pass.175x175-75.png","title":"Face4Pass 1.3 – Create photos for your documents","content":"Face4Pass is an application that allows you to easily create photos for your documents (i.e passport).   Drag and drop or open an existing file. On loading, the image quality is automatically improved. Take a photo with the built-in iSight camera. Edit many parameters of the image (exposure, contrast, saturation, temperature, tint, sharpness). For optimum […]"},{"link":"https://nmac.to/blog/screen-steps-pro-2-9-6/","image":"https://nmac.to/wp-content/uploads/2013/12/23674.jpg","title":"Screen Steps Pro 2.9.6 – Create visual training lessons in PDF or HTML format","content":"ScreenSteps Pro is not just another screen capture application. ScreenSteps helps you answer questions by automatically creating image-based documents as you capture screenshots. Using the integrated authoring tools you can quickly annotate images and add text. When you are finished you can export to HTML, PDF, Word (DOCX), WordPress, TypePad, Bloger, Movable Type, MindTouch, Confluence, Googles […]"},{"link":"https://nmac.to/blog/moneywiz-v1-4-1/","image":"https://nmac.to/wp-content/uploads/2013/12/MoneyWiz.175x175-75.jpg","title":"MoneyWiz v1.4.1 – Personal finance solution","content":"MoneyWiz lets you do more with your money. View all your accounts, budgets and bills in one place. Experience reports on a whole new level. Sync Everything across devices!   Meet MoneyWiz – the personal finance assistant that just works!   HOW IS MONEYWIZ BETTER? Automatically keeps data consistent across multiple devices Gives you beautiful […]"},{"link":"https://nmac.to/blog/ispeedfocus-v1-1-3/","image":"https://nmac.to/wp-content/uploads/2013/12/40566.jpg","title":"iSpeedFocus v1.1.3 – Photo editor for creating blur effects","content":"With iSpeedFocus you put your subject in Focus while giving different kinds of speed blur effects. WHAT’S NEW Version 1.1.3: Ability to flip image Horizontally/Vertically REQUIREMENTS Intel, 64-bit processor, Mac OS X 10.6.6 or later ScreenShots :          >>>>>  Click Here  "},{"link":"https://nmac.to/blog/app-isplash-colors-v2-6-3/","image":"https://nmac.to/wp-content/uploads/2013/12/mzi.qikrzfwe.175x175-75.jpg","title":"App iSplash Colors v2.6.3 – Color areas of a black and white photo","content":"With App iSplashColors you turn your image in a vibrant Black and White and brush back to Color the areas you want to pop-out… Additionally, iPopColor… lets you fine tune the way the black and white image is generated to create a rich image full of details lets you adjust the Hue Saturation Lightness to […]"},{"link":"https://nmac.to/blog/absorb-water-v1-0/","image":"https://nmac.to/wp-content/uploads/2013/12/mzi.sczhbroe.175x175-75.jpg","title":"Absorb Water v1.0 – Water has never been so easy to drink","content":"Absorb Water allows you to drink almost anything and figures out at the end of the day if you are hydrated! Clean water is good for you. No argument! For most of us water alone would make our taste buds shrivel up and life would be boring. Our lives are way too complex, for us to […]"}]