[{"link":"https://nmac.to/blog/dropsync/","image":"https://nmac.to/wp-content/uploads/2016/01/DropSync3.png","title":"DropSync 3.2.2 – Fast, flexible folder updater","content":"DropSync is a folder updater for web developers, photo professionals, scientists or anyone in need of a fast, automated and highly customizable way to repeatedly copy files from one place to another. Works with removable hard drives, between computers on a local network and even between your mac and a remote server over SSH. Set […]"},{"link":"https://nmac.to/blog/ratropolis/","image":"https://nmac.to/wp-content/uploads/2021/01/Ratropolis.png","title":"Ratropolis 1.07303 – Card Battler & Strategy Game","content":"Ratropolis combines roguelite, deck building, and tower defense with real time strategy gameplay. Lead your small rat outpost to safety and defend your rat citizens from predators and monstrous creatures. Build the largest ‘Ratropolis!’ and etch your name into rat history!   Choose from over 500 cards of economy, building, military, and skill types to […]"},{"link":"https://nmac.to/blog/chatology/","image":"https://nmac.to/wp-content/uploads/2017/08/Chatology1.png","title":"Chatology 1.2.5 – Search your Messages chat history with ease","content":"Chatology is message search made simple   If you use Messages or iChat, you probably know that searching messages to find important info from past chats can be frustrating. Perhaps you couldn’t find what you were looking for, or your Mac slowed down so much that you gave up.   Chatology makes it easy to: […]"},{"link":"https://nmac.to/blog/frammer-x/","image":"https://nmac.to/wp-content/uploads/2016/03/Frammer.X.png","title":"Frammer X 1.13 – Extract your favorite frames from a video","content":"Frammer X is a simple application that allows you to extract your favorite frames from a video, with an intuitive and clean interface.   Features: load your video (mov-m4v-mp4 file); drag and drop video files from “Finder” or from “Library” panel; play the video frame by frame, at half speed or normal speed (forward or […]"},{"link":"https://nmac.to/blog/macfamilytree/","image":"https://nmac.to/wp-content/uploads/2020/04/MacFamilyTree_9.png","title":"MacFamilyTree 9.2 – Create and explore your family tree","content":"MacFamilyTree gives genealogy a facelift: modern, interactive, convenient and fast. Explore your family tree and your family history in a way generations of chroniclers before you would have loved. MacFamilyTree helps you capture your family history, and turns data and facts into conclusive reports and visually impressive charts.   MacFamilyTree offers numerous options for you to […]"},{"link":"https://nmac.to/blog/little-orpheus/","image":"https://nmac.to/wp-content/uploads/2021/01/Little-Orpheus.png","title":"Little Orpheus 3.0.0 – Comrades! To the Centre!","content":"The year is 1962 and NASA are trying to put a man on the moon. In a remote corner of Siberia, a Soviet cosmonaut is heading in the other direction. Comrade Ivan Ivanovich is dropped into an extinct volcano in his exploration capsule, Little Orpheus, to explore the centre of the earth. He promptly vanishes. […]"},{"link":"https://nmac.to/blog/fonepaw-data-recovery/","image":"https://nmac.to/wp-content/uploads/2018/11/FonePaw-Data-Recovery.png","title":"FonePaw Data Recovery 2.6.0 – Retrieve deleted images, videos, audios and more","content":"Pro Data Recovery Wizard! Quick and deep scan your computer to retrieve deleted images, videos, audios, emails, documents and more from hard drives (including Recycle Bin) on  Mac   Deleted Data Recovery Lose data accidentally without backups, empty the trash bin or press “Shift+Del”? FonePaw Data Recovery will access the deleted files quickly and get […]"},{"link":"https://nmac.to/blog/stringed/","image":"https://nmac.to/wp-content/uploads/2015/04/Stringed2.png","title":"Stringed 2.9 – Shift pitch and manipulate tempo","content":"Stringed is the perfect tool for every musician. By allowing you to tweak any song’s speed and pitch, you will be able to learn any song in no time! Pitch Shifting: You won’t need to retune your instrument anymore!. With Stringed, you will be able to change any song’s pitch up to 12 semitones (up […]"},{"link":"https://nmac.to/blog/photo2movie/","image":"https://nmac.to/wp-content/uploads/2016/11/photo2movie.png","title":"photo2movie 2.81 – A professional tool for making UHD movies from your photos","content":"Make movie in Ultra HD quality from your photos in one click!   Hundreds or thousands of photos can be compiled into a high-quality movie with 4K Ultra HD resolution or better – all with just a few simple clicks.   photo2movie is also an extremely efficient productivity tool for making stop motion movies and […]"},{"link":"https://nmac.to/blog/cvs/","image":"https://nmac.to/wp-content/uploads/2021/01/CVS.png","title":"CVS 2.20 – For the health of your eyes","content":"With more and more hours spent working on a computer, we know your eyes have taken a toll. But did you know that a 20-20-20 exercise (take a break every 20 minutes and focus your eyes on an object 20 feet away for 20 seconds) can do wonders towards preserving your eyesight and relieve your […]"}]