[{"link":"https://nmac.to/blog/satellites/","image":"https://nmac.to/wp-content/uploads/2021/09/Satellites.png","title":"Satellites 1.4 – A data base of all TV satellites in the world","content":"This program is a data base of all TV satellites in the world. You can easily find a satellite parameters.   Features: Sort by satellite Search by channel name, satellite name, radio name, provider name Displaying the channel name, radio station, a provider with the link to the official site, encoding display Displaying a frequency, […]"},{"link":"https://nmac.to/blog/lograbbit/","image":"https://nmac.to/wp-content/uploads/2021/09/LogRabbit.png","title":"LogRabbit 1.8.0 – Logcat viewer for Android developers","content":"LogRabbit is the essential logcat viewer for Android developers. Save time and ease the pain of working with Android device logs.   LogRabbit monitors Android device logs in real time as well as providing the ability to save and view saved log files for offline analysis. Create saved filters using the powerful filter editor Quickly […]"},{"link":"https://nmac.to/blog/wordcount/","image":"https://nmac.to/wp-content/uploads/2020/02/wordCount.png","title":"wordCount 2.10 – Count the number of characters, words & lines in anything you select","content":"Count and display the number of characters, words, lines and UTF8 characters in anything you select at anywhere with this elegant app! (attention: setting interface located in status menu bar)   Still counting words by hand? Still copy-pasting into Microsoft Word just to get the word count? No offense, but you need something less clumsy […]"},{"link":"https://nmac.to/blog/civicsusa/","image":"https://nmac.to/wp-content/uploads/2021/09/civicsUSA.png","title":"civicsUSA 1.70 – USCIS Naturalization Test","content":"Manage basic civics with this efficient app. A useful tool for U.S. citizens, residents,s, and foreigners!   As an American, you are obligated to know basic civics. For example: Who was Thomas Jefferson? How many Senators does each state have? This app will help you master all the civics you need to understand how the […]"},{"link":"https://nmac.to/blog/darker-news-for-safari/","image":"https://nmac.to/wp-content/uploads/2021/09/Darker-News-for-Safari.png","title":"Darker News for Safari 1.1 – Dark Mode for Hacker News","content":"Enabled dark mode for Hacker News on Safari. This web extension automatically matches the system setting for whenever dark mode is enabled.   Version 1.1: General performance enhancements and bug fixes. Darker News is now available on iOS and iPadOS!   Intel, 64-bit processor macOS 10.14 or later    "},{"link":"https://nmac.to/blog/show-passwords/","image":"https://nmac.to/wp-content/uploads/2021/09/Show-Passwords.png","title":"Show Passwords 1.1 – Reveal hidden text on the web","content":"Uncover allows you to “see right through” hidden password fields as if they were plaintext. This is helpful if you use an autofill password manager, or would like to see stored passwords that exist on the webpage.   This application is private, secure, and easy to use. Thanks to the new security features in macOS […]"},{"link":"https://nmac.to/blog/xojo/","image":"https://nmac.to/wp-content/uploads/2018/02/Xojo_2021.png","title":"Xojo Pro 2021r2.1 – Object-oriented programming tool","content":"Xojo Pro (was Real Studio Professional) is a cross-platform software development tool that enables developers of all backgrounds to create software for OS X, Windows, Linux, the Web, and soon, mobile. With users all over the world, Xojo apps can be found in every conceivable category – from commercial software applications to use in governments, […]"},{"link":"https://nmac.to/blog/widsmob-imageconvert/","image":"https://nmac.to/wp-content/uploads/2018/06/WidsMob-ImageConvert.png","title":"WidsMob ImageConvert 2.18 – Convert RAW in batch","content":"WidsMob ImageConvert allows you to convert RAW in batch. Whether the RAW format with DSLR cameras, or mixed-format images, you can turn photos into to JPEG, JPEG 2000, PNG, TIFF, BMP, and more. What is more, the advanced algorithm has 6x speed to convert RAW formats into JPEG and other photo formats.   Photo editing […]"},{"link":"https://nmac.to/blog/dead-age/","image":"https://nmac.to/wp-content/uploads/2017/09/Dead-Age.png","title":"Dead Age 1.31 – An Innovative Indie Survival-RPG Game","content":"Survive the zombie apocalypse with turn-based combat and permanent death! Manage survivors, go on dangerous scavenging runs, build alliances, craft equipment, make difficult story-influencing decisions, defend your camp against undead hordes and experience non-linear rogue-lite elements. An innovative Indie Survival-RPG!   Just after the zombie outbreak you were fortunate enough to join a group of […]"},{"link":"https://nmac.to/blog/notebooks/","image":"https://nmac.to/wp-content/uploads/2020/07/Notebooks_2.png","title":"Notebooks 2.4.3 – Create documents, manage tasks, organize files, and sync with iOS.","content":"Notebooks is the only notebook you ever need. It allows you to create as many books as you need to write, store and structure your details of life, and it will quickly become the one and only repository for all journals, ideas, notes, drafts and diaries but also for your projects, task lists, documents, files […]"}]