[{"link":"https://nmac.to/blog/timelapse/","image":"https://nmac.to/wp-content/uploads/2021/01/timeLAPSE.png","title":"timeLAPSE 2.60 – A silent screenshot taker app","content":"timeLAPSE will take a silent screenshot of your Mac’s desktop automatically and periodically at an interval according to your setup, from between 10 seconds to 24 hours. All captured screenshots will be saved in a folder of your choosing. Then, these captured screenshots can be linked and compiled into a continuously played time-lapse video at […]"},{"link":"https://nmac.to/blog/aegis/","image":"https://nmac.to/wp-content/uploads/2016/03/Aegis_1.png","title":"Aegis 1.80 – Protect your Mac from threats from external disks","content":"With Aegis, only your trusted external disks will be able to access your Mac.   Protect your Mac from threats from external disks, whether they are Thunder, Firewire, USB disks or flash drives, or even SD cards!   In movies, we often see spies obtain top-secret information by simply plugging a flash drive. A few […]"},{"link":"https://nmac.to/blog/batchresize/","image":"https://nmac.to/wp-content/uploads/2021/01/batchRESIZE.png","title":"batchRESIZE 1.70 – Copy and resize an entire folder of pictures with just one simple click","content":"Copy and resize an entire folder of pictures with just one simple click!   It supports various kinds of file formats and can both enlarge and shrink images.   Modern cameras’ shot resolution keeps getting higher and higher, but sometimes, it’s really not necessary for it to be that large, and the large file size […]"},{"link":"https://nmac.to/blog/word-count-icon/","image":"https://nmac.to/wp-content/uploads/2021/01/Word-Count-Icon.png","title":"Word Count Icon 2.10 – Word counter on text you copy","content":"An elegant dock icon that conveniently and unobtrusively performs word counts on text you copy!   Displayed as an icon on your dock menu, the app will count your selection’s number of   characters, words, lines, and UTF8 characters whenever and wherever you are copying or pressing Command + C.   Version 2.10: Any Mac […]"},{"link":"https://nmac.to/blog/screenlog/","image":"https://nmac.to/wp-content/uploads/2021/01/ScreenLog.png","title":"ScreenLog 2.30 – Automatically capture the screen when it changes","content":"Automatically capture the screen when it changes.   Yes, only when it changed and you can configure the sensitivity!   Want to monitor or keep track of your computer usage? With ScreenLog, you can keep a log of screen captures of your computer sessions. However, unlike other apps, ScreenLog doesn’t take screen captures based on […]"},{"link":"https://nmac.to/blog/view/","image":"https://nmac.to/wp-content/uploads/2021/01/view.png","title":"view 2.02 – Enjoy a more lively desktop","content":"Enjoy your live desktop selected from loop played movie, webcam or digital video input and slideshow pictures with transitions.   Desktop picture too boring for you? Enjoy a more lively desktop! With “view”, you’ll be able to use a video, picture slideshow, or even feed from a webcam as your desktop picture!   All three […]"},{"link":"https://nmac.to/blog/capture-all/","image":"https://nmac.to/wp-content/uploads/2016/08/Capture-All.png","title":"Capture All 2.10 – Screen capture tool","content":"Captures all your open windows with just one click!   Yes, grab screenshots of All your windows Individually and Simultaneously in One Click!   As you know, OS X is equipped with a screenshot function. By default, the hotkey “command + shift + 3” will take a screenshot of your entire screen.   On the […]"},{"link":"https://nmac.to/blog/desktopcinema/","image":"https://nmac.to/wp-content/uploads/2021/01/desktopCinema.png","title":"desktopCinema 3.30 – Play your favorite movie as your wallpaper","content":"Yes, it is. desktopCinema is playing your favorite movie as your wallpaper!   And one click of paste playing your YouTube and URL streaming video embedded or non-embedded!   Because you are a genius and chose to work on a Mac, you probably multi-task at working and playing at the same time. That’s why we […]"},{"link":"https://nmac.to/blog/hideaway/","image":"https://nmac.to/wp-content/uploads/2021/01/HideAway.png","title":"HideAway 2.05 – Hide your secret text in picture or movie file","content":"Still writing secrets in notebooks stashed away in a locked drawer?   HideAway provides a better way of hiding secrets: in pictures.   And not just image files, but also in video files or even in PDF files.   Just drop a picture into HideAway, type or paste your secret into the app, and press […]"},{"link":"https://nmac.to/blog/overlay/","image":"https://nmac.to/wp-content/uploads/2020/02/Overlay.png","title":"Overlay 3.80 – Make art or design from reference photos and screenshots","content":"A frame that allows you to have an image or even PDF displayed semi-transparently in front of everything. It enables you to copy, trace, or compare designs, images, and documents with ease since you can lock the frame and make it undisturbed by mouse gestures.   It’s a transparent overlay of an image or document […]"}]