[{"link":"https://nmac.to/blog/miya-translate-1-1/","image":"https://nmac.to/wp-content/uploads/2017/05/Miya-Translate.png","title":"Miya Translate 1.1 – Multi-window translation using Google Translate","content":"Miya Translate is a fast and convenient multiple-window translator. If you often employ Google Translate, you are sure to appreciate Miya Translate’s ability to translate in multiple windows. The hot keys to speed up your work are: activate a translator’s window, create new windows, and launch menu-bar translator – you can do it all with […]"},{"link":"https://nmac.to/blog/newsletter-expert-2-1/","image":"https://nmac.to/wp-content/uploads/2017/05/Newsletter-Expert.png","title":"Newsletter Expert 2.1 – Templates for MS.Word","content":"Don’t spend your time making newsletters, make news! Newsletters Templates for MS Word is your ultimate assistant for creating captivating newsletters in mere minutes. Choose from a growing collection of professionally-crafted, customizable newsletter templates for any kind of news.   Newsletters Templates for MS Word features over 90 great templates in a variety of styles […]"},{"link":"https://nmac.to/blog/reservoir-dogs-bloody-days-1-0/","image":"https://nmac.to/wp-content/uploads/2017/05/Reservoir-Dogs.png","title":"Reservoir Dogs – Bloody Days 1.0 – Violent Action Strategy Game","content":"Shoot, kill, steal and die in pure Reservoir Dogs style as you play this top-down strategy shooter.   Unique Time-Rewind Gameplay Don’t try again, rewind. Control characters for overlapping bursts of time, in a single-player co-op mode and discover endless possibilities.   Take advantage of this highly addictive and strategic mechanic in tension-filled robberies and […]"},{"link":"https://nmac.to/blog/barcode-maker-2-24/","image":"https://nmac.to/wp-content/uploads/2016/12/Barcode-Maker.png","title":"Barcode Maker 2.24 – 18 different barcode standards maker","content":"Barcode Maker is the fastest way to perfect 18 different barcode standards, necessary to manage and sell products all over the planet. All you need to do is to enter your product code, and click ‘Process’. Your barcode is created. It has been copied into the clipboard and all you need to do is to […]"},{"link":"https://nmac.to/blog/dwg-viewer-1-2-4/","image":"https://nmac.to/wp-content/uploads/2017/03/DWG-Viewer1.png","title":"DWG Viewer 1.2.4 – A lightning-fast drawing viewer for DXF and DWG files","content":"DWG Viewer is a lightning-fast drawing viewer that enables you to view DXF and DWG files, just as you would in AutoCAD.   Note that: This app supports DWG(3D), DWG(2D), DXF(3D) and DXF(2D) files.   Key Features: Support AutoCAD linetype – compatibility with layout visualization. Support visualization of 3D Wireframe and Shade. Support of AutoCAD […]"},{"link":"https://nmac.to/blog/autopano-giga-4-4-1/","image":"https://nmac.to/wp-content/uploads/2017/04/Autopano.Giga_.png","title":"Autopano Giga 4.4.1 – Stitch multiple images (release candidate)","content":"Autopano Giga allows you to stitch 2, 20, or 2,000 images.   Version 3.0 integrates impressive new features that will definitely make you adopt Autopano Pro or Autopano Giga: Choose between 9 projection modes the one that best suits your image, including Little-Planet, Panini, Hammer, Mirror Ball, Orthographic and more. Edit your panoramas with an […]"},{"link":"https://nmac.to/blog/dark-train-1-0/","image":"https://nmac.to/wp-content/uploads/2017/05/Dark.Train_.png","title":"Dark Train 1.0 – A 2D atmospheric hardcore adventure game","content":"Are you curious about what it’s like to be a disobedient squid ANN 2.35f with four tentacles controlling a whole train? Ridiculous? No! DARK TRAIN is a 2D atmospheric hardcore adventure (no hints, no text, no help!) in an oppressive setting full of handmade papercut visuals, logical puzzles and mysteries about famous inventor D. W. […]"},{"link":"https://nmac.to/blog/bounty-train-1-0/","image":"https://nmac.to/wp-content/uploads/2017/05/Bounty-Train.png","title":"Bounty Train 1.0 – Explore the dangerous life of the North American/US 19th century","content":"Be prepared to conquer the Wild West on rails! Mount and design your very own train with plenty of detailed equipment, hire a loyal, bold and selfless crew and travel through the dangerous Wild West. Find your way by cleverly using your resources and by shipping goods and passengers. Solve problems your own way, either […]"},{"link":"https://nmac.to/blog/a-story-about-my-uncle-1-1/","image":"https://nmac.to/wp-content/uploads/2017/05/A-Story-About-My-Uncle.png","title":"A Story About My Uncle 1.1 – A first person platforming adventure game","content":"A Story About My Uncle is a first person platforming adventure game about a boy who searches for his lost uncle, and ends up in a world he couldn’t imagine existed. Take help of your uncle’s mysterious inventions that let you jump incredibly high and far through beautiful scenery, uncover clues to your uncle’s whereabouts, […]"},{"link":"https://nmac.to/blog/shadwen-escape-from-the-castle-1-0/","image":"https://nmac.to/wp-content/uploads/2017/05/Shadwen.png","title":"Shadwen – Escape From The Castle 1.0 – 3rd person stealth-action game","content":"Shadwen is a 3rd person stealth-action game where the only rule is to remain unseen. Stay hidden – or the ruthless guards will kill you on sight!   Shadwen, an assassin on a quest to kill the king, has a chance encounter with an orphaned girl, Lily. She follows Shadwen on her dangerous journey, but […]"}]