[{"link":"https://nmac.to/blog/browser-ninja-1-1/","image":"https://nmac.to/wp-content/uploads/2016/07/Browser-Ninja.png","title":"Browser Ninja 1.1 – Smart Browser Switcher","content":"Browser Ninja is an app that helps you easily switch your default web browser. Use as many browsers at once as you want and select your current default browser from menu bar.   If you want to use a specific browser for certain pages or in other specific conditions, just define a rule and Browser […]"},{"link":"https://nmac.to/blog/air-browser-1-3/","image":"https://nmac.to/wp-content/uploads/2016/07/AirBrowser.png","title":"Air Browser 1.3 – Easily access all your favorite websites from menubar","content":"With Air Browser, all your favorite websites are pre-loaded in the background, easily accessible from menubar.   An easy to configure app, air browser lets you take charge of your favorite websites the way you want.   Store all your frequently visited websites in Air Browser, with no more tab clutter in Safari, viola!   […]"},{"link":"https://nmac.to/blog/mailtab-pro-for-gmail-7-7/","image":"https://nmac.to/wp-content/uploads/2014/08/MailTab-Pro-for-Gmail.png","title":"MailTab Pro for Gmail 7.7 – Access Gmail from the menu bar","content":"MailTab Pro for Gmail is the ideal app for instantly accessing your Gmail account without having to open your Web browser. Download it for free and benefit from visual and audio mail notifications, quick access to your inbox, and the ability to respond to mails at lightning speed.   After downloading, simply click on the […]"},{"link":"https://nmac.to/blog/menumate-1-3/","image":"https://nmac.to/wp-content/uploads/2016/07/MenuMate.png","title":"MenuMate 1.3 – Display applications menu bar items anywhere on screen","content":"MenuMate displays a copy of an app’s menu bar items whenever you want, right next to the cursor!   Works seamlessly with most other apps!   You’re tired of straining your wrist from mousing back to the menu bar all the time, especially if you have a big screen, twin screens or a tablet+screen combo. […]"},{"link":"https://nmac.to/blog/falcon-1-3-2/","image":"https://nmac.to/wp-content/uploads/2016/06/Falcon.png","title":"Falcon 1.3.2 – A simple, markdown based note-taking app","content":"Falconis a simple, markdown based note-taking app.   Features Write notes, journals and research Organise notes in multiple notebooks for various topics Supports adding images to your notes Search notes easily by their title, content or tags Editor-only and Preview-only modes allow to edit and read notes in an uncluttered and focused way. Backup your […]"},{"link":"https://nmac.to/blog/netspot-wi-fi-reporter-2-1-472/","image":"https://nmac.to/wp-content/uploads/2016/07/NetSpot.Wi-Fi.Reporter.png","title":"NetSpot Wi-Fi Reporter 2.1.472 – Advanced visualizations and powerful WiFi reporting","content":"Installing a wireless network isn’t always easy. Interference from neighboring networks, and radio noise from electronic devices can cause serious connection problems. While you can overcome those by trial and error, there’s a much better solution: NetSpot is here to do the job for you!   NetSpot WiFi Reporter adds advanced visualizations and powerful reporting […]"},{"link":"https://nmac.to/blog/favorite-ftp-2-7/","image":"https://nmac.to/wp-content/uploads/2016/07/FavoriteFTP.png","title":"Favorite FTP 2.7 – Synchronize files between Mac and FTP servers","content":"FavoriteFTP is a product to help you synchronize files between Mac and FTP servers. Do you still need to manually upload files you just edited? Do you still need to pickup files in different directories in order to upload them? Do you still need to check every directories in FTP server to download files your […]"},{"link":"https://nmac.to/blog/cssdesigner-4-7/","image":"https://nmac.to/wp-content/uploads/2016/07/CSSDesigner.png","title":"CSSDesigner 4.7 – Full-featured and powerful CSS designing app","content":"CSS Designer is a full-featured and powerful CSS design app. CSSDesigner takes full advantage of the latest Mac technologies, giving you speedy, powerful tools that let you touch up and enhance CSS, draw or paint, apply dazzling effects, or create advanced compositions amazingly easily.   Features Quickly and easily create any CSS3 (CSS2) effects Edit […]"},{"link":"https://nmac.to/blog/cinema-4d-17-0/","image":"https://nmac.to/wp-content/uploads/2016/07/Cinema-4D.png","title":"Cinema 4D 17.0 – Create 3D videos and animation","content":"CINEMA 4D offers you all you need to create high-end 3D pictures and animations – right out of the box. And CINEMA 4D’s modular design – with a total of 8 modules that you can buy individually – allows you to custom fit the application to suit your needs and your budget. The XL and […]"},{"link":"https://nmac.to/blog/webcam-settings-2-3/","image":"https://nmac.to/wp-content/uploads/2016/07/Webcam-Settings.png","title":"Webcam Settings 2.3 – Control all settings of a USB webcam","content":"Webcam Settings is the first and only app which lets you improve the image quality in real-time when using your USB webcam with your favorite video application such as FaceTime, iChat/Messages, or Skype. Webcam Settings is a very useful and user-friendly OS X utility that will help you quickly adjust your USB webcam’s settings.   […]"}]