[{"link":"https://nmac.to/blog/airy-3/","image":"https://nmac.to/wp-content/uploads/2016/11/Airy.png","title":"Airy 3.24 – YouTube downloader for Mac","content":"If you really like some video on YouTube and want to have it available even when there is no Internet connection at hand – Airy will help. Airy is an essential YouTube downloader for Mac that can easily save YouTube video right to your computer. Sierra is fully supported.   Download YouTube videos on Mac […]"},{"link":"https://nmac.to/blog/pdf-squeezer/","image":"https://nmac.to/wp-content/uploads/2019/08/PDF-Squeezer4.png","title":"PDF Squeezer 4.3.1 – Simple-to-use PDF compression tool","content":"PDF Squeezer is a simple to use PDF compression tool. It comes with compression capabilities which mainly reduce the size of the images within your PDF documents. This will help you obtain important savings in bandwidth costs, digital storage costs and network transmission times.   Features: Simply drag and drop your PDF onto the application […]"},{"link":"https://nmac.to/blog/display-maestro/","image":"https://nmac.to/wp-content/uploads/2020/12/Display_Maestro_5.png","title":"Display Maestro 5.0.3 – Optimize resolution and bit depth for attached displays","content":"Display Maestro gives you full control over attached displays, allowing the use of all available resolutions and bit depths. Latest versions of macOS strip out the useful ability to set specific resolutions and presents a more user-friendly approach.   Experienced users, especially graphic designers and presenters, demand more precise control of their devices. Access exactly […]"},{"link":"https://nmac.to/blog/ubar/","image":"https://nmac.to/wp-content/uploads/2016/12/uBar4.png","title":"uBar 4.2.0 – The Dock replacement for the Mac [FIX]","content":"uBar is the Dock replacement for the Mac. If you’ve never really liked the Dock, or have a soft-spot for the Windows Taskbar, uBar is here to save the day. uBar can be configured as a dock or task bar for OS X.   Features: Favourites area (including Show Desktop and Trash) Expands up to […]"},{"link":"https://nmac.to/blog/popclip/","image":"https://nmac.to/wp-content/uploads/2017/05/PopClip1.png","title":"PopClip 2021.11.1 – Cut, copy and paste at your fingertips","content":"PopClip puts Cut, Copy and Paste (and more!) at your fingertips, with a popover menu which appears when you select text on your Mac.   How to use: Use your mouse pointer to select some text PopClip appears!   Features: Beautifully rendered user interface looks great on your Mac display Instantly search the web for […]"},{"link":"https://nmac.to/blog/cinch/","image":"https://nmac.to/wp-content/uploads/2015/11/Cinch1.png","title":"Cinch 1.2.4 – Simple, mouse-driven window management [FIX]","content":"Cinch gives you simple, mouse-driven window management by defining the left, right, and top edges of your screen as ‘hot zones’. Drag a window until the mouse cursor enters one of these zones then drop the window to have it cinch into place. Cinching to the left or right edges of the screen will resize […]"},{"link":"https://nmac.to/blog/icalamus/","image":"https://nmac.to/wp-content/uploads/2015/01/iCalamus2.png","title":"iCalamus 2.24 – Desktop publishing solution","content":"iCalamus is a desktop publishing solution that allows you to create documents with text, photos, and other visual elements.   The unregistered version of iCalamus already offers a cool feature: You can create professional photo books and calendars like in the full version and order high-quality prints at the Photographerbook company. The Photographerbook document service […]"},{"link":"https://nmac.to/blog/librarian-pro/","image":"https://nmac.to/wp-content/uploads/2021/03/Librarian_Pro_7.png","title":"Librarian Pro 7.0.6 – Complete personal inventory system","content":"Librarian Pro helps you manage your collection of books, magazines, games, CDs, software titles, and movies. It helps you inventory and retrieve information quickly.   Organize items into smart collections, add them to the in-program Amazon shopping cart, mark them as lent out to friends, and even export for the Web or your iPod! Librarian […]"},{"link":"https://nmac.to/blog/yep/","image":"https://nmac.to/wp-content/uploads/2018/05/Yep4.png","title":"Yep 4.0.4 – Organize and manage all your documents","content":"Yep is a document organization and management tool.   Like iTunes for music or iPhoto for photos, Yep lets you search and view your documents in a comfortable interface, while offering the ability to automatically save documents into a file in your Documents folder. Yep also provides direct scanning support and new drag-and-drop text or […]"},{"link":"https://nmac.to/blog/metadatics/","image":"https://nmac.to/wp-content/uploads/2016/05/Metadatics1.png","title":"Metadatics 1.6.6 – Powerful audio metadata editor [FIX]","content":"Metadatics is a powerful and advanced audio metadata editor. It supports batch editing of most common audio file types including MP3, M4A, AIFF, WAV, FLAC, APE, OGG, WMA, and more. Lookup metadata from online sources, rename files based on metadata, or manipulate metadata using one of the many built in functions. Metadatics provides all you […]"}]