[{"link":"https://nmac.to/blog/film-noir-1-3-3/","image":"https://nmac.to/wp-content/uploads/2014/04/Film-Noir.png","title":"Film Noir 1.3.3 – Professional looking black & white photos","content":"When photography was first introduced, the photographers had to shoot black and white photos, simply because technology didn’t allow them to do color photography yet. Then, as color photography was invented in the 30’s, black and white photography became a form of art, with a large following. Film Noir photography is a style of photography […]"},{"link":"https://nmac.to/blog/flamingo-1-3-2/","image":"https://nmac.to/wp-content/uploads/2014/03/Flamingo.png","title":"Flamingo 1.3.2 – Messaging client that supports Hangouts/Gtalk, Facebook, and XMPP","content":"Flamingo is a beautiful, native instant messaging client for OS X that supports Hangouts/Gtalk, Facebook, and XMPP.   Features: All-in-one design: buddies, conversations, and chats in a single window. Multiple, detachable chats in a single window. Inline previews for images, videos, and tweets. Supports CloudApp, Droplr, Instagram, and YouTube. File transfer via direct connection (compatible […]"},{"link":"https://nmac.to/blog/cellist-1-2-2/","image":"https://nmac.to/wp-content/uploads/2015/07/Cellist.png","title":"Cellist 1.2.2 – HTTP debugging proxy","content":"Cellist puts a proxy between HTTP clients and the Internet. All you need to do is set the proxy configuration on your device properly, and then all HTTP traffic will go through Cellist and be revealed in front of you.   Features Any Platform – Cellist records all HTTP traffic from any Mac, Windows PC, […]"},{"link":"https://nmac.to/blog/flavours2-224/","image":"https://nmac.to/wp-content/uploads/2015/07/Flavours2.png","title":"Flavours2 224 – Change the look of your Mac","content":"Flavours Lite is an application to change the operating system’s appearance in a fast, easy, and safe way. Applying a theme is only mouse-click away.   Flavours Lite was designed and built from the ground up for OS X 10.10 Yosemite. It features a completely rethought user experience through a new elegant UI, and introduces […]"},{"link":"https://nmac.to/blog/instant-3-0-2/","image":"https://nmac.to/wp-content/uploads/2015/07/Instant.png","title":"Instant 3.0.2 – Mimics the workflow of a real Polaroid instant camera","content":"Instant: The Polaroid Instant Photos brings the fun of Polaroid instant camera to your Mac.   Instant mimics the workflow of a real Polaroid instant camera. Drag and drop your digital photo on to the camera window, a view finder will pop up. Carefully select your field of view and click ‘Shoot’. A picture framed […]"},{"link":"https://nmac.to/blog/idefrag/","image":"https://nmac.to/wp-content/uploads/2015/07/iDefrag5.png","title":"iDefrag 5.0.0 – Disk defragmentation and optimization tool","content":"iDefrag helps defragment and optimize your disk for improved performance. Features include: Supports HFS and HFS+ (Mac OS Extended). Supports case sensitive and journaled filesystems. Supports adaptive hot file clustering (“Hot Zone”).   Four powerful defragmentation algorithms: Compact data, moving all free space to one place. Optimize filesystem metadata. On-line defragmentation. Defragment whilst your disk […]"},{"link":"https://nmac.to/blog/glimpses-2-0/","image":"https://nmac.to/wp-content/uploads/2015/07/Glimpses.png","title":"Glimpses 2.0 – Still-motion video creator (was Briefly)","content":"With Glimpses (was Briefly), still-motion videos are a neat and fun way to show hundreds and hundreds of your photos within a few minutes. (Still-motion videos consist of photos that are shown for the fraction of a second – though not to be confused with stop motion where photos necessarily correlate with each other and […]"},{"link":"https://nmac.to/blog/episode-6-5/","image":"https://nmac.to/wp-content/uploads/2014/02/Episode.png","title":"Episode 6.5 – Professional media encoding application","content":"Episode is a powerful cross-platform desktop media encoding application for Mac and Windows. It offers the highest quality and fastest desktop encoding for content repurposing for distribution to Web, DVD, mobile phones and portable devices. Includes: extensive format support in/out including superior quality Flash 8/9 encoding, presets and filters, watch folders, batch processing of 25 […]"},{"link":"https://nmac.to/blog/breaking-1-3/","image":"https://nmac.to/wp-content/uploads/2015/07/Breaking.png","title":"Breaking 1.3 – Your News At A Glance","content":"Breaking lets you add news that matter to you, right in your Today View.   Add local news, your favourite blogs or anything else that comes with a feed as a Today widget in OS X Yosemite. The latest stories will always be right there when you have time for them, a single gesture away. […]"},{"link":"https://nmac.to/blog/videobox-4-2-0/","image":"https://nmac.to/wp-content/uploads/2014/04/Videobox.png","title":"Videobox 4.2.0 – Download Flash video through your browser","content":"Videobox allows you to quickly and easily download Flash video from most all of the popular video sites on the internet. Videobox will convert the video into a native Quicktime format so it’s ready to view on your Mac, iPod, iPhone or iTunes.   Version 4.2.0: Release notes were unavailable when this listing was updated. […]"}]