[{"link":"https://nmac.to/blog/the-first-tree/","image":"https://nmac.to/wp-content/uploads/2017/09/The-First-Tree.png","title":"The First Tree 1.0 – A beautiful, 3rd-person exploration game","content":"From the creator of Home is Where One Starts… comes The First Tree, a third-person exploration game centered around two parallel stories: a fox trying to find her missing family, and a son reconnecting with his father in Alaska. Players take control of the fox on a poignant and beautiful journey that crescendos at the […]"},{"link":"https://nmac.to/blog/dupin/","image":"https://nmac.to/wp-content/uploads/2017/09/Dupin.png","title":"Dupin 2.12.1 – Manage duplicate iTunes tracks","content":"Dupin is your iTunes duplicates manager.   Dupin finds sets of duplicate tracks in iTunes based on the criteria you choose. It can then automatically select the “Keeper” tracks from among the duplicates using a variety of versatile filter options. Dupin is flexible, fast, and easy to use.   With Dupin you can: Locate, sort, […]"},{"link":"https://nmac.to/blog/statsey/","image":"https://nmac.to/wp-content/uploads/2017/02/Statsey.png","title":"Statsey 1.0.8 – App-usage statistics","content":"Statsey is a menu-bar app that lets you analyze your app-usage habits, and find out how much they are impacting your productivity or just to feed your curosity.   Features Most frequent data slices always one click away in your menu bar Custom time period view Auto-pause tracking when inactive Straightforward design Elegant and lightweight […]"},{"link":"https://nmac.to/blog/ssd-health-check/","image":"https://nmac.to/wp-content/uploads/2017/09/SSD-Health-Check.png","title":"SSD Health Check 1.5 – View important insights to the state of your SSD","content":"SSD Health Check shows important insights to the state of your SSD.   Features Expected lifetime until death in % S.M.A.R.T. status Short details Unexpected power losses Actual temperature display Raw read-error rate Power cycles   Version 1.5: Bug fix   Intel, 64-bit processor OS X 10.7 or later    "},{"link":"https://nmac.to/blog/drivemon/","image":"https://nmac.to/wp-content/uploads/2017/09/DriveMon.png","title":"DriveMon 1.0.2 – Monitor & check the health status of your hdd or ssd","content":"DriveMon is a tool which can help to monitor, check the health status of your hard-drive disks or solid-drive disks. DriveMon is built with S.M.A.R.T. technology.   What can DirveMon do? Reports S.M.A.R.T. attributes for S.M.A.R.T. capable disk. And supports to view recent scanned S.M.A.R.T. attributes; Reports general information for disk; Reports errors for disk […]"},{"link":"https://nmac.to/blog/compare-anything/","image":"https://nmac.to/wp-content/uploads/2017/09/Compare-Anything.png","title":"Compare Anything 1.1 – Compare files or directories of any kind with just a few clicks","content":"Compare anything lets you compare files or directories of any kind with just a few clicks.   With just 3 buttons it is easy to use. Click on the button labeled ‘Left’ to open Finder and choose the first file, then click the button labeled ‘Right’ and repeat the procedure, then click ‘Compare’.   The […]"},{"link":"https://nmac.to/blog/photo-gun/","image":"https://nmac.to/wp-content/uploads/2017/09/PhotoGUN.png","title":"Photo GUN 1.0 – Edit all your photos automatically","content":"Photo Gun is the secret weapon for all your photo processing needs!   No more time consuming, repetitive work! Simply drag and drop a picture, a hundred or thousands of photos, to the drop-window and select operations you want to apply to them. With a click of the “Save Results” button all processed photo-files are […]"},{"link":"https://nmac.to/blog/gmagon-css-maker/","image":"https://nmac.to/wp-content/uploads/2017/09/Gmagon-CSS-Maker.png","title":"Gmagon CSS Maker 2.0 – Easy generation of CSS styles","content":"Gmagon CSS Maker is a powerful, advanced CSS2/CSS3 generator that allows you to create a nice look without writing any code. As a powerful and easy-to-use CSS designer for Mac, Gmagon CSS Maker minimizes the time and effort spent on creating complex CSS styles. With this handy generator, you can easily create numerous graphic styles […]"},{"link":"https://nmac.to/blog/beat-the-game/","image":"https://nmac.to/wp-content/uploads/2017/09/Beat-The-Game.png","title":"Beat The Game 1.0 – An adventure game where you find your way with sounds","content":"Beat the Game is a surreal adventure game where you find your way by collecting items and discovering sounds.   Sounds you find introduce cinematic cutscenes as the story unfolds. You can combine a soda can with a drumstick to unlock hi-hat sounds or search the hidden corners of the world and you might run […]"},{"link":"https://nmac.to/blog/appgraphics/","image":"https://nmac.to/wp-content/uploads/2017/09/AppGraphics.png","title":"AppGraphics 1.1 – App Icon and Screenshot Generator","content":"Design the graphics, icons and screenshots of your iOS and macOS apps with just a few mouse clicks. Forget those times when you had to pay graphical designers serious money to create the graphics of your app. You can now do all those things yourself using AppGraphics and at just a fraction of the price. […]"}]