[{"link":"https://nmac.to/blog/goodday-1-0/","image":"https://nmac.to/wp-content/uploads/2013/12/icon.175x175-753.jpg","title":"Goodday 1.0 – All-in-one social media, email, and task management app","content":"Goodday is a single app that manages your emails, social media, notes, tasks, journal, and more. Switching between your apps has never been so easy. No logins, no logouts, and no hassles. Easily switch on or off modules based on your preference.   Social Media Switching between your favorite social media sites has never been […]"},{"link":"https://nmac.to/blog/wondershare-pdf-editor-pro/","image":"https://nmac.to/wp-content/uploads/2013/12/ProProduct_logo.175x175-75.jpg","title":"Wondershare PDF Editor Pro 3.1.0 – Edit and enhance your PDFs","content":"Wondershare PDF Editor Pro allows you to edit PDF files effortlessly. It’s easy to correct mistakes and typos in original PDF: just use the Touchup Tool to select the text you want to edit, and double click on the text blocks, you can easily correct mistakes and typos.   Main features of PDF Editor Pro: […]"},{"link":"https://nmac.to/blog/quickpick-2-1-2/","image":"https://nmac.to/wp-content/uploads/2013/12/36467.jpg","title":"QuickPick 2.1.2 – Seamless document launcher","content":"QuickPick is an application and document launcher designed to feel as if it’s part of Mac OS X itself. Just drag and drop any number of applications or documents into the QuickPick window, and they’ll only ever be a mouse click, flick, or key press away.   QuickPick is a great place to store documents […]"},{"link":"https://nmac.to/blog/spress-1-0/","image":"https://nmac.to/wp-content/uploads/2013/12/spress.175x175-75.jpg","title":"s.press 1.0 – JS/CSS/HTML Compressor","content":"s.press is a JavaScript, CSS and HTML compressor. Compressing your script files helps you to save your network traffic and users to connect to your site faster.   Just drop your files/folders and click Start button. You can make several settings and switch them very easily. So even if you are working on several projects, […]"},{"link":"https://nmac.to/blog/slicy-v1-1-5/","image":"https://nmac.to/wp-content/uploads/2013/12/App.175x175-751.png","title":"Slicy 1.1.5 – Turn PSD elements into images for the Web and apps","content":"Slicy (was Layer Cake) turns PSD elements into images for the Web and for Apps, simply name your layer groups once and let Slicy do its magic. Bye bye, “Save for Web/Devices”. Hello, boost in productivity and creativity!   Designers and Developers, rejoice — exporting is no longer a workflow killer. Name layer groups like […]"},{"link":"https://nmac.to/blog/savings-1-4/","image":"https://nmac.to/wp-content/uploads/2013/12/Savings.175x175-75.jpg","title":"Savings 1.4 – Manage your personal finances","content":"Savings is an easy-to-use personal finance application, beautifully designed for your Mac. It has everything you need to get your finance under control, but without the complexity you find in other personal finance apps. Everything from entering a transaction to creating a budget has been streamlined to an intuitive process, so you can get your […]"},{"link":"https://nmac.to/blog/ifunia-media-converter/","image":"https://nmac.to/wp-content/uploads/2013/12/ifunia_icon.jpg","title":"iFunia Media Converter 4.0.0 – Playback Video/Audio/DVD on Mac OS X and Portables","content":"iFunia Media Converter is a batch media transcoder which owns functions of DVD Ripper, Audio Converter and Video Converter. It is an all-around solution for multimedia users to convert video/audio files, rip DVD to any other popular video/audio formats directly or for use with iPad mini, iPad 4, iPad 3, iPhone 5, Apple TV, or […]"},{"link":"https://nmac.to/blog/easymeasurer-1-1/","image":"https://nmac.to/wp-content/uploads/2013/12/EasyMeasurer.175x175-75.png","title":"EasyMeasurer 1.1 – On screen measuring","content":"Quick and easy measuring of objects and distances on the screen (in pixels)   Version 1.1: Retina display fix New window design   OS X 10.5 or later                    Turbobit          Uploaded         1fichier          Tusfiles          FileFactory"},{"link":"https://nmac.to/blog/tree-1-9-1/","image":"https://nmac.to/wp-content/uploads/2013/12/appIcon.175x175-75.jpg","title":"Tree 1.9.1 – Store ideas and organize info","content":"Tree is an outliner featuring a horizontally expandable tree view. Tree assists you in organizing your information, sketching plans and brainstorming new ideas. Tree allows you to store your ideas and keywords in segments that you can sort, re-arrange and constantly refine. Tree is designed to be a lightweight application that lets you concentrate on […]"},{"link":"https://nmac.to/blog/dailydo-1-2-11/","image":"https://nmac.to/wp-content/uploads/2013/12/DailyDo.175x175-75.jpg","title":"DailyDo 1.2.11 – Simple task manager","content":"DailyDo is your answer to other complex and expensive todo apps. DailyDo brings you a fantastic todo and task manager. You can write your tasks on the beautiful notepad. When you are done just check the box and your tasks will appear on menu bar with Todo Pad. Todo Pad is an easy way to […]"}]