[{"link":"https://nmac.to/blog/newsletters-design-templates/","image":"https://nmac.to/wp-content/uploads/2017/12/DesiGN-Newsletters-Templates.png","title":"Newsletter Templates – GN 2.0.1 – Over 120 news templates for Pages","content":"Don’t spend your time making newsletters, make news! Newsletter Templates – GN is your ultimate assistant for creating captivating newsletters in mere minutes. Choose from a growing collection of 129 professionally-crafted, customizable newsletter templates for any kind of news.   DesiGN Newsletters Templates features over 120 great templates in a variety of styles to match every taste […]"},{"link":"https://nmac.to/blog/movavi-screen-capture/","image":"https://nmac.to/wp-content/uploads/2017/03/Movavi-Screen-Capture5.png","title":"Movavi Screen Capture Pro 10.1.0 – Record any kind of screen video","content":"Movavi Screen Capture – Capture full screen video or any area of your screen: desktop, web browsers, online videos, or anything else that’s happening on your Mac screen. Record any audio: music, online radio, system alerts, sound from microphone, or musical instruments connected to your Mac. Combine audio sources: record system and microphone sound simultaneously. […]"},{"link":"https://nmac.to/blog/spinnortality/","image":"https://nmac.to/wp-content/uploads/2019/02/Spinnortality.png","title":"Spinnortality 31.01.2019 – Cyberpunk management sim game","content":"Found a powerful corporation. Use it to market horrific products, control the media, cause riots, crash stock markets, topple governments and become immortal.    Features: In this 8-20 hour turn-based management game, you will: Achieve immortality with cutting edge tech. Bribe politicians, spread fake news, rig elections. Research products such as metacritic for friendships, sentient […]"},{"link":"https://nmac.to/blog/robothorium/","image":"https://nmac.to/wp-content/uploads/2019/02/Robothorium.png","title":"Robothorium 1.0 – A cyberpunk dungeon crawler with turn-based fights","content":"2052. Planet Earth. BreakTech, an enterprise specialised in robotic construction, is flourishing thanks to thorium, an unlimited and innovative power source. After many years of exploitation, robots are finally protesting for their rights. But the peaceful movement is quickly escalating to riots and the human repression is near. Now seen as a first degree threat, […]"},{"link":"https://nmac.to/blog/templates-for-ms-word-by-gn/","image":"https://nmac.to/wp-content/uploads/2018/12/Templates-for-MS-Word-by-GN5.png","title":"Templates for MS Word by GN 5.0.6 – A collection of over 3,000 easy-to-use Word templates","content":"The handy Templates for MS Word by GN pack supplies a collection of over 3,000 easy-to-use templates for creating business and personal documents with MS Word.   The Templates for MS Word by GN set gives a comprehensive selection of templates, from letters and brochures to greeting cards and books. Most templates consist of several […]"},{"link":"https://nmac.to/blog/tenorshare-4mekey/","image":"https://nmac.to/wp-content/uploads/2019/02/Tenorshare-4MeKey.png","title":"Tenorshare 4MeKey 1.0.0.7 – No.1 iOS Password Finder","content":"4MeKey makes it easy for you to find, recover, view, export and manage all your passwords on iPhone and iPad.   Find Wi-Fi Password on iPhone – No Need to Jailbreak Forgot Wi-Fi password that saved on the iPhone Cannot find stored Wi-Fi passwords on iPhone My remembered Wi-Fi password cannot connect Try to show […]"},{"link":"https://nmac.to/blog/youtube-song-downloader/","image":"https://nmac.to/wp-content/uploads/2016/09/YouTube-Song-Downloader2.png","title":"YouTube Song Downloader 2.6 – Download music and videos from Youtube","content":"    The YouTube Song Downloader allows you to preview files immediately. Simply select an entry and click the play button to get things going…   Find music Simply enter the artist or song title in the search box and you’ll get great results from the YouTube portal. Afterwards, you can download the video or […]"},{"link":"https://nmac.to/blog/overfall/","image":"https://nmac.to/wp-content/uploads/2016/05/Overfall1.png","title":"Overfall 03.22.2017 – Turn-Based Combat Strategy Game","content":"Overfall is a fantasy role-playing game of rough diplomacy and tough action. Explore, negotiate, and fight your way across the high seas!   You will lead two heroes on a journey across the high seas in search of their lost king. You will encounter people of all breeds and all creeds; ally with them or […]"},{"link":"https://nmac.to/blog/blockhood/","image":"https://nmac.to/wp-content/uploads/2016/05/Blockhood.png","title":"Block’hood 1.1.25 – A neighborhood-building simulator game","content":"Block’hood is a neighborhood-building simulator that celebrates the diversity and experimentation of cities and the unique ecosystems within them. Budding city planners will have access to 90+ building blocks to arrange and combine and to create unique neighborhoods and discover the implications of their designs. The game will embark on a story of ecology and […]"},{"link":"https://nmac.to/blog/jydge/","image":"https://nmac.to/wp-content/uploads/2018/02/JYDGE.png","title":"JYDGE 1.2.1.5 – Top-Down Shooter & Action Game","content":"Build your own cybernetic JYDGE in this lawful-but-awful roguehate top-down shooter where you get to eradicate crime in the never-sleeping megacity of Edenbyrg. Create your own play-style by augmenting your JYDGE, modifying your Gavel rifle, and choosing fearless companions to suit the tasks at hand. Go solo or team up with Co-JYDGE in shared screen […]"}]