[{"link":"https://nmac.to/blog/master-of-orion-2-5-0-15/","image":"https://nmac.to/wp-content/uploads/2016/04/Master-of-Orion.png","title":"Master of Orion 2.5.0.15 – Space Strategy Game","content":"The ascendant spacefaring 4X strategy game returns! A new chapter in the epic Master of Orion saga is poised to once again capture the imaginations of millions of gamers.   Diehard fans of the first games will be ecstatic to know that this revival is being built under the watchful eyes of members from the […]"},{"link":"https://nmac.to/blog/due-1-4-2/","image":"https://nmac.to/wp-content/uploads/2014/05/Due.png","title":"Due 1.4.2 – Set reminders in your own words","content":"Due lets you type “Make dinner reservation at 9am tomorrow” and your reminder is set for 9 AM tomorrow.    “Cancel subscription in 1 month” and you get a buzz a month later.   Just tell Due in your own words what you’d like to do, and when you’d like to be reminded.   There […]"},{"link":"https://nmac.to/blog/suite-for-iwork-9-1/","image":"https://nmac.to/wp-content/uploads/2016/04/Suite-for-iWork9.png","title":"Suite for iWork 9.1 – Themes for Keynote, Templates for Pages and Numbers","content":"Suite for iWork is a collection of more than 1250 templates for Pages, Keynote and Numbers.   1110 beautiful templates for Pages documents. 105 static and 25 action themes for Keynote presentations. 50 templates for Numbers. All-in-One app.   Templates for Pages documents.   1110 pre-designed and elegant templates for your Pages documents. Whenever you […]"},{"link":"https://nmac.to/blog/next-1-4/","image":"https://nmac.to/wp-content/uploads/2015/01/Next.png","title":"Next 1.4 – Track your expenses and finances","content":"Next helps you get control of your expenses. It’s the easiest way to track your expenses. It’s fast, elegant and won’t get in your way. And with iCloud sync and the additional iPhone/iPad apps, your data is everywhere with you.   Your expenses are grouped into different views: By year, month or day. And thanks […]"},{"link":"https://nmac.to/blog/exposure-x-1-1-0-2223/","image":"https://nmac.to/wp-content/uploads/2016/04/Exposure-X.png","title":"Exposure X 1.1.0.2223 – Creative photo editor that handles every step of your workflow","content":"Exposure X is the creative photo editor that handles every step of your workflow. From card transfer to organization to editing, Exposure simplifies routine tasks and delivers a rich set of tools for developing beautiful photos.   Creative Exposure’s carefully researched library of styles gives your photos a human touch. Each look encompasses many subtle […]"},{"link":"https://nmac.to/blog/decloner-1-6-2/","image":"https://nmac.to/wp-content/uploads/2014/12/Decloner.png","title":"Decloner 1.6.2 – Find and eliminate duplicate files on your Mac","content":"Decloner helps you find and eliminate duplicate files on your Mac. It uses SHA-1 algorithm to reliably determine if files are identical. Decloner has a simple straightforward user interface where you only need to choose where to scan, and Decloner will find duplicate files in those locations and all the subdirectories. You can scan multiple […]"},{"link":"https://nmac.to/blog/atomic-1-0-1/","image":"https://nmac.to/wp-content/uploads/2016/04/ATOMIC.png","title":"ATOMIC 1.0.1 – The most comprehensive memory tester","content":"Most Macintosh freeze-ups, crashes and other failures are easily found. Broken software, a bad drive or some other troubled peripheral problem can be solved with some simple detective work. But then there’s that random, inexplicable problem that is never easily solved – a system that freezes when the computer is idle. Momentary lockups. The beachball […]"},{"link":"https://nmac.to/blog/tree-2-0-3/","image":"https://nmac.to/wp-content/uploads/2016/04/Tree.png","title":"Tree 2.0.3 – Store ideas and organize info","content":"Tree 2 is an outliner featuring a horizontally expandable tree view. Tree assists you in organizing your information, sketching plans, and brainstorming new ideas. Tree allows you to store your ideas and keywords in segments that you can sort, re-arrange, and constantly refine. Tree is designed to be a lightweight application that lets you concentrate […]"},{"link":"https://nmac.to/blog/nomad-fleet-1-0/","image":"https://nmac.to/wp-content/uploads/2016/04/Nomad-Fleet.png","title":"Nomad Fleet 1.0 – Strategy, Sci-fi And 3D Space Game","content":"Nomad Fleet is a Real Time Strategy game where you must lead the last remnants of Mankind to safety after a mysterious alien race has hunted them near extinction. Lead a fully armed fleet of battleships, carriers and fighters through a series of randomized scenarios and encounters where they must fight for their survival while […]"},{"link":"https://nmac.to/blog/squidoo-1-0-9/","image":"https://nmac.to/wp-content/uploads/2015/12/Squidoo.png","title":"Squidoo 1.0.9 – Control iTunes, Spotify, and Rdio from the menu bar","content":"Squidoo (was Music Control) is a simple and powerful app for finding and controlling music from your menu bar.   With Squidoo you can: Manage playback of popular music applications, including iTunes, Spotify and Rdio, all from your Mac menu bar Broadcast and control music from any local network Mac Search for your favorite albums […]"}]