[{"link":"https://nmac.to/blog/wifi-status-1-2/","image":"https://nmac.to/wp-content/uploads/2017/03/Wifi-Status.png","title":"Wifi Status 1.2 – Wireless Signal Strength Explorer and Scanner","content":"NEVER SETTLE for Low Performing Wireless Signals with Wifi Status App. See Wireless signal strength right on the menuBar. See your Local & Public IP address Works with Macbook Air, Macbook Pro, iMac, MacBook, MacPro, Mac Mini.   See the status of your wifi signal strength right from the menu bar. This utility adds network […]"},{"link":"https://nmac.to/blog/contacts-sync-for-google-gmail-6-5-3/","image":"https://nmac.to/wp-content/uploads/2017/03/Contacts-Sync.png","title":"Contacts Sync for Google Gmail 6.5.3 – Allows you to sync your Gmail and Mac contacts","content":"Contacts Sync for Google Gmail allows you to quickly and easily sync your Gmail and Mac contacts so you can have access to your contacts wherever you go. This app stands out from the competition with its reliability, ease of use, speed, and with a true “2-way sync” that allows you to merge changes you’ve […]"},{"link":"https://nmac.to/blog/bundle-for-wedding-1-3/","image":"https://nmac.to/wp-content/uploads/2016/09/Bundle-for-Wedding.png","title":"Bundle for Wedding 1.3 – Templates for wedding planning","content":"Bundle for Wedding is an excellent tool for organizing the beautiful and memorable wedding you’ve been dreaming of, providing you with unique templates for Pages documents, spreadsheet templates for Numbers, first-class slideshow themes for Keynote, and illustrations. Focus on your exciting plans and leave the invitations and other paperwork to us to us!   All […]"},{"link":"https://nmac.to/blog/folder-size-catalog-2-40/","image":"https://nmac.to/wp-content/uploads/2017/03/Folder-Size-Catalog.png","title":"Folder Size Catalog 2.40 – Folder-size calculator","content":"Folder Size Catalog provides at-a-glance view of your folders and folder sizes so that you can easily check the distribution of your disk space.   Key Features Fast and efficiently searches through folders and recursively through all component subfolders Generates neatly indexed catalog report to help you identify the largest folders Creates HTML5 mobile friendly […]"},{"link":"https://nmac.to/blog/video-editor-robot-2-0/","image":"https://nmac.to/wp-content/uploads/2017/02/Video.Editor.Robot_.png","title":"Video Editor Robot 2.0 – Edit video, audio, image, titles using fabulous tools","content":"Video Editor Robot editing video is only three-step: Step 1, Import media; Step 2, Edit video, audio, image, titles using fabulous tools Step 3, Export video.   Supported Input Formats Support high-resolution videos such as 4K, 3D, 8K Video formats: MPG, MPEG, MPEG 2, VOB, DAT, MP4, M4V, TS, MTS, M2TS, RM, RMVB, WMV, ASF, […]"},{"link":"https://nmac.to/blog/orion-markup-3-04/","image":"https://nmac.to/wp-content/uploads/2016/11/Orion-Markup.png","title":"Orion Markup 3.04 – Add image notes and annotations","content":"Orion Markup lets you express your thoughts and comments though images. It makes it easy to add notes, zoom-in bubbles, outlines boxes, lines, and arrows to images and screenshots.   Supports a full suite of annotation objects, including: zoom bubbles: creates magnified versions of selected image regions multiple sized outline boxes and text labels hundreds […]"},{"link":"https://nmac.to/blog/flashcards-for-diagrams-2-2-1/","image":"https://nmac.to/wp-content/uploads/2017/03/Flashcards.png","title":"Flashcards for Diagrams 2.2.1 – Flash Cards Study App","content":"Flashcards for Diagrams is a powerful study tool that enables you to accurately memorize complex diagrams. With an intuitive workflow, the speed, accuracy, and results of this method are beyond compare. Flashcards for Diagrams always works without connection to the internet. With iCloud Sync, your diagrams are always up to date on all your devices. […]"},{"link":"https://nmac.to/blog/cleanusbdrive-1-3/","image":"https://nmac.to/wp-content/uploads/2016/09/CleanUSBDrive.png","title":"CleanUSBDrive 1.3 – The fastest DS_Store remover for external drives","content":"CleanUSBDrive is an utility to eject any external drive removing those files that you don’t want to see in your smartTV multimedia-browser, for example. It cleans all drives from system junk before ejecting, with a very high performance.   Features Simple and fast Very minimalist design Status bar App Remove .DS_Store, ._AppleDouble, Thumbs.db, .Trashes, .Spotlight, […]"},{"link":"https://nmac.to/blog/remixvideo-1-1/","image":"https://nmac.to/wp-content/uploads/2017/02/Remixvideo.png","title":"Remixvideo 1.1 – Enhance your live shows with Remixvideo, the intuitive video sampler","content":"Remixvideo is the weapon of choice for creative video mixing, with a slick grid interface that makes DJs/producers instantly feel at home.   It offers two ways to enhance music performances with visuals: linking audio samples to video pads in standalone mode, or playing it as a video plug-in within your favorite music software. Running […]"},{"link":"https://nmac.to/blog/pdf-to-image-pro-3-3-19/","image":"https://nmac.to/wp-content/uploads/2016/12/PDF.to_.Image_.Pro_.png","title":"PDF to Image Pro 3.3.19 – PDF to JPG/PNG and more","content":"Convert PDF to almost any image formats quickly and stay or improve original quality.   PDF to Image Pro can convert PDF to JPEG, PNG, GIF, BMP, TGA, PPM, TIFF and JPEG2000 with high quality. Also, it allows you to finish batch PDF conversion and convert one page PDF. And before you convert PDF to […]"}]