[{"link":"https://nmac.to/blog/ifoto-converter-2-2/","image":"https://nmac.to/wp-content/uploads/2016/10/iFoto-Converter.png","title":"iFoto Converter 2.2 – Batch Conversion","content":"iFoto Converter is the ultimate photo converter for most of the formats.   The excellent batch conversion can transform one image or an entire folder of mixed format images to single file format. The advanced algorithm let you instant preview watermarks and captions added to all the photos. What’s more, when you convert RAW to […]"},{"link":"https://nmac.to/blog/all-docs-1-6/","image":"https://nmac.to/wp-content/uploads/2016/11/All-Docs1-1.png","title":"All Docs 1.6 – Microsoft Office Edition in OneDrive","content":"All Docs is magic and easy-to-use app help you easier to create Microsoft office 365 documents in OneDrive on your Mac.   Features: Create Word, Excel and PowerPoint documents. Sync documents in OneDrive’s Documents folder to local. Keep track all changes of online documents and automatic update on local. Calendar and manage email with Outlook. […]"},{"link":"https://nmac.to/blog/newsletters-templates-for-pages-1-1/","image":"https://nmac.to/wp-content/uploads/2016/11/Newsletters-Templates-for-Pages.png","title":"Newsletters Templates for Pages 1.1 – 90 great newsletters templates for pages","content":"Don’t spend your time making newsletters, make news! Newsletters Templates for Pages is your ultimate assistant for creating captivating newsletters in mere minutes. Choose from a growing collection of professionally-crafted, customizable newsletter templates for any kind of news.   Newsletters Templates for Pages features over 90 great templates in a variety of styles to match […]"},{"link":"https://nmac.to/blog/jitouch-2-71/","image":"https://nmac.to/wp-content/uploads/2015/01/Jitouch.png","title":"Jitouch 2.71 – Expands the gestures for MacBook multi-touch trackpad and Magic Mouse","content":"Jitouch is an application that expands the set of Multi-Touch gestures for the new MacBook and the new Magic Mouse. These thoughtfully designed gestures will enable you to perform frequent tasks more easily such as changing tabs in Web browsers, closing windows, minimizing windows, changing Spaces, and a lot more.   Jitouch also fulfills many […]"},{"link":"https://nmac.to/blog/fax-templates-for-pages-1-2/","image":"https://nmac.to/wp-content/uploads/2016/11/Fax-Templates-for-Pages.png","title":"Fax Templates for Pages 1.2 – Pages templates for faxes","content":"Fax Templates for Pages is a top-quality set of original templates for Apple’s Pages word-processing app. While many businesses have moved on to a variety of modern communication technologies, some still insist using the fax machine. You can be on top of the fax with a range of Graphic Node’s stylish templates. Every object in […]"},{"link":"https://nmac.to/blog/timing-1-8/","image":"https://nmac.to/wp-content/uploads/2014/09/Timing.png","title":"Timing 1.8 – Discover how you spend time on your Mac","content":"Timing is the best way to keep track of the time you spend with your Mac. Find out where your time goes — without ever having to start a timer again!   Timing automatically tracks which documents you are editing, which applications you use, and the domains of the websites you visit. You’ll never have […]"},{"link":"https://nmac.to/blog/picframe-2-8-2/","image":"https://nmac.to/wp-content/uploads/2014/09/PicFrame.png","title":"PicFrame 2.8.2 – Combine multiple photos into frames","content":"PicFrame helps you combine multiple photos into amazing looking frames that you can save to your computer or share to Facebook. With 67 adjustable frames, rounded corners and plenty of patterns, you will always have a unique look.   Since PicFrame was released on the iPhone and iPad we have often been requested to create […]"},{"link":"https://nmac.to/blog/orion-markup-2-80/","image":"https://nmac.to/wp-content/uploads/2016/11/Orion-Markup.png","title":"Orion Markup 2.80 – Add image notes and annotations","content":"Orion Markup lets you express your thoughts and comments though images. It makes it easy to add notes, zoom-in bubbles, outlines boxes, lines, and arrows to images and screenshots.   Supports a full suite of annotation objects, including: zoom bubbles: creates magnified versions of selected image regions multiple sized outline boxes and text labels hundreds […]"},{"link":"https://nmac.to/blog/falcon-1-4-5/","image":"https://nmac.to/wp-content/uploads/2016/06/Falcon.png","title":"Falcon 1.4.5 – A simple, markdown based note-taking app","content":"Falcon is a simple, markdown based note-taking app.   Features Write notes, journals and research Organise notes in multiple notebooks for various topics Supports adding images to your notes Search notes easily by their title, content or tags Editor-only and Preview-only modes allow to edit and read notes in an uncluttered and focused way. Backup […]"},{"link":"https://nmac.to/blog/fake-1-9-1/","image":"https://nmac.to/wp-content/uploads/2014/09/Fake.png","title":"Fake 1.9.1 – Browser that simplifies Web automation","content":"Fake is a new browser for Mac OS X that makes web automation simple. Fake allows you to drag discrete browser Actions into a graphical Workflow that can be run again and again without human interaction. The Fake Workflows you create can be saved, reopened, and shared.   Inspired by Apple’s Automator application, Fake looks […]"}]