[{"link":"https://nmac.to/blog/spektrel-art/","image":"https://nmac.to/wp-content/uploads/2017/02/Spektrel-Art.png","title":"Spektrel Art 1.1.11 – Enhance your photos by using contrasts and glows to draw attention","content":"Spektrel Art is an extravagant otherworldly display of webbed light that glistens and gleams with intersecting lines of tapered light. Applied to photos, this medium of imaginative and magical art form transcends the ordinary to extraordinary creating something wild with movement, sparkling life and divided color spaces.   Powerful adjustments allow you to fine-tune to […]"},{"link":"https://nmac.to/blog/wifi-scanner/","image":"https://nmac.to/wp-content/uploads/2015/12/WiFi-Scanner2.png","title":"WiFi Scanner 3.0.2 – 802.11 wireless scanner and connection manager","content":"WiFi Scanner is a 802.11 wireless scanner and connection manager. This will detect access points and clients in ad-hoc mode if the SSID is being broadcast. It can be used for wireless site surveys, wireless discovery, and to connect to Wi-Fi networks. The tool reports signal strength in dBm and shows access point BSSID/MAC addresses. […]"},{"link":"https://nmac.to/blog/istatistica/","image":"https://nmac.to/wp-content/uploads/2020/06/iStatistica5.png","title":"iStatistica 5.1 – Advanced system monitor","content":"iStatistica is an advanced system monitor. It includes a Notification-Center widget and status-bar menu. Simply slide out Notification Center to keep an eye on your CPU, memory, disk usage, and network activity.   System monitoring uptime memory pressure CPU usage disk usage   Battery information uptime cycles health capacity   Network activity network map external […]"},{"link":"https://nmac.to/blog/nanobrowser/","image":"https://nmac.to/wp-content/uploads/2021/11/NanoBrowser.png","title":"NanoBrowser 1.5.1 – Mini web browser","content":"NanoBrowser is a small browser that resides at the forefront of the screen.   You can also display it on the maximized application screen.   You can switch translucent or non-transparent from the application icon on the status bar at any time.   In order to memorize the last open tab of this application,   […]"},{"link":"https://nmac.to/blog/aria/","image":"https://nmac.to/wp-content/uploads/2022/01/Aria.png","title":"Aria 2.0.6 – A simple text editor","content":"Aria is a powerful native text editor for code and markup. Designed for Mac, it comes with all the macOS user interface that you know and all the classic features like tabs, shortcuts and more.   Aria comes with a bunch of powerful smart features designed for pros. Use the file explorer to open your […]"},{"link":"https://nmac.to/blog/principle-3/","image":"https://nmac.to/wp-content/uploads/2017/09/Principle3.png","title":"Principle 6.15 – Animate Your Ideas, Design Better Apps","content":"Principle makes it easy to create animated and interactive user interface designs. Whether you’re designing the flow of a multi-screen app, or new interactions and animations, Principle lets you create designs that look and feel amazing.   Built for the Biggest Imaginations There are a lot of things you might want to design: a short […]"},{"link":"https://nmac.to/blog/dock-mate/","image":"https://nmac.to/wp-content/uploads/2020/09/Dock-Mate.png","title":"Dock Mate 0.8.7 – Window previews and controls [FIX]","content":"Dock Mate adds mouse over window previews to the Dock. With useful built in window management tools and special views to control Music apps. Simply hover over an icon to see all the apps running windows and control them.   Features   Window Previews Show previews of all app windows by mousing over the Dock […]"},{"link":"https://nmac.to/blog/tuneskit-spotify-converter/","image":"https://nmac.to/wp-content/uploads/2017/08/TunesKit-Spotify-Converter.png","title":"Viwizard Music Converter 2.7.0 – Download and convert Spotify music","content":"Viwizard Music Converter for Mac is a smart music downloader and converter for Spotify users. It can easily extract and convert any Spotify songs, albums, playlists, or artists to MP3, M4A, AAC, WAV, FLAC, or M4B common formats so that you can play Spotify music offline on any MP3 player or mobile device.   Version 2.7.0: […]"},{"link":"https://nmac.to/blog/enolsoft-pdf-password-remover/","image":"https://nmac.to/wp-content/uploads/2018/07/Enolsoft-PDF-Password-Remover.png","title":"Enolsoft PDF Password Remover 3.8.0 – Crack PDF password on Mac with ease","content":"Remove PDF password on Mac, giving you the freedom to use your PDFs as you want.   Open/User password Open/user password of PDF is always used for controlling the permission of opening a PDF file to keep the secure. If you forget the password, brute force will be the only way.   Restrictions/Owner password For […]"},{"link":"https://nmac.to/blog/initiater/","image":"https://nmac.to/wp-content/uploads/2022/01/Initiater.png","title":"Initiater 1.0.1 – Capture Text-OCR and Graphics","content":"Capture Text and Graphics! Upgrade your productivity to the next level!   Initiater is an easy to use small macOS OCR (Optical Character Recognition) app that extracts and recognizes any non-editable text on your Mac computer’s screen. As an extra feature, it can turn graphic files into editable text.   Initiater is a small app […]"}]