[{"link":"https://nmac.to/blog/airwriter-2-23/","image":"https://nmac.to/wp-content/uploads/2015/02/airWriter.png","title":"airWriter 2.23 – A Transparent Text Editor","content":"No illuminated text, no fancy formatting, no messy headers or footers, and no footnotes or endnotes. airWriter is an elegant, multipurpose text editor. Its beautifully transparent interface will calm your mind and soul while you work on your insufferable projects.   No matter if you are writing a film review, news article, sports commentary, even […]"},{"link":"https://nmac.to/blog/atv-flash-black-2-5/","image":"https://nmac.to/wp-content/uploads/2014/01/aTV-Flash-black.png","title":"aTV Flash (black) 2.5 – Supercharge your second-generation Apple TV","content":"aTV Flash (black) supercharges your 2nd generation Apple TV, empowering it to do things you never thought possible! All new features are installed alongside the normal Apple TV features, so things like movie rentals, Netflix, and AirPlay will remain unchanged.   Installing aTV Flash (black) requires that you first jailbreak your 2nd Gen. Apple TV […]"},{"link":"https://nmac.to/blog/addism-1-1/","image":"https://nmac.to/wp-content/uploads/2015/02/Addism.png","title":"Addism 1.1 – A great calculator for your Mac.","content":"Addism comes with a clean, intuitive user interface and lots of features.   Addism displays the whole calculation and the result as you are typing, to serve you a complete overview over your calculation.   You can use both mouse as well as your keyboard to calculate. Addism supports keyboard shortcuts for every function.   […]"},{"link":"https://nmac.to/blog/sqlite-professional-1-0-43/","image":"https://nmac.to/wp-content/uploads/2014/03/SQLite.Professional.png","title":"SQLite Professional 1.0.43 – Advanced SQL editor","content":"SQLite Professional is the top SQLite editor for OS X.    Features: Automatic data reloading when the database gets modified externally. Backwards compatibility with SQLite 2. Version integration. Mucked your database? Rollback to a previous version. Semiautomatic dependency resolution. Column reordering. Import or export your data in CSV, mySQL, XML, or JSON formats. Export custom […]"},{"link":"https://nmac.to/blog/fundy-designer-1-8-5/","image":"https://nmac.to/wp-content/uploads/2014/02/Fundy.Designer.png","title":"Fundy Designer 1.8.5 – Next generation design tool","content":"A design leader in the professional photographic community since 2008, Fundy Software is behind you every step of the way. Working to bring you software that is revolutionary in its functionality and ease of use, learn how Andrew Funderburg, CEO of Fundy Software started the company.   Revolutionize your album design workflow and design like […]"},{"link":"https://nmac.to/blog/air-conflicts-pacific-carriers/","image":"https://nmac.to/wp-content/uploads/2015/02/Air.Conflicts.Pacific.Carriers.png","title":"Air Conflicts: Pacific Carriers 1.1 – Arcade combat action flight game","content":"Experience top combat action in this brand new arcade flight sim and become immersed in the exploits of famous aircraft carriers. Choose the side you want to play on: the US Navy or the Imperial Japanese Navy. Climb into the cockpit and re-live the most famous battles of the War in the Pacific. Equip your […]"},{"link":"https://nmac.to/blog/voila-3-8-2/","image":"https://nmac.to/wp-content/uploads/2014/02/Voila.png","title":"Voila 3.8.2 – Capture, annotate, organize, and share media","content":"Voila is a screen-capture, recording, and annotation tool that is a full-featured replacement for Mac’s screen-capture and screen-recording capabilities. It has a large and robust set of editing, organizing, annotation, and effects tools that allows the user to create and add details to screenshots, tutorials, videos, and presentations.   Voila lets you capture any shape, […]"},{"link":"https://nmac.to/blog/callpad-1-2-2/","image":"https://nmac.to/wp-content/uploads/2015/01/CallPad.png","title":"CallPad 1.2.2 – Make Phone Calls","content":"CallPad is a very simple app to ease making phone calls without picking up your iPhone in OS X Yosemite. CallPad requires an iPhone with iOS 8 and an activated carrier plan.   Phone calling works with any iOS device that supports iOS 8 and any Mac that supports Yosemite.   NOTE : In order […]"},{"link":"https://nmac.to/blog/fresh-word-1-1/","image":"https://nmac.to/wp-content/uploads/2015/01/Fresh.Word_.png","title":"Fresh Word 1.1 – Easy to use word processor","content":"Fresh Word is a magic, easy-to-use word processor that can make the writing and the picture have perfect layout, support Retina resolutions and export all the common formats: .pdf, .rtf, .doc, .txt, .odt and more. To create the tables and insert the pictures make your document more rich and colorful. Automatic save function let you […]"},{"link":"https://nmac.to/blog/workburst-1-2/","image":"https://nmac.to/wp-content/uploads/2015/01/WorkBurst.png","title":"WorkBurst 1.2 – A Pomodoro Timer","content":"WorkBurst is the easiest way to instantly boost your productivity — with no confusing settings or extra buttons to push. Simply press start and get to work.   When it’s time for a break, your screen will dim to let you know.   Loosely based on the popular pomodoro technique, WorkBurst is the best way […]"}]