[{"link":"https://nmac.to/blog/share-tunes-2-1-3/","image":"https://nmac.to/wp-content/uploads/2016/03/Share.Tunes_.png","title":"Share Tunes 2.1.3 – Share what song you are listening to","content":"Share Tunes helps you to share your taste in music on Twitter, Facebook, Sina Weibo, and Tumblr! Music plays an important part in our lives, so why don’t share it with others?   Share Tunes works in the background and lives in your menubar. When you open it, you’ll see the song you’re currently playing […]"},{"link":"https://nmac.to/blog/movieicon-2-9-40/","image":"https://nmac.to/wp-content/uploads/2017/01/MovieIcon.png","title":"MovieIcon 2.9.40 – Adds cover art to video files","content":"MovieIcon is a simple Mac application designed to automatically apply movie-poster images retrieved from the Internet as icons to your video files, helping you to keep your collection with the sleek style you expect from a Mac.   Features Easy to use. Just drag a file or folder into the window (or add it from […]"},{"link":"https://nmac.to/blog/mouse-hider-3-1/","image":"https://nmac.to/wp-content/uploads/2017/01/MouseHider.png","title":"Mouse Hider 3.1 – Makes the presence of the mouse cursor on the monitor less intrusive","content":"Mouse Hider makes the presence of the mouse cursor on the monitor less intrusive.   Thanks to Mouse Hider it is possible to automatically hide the mouse cursor after a customizable time of inactivity, or alternatively, by putting it on the edge of the screen through the Hot Borders mode, and also through a Shortcut. […]"},{"link":"https://nmac.to/blog/cssdesigner-5-0/","image":"https://nmac.to/wp-content/uploads/2016/07/CSSDesigner.png","title":"CSSDesigner 5.0 – Full-featured and powerful CSS designing app","content":"CSS Designer is a full-featured and powerful CSS design app. CSSDesigner takes full advantage of the latest Mac technologies, giving you speedy, powerful tools that let you touch up and enhance CSS, draw or paint, apply dazzling effects, or create advanced compositions amazingly easily.   Features Quickly and easily create any CSS3 (CSS2) effects Edit […]"},{"link":"https://nmac.to/blog/audiotunes-1-5-0/","image":"https://nmac.to/wp-content/uploads/2017/01/AudioTunes.png","title":"AudioTunes 1.5.0 – FLAC, APE, WMA Converter","content":"AudioTunes is a powerful audio converter, which converts common audios ( MP3，wav，flac，ape，wma，amr，ac3，au ,etc ) to iTunes simply by 3 clicks. You can play those audios on your Mac or download them to the iOS devices.   Key features: Easy to Use (No Complicated Setting) Only 3 steps: Add files – Select the format – Click […]"},{"link":"https://nmac.to/blog/stationary-template-for-mail-4-0/","image":"https://nmac.to/wp-content/uploads/2014/11/Designs-for-Mail2.png","title":"Stationary – Template for Mail 4.0 – 100+ beautiful templates for Apple’s Mail","content":"Designs for Mail is an excellent collection of 230 stationery templates for Apple’s Mail. Just choose a template, add your text and photos, and send the exceptional email to your client, workmate, or friend.   The available designs range from the elegant Red Red Wine to the outright kooky Easter Chicken. You will definitely find […]"},{"link":"https://nmac.to/blog/spillo-1-9-7/","image":"https://nmac.to/wp-content/uploads/2014/08/Spillo.png","title":"Spillo 1.9.7 – Take full control over your bookmarks on Pinboard","content":"Spillo is a powerful, beautiful and amazingly fast Pinboard client. Spillo lets you browse and organize your bookmarks in a stunning modern interface. Spillo also makes creating a bookmark from anywhere on your Mac as convenient as possible.   A beautiful interface Spillo has a beautiful modern interface that feels just right at home on […]"},{"link":"https://nmac.to/blog/nihilumbra/","image":"https://nmac.to/wp-content/uploads/2017/01/Nihilumbra.png","title":"Nihilumbra 1.35 – Discover the beautiful world of Nihilumbra with this adventure game","content":"Discover the beautiful world of Nihilumbra and join Born on his adventure to find himself whilst trying to escape from his inevitable curse. Born was created from the absolute nothingness: The Void. But somehow he separates himself from the black emptiness and appears in the world. This is where his long odyssey begins, in which he […]"},{"link":"https://nmac.to/blog/watts-2-0-3/","image":"https://nmac.to/wp-content/uploads/2016/09/Watts.png","title":"Watts 2.0.3 – Recalibration tool for laptop batteries","content":"Watts is a MacBook® battery management and calibration assistant tool. It’s a menu bar app that, apart from the usual battery information (power source used, current battery charge and remaining time), provides advanced data to obtain the maximum performance of your MacBook® battery.   Your battery needs to be calibrated from time to time to […]"},{"link":"https://nmac.to/blog/my-net-1-25/","image":"https://nmac.to/wp-content/uploads/2015/11/My.Net_.png","title":"My Net 1.25 – Network Scanner","content":"See whats all connect to your favorite public WiFi network or your home network. This all-in-one information appliation is an extremely fast and thorough security solution for every user. LAN Scan is an application developed for Network Administrators and IT Managers but presented in a format targeted for non-professionals. This application allows you to view […]"}]