[{"link":"https://nmac.to/blog/education-templates-by-nobody/","image":"https://nmac.to/wp-content/uploads/2016/07/Education.Templates.png","title":"Education Templates by Nobody 2.1.1 – 65 Education-related Templates for pages","content":"Education Templates has 65 Education-related Templates for pages.   Education Templates by Nobody is a valuable add-on for Apple’s Pages app and provides 65 useful education-related templates.   Content Activity Sheet 2x Addition-Subtraction Worksheet Alphabet Worksheet Alphabet Cursive Worksheet Attendance List Behavior Chart Blank Sheet Music Book Report Bookmarks Bubble Map Calendars: Monthly + 2x […]"},{"link":"https://nmac.to/blog/adobe-muse-cc/","image":"https://nmac.to/wp-content/uploads/2017/08/Adobe-Muse.png","title":"Adobe Muse CC 2018.0.0 – Design and publish HTML websites without writing code","content":"Adobe Muse 2018 enables designers to create websites as easily as creating a layout for print. Design and publish original HTML pages using the latest Web standards, and without writing code. Now in beta, Muse makes it a snap to produce unique, professional-looking websites.   Key Features Plan your project– Easy-to-use sitemaps, master pages, and a […]"},{"link":"https://nmac.to/blog/overgrowth/","image":"https://nmac.to/wp-content/uploads/2017/10/Overgrowth.png","title":"Overgrowth 1.0 – Jump, kick, throw, and slash your way to victory","content":"As a lightning-fast acrobatic ninja rabbit, you can choose how to approach each encounter. Do you want to pick off enemies one at a time like the killer in a slasher film? Dive into the thick of it and fight whole groups in a frontal assault? Steal the most powerful weapon you can find, and […]"},{"link":"https://nmac.to/blog/short-menu/","image":"https://nmac.to/wp-content/uploads/2017/02/Short-Menu3.png","title":"Short Menu 3.0.2 – Fast and intelligent URL shortener","content":"Short Menu is a powerful, intelligent, and lightning-fast URL shortener. It supports 15 different services and is extremely easy to use. Simply click on Short Menu’s menu bar icon to open it. It automatically takes the URL from your clipboard. You only have to press one button, then Short Menu will shorten your URL and […]"},{"link":"https://nmac.to/blog/any-deepstyle/","image":"https://nmac.to/wp-content/uploads/2017/10/Any-DeepStyle.png","title":"Any DeepStyle 1.0.1 – Art Filters & AI Photo Editor","content":"Any DeepStyle is a cool revolutionary app that combines neural networks and AI (Artificial Intelligence) to transform your photos into impressive works of art using 80+ diversified filters & styles, including Mosaic, classical, anime, comic, modern, traditional, abstract, Cartoon as well as your OWN styles. Not a single App or Photoshop plugin can be comparable […]"},{"link":"https://nmac.to/blog/dragodino/","image":"https://nmac.to/wp-content/uploads/2017/10/DragoDino.png","title":"DragoDino 1.0 – A 2D rogue platformer game","content":"Fight your way to the top in DragoDino, an epic adventure set in an ever changing world!   Meet Bob, a DragoDino, and guide him through the 10 levels of the Forest Kingdom in a quest to recover his lost egg stuck atop a giant tree.   Explore and fight enemies to reach ever higher, […]"},{"link":"https://nmac.to/blog/pathfinder-adventures/","image":"https://nmac.to/wp-content/uploads/2017/10/Pathfinder-Adventures.png","title":"Pathfinder Adventures 1.0 – RPG, Strategy & Fantasy Card Game","content":"Pathfinder Adventures brings one of Paizo’s most successful products, the Pathfinder Adventure Card Game, into the digital realm in an enhanced experience. Additionally, it emphasizes the characters, story, and world of Pathfinder’s rich and diverse world.   Features players experience exclusively in the digital version include: Reactive cutscenes featuring Pathfinder’s iconic characters. Explore towns, cities, […]"},{"link":"https://nmac.to/blog/schwartz/","image":"https://nmac.to/wp-content/uploads/2017/05/Schwartz1.png","title":"Schwartz 1.8 – Template base graphics code generation","content":"Schwartz is a developer tool that takes the pain out of writing complex graphics-drawing code. With Schwartz, you can create vector-based graphic compositions in a user-friendly graphical environment, and then automatically generate source code for rendering your composition on iOS, OS X, the Web, or any other platform.   Schwartz already supports producing source code […]"},{"link":"https://nmac.to/blog/mflare/","image":"https://nmac.to/wp-content/uploads/2017/10/mFlare.png","title":"mFlare 1.3.8 – Professional lens flare plugin with brand new possibilities","content":"mFlare is the most advanced multi-platform plug-in for designing and animating realistic lens flare effects.   Features Over 200 professional presets Over 170 realistic textures Direct FCPX access 2D / 3D light effects 3D light-tracking in Motion 5 Luma tracking Automatic dynamic animation Real-time dynamic preview Real-time presets library 64-bit architecture Multi-platform support and much […]"},{"link":"https://nmac.to/blog/business-lab-for-pages/","image":"https://nmac.to/wp-content/uploads/2017/04/Business-Lab-for-Pages.png","title":"Business Lab for Pages 3.2.1 – Templates Bundle","content":"Develop your professional image and brand identity, save thousands on creative agency fees! Explore a broad range of professionally-designed customizable business stationery templates, easily adapt them to your professional needs!   Business Lab for Pages offers corporate stationery templates in convenient packs sorted by style and appearance. Every style pack is a comprehensive collection of […]"}]