[{"link":"https://nmac.to/blog/snapselect-1-2-0/","image":"https://nmac.to/wp-content/uploads/2015/01/Snapselect.png","title":"Snapselect 1.2.0 – Discover best photos, eliminate duplicates","content":"Snapselect saves you time and helps to manage photos in the new smart way. Easily discover your best images, quickly eliminate similar photos and duplicates, save disk space and make your photo life easier! It works flawlessly with iPhoto, Aperture, Lightroom, any folder and any external drive, including camera SD cards.   Version 1.2.0: Speed […]"},{"link":"https://nmac.to/blog/mach-write-1-6-0/","image":"https://nmac.to/wp-content/uploads/2015/03/Mach-Write.png","title":"Mach Write 1.6.0 – Powerful text editor","content":"Mach Write is a powerful new RTF, TXT, and PDF editor (Rich Text Format, Plain Text, PDF) for iOS and OS X! Featuring full iCloud document synchronization, RTF in multiple styles, sizes, and colors; as well as PDF viewing/creating/annotation; and TXT files in addition to supporting nearly 15 plain text code formats; Mach Write makes […]"},{"link":"https://nmac.to/blog/menutab-pro-for-facebook-6-5/","image":"https://nmac.to/wp-content/uploads/2015/01/MenuTab.Pro_.for_.Facebook.png","title":"MenuTab Pro for Facebook 6.5 – The Ultimate Facebook App for you MAC","content":"MenuTab Pro for Facebook is the Pro version of the best Mac app for Facebook with these amazing extra features: Color-coded menubar alerts, Desktop mode with chat, Popup notifications, Stealth mode, Full screen support and much more!   MenuTab Pro for Facebook is an incredibly slick and gorgeous app for quickly accessing your Facebook account […]"},{"link":"https://nmac.to/blog/ia-writer-pro-1-5-2/","image":"https://nmac.to/wp-content/uploads/2015/03/iA.Writer.Pro_.png","title":"iA Writer Pro 1.5.2 – Professional writing suite","content":"iA Writer Pro is a professional writing suite that gives you full control over your notes, drafts and edits.   Workflow: Note – Write – Edit – Read. Each stage has a task-specific typeface and color. Syntax Control scans the syntax of English, French, German, Italian, and Spanish text and highlights your adjectives, nouns, verbs, […]"},{"link":"https://nmac.to/blog/civilization-beyond-earth/","image":"https://nmac.to/wp-content/uploads/2014/12/Civilization-Beyond-Earth.png","title":"Civilization: Beyond Earth 1.1.4 – Lead your people to a new frontier","content":"Sid Meier’s Civilization: Beyond Earth is a new science-fiction-themed entry into the award-winning Civilization series. Set in the future, global events have destabilized the world leading to a collapse of modern society, a new world order and an uncertain future for humanity. As the human race struggles to recover, the re-developed nations focus their resources […]"},{"link":"https://nmac.to/blog/super-mp3-converter-6-0-95/","image":"https://nmac.to/wp-content/uploads/2015/03/Super.MP3.Converter.png","title":"Super MP3 Converter 6.0.95 – Convert any videos or audios to MP3, AAC and more","content":"Super MP3 Converter can convert almost all videos and audios to MP3, AAC, AIFF, ALAC, WAV and M4A with lightening speed and zero quality loss. With this wonderful MP3 Music Converter App, users can convert any audio file like OGG, FLAC, AC3, and more to other popular audio formats. Also, it enables users to extract […]"},{"link":"https://nmac.to/blog/freememory-pro-1-9/","image":"https://nmac.to/wp-content/uploads/2015/03/FreeMemory-Pro.png","title":"FreeMemory Pro 1.9 – Monitor and manage memory usage","content":"FreeMemory Pro can increase your free memory with a simple click. It always monitors your memory usage in your menubar, and provides you with tons of extra features: Menubar information can be easily customized: icon, 2D pie chart, monochrome chart, text, full info, font size selector Usage details can be displayed with an elegant 3D […]"},{"link":"https://nmac.to/blog/tales-from-the-borderlands/","image":"https://nmac.to/wp-content/uploads/2015/03/Tales.from_.the_.Borderlands.png","title":"Tales from the Borderlands 1.0 – Great adventurer and quest game","content":"Tales from the Borderlands is a five part episodic game series from the creators of The Wolf Among Us and The Walking Dead: A Telltale Games Series. Set on the unforgiving world of Pandora after the events seen in Borderlands 2, this is a story full of Borderlands’ trademark humor, following two adventurers on their […]"},{"link":"https://nmac.to/blog/iconvert-icons-2-7/","image":"https://nmac.to/wp-content/uploads/2015/03/iConvert.Icons_.png","title":"iConvert Icons 2.7 – Convert icons to .png format","content":"iConvert Icons is now the easiest way to create and convert icons from almost any format. With its unique auto-detection feature, just drop images, apps, folders with custom icons, and of course other icons right into the conversion window. All you need to do is choose the location where you want the newly converted icons […]"},{"link":"https://nmac.to/blog/icircuit-1-8/","image":"https://nmac.to/wp-content/uploads/2014/05/iCircuit.png","title":"iCircuit 1.8 – Design and experiment with circuits","content":"iCircuit is the easiest way to design and experiment with circuits. Its advanced simulation engine can handle both analog and digital circuits and features realtime always-on analysis. It is the perfect companion to students, hobbyists, and engineers.   You use it as you would any CAD program: you add elements, connect them together, and set […]"}]