[{"link":"https://nmac.to/blog/clawmenu-300/","image":"https://nmac.to/wp-content/uploads/2013/12/ClawMenu.175x175-75.jpg","title":"ClawMenu 3.0.0 – Create custom menus for your apps (was PiquantMenu)","content":"ClawMenu finds its place between the Finder and LauchPad, offering a whole new access to your files. Usable via your menubar or with a simple short cut, it gives you the possibility to navigate through your folders without the need to use the Finder. All your documents at your fingertips! Usage The navigation in icon […]"},{"link":"https://nmac.to/blog/pochade-214/","image":"https://nmac.to/wp-content/uploads/2013/12/Pochade.175x175-75.jpg","title":"Pochade 2.1.4 – Full-spectrum colors picker","content":"Pochade easily allows you to select any color from your screen, save your collection of colors, and get the color value the way you want. Pochade is ideal for anyone that often has to get different color values from their screen. You can also import your existing collections. We support ACO, ASE, and CLR files […]"},{"link":"https://nmac.to/blog/tuba-14/","image":"https://nmac.to/wp-content/uploads/2013/12/MacIcon.175x175-75.jpg","title":"Tuba 1.4 – Super fast and elegantly designed YouTube app","content":"Tuba is a super fast and elegantly designed YouTube app for your beloved Mac   Why use Tuba app instead of youtube.com? 1) The app is blazing fast compare with the website.Everything is much faster. 2) Better design: more content, no clutter. 3) Save 50% battery. Tuba only uses half the power compare with youtube.com, […]"},{"link":"https://nmac.to/blog/dupeguru-music-edition-651/","image":"https://nmac.to/wp-content/uploads/2013/12/22521.jpg","title":"dupeGuru Music Edition 6.5.1 – Find duplicate songs in your music collection","content":"dupeGuru Music Edition is a tool to find duplicate songs in your music collection. It can scan filenames, tags, or contents. dupeGuru ME is efficient. Find your duplicate files in minutes, thanks to its quick fuzzy-matching algorithm. dupeGuru ME not only finds filenames and tags that are the same, but it also finds similar ones. […]"},{"link":"https://nmac.to/blog/dupeguru-picture-edition-271/","image":"https://nmac.to/wp-content/uploads/2013/12/22724.jpg","title":"dupeGuru Picture Edition 2.7.1 – Find duplicate pictures on your computer","content":"dupeGuru Picture Edition (PE for short) is a tool to find duplicate pictures on your computer. dupeGuru PE is a big brother of dupeGuru. It works like dupeGuru, but is specialized for duplicate pictures matching. dupeGuru PE is efficient. Find your duplicate pictures in minutes, thanks to its quick fuzzy matching algorithm. Not only can […]"},{"link":"https://nmac.to/blog/easyvpn-154/","image":"https://nmac.to/wp-content/uploads/2013/12/33073.jpg","title":"EasyVPN 1.5.4 – Interface for VPN server","content":"EasyVPN is an interface for the standards-based VPN Server that is included in Mac OS X. Apple provides an interface for OS X Server but not for regular OS X. EasyVPN provides a similar, yet simple interface to fully configure the VPN Server. WHAT’S NEWVersion 1.5.4: Improved start on system launch Updated license engine UI […]"},{"link":"https://nmac.to/blog/filechute-456/","image":"https://nmac.to/wp-content/uploads/2013/12/11632.jpg","title":"FileChute 4.5.6 – Quick Internet file transfer tool","content":"FileChute offers an easier way to send large files. How many times have you tried to email a large file only to have it bounce? FileChute makes sending files easy. Just drag a file and drop it on FileChute. FileChute puts the file on your Dropbox or website and generates a Web link for retrieving the […]"},{"link":"https://nmac.to/blog/moneyguru-270/","image":"https://nmac.to/wp-content/uploads/2013/12/28526.jpg","title":"moneyGuru 2.7.0 – Personal finance management application","content":"moneyGuru is a personal finance management application. With it, you can evaluate your financial situation so you can make informed (and thus better) decisions. Most finance applications have the same goal, but moneyGuru’s difference is in the way it achieves it. Rather than having reports which you have to configure (or find out which pre-configured […]"},{"link":"https://nmac.to/blog/notebook-318/","image":"https://nmac.to/wp-content/uploads/2013/07/NoteBook.png","title":"NoteBook 3.1.8 – Organize photos, email, documents and more","content":"NoteBook is an ideal solution for users who are sick and tired of spending their time trying to stay organized. From simple tasks to massive projects, Circus Ponies NoteBook handles it all, so you can stop spending hours doing what should take just minutes.   Here are four ways NoteBook will save you time every day: […]"},{"link":"https://nmac.to/blog/pluraleyes-311/","image":"https://nmac.to/wp-content/uploads/2013/12/41770.jpg","title":"PluralEyes 3.1.1 – Instantly sync multi-camera audio and video","content":"PluralEyes will synch your audio and video in seconds Videographers and filmmakers win by telling a good story. Now you can win at the workflow behind that story too. By synchronizing audio and multi-camera video automatically, PluralEyes revolutionizes post-production and speeds your sync in seconds rather than days.   The new PluralEyes for Mac is […]"}]