[{"link":"https://nmac.to/blog/greeting-cards-1-9-1/","image":"https://nmac.to/wp-content/uploads/2016/07/Greeting-Cards.png","title":"Greeting Cards 1.9.1 – A collection of 500 Pages templates for cheerful celebrations","content":"Greeting Cards – Graphic Node presents a holidays card application offering a collection of 500 Pages templates for cheerful celebrations.   Buy it now if you: Want to congratulate your friends or loved ones Do it like a professional designer Want to get regular updates Like free things and holidays   Nearly all objects in […]"},{"link":"https://nmac.to/blog/garageband-10-1-4/","image":"https://nmac.to/wp-content/uploads/2015/07/GarageBand10.png","title":"GarageBand 10.1.4 – Complete recording studio and more","content":"The new GarageBand is a whole music creation studio right inside your Mac — complete with keyboard, synths, orchestral and percussion instruments, presets for guitar and voice, an entirely redesigned sound library, and virtual session drummers. A beautiful and intuitive interface makes it easy to learn, play, record, and create great-sounding songs. And you can […]"},{"link":"https://nmac.to/blog/denied-1-4-1/","image":"https://nmac.to/wp-content/uploads/2016/11/Denied.png","title":"Denied 1.4.1 – Skip Terrible Music","content":"Denied sees what you’re playing in Spotify and iTunes and automatically skips songs that you dislike.   Tracks can be skipped by their artist, title, album, whether they contain explicit lyrics*, or if you’ve heard them before in the past few hours.   Denied allows you to truly enjoy Top 40 playlists, the Christmas season, […]"},{"link":"https://nmac.to/blog/video-toolbox-vgurusoft-1-1-4/","image":"https://nmac.to/wp-content/uploads/2016/12/Video-Toolbox-vGuruSoft.png","title":"Video Toolbox vGuruSoft 1.1.4 – Editor,Converter,Recorder","content":"Video Toolbox vGuruSoft is the most powerful all-in-one essential media toolset ever.   Video Toolbox vGuruSoft = Powerful Video Editor + Video Converter + Audio Converter + HD Media Player + Lossless Screen Recorder + Compression Tool…   Use this complete full-featured video toolbox to convert, edit, merge, compress, capture, and play any video and […]"},{"link":"https://nmac.to/blog/sibelius-8-5-0/","image":"https://nmac.to/wp-content/uploads/2014/07/Sibelius.png","title":"Sibelius 8.5.0 – Music notation solution","content":"Sibelius is the world’s best-selling music notation software for Mac. It is as intuitive to use as a pen, yet so powerful that it does most things in less than the blink of an eye. The demo includes example scores and a demo user guide summarizing the main features of the program.   Version 8.5.0: […]"},{"link":"https://nmac.to/blog/appdelete-4-3-1/","image":"https://nmac.to/wp-content/uploads/2015/02/AppDelete.png","title":"AppDelete 4.3.1 – The speedy and efficient way to delete your unwanted apps","content":"AppDelete is an uninstaller for Macs that will remove not only applications but also widgets, preference panes, plugins, and screensavers along with their associated files. Without AppDelete these associated items will be left behind to take up space and potentially cause issues.   There are several ways to activate AppDelete: Drag items onto main window […]"},{"link":"https://nmac.to/blog/pdf-to-image-pro-3-3-9/","image":"https://nmac.to/wp-content/uploads/2016/12/PDF.to_.Image_.Pro_.png","title":"PDF to Image Pro 3.3.9 – PDF to JPG/PNG and more","content":"Convert PDF to almost any image formats quickly and stay or improve original quality.   PDF to Image Pro can convert PDF to JPEG, PNG, GIF, BMP, TGA, PPM, TIFF and JPEG2000 with high quality. Also, it allows you to finish batch PDF conversion and convert one page PDF. And before you convert PDF to […]"},{"link":"https://nmac.to/blog/denied-1-4-0/","image":"https://nmac.to/wp-content/uploads/2016/11/Denied.png","title":"Denied 1.4.0 – Skip Terrible Music","content":"Denied sees what you’re playing in Spotify and iTunes and automatically skips songs that you dislike.   Tracks can be skipped by their artist, title, album, whether they contain explicit lyrics*, or if you’ve heard them before in the past few hours.   Denied allows you to truly enjoy Top 40 playlists, the Christmas season, […]"},{"link":"https://nmac.to/blog/word-air-1-7-3/","image":"https://nmac.to/wp-content/uploads/2016/08/Word-Air.png","title":"Word Air 1.7.3 – for Microsoft Word Edition & Open Office Format","content":"Word Air is a beautiful, easy-to-use text editor that is designed to make writing convenient, efficient and comfortable. Word Air is ease, fast and uncluttered. It starts up quickly, has a live word count, easy on the eyes and you can export all the common formats: .pdf, .rtf, .doc, .txt and more .   Features […]"},{"link":"https://nmac.to/blog/slicy-1-1-8/","image":"https://nmac.to/wp-content/uploads/2016/12/Slicy.png","title":"Slicy 1.1.8 – Turn PSD elements into images for the Web and apps","content":"  Slicy (was Layer Cake) turns PSD elements into images for the Web and for Apps, simply name your layer groups once and let Slicy do its magic. Bye bye, “Save for Web/Devices”. Hello, boost in productivity and creativity!   Designers and Developers, rejoice — exporting is no longer a workflow killer. Name layer groups […]"}]