[{"link":"https://nmac.to/blog/sword-coast-legends/","image":"https://nmac.to/wp-content/uploads/2015/11/Sword.Coast_.Legends.png","title":"Sword Coast Legends 1.0 – Dungeons & Dragons as a shared storytelling experience","content":"    Set in the lush and vibrant world of the Forgotten Realms, Sword Coast Legends offers an all-new way to enjoy the time-tested magic of playing Dungeons & Dragons as a shared storytelling experience. With a deep narrative developed by a team of long-time industry veterans and a partnership with Wizards of the Coast, […]"},{"link":"https://nmac.to/blog/skullgirls-1-0-13330/","image":"https://nmac.to/wp-content/uploads/2015/11/Skullgirls.png","title":"Skullgirls 1.0.13330 – Fast-paced 2-D fighting game","content":"Skullgirls is a fast-paced 2-D fighting game that puts players in control of fierce warriors in an extraordinary Dark Deco world. Featuring all-new game systems which test the skills of veteran fighting game fans while also making the genre enjoyable and accessible to newcomers.   Skullgirls is a modern take on classic arcade fighters with […]"},{"link":"https://nmac.to/blog/conflicks-revolutionary-space-battles-1-0/","image":"https://nmac.to/wp-content/uploads/2015/11/Conflicks.png","title":"Conflicks – Revolutionary Space Battles 1.0 – Strategy Space Battle Game","content":"Conflicks: Revolutionary Space Battles is a creative new take on space-themed videogames that merges the deep, thoughtful gameplay of strategy games with the intuitive accessibility of physics-based games.   The game universe is a futuristic alternate history of the European Renaissance that combines elements from the 16th, 17th and 18th centuries with science fiction and […]"},{"link":"https://nmac.to/blog/seasons-1-3-5/","image":"https://nmac.to/wp-content/uploads/2015/06/Seasons.png","title":"Seasons 1.3.5 – A beautiful app to explore, in a fun way, what to watch in TV","content":"Of course you will want to track your favourite TV programmes too and this app will help you a lot on this. But tracking TV programmes is just the beginning: discover it yourself!   (Soon there will be versions for iPad and iPhone too, so you can automatically synchronise between your devices the TV shows […]"},{"link":"https://nmac.to/blog/textexpander-5-1-3/","image":"https://nmac.to/wp-content/uploads/2014/01/TextExpander.png","title":"TextExpander 5.1.3 – Expand custom keyboard shortcuts into frequently-used text and pictures","content":"TextExpander saves your fingers and your keyboard, expanding custom keyboard shortcuts into frequently-used text and pictures. Type more with less effort!   Here are a few examples for what you can do with TextExpander: Insert standard greetings, phrases, boilerplate paragraphs, and signatures – including formatted text and pictures. Correct typos automatically Organize snippets into groups […]"},{"link":"https://nmac.to/blog/musictube-1-5-1/","image":"https://nmac.to/wp-content/uploads/2015/11/Musictube.png","title":"Musictube 1.5.1 – Stream music from YouTube","content":"Musictube is a YouTube music player. With it you can listen to millions of songs on YouTube in a convenient way, much like using a traditional player. Musictube plays album tracks in their original order and integrates album covers, artist pictures and lyrics.   Musictube can play full albums or even discographies of millions of […]"},{"link":"https://nmac.to/blog/my-alarm-clock-1-8/","image":"https://nmac.to/wp-content/uploads/2015/11/My.Alarm_.Clock_.png","title":"My Alarm Clock 1.8 – Turn your Mac into an all-in-one alarm clock","content":"My Alarm Clock turns your Mac into an alarm clock that sings your favorite tunes, a bedside clock with gorgeous themes and current weather information, and a sleep timer that lulls you to sleep at night!   Features Designer clocks: enjoy a variety of stylish clock faces Multiple alarm support: you’ll never oversleep or miss […]"},{"link":"https://nmac.to/blog/my-net-1-22/","image":"https://nmac.to/wp-content/uploads/2015/11/My.Net_.png","title":"My Net 1.22 – Network Scanner","content":"See whats all connect to your favorite public WiFi network or your home network. This all-in-one information appliation is an extremely fast and thorough security solution for every user. LAN Scan is an application developed for Network Administrators and IT Managers but presented in a format targeted for non-professionals. This application allows you to view […]"},{"link":"https://nmac.to/blog/sendlater-1-2-2/","image":"https://nmac.to/wp-content/uploads/2015/11/SendLater.png","title":"SendLater 1.2.2 – Send email at a specific date and time in the future","content":"SendLater gives you the ability to send email at a specific date and time in the future. Normally, emails are immediately sent to the recipient when you press Mail’s “Send” button, but SendLater provides a new button to work its magic. This allows better control of your emails and is more than handy in the […]"},{"link":"https://nmac.to/blog/markly-1-6-0/","image":"https://nmac.to/wp-content/uploads/2015/11/Markly.png","title":"Markly 1.6.0 – Create measurement and design specs in Photoshop and Sketch","content":"Markly is a measurement and design-spec plugin/extension for Photoshop and Sketch. It is made for modern Web designers and app front-end developers. You can add specification marks simply by clicking-and-dragging. Coordinates, dimensions, distance, or fonts, no matter what or where you want.   Super Easy and Fast   Without Markly, you have to spend time […]"}]