[{"link":"https://nmac.to/blog/axure-rp/","image":"https://nmac.to/wp-content/uploads/2018/02/Axure-RP9.png","title":"Axure RP 9.0.0.3716 – Design the right solution and align your team","content":"Axure RP brings new diagramming, prototyping, and specification features to help you design the right solution and align your team. For teams, take advantage of new collaboration features and an option to install Axure Share on-premises.   PLAN AND PROTOTYPE Building great business solutions, websites, and applications requires planning before going into production.   With Axure […]"},{"link":"https://nmac.to/blog/exposure-x5/","image":"https://nmac.to/wp-content/uploads/2018/09/Exposure-X4.png","title":"Exposure X5 Bundle 5.2.4.282 – The fastest way to bring your vision to life","content":"Exposure is the award-winning RAW photo editor and organizer that enables you to create beautiful images and master your workflow.   For over a decade, Exposure has helped photographers bring their images to life with unmatched creative tools. Exposure also offers powerful organizing tools, fast performance, an intuitive layout, and a subscription-free approach. It’s the […]"},{"link":"https://nmac.to/blog/two-point-hospital/","image":"https://nmac.to/wp-content/uploads/2018/11/Two-Point-Hospital.png","title":"Two Point Hospital 1.21.55860 – Single player Simulation & Management Game","content":"Build up a hospital from nothing to a masterpiece as you design the most beautiful – or functional – healthcare operation in the whole of Two Point County.    Optimise your hospital design to increase patient (and cash) flow, arranging corridors, rooms and waiting areas to your exact specifications. Expand your hospital to multiple buildings […]"},{"link":"https://nmac.to/blog/yuri/","image":"https://nmac.to/wp-content/uploads/2017/06/Yuri.png","title":"Yuri 3.0 – An artful platformer with fast-paced gameplay","content":"It’s night. Yuri wakes up in a strange forest inhabited by enormous plants and mysterious creatures.   Travel with him and test your skills to overcome the many dangers of this fantastic and unexplored world.   Through 10 extensive levels, find secret passages and explore all the way to the center of the Earth.   […]"},{"link":"https://nmac.to/blog/true-fear-forsaken-souls/","image":"https://nmac.to/wp-content/uploads/2020/09/True-Fear.png","title":"True Fear: Forsaken Souls 2.0.0 – Horror Hidden Object Game","content":"You are walking down a street you don’t recognize, the fog slowing your pace to a crawl as darkness blinds you. You pause and look up to see a house; candles flicker in every window, like a beacon. Climbing the few steps to the front door, you realize many years have passed since it was […]"},{"link":"https://nmac.to/blog/resolutiion/","image":"https://nmac.to/wp-content/uploads/2020/09/Resolutiion.png","title":"Resolutiion 1.1.4.3 – Adventure Pixel Action & Adventure Game","content":"An old killer escorts a curious AI through chaotic combat, puzzling secrets, and unsettling calm in a dreamscape of madmen and sane animals.    Resolutiion is a fast-paced action-adventure created by two angry German brothers leading a band of vagrants who loaded it with lovely pixels, dirty jokes, deep ideas and badassemotional tunes for 20 […]"},{"link":"https://nmac.to/blog/buoyancy/","image":"https://nmac.to/wp-content/uploads/2020/09/Buoyancy.png","title":"Buoyancy 3.0.0815 Early Access – A city-building strategy game","content":"Buoyancy is a city-building strategy game set in an ocean world.   Build a floating city. Plan out your city’s expansion by placing floating platforms that connect with each other. There are several types of buildings: Gatherers, Production, Hunters, Military, and Utility. Resources are delivered in real-time for constructing and production by your villagers.   […]"},{"link":"https://nmac.to/blog/videoscan/","image":"https://nmac.to/wp-content/uploads/2019/06/VideoScan.png","title":"VideoScan 1.0.5 – Displays hidden information about your multimedia","content":"VideoScan displays hidden information about your multimedia documents. The application is able to analyze your files as well as the embedded audio and video streams. It provides you a lot of information, including the appearance of videos, the number of frames per second, the bit rate used, the sample rate of audio tracks, the number […]"},{"link":"https://nmac.to/blog/syncsettings/","image":"https://nmac.to/wp-content/uploads/2020/08/SyncSettings.png","title":"SyncSettings 1.2.4 – Back up and sync the preferences of your applications","content":"SyncSettings is the application able to back up and sync the preferences of your mac apps. Tired of settling all your apps after a new macOS install or manually keeping the same settings across several macs? SyncSettings will do it for you. SyncSettings packages your preferences into a single ssbackup file. So, you can then […]"},{"link":"https://nmac.to/blog/screenotate/","image":"https://nmac.to/wp-content/uploads/2020/08/Screenotate.png","title":"Screenotate 3.0.0 – Recognize text in your screenshots","content":"Do you often find yourself retyping text that’s stuck inside an image? Have you ever found an old screenshot lying around and can’t find where it originally came from?   Try Screenotate! Every time you take a screenshot, Screenotate will step in to recognize and save the text inside (using Optical Character Recognition), along with […]"}]