[{"link":"https://nmac.to/blog/expressionsinbar/","image":"https://nmac.to/wp-content/uploads/2021/03/ExpressionsinBar.png","title":"ExpressionsinBar 2.3 – Powerful computer algebra system in your menu bar","content":"ExpressionsinBar is a simple menubar application which provides powerful computer-aided algebra computations. A mathematical expression entered in the popup window is immediately computed and the result is displayed in an associated subview window. With the drag-and-drop feature, results are easily copied into text editors such as Pages or Microsoft Word, or presentation programs such as […]"},{"link":"https://nmac.to/blog/cisdem-contactsmate/","image":"https://nmac.to/wp-content/uploads/2018/05/Cisdem-ContactsMate.png","title":"Cisdem ContactsMate 5.7.0 – Manage and backup contacts in one place","content":"Cisdem ContactsMate (was Contact Manager) is a great contacts manager. It allows you to backup everything in Contacts; edit the Contacts fields; find, analyze, report, and fix dozens of problems with OS X Contacts; and export your address book to CSV, vCard, TXT, DocX, HTML, Excel, Numbers, and Pages formats for easy Contacts backup or […]"},{"link":"https://nmac.to/blog/timetable/","image":"https://nmac.to/wp-content/uploads/2021/03/TimeTable.png","title":"TimeTable 3.4.2 – Track time, event- and project-planning, and billing in iCal","content":"With TimeTable, you can view, analyze, and total the hours you have recorded in your iCal calendars. Since you already use your calendars to plan your time, this data is perfect for tracking time, event and project planning, and billing customers for time you have worked.   Your events are edited and stored in iCal. […]"},{"link":"https://nmac.to/blog/bulk-photo-watermark/","image":"https://nmac.to/wp-content/uploads/2021/03/Bulk-Photo-Watermark.png","title":"Bulk Photo Watermark 2.0 – Easily add watermarks to art, photos and more","content":"Bulk Photo Watermark stamps text, EXIF data, QR codes, images and maps on your photos.   The number of watermarks you add to a photo is unlimited. Watermarks can be rotated and freely positioned using the arrow buttons in the Layout panel. EXIF data from the photos (like camera model, focal length, exposure details etc.) […]"},{"link":"https://nmac.to/blog/exif-app/","image":"https://nmac.to/wp-content/uploads/2021/03/EXIF-App.png","title":"EXIF App 1.3 – EXIF viewer software","content":"EXIF App is the last EXIF viewer you’ll ever need. Our app loads images in any format, including RAW. The app supports all EXIF, TIFF, EXIF-AUX, and JFIF structures as well as Maker Notes from Nikon, Canon, Pentax, Fuji, Panasonic, Olympus and many more. EXIF and location data from photos taken with mobile devices is […]"},{"link":"https://nmac.to/blog/focus-2/","image":"https://nmac.to/wp-content/uploads/2021/03/Focus_2.png","title":"Focus 2.6.5 – Reduce clutter & tasks noise","content":"Focus helps you concentrate on the essentials – it can highlight the current working application and blur the rest.   Don’t get distracted by dozens of windows, apps or flashy websites while working on important tasks and make your eyes more comfortable while looking at your screen.   Focus is a perfect fit for macOS […]"},{"link":"https://nmac.to/blog/turbocad-pro/","image":"https://nmac.to/wp-content/uploads/2017/12/TurboCAD11.png","title":"TurboCAD Pro 12.0.0 – 2D/3D realistic rendering precision drawing solution","content":"TurboCAD Mac Pro delivers unparalleled value and productivity in a professional 2D/3D CAD package. Fully integrated 2D drafting tools, 3D surface and ACIS solid modeling tools, assembly tools, advanced architectural tools, and powerful LightWorks photorealistic rendering are accompanied by thousands of symbols, materials, decals, and more.   Professional Control and Flexibility Customizable toolbars, set-up wizard, […]"},{"link":"https://nmac.to/blog/widsmob-portrait/","image":"https://nmac.to/wp-content/uploads/2018/02/WidsMob_Portrait_2.png","title":"WidsMob Portrait 4.10 – Portrait image retouch and photo makeup adjustments","content":"WidsMob Portrait detects and beautifies a portrait image. It has controls for face, eye, cheek, noise, teeth, shine, skin and other makeup aspects. This portrait retouching software also provides one-click options for blemishes and pouch removal. It has a management system to improve skin texture. Besides smoothing and wrinkle removal, WidsMob Portrait also enables people […]"},{"link":"https://nmac.to/blog/rsync-server/","image":"https://nmac.to/wp-content/uploads/2021/03/Rsync-Server.png","title":"Rsync Server Basic Edition 2018.08.12 – Enable rsync service","content":"Rsync Server – Basic Edition helps you enable rsync service on your Mac.   Features Share any folder Connect to the shared folder using the native rsync protocol on port 8873 Includes rsync 3.1.2   Version 2018.08.12: A custom port number can now be specified   Intel, 64-bit processor OS X 10.8 or later   […]"},{"link":"https://nmac.to/blog/watermark%e2%80%aa/","image":"https://nmac.to/wp-content/uploads/2021/03/WaterMark_.png","title":"WaterMark‪+ 3.00 – Watermark all your pictures automatically","content":"If you ever plan on displaying your pictures on a web site, even if you use a script to prevent people from right clicking and saving, search engines like Google will harvest them, and offer them for free lunch on images.google.com. You must protect them by applying a watermark that very precisely asserts your intellectual […]"}]