[{"link":"https://nmac.to/blog/notelist/","image":"https://nmac.to/wp-content/uploads/2021/03/NoteList_4.png","title":"NoteList 4.3.2 – Save notes in multiple formats","content":"NoteList allows you to manages notes, in text format or RTF with or without images inside. A NoteList document contains a list of notes in a table and the selected note in details. The user can edit and modify the selected note at any time. Simply and elegant the peculiar use of ‘color categories’ makes […]"},{"link":"https://nmac.to/blog/power-menu/","image":"https://nmac.to/wp-content/uploads/2021/06/Power_Menu_.png","title":"Power Menu 1.0.12 – Enhancing Finder extension for Mac","content":"Power Menu is a highly configurable Finder extension that adds powerful actions to the right click menu and toolbar within Finder – this makes it quick and easy to do things such as move and copy files, convert images, create new documents and much more. The app comes bundled with several useful preset actions (see […]"},{"link":"https://nmac.to/blog/statsbar/","image":"https://nmac.to/wp-content/uploads/2017/06/StatsBar2.png","title":"StatsBar 2.9 – Monitor system processes from the menu bar","content":"StatsBar gives you a comprehensive and detailed analysis of the following areas of your Mac: CPU usage Memory usage Disk usage Network and bandwidth usage Battery power and health (MacBooks only)   Monitoring these stats allows you to easily keep a check on your Mac’s health and performance.   Additional features: Memory Clean feature to […]"},{"link":"https://nmac.to/blog/usb-block/","image":"https://nmac.to/wp-content/uploads/2021/06/USB-Block.png","title":"USB Block 2.6 – Prevent data leakage","content":"USB Block is a data leakage prevention tool which can: Authorize USB devices and prevent any unauthorized access to your Mac computer. Password protect USB authorization (Without password, non-trusted USB devices will be automatically blocked when they are inserted) Disable USB storage. Add trusted USB devices to the white-list. Block network access(WLAN). Block Bluetooth access. […]"},{"link":"https://nmac.to/blog/loop-mash-up/","image":"https://nmac.to/wp-content/uploads/2018/11/Loop-Mash-Up.png","title":"Loop Mash Up 1.2.2 – Professional music with Loop Mash Up","content":"Make professional music with Loop Mash Up. This app is a powerful sampler with plenty of loops and presets.    All samples were created by professional musicians and DJs. Enjoy creating powerful beats by simply tapping the pads and get the instant result!   VARIOUS ELECTRONIC MUSIC STYLES Choose between 6 most popular genres of […]"},{"link":"https://nmac.to/blog/tempomate/","image":"https://nmac.to/wp-content/uploads/2020/05/Tempomate_4.png","title":"Tempomate 4.5 – Clever and beautiful metronome","content":"Tempomate is clever and beautiful metronome.   Features Tempos from 20 to 360 bpm Tap tempo; during taps, the beats syncronise to your input Change tempo by 1 or 5 bpm at a time Click light can be turned on and off Mouse and keyboard input options Keyboard Shortcuts Space: Play / Stop Up, Down: […]"},{"link":"https://nmac.to/blog/webvideohunter/","image":"https://nmac.to/wp-content/uploads/2017/04/WebVideoHunter.png","title":"WebVideoHunter 6.3.1 – Download and convert YouTube videos","content":"WebVideoHunter (formerly known as YouTubeHunter) is a versatile OS X application that allows you to download videos from popular sites such as Vimeo, YouTube or Dailymotion.   Furthermore, with the help of the WebVideoHunter utility you will be able to search for videos, play them, and download them in any quality format.   The Full and Pro […]"},{"link":"https://nmac.to/blog/pikka/","image":"https://nmac.to/wp-content/uploads/2017/05/Pikka1-1.png","title":"Pikka 2.2.0 – Color picker for developers and designers","content":"Pikka is a easy to use color picker for developers and designers.   Just pick a color from screen and it will be copied in your preferred format immediately.   Color Folders Share colors between different folders to easily organize color palettes. Drag & Drop colors between folders. Copy color from library with double click. […]"},{"link":"https://nmac.to/blog/mailbox-for-zoho/","image":"https://nmac.to/wp-content/uploads/2021/06/Mailbox-for-Zoho.png","title":"Mailbox for Zoho 1.0.2 – Multi-Account Zoho client for Mac","content":"Mailbox for Zoho Multi-Account Zoho client for Mac. Welcome to your new mailbox.   Main Features Multiple accounts supported, simultaneously. Access all your Zoho apps from Mailbox. Free accounts supported (no IMAP needed). Works with custom domains. Works with two factor authentication (2FA).   Version 1.0.2: Release notes were unavailable when this listing was updated. […]"},{"link":"https://nmac.to/blog/painnt/","image":"https://nmac.to/wp-content/uploads/2021/06/Painnt.png","title":"Painnt 1.41 – Photo editor with 2000+ filters","content":"Painnt is the ultimate photo editor. Turn your photos into art masterpieces, or awesome cartoon photos. If you like digital art, you’ll love Painnt!   Choose from our selection of 2000+ filters, ranging from classical art (with Van Gogh or Picasso styles) that you’ll want to frame and hang, to cartoon sketches that belong right […]"}]