[{"link":"https://nmac.to/blog/basingstoke/","image":"https://nmac.to/wp-content/uploads/2018/05/Basingstoke1.png","title":"Basingstoke 1.0 – Stealth and arcade action game","content":"Basingstoke is a tense roguelike that mixes stealth and arcade action. Explore the smouldering ruins of apocalyptic Basingstoke, UK, a   Scavenge and Craft Loot and craft as you explore. Lob a tasty sausage roll as a diversion, or poison a kebab for bait. Sneak up and knock a monster out with a whack from […]"},{"link":"https://nmac.to/blog/dead-secret-circle/","image":"https://nmac.to/wp-content/uploads/2018/05/Dead-Secret-Circle.png","title":"Dead Secret Circle 1.0 – First-Person Mystery Horror & Adventure Game","content":"DEAD SECRET CIRCLE is designed by hardcore fans of classic horror games. If you like exploring creepy places, discovering a complex story, solving weird puzzles, and running for your life from a straight-razor-wielding serial killer with a sinister laugh, DEAD SECRET CIRCLE is for you.   DEAD SECRET CIRCLE is a horror mystery game set […]"},{"link":"https://nmac.to/blog/hitman-game-of-the-year-edition/","image":"https://nmac.to/wp-content/uploads/2018/05/HITMAN.png","title":"HITMAN Game of The Year Edition 1.13.2 – Third Person Stealth-Assassin Game","content":"Experiment and have fun in the ultimate playground as Agent 47 to become the master assassin. Travel around the globe to exotic locations and eliminate your targets with everything from a katana or a sniper rifle to an exploding golf ball or some expired spaghetti sauce.   The HITMAN – Game of The Year Edition […]"},{"link":"https://nmac.to/blog/bioshock-remastered/","image":"https://nmac.to/wp-content/uploads/2018/05/BioShock.Remastered.png","title":"BioShock Remastered 1.0 – Story Rich Action & Horror Game","content":"BioShock is a shooter unlike any you’ve ever played, loaded with weapons and tactics never seen. You’ll have a complete arsenal at your disposal from simple revolvers to grenade launchers and chemical throwers, but you’ll also be forced to genetically modify your DNA to create an even more deadly weapon: you.   Features: Museum of […]"},{"link":"https://nmac.to/blog/dirt-rally/","image":"https://nmac.to/wp-content/uploads/2018/05/DiRT.Rally_.png","title":"DiRT Rally 1.1.2 – The champion rally series","content":"DiRT Rally is the most authentic and thrilling rally game ever made, road-tested over 80 million miles by the DiRT community. It perfectly captures that white knuckle feeling of racing on the edge as you hurtle along dangerous roads at breakneck speed, knowing that one crash could irreparably harm your stage time.    DiRT Rally […]"},{"link":"https://nmac.to/blog/wondershare-filmora-scrn/","image":"https://nmac.to/wp-content/uploads/2017/12/Wondershare-Filmora-Scrn.png","title":"Wondershare Filmora Scrn 2.0.1 – Screen recording made simple","content":"Powerful features for high quality screen recordings   Features   Changeable Cursor Adjust the size, shape and color of your cursor to make it stand out.   Full Editing Suite Edit your clips quickly and easily with a wide range of professional tools.   2 Devices Record from your computer and webcam simultaneously.   Import […]"},{"link":"https://nmac.to/blog/tw-warhammer/","image":"https://nmac.to/wp-content/uploads/2018/05/Total.War_.WARHAMMER.png","title":"Total War: WARHAMMER 1.6.0 – Addictive turn-based & empire-building game","content":"The Old World echoes to the clamour of ceaseless battle. The only constant is WAR!   A fantasy strategy game of legendary proportions, Total War: WARHAMMER combines an addictive turn-based campaign of epic empire-building with explosive, colossal, real-time battles. All set in the vivid and incredible world of Warhammer Fantasy Battles.    Command five wholly […]"},{"link":"https://nmac.to/blog/megaseg/","image":"https://nmac.to/wp-content/uploads/2012/12/MegaSeg6.png","title":"MegaSeg 6.0.6 – Professional MP3 DJ application","content":"MegaSeg is a complete solution for pro audio/video DJ mixing, radio automation, and music scheduling with rock-solid performance and an easy-to-use design. Mix with visual waveforms and Magic Trackpad cue and sync. Preview tracks with optional audio outputs and MIDI control. Enjoy fast access and elegant management of your iTunes library, including iTunes Match. Segue […]"},{"link":"https://nmac.to/blog/wondershare-safeeraser/","image":"https://nmac.to/wp-content/uploads/2015/12/Wondershare-SafeEraser3.png","title":"Wondershare SafeEraser 3.8.1 – Permanent Erasure of Your iDevice’s Data","content":"For many reasons, you will need to delete all data on your iPhone/iPad/iPod Touch permanently. Perhaps you now want to switch to a new phone and trade in your old iPhone on market, thus you need to delete all data on your device to protect personal information. However, you should know that these deleted files […]"},{"link":"https://nmac.to/blog/wondershare-data-recovery/","image":"https://nmac.to/wp-content/uploads/2017/02/Wondershare-Data-Recovery6.png","title":"Wondershare Data Recovery 6.2.2 – Comprehensive data recovery suite","content":"Wondershare Data Recovery is a comprehensive data recovery suite to recover Mac data lost due to accidental deleting, formatting, virus infection, improper operation, unexpected power failure, and other unknown reasons.   It can recover Mac data from lost, deleted, logical corrupted and formatted Mac hard drive, iPod, USB drive, SD card, digital camera, mobile phone, […]"}]