[{"link":"https://nmac.to/blog/xnsketch-v1-12/","image":"https://nmac.to/wp-content/uploads/2013/12/xnsketch.175x175-75.png","title":"XnSketch v1.12 – Turn your photos into cartoon or sketch","content":"With XnView Sketch you can easily turn your photos into cartoon or sketch images. Features: – 18 different effects (black strokes, white strokes, pastel,  colored sketch, …) – Edge strength, and opacity adjustement – Contrast, brightness, saturation adjustement – Save or share the result  WHAT’S NEW Version 1.12: Facebook sharing Minor bugs fixed REQUIREMENTS OS […]"},{"link":"https://nmac.to/blog/macfonts-techfonts-v1-1/","image":"https://nmac.to/wp-content/uploads/2013/12/Font_Installer.175x175-751.png","title":"MacFonts-TechFonts 1.1 – MacFonts Tech Collection","content":"A premier collection of 10 futuristic and digital style fonts, including a personal AND commercial use license for a single user so you can use the fonts in any home, business or for-profit project. All fonts are available in OpenType format and work in all applications including Quark, Illustrator, Photoshop, Microsoft Office, iLife, iWork, Pixelmator […]"},{"link":"https://nmac.to/blog/macfonts-spooky-fonts-v1-2/","image":"https://nmac.to/wp-content/uploads/2013/12/Font_Installer.175x175-752.png","title":"MacFonts-Spooky Fonts 1.2 – MacFonts Spooky Collection","content":"A holiday collection of 10 fonts perfect for Halloween, Christmas, and other seasons of celebration, including a personal AND commercial use license for a single user so you can use the fonts in any home, business or for-profit project. All fonts are available in OpenType format and work in all applications including Quark, Illustrator, Photoshop, […]"},{"link":"https://nmac.to/blog/macfonts-handwritingfonts-v1-1/","image":"https://nmac.to/wp-content/uploads/2013/12/Font_Installer.175x175-753.png","title":"MacFonts-HandwritingFonts 1.1 – MacFonts Handwriting Collection","content":"A collection of 10 fonts in handwritten style that look naturally drawn, including a personal AND commercial use license for a single user so you can use the fonts in any home, business or for-profit project. All fonts are available in OpenType format and work in all applications including Quark, Illustrator, Photoshop, Microsoft Office, iLife, […]"},{"link":"https://nmac.to/blog/handy-clock-v1-4/","image":"https://nmac.to/wp-content/uploads/2013/12/New_Icon.175x175-75.png","title":"Handy Clock v1.4 – Mac’s desktop clock that is both beautiful and practical","content":"Handy Clock presents 6 beautiful designs to choose from depending on your taste and preference. Stick with one design or try a new one for a change! – 3 instrument clocks, all in different shades – 1 modern clock– 2 chronograph clocks+ Quartz movement+ Shows on ALL desktops + 100m Waterproof (just kidding!) + Chrono […]"},{"link":"https://nmac.to/blog/face4pass-v1-2/","image":"https://nmac.to/wp-content/uploads/2013/12/Face4Pass.175x175-751.png","title":"Face4Pass v1.2 – Create photos for your documents","content":"Face4Pass is an application that allows you to easily create photos for your documents (i.e passport). Drag and drop or open an existing file.On loading, the image quality is automatically improved. Take a photo with the built-in iSight camera.Edit many parameters of the image (exposure, contrast, saturation, temperature, tint, sharpness).For optimum sizing of the photo, […]"},{"link":"https://nmac.to/blog/apimac-notepad-v9-9-5/","image":"https://nmac.to/wp-content/uploads/2013/12/NotepadApp.175x175-75.png","title":"Apimac Notepad v9.9.5 – Store text by categories","content":"Apimac Notepad helps you organize any piece of text you may want to be at hand.  Mac Notepad is designed from the ground up to support the latest Apple technologies and provides everything you need to be more productive in your work with your Mac. Mac Notepad lets you save and organize any piece of […]"},{"link":"https://nmac.to/blog/screentaker-v1-2-3/","image":"https://nmac.to/wp-content/uploads/2013/12/Icon.175x175-759.png","title":"Screentaker v1.2.3 – Snap iOS screenshots","content":"Screentaker is a small utility that makes creating nice screenshots for iOS apps easier by letting you apply effects to them. Simply drop the screenshot on Screentaker or even capture a screenshot from the iOS Simulator and choose the desired device, orientation and effect. The app is smart enough to detect the device and orientation automatically. […]"},{"link":"https://nmac.to/blog/push-to-talk-v1-2/","image":"https://nmac.to/wp-content/uploads/2013/05/Push-to-Talk.png","title":"Push To Talk 1.2 – Keep your voice chats worry-free","content":"Push to Talk is a slick and unobtrusive menu bar app that makes voice chats worry-free and keeps the flow of conversation clear. Simply press down the user-configurable hotkey when you want to activate your microphone, and then release when you want the microphone to be muted again.   The aim of this app is […]"},{"link":"https://nmac.to/blog/pin-pro-for-pinterest-v1-2/","image":"https://nmac.to/wp-content/uploads/2013/12/APPL-PRO.175x175-751.png","title":"Pin Pro for Pinterest 1.2 – Browse Pinterest from your menu bar","content":"Pin Pro takes your Pinterest addiction to a whole new level. It is the best app for instantly browsing and uploading to your Pinterest account without ever having to open your web browser! Browse through the latest pinned images from your friends and the wider Pinterest community. With Pin Pro, you can also upload images to […]"}]