[{"link":"https://nmac.to/blog/the-henry-stickmin-collection/","image":"https://nmac.to/wp-content/uploads/2020/08/The-Henry-Stickmin-Collection.png","title":"The Henry Stickmin Collection 0.1 – Funny Classic 2D Game","content":"The Henry Stickmin Collection is a Newgrounds choose-your-own-path classic, reborn and revitalized. This 6-game epic culminates in multiple entirely canon, extremely different endings. Each step of the journey has you choose from options such as a Teleporter or calling in your buddy Charles to help you out. Correct choices will move the story forward, but […]"},{"link":"https://nmac.to/blog/copied/","image":"https://nmac.to/wp-content/uploads/2017/12/Copied4.png","title":"Copied 4.0.1 – Copy and Paste Everywhere","content":"Copied is a full featured clipboard manager. Save text, links, and images that you’ve copied to your clipboard from any app. Quickly access your saved clippings from the menubar and copy them back to your clipboard in its original format or in a variety of different formats using templates.   Create lists and organize your […]"},{"link":"https://nmac.to/blog/avorion/","image":"https://nmac.to/wp-content/uploads/2020/08/Avorion.png","title":"Avorion 1.1.4 – Open World Sci-fi Space Game","content":"Several hundred years ago, a cataclysmic catastrophe nearly ripped your galaxy apart – an impassable ring of torn hyperspace fabric appeared in the center of the galaxy, which normal hyperspace engines can’t overcome.   Since this Event nobody has managed to get near the central regions of the galaxy. All you know is that the […]"},{"link":"https://nmac.to/blog/flashing-lights/","image":"https://nmac.to/wp-content/uploads/2020/08/Flashing.Lights.png","title":"Flashing Lights 06.08.2020 – Police, Firefighting, Emergency Services Simulator","content":"Enrol with the police, emergency medical services or fire department and take on missions unique to each service in an open world. Engage in desperate car chases, diagnose life-threatening injuries, and put out lethal fires! Each department has its own vehicles and equipment for you to operate while on duty. Play in single player, or […]"},{"link":"https://nmac.to/blog/cities-skylines/","image":"https://nmac.to/wp-content/uploads/2015/03/Cities.Skylines.png","title":"Cities: Skylines Include All DLCs 1.13.1f1 – Modern city simulation game","content":"Cities: Skylines is a modern take on the classic city simulation. The game introduces new game play elements to realize the thrill and hardships of creating and maintaining a real city whilst expanding on some well-established tropes of the city building experience.   From the makers of the Cities in Motion franchise, the game boasts […]"},{"link":"https://nmac.to/blog/driftland-the-magic-revival/","image":"https://nmac.to/wp-content/uploads/2019/11/Driftland.png","title":"Driftland The Magic Revival 24.07.2020 – Strategy & Simulation Game","content":"After a devastating war between ancient mages, a powerful spell is all that holds together the shattered planet of Driftland. Faced with the destruction of their entire civilization and life on the planet, the warring factions called a truce and tried to repair the damage – but it was already too late. By using all […]"},{"link":"https://nmac.to/blog/overcooked-2/","image":"https://nmac.to/wp-content/uploads/2019/03/Overcooked-2.png","title":"Overcooked! 2 Suns Out Buns Out – Casual Co-Op Cooking Action Game","content":"Overcooked returns with a brand-new helping of chaotic cooking action! Journey back to the Onion Kingdom and assemble your team of chefs in classic couch co-op or online play for up to four players. Hold onto your aprons … it’s time to save the world (again!)   Out of the frying pan, into the fire… […]"},{"link":"https://nmac.to/blog/machiavillain/","image":"https://nmac.to/wp-content/uploads/2020/08/MachiaVillain.png","title":"MachiaVillain 2.60 – An evil mansion management and strategy game","content":"Welcome to Villain City, a luxury community entrenched in the hills of horror. Ax murderers, mad scientists and tax evaders, all kinds of bad guys consider this place to be their sweet home. This is the perfect place to rest, relax, and pursue a career in the noblest of professions: professional Villain!!   The real […]"},{"link":"https://nmac.to/blog/twixl-publisher/","image":"https://nmac.to/wp-content/uploads/2019/11/Twixl-Publisher10.png","title":"Twixl Publisher 11.6 – Create iOS, Android, and Kindle Fire apps from Adobe InDesign","content":"Twixl Publisher lets you easily create iOS and/or Android apps (for both tablets and phones), based on Adobe InDesign content. You can publish in Apple’s App Store, Google Play, or the Kindle Fire Appstore. You can also export a “Web Reader” version of your content for displaying a publication is a standard desktop or notebook […]"},{"link":"https://nmac.to/blog/mutazione/","image":"https://nmac.to/wp-content/uploads/2020/08/Mutazione.png","title":"Mutazione 1.7 – Story Rich Adventure Game","content":"MUTAZIONE is an adventure game where the juicy personal drama is just as important as the high-stakes adventure part of the story.   Explore the community as 15-year-old Kai as she travels to the strange and secretive community of Mutazione to care for her ailing grandfather, Nonno.    Make new friends; plant musical gardens; attend […]"}]