[{"link":"https://nmac.to/blog/massive-chalice/","image":"https://nmac.to/wp-content/uploads/2019/02/Massive-Chalice.png","title":"Massive Chalice 2.1.0.2 – Turn-Based Strategy & Tactical Game","content":"MASSIVE CHALICE is a tactical strategy game set on an epic timeline from Double Fine Productions. As the Immortal Ruler of the Nation, you’ll take command of its heroes, forge marriages to strengthen your Bloodlines, and battle a mysterious enemy known as the Cadence in a war lasting hundreds of years.   Key Features Bloodline […]"},{"link":"https://nmac.to/blog/ash-of-gods/","image":"https://nmac.to/wp-content/uploads/2018/04/Ash-of-Gods.png","title":"Ash of Gods: Redemption 1.4.38 – A turn-based RPG, Strategy & Adventure Game","content":"Ash of Gods: Redemption is a turn-based RPG that combines tactical combat, CCG elements, and a constantly evolving story in which no one is safe from death, including the main characters.   GAMEPLAY Ash of Gods is the story of three separate protagonists rising in response to a centuries-old menace once thought to be mere […]"},{"link":"https://nmac.to/blog/enclave/","image":"https://nmac.to/wp-content/uploads/2019/02/Enclave.png","title":"Enclave 2.1.0.12 – Fantasy, RPG, Adventure & Action Game","content":"Experience incredibly atmospheric and intense medieval combat action!  Go ahead and enter a new world, the award-winning world of ENCLAVE!   The people of Light and Darkness are divided by a bottomless rift that split the earth many millennia ago. The lands of light are an Enclave of truth and order surrounded by the twisted […]"},{"link":"https://nmac.to/blog/regalia/","image":"https://nmac.to/wp-content/uploads/2018/02/Regalia-Royal-Edition.png","title":"Regalia: Royal Edition 1.2 – A Tactical Turn-Based RPG & Simulation Game","content":"Regalia: Of Men And Monarchs is an RPG full of challenging combat and exciting adventures. Create your party of distinct individuals and get to work! There’s a lot to be done if you are to rebuild your kingdom.   Enjoy the beautiful hand-drawn graphics, lose yourself in the original orchestral soundtrack composed by Game Audio […]"},{"link":"https://nmac.to/blog/rocket-league/","image":"https://nmac.to/wp-content/uploads/2019/02/Rocket-League.png","title":"Rocket League 1.0 – Multiplayer Racing & Soccer Game","content":"Soccer meets driving once again in the long-awaited, physics-based sequel to the beloved arena classic, Supersonic Acrobatic Rocket-Powered Battle-Cars!   A futuristic Sports-Action game, Rocket League, equips players with booster-rigged vehicles that can be crashed into balls for incredible goals or epic saves across multiple, highly-detailed arenas. Using an advanced physics system to simulate realistic […]"},{"link":"https://nmac.to/blog/joyoshare-ipasscode-unlocker/","image":"https://nmac.to/wp-content/uploads/2019/01/Joyoshare-iPasscode-Unlocker.png","title":"Joyoshare iPasscode Unlocker 1.1.2 – Easily remove iPhone/iPad/iPod touch lock screens","content":"As one of the fastest iDevice screen passcode unlockers, Joyoshare iPasscode Unlocker for Mac is aimed at removing screen lock without password from iPhone, iPad to iPod touch on Mac in a couple of clicks only. Whether your iPhone is locked due to forgotten password or broken screen, etc, this smart iPhone passcode unlocker can […]"},{"link":"https://nmac.to/blog/joyoshare-screen-recorder/","image":"https://nmac.to/wp-content/uploads/2018/03/Joyoshare-Screen-Recorder.png","title":"Joyoshare Screen Recorder 2.0.0.22 – Easy-to-use screen capture tool","content":"Joyoshare Screen Recorder is an all-in-one and easy-to-use screen capture. Joyoshare Screen Recorder can not only record all screen videos and audios, but also save the recordings as popular formats, such as MP4, MPG, MOV, MKV, AVI, FLV, WMV, MP3, OGG, AAC, WAV, and more with lossless quality preserved. It’s a perfect video solution to […]"},{"link":"https://nmac.to/blog/flawless/","image":"https://nmac.to/wp-content/uploads/2018/06/FlawlessApp.png","title":"Flawless 0.9.8 – Make your iOS apps look exactly like the expected design","content":"Flawless allows you to make your iOS apps look exactly like the expected design. With real-time comparison of expected and implemented design that is all built into an iOS simulator. We made Flawless for those, who are obsessed with quality of mobile apps.   Version 0.9.8: Improved: Stability of Sketch files selection and parsing process. […]"},{"link":"https://nmac.to/blog/tuneskit-iphone-data-recovery/","image":"https://nmac.to/wp-content/uploads/2018/09/TunesKit-iPhone-Data-Recovery.png","title":"TunesKit iPhone Data Recovery 2.2.0.25 – Recover lost data on iOS devices","content":"Lost data on iPhone, iPad or iPod? Take it easy! TunesKit iPhone Data Recovery for Mac is here to rescue you from any iOS data disaster by completely and quickly recovering more than 20 types of lost and deleted data including photos, videos, contacts, WhatsApp, Viber, notes, etc. on iPhone/iPad/iPod touch through iOS devices directly, […]"},{"link":"https://nmac.to/blog/feudal-alloy/","image":"https://nmac.to/wp-content/uploads/2019/01/Feudal-Alloy.png","title":"Feudal Alloy 1.02 – An epic action adventure game","content":"Attu is an ordinary farmer robot who lives in a small cottage in sunflower fields. He had been living a simple but pleasant life until a bunch of outlaws attacked the village, stole their oil supplies and burnt his house.   Fortunately, he managed to grab his old sword and fled into the woods.   […]"}]