[{"link":"https://nmac.to/blog/connect-2-0/","image":"https://nmac.to/wp-content/uploads/2014/03/Connect2.png","title":"Connect 2.0 – Phone calls using Bluetooth connection","content":"Connect App lets you make and receive phone calls from your Mac using a Bluetooth hands-free connection to your phone. You can access Connect through the OS X menu bar. Connect works with any modern smartphone and has the following great features: Type a name or number in the search bar and you will see […]"},{"link":"https://nmac.to/blog/cactus-1-1-6/","image":"https://nmac.to/wp-content/uploads/2014/03/Cactus.png","title":"Cactus 1.1.6 – Static site generator that builds websites locally","content":"Cactus is a static site generator. A static site generator allows you to build websites locally, using modern web technologies, and have the results generated to a collection of flat files. This is useful because setting up a server environment with Django or Ruby can be difficult and expensive. A static site generator lets you […]"},{"link":"https://nmac.to/blog/base-2-4-8/","image":"https://nmac.to/wp-content/uploads/2014/03/Base.png","title":"Base 2.4.8 – Create, design, edit and browse SQLite 3 database files","content":"Base is an application for creating, designing, editing, and browsing SQLite 3 database files. It’s a proper OS X application. Fast to launch, quick to get in to and get the data you need.   Base starts with all the basic features you need: Schema viewing Table contents viewing/editing Custom SQL queries Command logging   […]"},{"link":"https://nmac.to/blog/texts-0-18-5/","image":"https://nmac.to/wp-content/uploads/2014/03/Texts.png","title":"Texts 0.18.5 – Markdown word processor","content":"Texts enables you to write well-structured documents. Store as plain text with Markdown markup. Publish in PDF, HTML, Word, ePUB, and other formats from single source.   Version 0.18.5: Save tables in “pipe” format in GitHub and MMD Markdown flavors. Export non-breaking space as HTML entity in HTML format. Paste image files copied from Finder […]"},{"link":"https://nmac.to/blog/mythoughts-1-4/","image":"https://nmac.to/wp-content/uploads/2014/03/MyThoughts.png","title":"MyThoughts 1.4 – Create organized, intuitive mind maps","content":"MyThoughts introduces a new level of freedom in the use of Mind Mapping Software, allowing you to create Unique, Meaningful, Brain Friendly Mind Maps. With over 3000 images to illustrate your Mind Maps, MyThoughts for Mac also has iPhoto seamlessly integrated into the Media Browser giving direct drag and drop access to your photographs. Plus, […]"},{"link":"https://nmac.to/blog/data-rescue-3-2-3/","image":"https://nmac.to/wp-content/uploads/2014/03/Data.Rescue.png","title":"Data Rescue 3.2.3 – Recover lost data on drives","content":"Data Rescue is a robust and reliable hard-drive recovery solution for your Mac. Recover lost or deleted files, mount corrupted drives, and more — Data Rescue offers complete relief from crippling hard-drive disasters!   Feature-rich Recovery Recover hundreds of file types. Preview recoverable files. Clone drives ahead of physical failure. Reach out to free pre- […]"},{"link":"https://nmac.to/blog/spotlife-1-0-9/","image":"https://nmac.to/wp-content/uploads/2014/03/Spotlife.png","title":"Spotlife 1.0.9 – Desktop-based calendar viewer","content":"Spotlife is the fastest, easiest way to view the important happenings in your life.    Spotlife puts your calendar directly on your desktop, so it’s always available to you. Press a keyboard shortcut at any time from any application, and the Desktop Calendar will zoom forward above all other windows — now you’ll truly be […]"},{"link":"https://nmac.to/blog/ringer-2-0-3/","image":"https://nmac.to/wp-content/uploads/2014/01/Ringer.png","title":"Ringer 2.0.3 – Create iPhone ringtones","content":"Ringer allows you to create iPhone ringtones.    Choose any non-protected file from your iTunes library or any media file on your system and turn it into a custom ringtone for your iPhone. Make as many as you want, there is no limit to the number of ringtones you can make with Ringer.   Easily […]"},{"link":"https://nmac.to/blog/1000-opentype-font-collection-2-0/","image":"https://nmac.to/wp-content/uploads/2014/03/1000.OpenType.Fonts_.png","title":"1000 OpenType Font Collection 2.0 – Collection of stylish fonts for commercial use","content":"1000 Opentype Fonts Collection helps you get creative. The font collection includes 238 unique font family styles, with 1000 total fonts. An excellent addition to any font collector’s library for use in graphic and logo design, web design, scrapbooks, presentations, invitations, promotional material, advertisements, and more.   Each font is in OpenType font format and […]"},{"link":"https://nmac.to/blog/instatab-pro-for-instagram-1-03/","image":"https://nmac.to/wp-content/uploads/2014/01/InstaTab-Pro-for-Instagram.png","title":"InstaTab Pro for Instagram 1.03 – Access Instagram directly from your mac desktop","content":"InstaTab Pro for Instagram is new way to access your Instagram. Doesn’t have enough space for a menubar app? Not a problem. We introduce InstaTab Pro that will stick on edges of your screen.   InstaTab Pro for Instagram with these Charming features:   Access your Instagram with “1 click” from your menubar，red camera icon […]"}]