[{"link":"https://nmac.to/blog/the-flame-in-the-flood/","image":"https://nmac.to/wp-content/uploads/2016/03/The.Flame_.in_.the_.Flood_.png","title":"The Flame in the Flood 1.3.002 – Adventure & Survival Game","content":"A rogue-lite river journey through the backwaters of a forgotten post-societal America. Forage, craft, evade predators.   From the Art Director of BioShock and a team of veterans of the BioShock, Halo, Guitar Hero and Rock Band series comes The Flame in the Flood.   Travel by foot and by raft down a procedurally-generated river […]"},{"link":"https://nmac.to/blog/endless-legend/","image":"https://nmac.to/wp-content/uploads/2016/10/Endless-Legend1.png","title":"Endless Legend – Symbiosis 1.7.2 – Strategy, indie & RPG game","content":"While much is known of the surface of Auriga, its oceans still guard many mysteries. Weathered fortresses, certainly creations of another age, still house a secretive people called the Fomorians who serve some ancient purpose. But while the nations of Auriga learn to meet, trade, and war on the seas, another force rises from beneath […]"},{"link":"https://nmac.to/blog/umark/","image":"https://nmac.to/wp-content/uploads/2019/01/uMark.png","title":"uMark 6.1 – Watermarking for digital photos","content":"uMark helps you protect your digital photos. uMark is a powerful batch watermarking software. It enables you to add visible watermarks to your images. You can add your name, logo, copyright info as watermarks. You can customize the placement of your watermark, set a custom font, color and transparency. You can also rotate and tile […]"},{"link":"https://nmac.to/blog/bundle-for-ms-office-by-gn/","image":"https://nmac.to/wp-content/uploads/2017/12/Bundle-for-MS-Office-by-GN.png","title":"Bundle for MS Office by GN 7.0.3 – Templates for MS Office","content":"Bundle for MS Office by GN (was Templates Bundle for MS Office, then was Bundle for MS Office, then was Office Studio, then was GN Bundle for MS Office) is the ultimate helping hand for users of MS Office. It provides you with original designs for Word documents, professional template lines for MS Word, spreadsheet […]"},{"link":"https://nmac.to/blog/forecast-bar/","image":"https://nmac.to/wp-content/uploads/2017/09/Forecast-Bar3.png","title":"Forecast Bar 5.2.2 – Accurate, local live weather and forecasts","content":"Forecast Bar offers hyper accurate, hyper local live weather and forecasts right in your menu bar. With beautiful background images matching current weather conditions and time of day along with a simple and clean interface you will find yourself checking the weather non-stop!   Tapping on Forecast Bar opens up a gorgeous panel full of […]"},{"link":"https://nmac.to/blog/aeon-timeline/","image":"https://nmac.to/wp-content/uploads/2016/04/Aeon-Timeline2.png","title":"Aeon Timeline 2.3.16 – Timeline tool stimulates creative thinking","content":"Aeon Timeline is the timeline tool for creative thinking.   Most traditional timeline applications are designed to suit a single need: to create an attractive display of one- dimensional time. They are presentational, static, and perfectly suited to overhead slides and projectors.   Aeon Timeline aims to be different. Model relationships between people and events. […]"},{"link":"https://nmac.to/blog/divx/","image":"https://nmac.to/wp-content/uploads/2017/07/DivX-Pro10.png","title":"DivX Pro 10.8.7 – Playback DivX media","content":"DivX Plus Pro introduces the latest codec and enables high quality DivX HEVC video creation and video streaming with existing DivX tools. Based on the newest video compression standard, DivX HEVC strives to deliver up to 50% better compression than its H.264-based predecessor, DivX Plus HD.   DivX 10 is the first software of its […]"},{"link":"https://nmac.to/blog/depthcam-pro/","image":"https://nmac.to/wp-content/uploads/2019/01/DepthCam-Pro.png","title":"DepthCam Pro 1.2 – Take control of your Depth Photos","content":"DepthCam Pro is the perfect app for editing your Portrait Mode photos.    View and edit the depth data embedded in your photos. Cut and paste makes it easy to edit depth data in other apps such as Photoshop. View/Edit Depth Maps View/Edit Portrait Effects Matte (PEM) Smart Crop preserving depth data Facebook 3D Photo […]"},{"link":"https://nmac.to/blog/the-adventure-pals/","image":"https://nmac.to/wp-content/uploads/2019/01/The-Adventure-Pals.png","title":"The Adventure Pals 1.0 – An epic adventure platformer game","content":"The Adventure Pals is an action-packed platformer about friendship, exploration, and riding your giraffe. And, of course, the age-old tale of an evil madman with the nefarious plan of turning old people into delicious hot dogs.   STORY Mr. B is kidnapping old people and turning them into hot dogs! It’s up to you and […]"},{"link":"https://nmac.to/blog/guns-gore-cannoli-2/","image":"https://nmac.to/wp-content/uploads/2015/05/Guns.Gore_.and_.Cannoli.2.png","title":"Guns, Gore and Cannoli 2 1.0.8 – Prepare yourself for a non-stop action fights","content":"Welcome to the 1940’s. Europe is being torn apart by the war, the USA is preparing for battle and the mob does business as usual. Only this time they went too far, even for Vinnie’s standards.   Prepare yourself to go to war after you make a shocking discovery about what actually happened during the […]"}]