[{"link":"https://nmac.to/blog/bus-driver/","image":"https://nmac.to/wp-content/uploads/2013/11/Bus-Driver.png","title":"Bus Driver 1.5.5 – Bus driving simulation game","content":"In Bus Driver, your job is to transport passengers around an attractive and realistic city. You must drive to a timetable on a planned route, whilst obeying traffic rules, and taking care not to upset or injure your passengers. This makes Bus Driver unlike any other driving game – the experience of driving a bus […]"},{"link":"https://nmac.to/blog/jpegmini/","image":"https://nmac.to/wp-content/uploads/2013/12/JPEGmini.175x175-75.jpg","title":"JPEGmini 1.8.2 – Compress JPEGs up to 500% while maintaining the original resolution","content":"JPEGmini is a patent-pending photo recompression technology, which significantly reduces the size of photographs without affecting their perceptual quality. The technology works in the domain of baseline JPEG, resulting in files that are fully compatible with any browser, photo software or device that support the standard JPEG format.   Put your photos on a diet […]"},{"link":"https://nmac.to/blog/pictary/","image":"https://nmac.to/wp-content/uploads/2013/12/AppIcon.175x175-752.png","title":"Pictary 2.1 – Captures your emotions, feelings and look on your mac","content":" Imagine an App that captures your emotions, feelings and look while you’re using your Mac! Pictary will take care of all that! It creates a personal diary but instead words it uses pictures to capture you and others in front of your Mac. Utilizing the built in Camera it takes pictures every time you start, […]"},{"link":"https://nmac.to/blog/scrapbook-2/","image":"https://nmac.to/wp-content/uploads/2013/12/40505.png","title":"Scrapbook 1.3.3 – Copy and store multiple clips","content":"Scrapbook is an innovative Clipboard, which enables you to store more than one item for future use. All of your clip entries will remain even if you restart your Computer. Scrapbook offers the advantage of a discreet and simple interface. Moreover, you can use snippets, predefined tools and self configurable JavaScript filters.   Main-Features: OS […]"},{"link":"https://nmac.to/blog/bee/","image":"https://nmac.to/wp-content/uploads/2013/12/49566.png","title":"Bee 1.0.3 – Better issue tracking on your Mac","content":"Bee syncs with GitHub Issues, JIRA and FogBugz. You can also use Bee to keep track of your plain text notes. Features: Flight Path. Flight Path lives in your menu bar and helps you by intelligently selecting the task you should be working on next. Notifications. Bee uses Notification Center to inform you of new […]"},{"link":"https://nmac.to/blog/diptic/","image":"https://nmac.to/wp-content/uploads/2013/12/Diptic.175x175-75.png","title":"Diptic 2.0.1 – Create unique photo collages","content":"Diptic helps you easily combine multiple photos and apply artistic effects to create exceptional photo collages that can be shared with friends and family. With rounded borders and 56 customizable layouts, there are unlimited options to create unique images! FEATURES: 56 frames! All fully adjustable with one to six photos in each layout Multi-Touch! The […]"},{"link":"https://nmac.to/blog/propervolume/","image":"https://nmac.to/wp-content/uploads/2013/12/pv.175x175-75.png","title":"properVOLUME 1.1.3 – Audio volume input/output control levels","content":"The menubar audio volume app done right; the best-looking, simplest, cleanest, fastest and most functional way to set audio volume input/output levels on the mac. Mavericks ready. SAVE YOUR EARDRUMS Have you ever plugged a USB headset for video chat or SIP phone calls into your mac and had your head about blown off by […]"},{"link":"https://nmac.to/blog/set-for-ms-office/","image":"https://nmac.to/wp-content/uploads/2013/12/msoffice2.png","title":"Set for MS Office 1.0 – Word, PowerPoint, and Excel designs bundle","content":"Set for MS Office is the ultimate bundle of all designs for Word, PowerPoint, and Excel for Mac offered by Jumsoft. It gives numerous options for producing professional and exciting content ranging from striking themes for your slideshows to smart multi-layout templates for brochures and catalogs. Set for MS Office will make your work more […]"},{"link":"https://nmac.to/blog/isonics-2/","image":"https://nmac.to/wp-content/uploads/2013/12/45162.jpg","title":"iSonics 1.5.1 – Convert audio files between formats","content":"iSonics makes it easy to convert any audio format and CDs to all popular audio formats: MP3, MP2, AAC, FLAC, ALAC, WMA, OGG Vorbis, AC3 and WAV.It handles Metadata with ease and even enables you to change Metadata including automatically downloading cover pictures. As a bonus you can import CDs and convert the audio tracks to […]"},{"link":"https://nmac.to/blog/chocolat-2/","image":"https://nmac.to/wp-content/uploads/2013/12/40882.jpg","title":"Chocolat 2.0.3 – Native Cocoa text editor","content":"Chocolat is a new text editor that combines native Cocoa with powerful text editing tools. Features: Split editing Code completion Live errors Folding Symbol list Blockedit Vim mode Jump to definition Project find Go to file Web preview Documentation WHAT’S NEW Version 2.0.3: Fix the codesigning melodrama (10.8 users, consider yourselves fortunate). Important security fix! Tern […]"}]