[{"link":"https://nmac.to/blog/cocoabox-2-0/","image":"https://nmac.to/wp-content/uploads/2014/08/CocoaBox.png","title":"CocoaBox 2.0 – All your Objective-C and redacted snippets on all your Macs","content":"All your Snippets and all your Source Files on all your Macs. Thanks to iCloud.   Life is like a box of code. It is up to you what you do with it.   This is true for CocoaBox as well:   Store unlimited Cocoa/Objective-C/redacted snippets. Thanks to iCloud, use them on all your Macs. […]"},{"link":"https://nmac.to/blog/bills-1-10-1/","image":"https://nmac.to/wp-content/uploads/2013/03/Bills.png","title":"Bills 1.10.1 – Plan and track your expenses every month","content":"Bills is an application that can help you plan and track your expenses every month. Brilliant interface will remind you of a real-life office room (check the screenshots). Clear, simple and quick (a MUST HAVE) financial planning!   You always need a simple tool to control how much you want to spend this month. Essentially […]"},{"link":"https://nmac.to/blog/hourly-news-1-3-5/","image":"https://nmac.to/wp-content/uploads/2014/08/Hourly.News_.png","title":"Hourly News 1.3.5 – Play the most recent news updates from multiple sources with just one tap","content":"Hourly News is a simple app that lives in your Mac’s menu bar and plays the most recent news updates from multiple news podcast sources with one click. As a podcast app, Hourly News lets to you subscribe and listen to any/all of the most recent NPR, BBC, CBC, ABC, CBS, WSJ, Bloomberg, ESPN, VOA, […]"},{"link":"https://nmac.to/blog/youtube-hunter-5-4-4/","image":"https://nmac.to/wp-content/uploads/2014/08/YouTubeHunter.png","title":"YouTube Hunter 5.4.4 – Download and convert YouTube videos","content":"YouTubeHunter is a video downloader and converter.   It takes only seconds to find and download videos from YouTube, Vimeo, DailyMotion, VEVO and others. YouTubeHunter downloads videos 15x faster than real time playing and supports simultaneous downloads. YouTubeHunter has built-in search and preview capabilities. Get video by URL feature is available. YouTubeHunter keeps subtitles for […]"},{"link":"https://nmac.to/blog/wikibot-1-74/","image":"https://nmac.to/wp-content/uploads/2013/03/Wikibot.png","title":"Wikibot 1.74 – A Wikipedia Articles Reader","content":"Wikibot makes reading Wikipedia articles a joy on your Mac. Between the beautifully crafted interface, customizable display options, and killer features like tabbed browsing, language switching, a read-later queue and offline caching, there is a lot to love about Wikibot!   Features: Browse Wikipedia articles in 36 languages! Tabbed browsing allows you to have multiple […]"},{"link":"https://nmac.to/blog/tunespan-1-2/","image":"https://nmac.to/wp-content/uploads/2013/07/TuneSpan.png","title":"TuneSpan 1.2 – Effortless iTunes media library management","content":"TuneSpan allows you to browse and span the media in your iTunes Library.   To span your media means to distribute the files in your iTunes Library across multiple drives.   What does TuneSpan do?  TuneSpan helps you easily move the media files (Music, Movies, etc.) in your iTunes Library to multiple drives, avoiding the […]"},{"link":"https://nmac.to/blog/notebook-4-0-4/","image":"https://nmac.to/wp-content/uploads/2013/07/NoteBook.png","title":"NoteBook 4.0.4 – Electronic notebook for taking notes, managing and organized","content":"NoteBook stores and organizes your notes and other information in electronic notebooks that look and work just like the paper ones you’ve used all your life. With outlining, diagramming, sketching, voice annotation, even PDF mark-up, NoteBook helps you take great notes whatever your note-taking style.   And NoteBook makes it easy to find anything with […]"},{"link":"https://nmac.to/blog/myphotostream-1-0-7/","image":"https://nmac.to/wp-content/uploads/2014/04/MyPhotostream.png","title":"MyPhotostream 1.0.7 – Desktop app for easily viewing Photo Stream","content":"MyPhotostream is a desktop app that allows you to easily view photos in your Photo Stream on iCloud without having to launch iPhoto.   Version 1.0.7: Fix: Fixed a bug on new releases of OS X that prevented the user from selecting photo(s). Fix: Resized the app icon slightly to better fit into the Dock. […]"},{"link":"https://nmac.to/blog/cloud-commander/","image":"https://nmac.to/wp-content/uploads/2014/08/Cloud-Commander3.png","title":"Cloud Commander 3.7.5 – File manager for cloud-based accounts","content":"Cloud Commander provides file transfers and browsing for multiple cloud-based accounts, including Dropbox, Box, SkyDrive, Google Drive, Copy, SugarSync, Picasa, Flickr, WebDAV, and FTP/SFTP/FTPS. It includes drag-and-drop transfers between accounts as well as to and from the Finder, Quick Look previews, and other features. This release adds sortable columns and Finder icons in Detail view, […]"},{"link":"https://nmac.to/blog/solar-walk-2-0-2/","image":"https://nmac.to/wp-content/uploads/2014/08/Solar-Walk.png","title":"Solar Walk 2.0.2 – Astronomer-friendly space exploration tool","content":"Solar Walk is a 3D Solar System model that enables you to navigate through space and time, observe all the planets in close-up, learn their trajectories, inner structure, history of their exploration, points of interest and more. Use 3D mode to get a more realistic experience! And zoom out to view and spin the entire […]"}]