[{"link":"https://nmac.to/blog/epagecreator/","image":"https://nmac.to/wp-content/uploads/2013/06/ePageCreator.png","title":"ePageCreator 5.9.0 – Turn your PDF and image files into digital page","content":"With ePageCreator, you can turn your PDF and image files into digital page flip publications in minutes. You have full control of your flipbooks. You are able to host them on your own website or any other websites. You can also put them on CD/DVD, USB drive and any other offline media for offline reading. […]"},{"link":"https://nmac.to/blog/design-elements/","image":"https://nmac.to/wp-content/uploads/2017/10/Design-Elements-Lab-Template.png","title":"Design Elements 1.2 – Decorative artwork for your documents and presentations","content":"Illustrate your work! Design Elements Lab for Microsoft Office is a comprehensive collection of thousands of high-quality icons, logos, badges, doodles, ribbons, clipart, and other items to liven-up your Microsoft Word documents and Powerpoint presentations on all occasions!   Applying Design Elements Lab for Microsoft Office items to your work is as easy as dragging […]"},{"link":"https://nmac.to/blog/switchem/","image":"https://nmac.to/wp-content/uploads/2018/02/Switchem.png","title":"Switchem 1.1.0 – Application switcher which uses groups of apps","content":"Switchem is a productivity tool for those who value their time and want to automate their workday routine. An entirely innovative approach means always to be ready to resolve any tasks without wasting time doing routine preparations. Applications in groups. Switch between groups in a second.   Simply put, Switchem is an application that allows […]"},{"link":"https://nmac.to/blog/deep-dreamer/","image":"https://nmac.to/wp-content/uploads/2016/05/Deep-Dreamer.png","title":"Deep Dreamer 1.0.251 – Generative art created with Google’s Deepdream engine","content":"Deep Dreamer is the easiest way to process images and video with Google’s amazing Deepdream engine. Give it a photo, and watch as horizons get filled with towers and pagodas. Rocks and trees turn into buildings. Birds, dogs, and insects (AKA puppyslugs) start to appear from out of nowhere.   Deep Dreamer takes your deep […]"},{"link":"https://nmac.to/blog/xmind/","image":"https://nmac.to/wp-content/uploads/2016/07/XMind3.png","title":"XMind 3.7.7 – Popular mind mapping and project management app","content":"    XMind is the most popular mind mapping tool. Millions of people use XMind to clarify thinking, manage complex information, run brainstorming and get work organized. It couldn’t be easier to get started.   A detailed list of features can be found here.   Version 3.7.7: Release notes were unavailable when this listing was […]"},{"link":"https://nmac.to/blog/vicinity/","image":"https://nmac.to/wp-content/uploads/2018/01/Vicinity1.png","title":"Vicinity 1.1.2 – Stay concentrated, focused or relax","content":"Vicinity helps you to stay concentrated, focused, or relaxed. Using selected, handcrafted ambient sounds in high definition, it enhances your environment by creating an authentic acoustic atmosphere. Located in your menu bar, it’s easily and quickly accessible. Although we don’t try to convince you with quantity but with quality, we’ll add additional sounds constantly.   […]"},{"link":"https://nmac.to/blog/pyka/","image":"https://nmac.to/wp-content/uploads/2018/01/Pyká.png","title":"Pyká 1.0.10 – Project library app and the world’s first Work Hub","content":"Pyká is a revolutionary new project library app and the world’s first Work Hub. Designed for people who work in project-based environments, Pyká takes your project library to a whole new level. There are many challenges and problems that arise when individuals or teams work on projects. While many solutions exist to help people manage […]"},{"link":"https://nmac.to/blog/turbofloorplan-3d-pro/","image":"https://nmac.to/wp-content/uploads/2018/02/TurboFloorPlan-3D.png","title":"TurboFloorPlan 3D Pro 2017 19.0.1 – Drag-and-drop home and landscape design","content":"TurboFloorPlan 3D Home & Landscape Pro 2017 is an easy way to design your dream home! Plan all phases of your home from foundation, HVAC, electrical, and plumbing to the walls, windows, doors and custom roof. Visualize a new kitchen, bath, or room addition with custom cabinets, lighting, furniture and appliances. Easily edit to see […]"},{"link":"https://nmac.to/blog/cpu-led/","image":"https://nmac.to/wp-content/uploads/2018/02/CPU-LED.png","title":"CPU LED 1.3 – LED light in your menu bar to indicate CPU activity","content":"CPU LED is for you if you ever wonder how stressed your CPU is? Sometimes, opening a complex activity monitor while your computer is heavily loaded is too late (or too much). Sometimes all you need to know is that your CPU is working hard.   CPU LED is a very lightweight unobtrusive app that […]"},{"link":"https://nmac.to/blog/menubus/","image":"https://nmac.to/wp-content/uploads/2018/02/menuBUS-Pro.png","title":"menuBUS Pro 2.2.07 – Capture all system audio","content":"menuBUS is a lightweight menu bar application designed to capture all system audio, host realtime AudioUnit effects, and pass the processed audio to your choice of output.   Until now applying effects to the system audio has involved the use of multiple apps, audio drivers and aggregate devices, and in the case of paid apps […]"}]