[{"link":"https://nmac.to/blog/snapselect-1-1-0/","image":"https://nmac.to/wp-content/uploads/2015/01/Snapselect.png","title":"Snapselect 1.1.0 – Discover best photos, eliminate duplicates","content":"Snapselect saves you time and helps to manage photos in the new smart way. Easily discover your best images, quickly eliminate similar photos and duplicates, save disk space and make your photo life easier! It works flawlessly with iPhoto, Aperture, Lightroom, any folder and any external drive, including camera SD cards.   Version 1.1.0: UIX […]"},{"link":"https://nmac.to/blog/roadmovie-2-7-3/","image":"https://nmac.to/wp-content/uploads/2014/12/RoadMovie.png","title":"RoadMovie 2.7.3 – Subtitle, batch-encode and upload your movies","content":"RoadMovie helps get your videos subtitled, metadata tagged, chapterized, encoded and uploaded to your portable device or website. RoadMovie 2 brings you “video-encoding-super-powers” in a friendly and easy to use interface. Now you can finally create professionally encoded videos without using several apps for each task. All you need comes in this one app. Easy […]"},{"link":"https://nmac.to/blog/pimp-your-screen-2-1/","image":"https://nmac.to/wp-content/uploads/2014/06/Pimp-Your-Screen.png","title":"Pimp Your Screen 2.1 – Custom desktop wallpapers","content":"Pimp Your Screen is here to customize the look of your desktop by giving you an exclusive selection of specially designed background images and wallpapers arranged in categories. Choose from a variety of minimalistic images, abstract backgrounds and truly unique wallpapers that will bring even more beauty to your Mac. Pimp Your Screen is a […]"},{"link":"https://nmac.to/blog/clone-x-4-3-2/","image":"https://nmac.to/wp-content/uploads/2014/12/Clone-X.png","title":"Clone X 4.3.2 – Create a copy of your system installation and much more","content":"Clone X is specially designed to create a copy of your system, to duplicate it on other disks or computers, and to repair and reinstall the system in case of problems (damaged system, errors during installation, etc.)   With OS X, the system is now a very complex construction. It is no longer confined within […]"},{"link":"https://nmac.to/blog/warhammer-quest/","image":"https://nmac.to/wp-content/uploads/2015/01/WarhammerQuest.png","title":"Warhammer Quest 1.0 – Strategy and role-playing game","content":"Based on the classic tabletop game, Warhammer Quest is an addictive mix of role-playing and strategy.   Lead your group of brave adventurers through the perilous dungeons of the Warhammer World in the search for wealth and glory!   Level up your party of heroes. Loot weapons, armour and mysterious artefacts from fallen enemies. Crush […]"},{"link":"https://nmac.to/blog/textexpander-4-3-5/","image":"https://nmac.to/wp-content/uploads/2014/01/TextExpander.png","title":"TextExpander 4.3.5 – Expand custom keyboard shortcuts into frequently-used text and pictures","content":"TextExpander saves your fingers and your keyboard, expanding custom keyboard shortcuts into frequently-used text and pictures. Type more with less effort!   Here are a few examples for what you can do with TextExpander: Insert standard greetings, phrases, boilerplate paragraphs, and signatures – including formatted text and pictures. Correct typos automatically Organize snippets into groups […]"},{"link":"https://nmac.to/blog/jitouch-2-6/","image":"https://nmac.to/wp-content/uploads/2015/01/Jitouch.png","title":"Jitouch 2.6 – Expands the gestures for MacBook multi-touch trackpad and Magic Mouse","content":"Jitouch is an application that expands the set of Multi-Touch gestures for the new MacBook and the new Magic Mouse. These thoughtfully designed gestures will enable you to perform frequent tasks more easily such as changing tabs in Web browsers, closing windows, minimizing windows, changing Spaces, and a lot more.   Jitouch also fulfills many […]"},{"link":"https://nmac.to/blog/appdelete-4-1-5/","image":"https://nmac.to/wp-content/uploads/2014/03/AppDelete.png","title":"AppDelete 4.1.5 – The speedy and efficient way to delete your unwanted apps","content":"AppDelete is an uninstaller for Macs that will remove not only applications but also widgets, preference panes, plugins, and screensavers along with their associated files. Without AppDelete these associated items will be left behind to take up space and potentially cause issues.   There are several ways to activate AppDelete: Drag items onto main window […]"},{"link":"https://nmac.to/blog/tab-launcher-2-8-1/","image":"https://nmac.to/wp-content/uploads/2013/12/Tab-Launcher.png","title":"Tab Launcher 2.8.1 – Clean up and organize the Dock","content":"The idea of Tab Launcher is not to replace the system’s dock, but to help keep it clean, with only the applications that are currently running.   By removing all the application from the dock and organizing them on tabs, you can quickly find and run any application you want.   Apart from that, you […]"},{"link":"https://nmac.to/blog/current-for-facebook-1-0-2/","image":"https://nmac.to/wp-content/uploads/2015/01/Current-for-Facebook.png","title":"Current for Facebook 1.0.2 – Bring Facebook To The Mac Desktop","content":"Current offers THE BEST way to message and browse on Facebook with your Mac! With Current, you can Facebook message friends in their own chat windows and quickly access your inbox, notifications, and online friends right from the menu bar.   Current isn’t just a messaging app. It’s a complete replacement for using Facebook in […]"}]