[{"link":"https://nmac.to/blog/profind/","image":"https://nmac.to/wp-content/uploads/2018/12/ProFind.png","title":"ProFind 1.11.0 – Advanced file search for macOS","content":"ProFind is advanced file search app for macOS.    With powerful features and great performance, ProFind delivers advanced file search for macOS. And with support for natural language queries, application launching, hidden location searches, scripting and more.    Search inside invisible folders and packages. Searches any disk type.    Uses kernel based searching (searchfs) when […]"},{"link":"https://nmac.to/blog/hdr-effect/","image":"https://nmac.to/wp-content/uploads/2020/01/HDR-Effect.png","title":"HDR Effect 1.11 – Create eye catching HDR photo effects in single shot","content":"Have you ever wished to have a perfect HDR photo with all detailing? Now you can, turn your standard photo in a vibrant HDR image with powerful tools.   A cutting-edge tool which comes with an innovative solution to bring every imaginable HDR effect to life. Developed by Tweaking Technologies , HDR Effect inspires to […]"},{"link":"https://nmac.to/blog/pcalc/","image":"https://nmac.to/wp-content/uploads/2016/05/PCalc_4.png","title":"PCalc 4.10.2 – Full-featured scientific calculator","content":"PCalc is a full-featured, scriptable scientific calculator with support for hexadecimal, octal, and binary calculations, as well as an RPN mode, programmable functions, and an extensive set of unit conversions.   Includes a Notification Center widget, and support for Handoff with the iOS 8 version.   Version 4.10.2: Moved the About screen to a standalone […]"},{"link":"https://nmac.to/blog/garagepay/","image":"https://nmac.to/wp-content/uploads/2022/04/GaragePay.png","title":"GaragePay 1.8.2 – Download, view, search, archive all your PayPal transactions","content":"GaragePay lets you download, view, search, and archive all your PayPal transactions without having to log into the PayPal website. It lets you organize your transactions in smart groups and can export to CSV files.   Version 1.8.2: Added native support for Apple silicon Improved support for new macOS Bug Sur   Intel, 64-bit processor […]"},{"link":"https://nmac.to/blog/advanced-duplicate-cleaner/","image":"https://nmac.to/wp-content/uploads/2021/03/Advanced-Duplicate-Cleaner.png","title":"Advanced Duplicate Cleane‪r 1.5 – Remove Duplicate Files","content":"Advanced Duplicate Cleaner is a smart & intelligent tool to identify and remove duplicate & similar files. It scans your entire Mac for files, photos, videos, music, apps, etc. that are duplicate & similar. To perform a scan, you can either pick from the recommended locations or can add a folder of your choice. Whatsoever […]"},{"link":"https://nmac.to/blog/app-tamer/","image":"https://nmac.to/wp-content/uploads/2020/07/App_Tamer_2.png","title":"App Tamer 2.7.1 – CPU manager for your app collection","content":"App Tamer tames your processor-monopolizing apps and keeps them from chewing up excessive CPU time and battery life. Powered by a unique AutoStop feature, App Tamer stops each application when you switch away from it — when you return to that app, it restarts automatically!   App Tamer is built around an attractive and clear […]"},{"link":"https://nmac.to/blog/quick-print/","image":"https://nmac.to/wp-content/uploads/2014/08/Quick-Print.png","title":"Quick Print 1.0.10 – Print selected Finder items without opening native applications","content":"Quick Print prints the Finder’s selected items without opening the native application, and also prints the Clipboard.   Currently it supports: Images Text files Fonts Web browser files PDFs Content of folders Files recently opened by an application Many more file types and scenarios   When a non supported file kind is selected, it shows […]"},{"link":"https://nmac.to/blog/image-resizer/","image":"https://nmac.to/wp-content/uploads/2018/01/Image-Resizer.png","title":"Image Resizer 2.3 – Reduce your image size in few seconds","content":"We capture our precious moments in the form of images and always want to share them with our family and friends. But a lot many times, we are unable to do so due to large image sizes. A perfect solution to this problem is Image Resizer.   It is a useful and effective tool to […]"},{"link":"https://nmac.to/blog/cmm-x/","image":"https://nmac.to/wp-content/uploads/2021/01/cmmx_4.png","title":"CleanMyMac X 4.10.4 – Delete files that waste your disk space","content":"CleanMyMac X makes space for the things you love. Sporting a range of ingenious new features, CMM X lets you safely and intelligently scan and clean your entire system, delete large, unused files, reduce the size of your iPhoto library, uninstall unneeded apps or fix the ones that started to work improperly, manage all your […]"},{"link":"https://nmac.to/blog/navicat-premium/","image":"https://nmac.to/wp-content/uploads/2022/01/Navicat_Premium_16.png","title":"Navicat Premium 16.0.12 – Combines all Navicat versions in an ultimate version","content":"Navicat Premium is an all-in-one database admin and migration tool for MySQL, SQL Server, Oracle and PostgreSQL.   Navicat Premium combines all Navicat versions in an ultimate version and can connect MySQL, Oracle and PostgreSQL. Navicat Premium allows user to drag and drop tables and data from Oracle to MySQL, PostgreSQL to MySQL, Oracle to […]"}]