[{"link":"https://nmac.to/blog/patternodes/","image":"https://nmac.to/wp-content/uploads/2022/02/Patternodes_3.png","title":"PatterNodes 3.0.5 – Parametric graphic patterns and illustrations","content":"PatterNodes is a tool for creating graphical patterns, animations, gradients, or illustrations based on repetitions. This is done by defining a sequence of steps, a recipe of sorts, that describes the pattern. Each pattern element or operation is represented by a little panel called a node, and the nodes are then linked by connections drawn […]"},{"link":"https://nmac.to/blog/wifi-explorer-pro/","image":"https://nmac.to/wp-content/uploads/2020/07/WiFi_Explore_Pro_3.png","title":"WiFi Explorer Pro 3.4.5 – Pro-level tool for Wi-Fi diagnostics","content":"WiFi Explorer Pro takes the code base of WiFi Explorer, and adds a set of features that makes it the right tool for WLAN and IT professionals. You can use WiFi Explorer Pro for preliminary assessments, to help design and validate wireless networks installations, as well as to identify channel conflicts, overlapping, poor signal quality […]"},{"link":"https://nmac.to/blog/popdo/","image":"https://nmac.to/wp-content/uploads/2021/12/PopDo.png","title":"PopDo 2021.2.8 – Menu bar task list","content":"PopDo is a convenient task list for the Mac menu bar, showing all your to-do items in a single view. It sports searching, filtering and sorting for quickly getting to the task you are looking for.   FEATURES: Integration with Reminders. Synchronization with iCloud. Full mode and compact mode. List and task custom colors. Color […]"},{"link":"https://nmac.to/blog/microsoft-office/","image":"https://nmac.to/wp-content/uploads/2015/11/Microsoft-Office-2016.png","title":"Microsoft Office 2021 16.60 – Popular productivity suite","content":"Microsoft Office – Unmistakably Office, designed for Mac.   The new versions of Word, Excel, PowerPoint, Outlook and OneNote provide the best of both worlds for Mac users – the familiar Office experience paired with the best of Mac.   If you already use Office on a PC or iPad, you will find yourself right at […]"},{"link":"https://nmac.to/blog/outline/","image":"https://nmac.to/wp-content/uploads/2020/11/Outline_3.png","title":"Outline 3.2203.4 – View OneNote notebooks","content":"Outline is an intuitive note-taking application for OS X with convenient structure resembling real paper books: notebooks, sections, groups of sections and pages help to keep order in notes, regardless of their complexity. Outline for Mac is perfect for students, teachers, physicians, lawyers, executives and everyone who’s daily life involves extensive note-taking of any kind. […]"},{"link":"https://nmac.to/blog/widsmob-hdr/","image":"https://nmac.to/wp-content/uploads/2018/06/WidsMob-HDR.png","title":"WidsMob HDR 3.14 – Use HDR to enhance your photos","content":"WidsMob HDR provides the optimal HDR results to enhance the photos as eye view. It also provides the live preview with full resolution of the HDR photographs.    Customize HDR photos by tone mapping parameters, such as tone length and tone saturation. Color management is also supported for brightness, saturation and contrast. It is easy […]"},{"link":"https://nmac.to/blog/concordia/","image":"https://nmac.to/wp-content/uploads/2021/10/Concordia.png","title":"Concordia 1.2.3.3 – A strategic, Euro-style board game","content":"Concordia: Digital Edition is a faithful adaptation of a strategic board game ranked in Top 20 board games of all time. Plan ahead and make crucial decisions every turn. Always be prepared to make a trade off – your actions can very well benefit other players as well as yourself.   What is Concordia? Concordia: […]"},{"link":"https://nmac.to/blog/absolute-drift/","image":"https://nmac.to/wp-content/uploads/2021/06/Absolute-Drift.png","title":"Absolute Drift 1056060422 – Become a master at the art of drifting","content":"In Absolute Drift, you will master the art of drifting. Practice your skills in Free-Roam and compete in drift events such as Driftkhana and Mountain Drifting.   Key Features Drive and customize up to 6 drift cars 3 Game Modes: Driftkhana, Drifting, & Mountain Drifting with 34 levels 5 Free-Roaming areas, each with unique levels […]"},{"link":"https://nmac.to/blog/through-the-ages/","image":"https://nmac.to/wp-content/uploads/2019/03/Through-the-Ages3.png","title":"Through The Ages 2.11.47 – 2D Strategy Board Game","content":"The official adaptation of Vlaada Chvátil’s strategy classic, the third best board game ever according to Board Game Geek website.   This is your chance to make history: You begin with a small tribe. As you expand your farms and mines, you lay the groundwork for technological advancements, better governments, and grand wonders. Your military […]"},{"link":"https://nmac.to/blog/factorio/","image":"https://nmac.to/wp-content/uploads/2020/05/factorio.png","title":"Factorio 1.1.53 – Automation Base Building Game","content":"Factorio is a game in which you build and maintain factories. You will be mining resources, researching technologies, building infrastructure, automating production and fighting enemies. In the beginning you will find yourself chopping trees, mining ores and crafting mechanical arms and transport belts by hand, but in short time you can become an industrial powerhouse, […]"}]