[{"link":"https://nmac.to/blog/versionsmanager/","image":"https://nmac.to/wp-content/uploads/2017/07/VersionsManager.png","title":"VersionsManager 1.1.6 – Remove gigabytes of superfluous old files","content":"VersionsManager is an application that allows you to inspect and optionally delete old ‘versions’ of your documents that have been stored automatically by your Mac.   Since OS X 10.7 ‘Lion’, most Mac apps automatically store not only the latest version of any document, but all previous intermediate versions are stored too. These previous versions […]"},{"link":"https://nmac.to/blog/claquette/","image":"https://nmac.to/wp-content/uploads/2016/08/Claquette.png","title":"Claquette 1.5.8 – Capture your screen, attached cameras, and microphones","content":"Claquette is a tool that allows you to record your Mac’s screen in lossless quality. Additionally, you can capture live video and audio from camera and microphone. After finishing a recording, you can directly export a movie or send it to Final Cut Pro X, from where it can be edited to your heart’s content. […]"},{"link":"https://nmac.to/blog/audulus/","image":"https://nmac.to/wp-content/uploads/2017/11/Audulus.png","title":"Audulus 3.5.1 – Minimalist modular audio processor","content":"Audulus is a minimalist modular audio-processing application. With Audulus, you can build synthesizers, design new sounds, or process audio. All with low latency real-time processing suitable for live performance. Audulus’s user interface is clean, simple, and easy to learn, allowing you to focus on sound.   Features fluid interface – smooth animated interaction MIDI control […]"},{"link":"https://nmac.to/blog/syncios-data-recovery/","image":"https://nmac.to/wp-content/uploads/2016/12/Syncios-Data-Recovery.png","title":"Syncios Data Recovery 1.2.1 – Recover lost iOS data","content":"Syncios Data Recovery lets you bring back your iOS device lost data. Supports iPhone 7 and iOS 10. 3 recovery modes to retrieve data from your iDevice, iTunes backup, and iCloud backup. Recover photos, messages, contacts, as well as app data, like WhatsApp conversations, iPhoto, Instagram, etc. Preview what you’ve found before performing recovery. You […]"},{"link":"https://nmac.to/blog/prepros/","image":"https://nmac.to/wp-content/uploads/2017/07/Prepros.png","title":"Prepros 6.2.2 – Allows you to work in multiple languages","content":"Prepros is a tool to compile LESS, Sass, Compass, Stylus, Jade, and much more with automatic CSS prefixing, It comes with a built-in server for cross-browser testing. It runs on Windows, OS X, and Linux.   Version 6.2.2: Improved: Enabled inline javascript in less files. Fixed: Less not compiling imports proprely.   Intel, 64-bit processor […]"},{"link":"https://nmac.to/blog/the-signal-from-tolva/","image":"https://nmac.to/wp-content/uploads/2017/10/The.Signal.From_.Tovla_.png","title":"The Signal From Tölva Polar Regions 1.0.51 – An open-world first-person shooter game","content":"The Signal From Tölva is a first-person game of exploration and combat, set in a beautiful, hand-crafted, hand-painted sci-fi world.   Key Features Explore a single-player shooter set in a weird, sprawling, tranquil alien landscape. Fight a war of territory control against dynamic and ferocious AI. Recruit allied robots to fight alongside you. Equip electronic […]"},{"link":"https://nmac.to/blog/night-in-the-woods/","image":"https://nmac.to/wp-content/uploads/2017/02/Night.in_.the_.Woods_.png","title":"Night in the Woods: Weird Autumn Edition 1.0 – Story Rich Adventure Game","content":"College dropout Mae Borowski returns home to the crumbling former mining town of Possum Springs seeking to resume her aimless former life and reconnect with the friends she left behind. But things aren’t the same. Home seems different now and her friends have grown and changed. Leaves are falling and the wind is growing colder. […]"},{"link":"https://nmac.to/blog/tuneskit/","image":"https://nmac.to/wp-content/uploads/2016/07/TunesKit3.png","title":"TunesKit 3.5.3 – iTunes DRM media converter","content":"TunesKit is a very easy-to-use and powerful iTunes DRM media converter. It helps iTunes lovers easily bypass the Fairplay DRM protection from iTunes purchased and rented movies/TV shows, and converts iTunes encrypted M4V to MP4 format with fast speed and 100% preserved quality.   Version 3.5.3: Bug fixes   Intel, 64-bit processor OS X 10.8 […]"},{"link":"https://nmac.to/blog/dirt-3-ce/","image":"https://nmac.to/wp-content/uploads/2015/02/DiRT-3-Complete-Edition1.png","title":"DiRT 3 Complete Edition 1.0.3 – The ultimate off-road racer powerslides onto the Mac","content":"Speed to mud-splattered glory in a stunning world of all-terrain motorsport! Overcome the elements and overtake your rivals as you cut through Finnish forests, kick up dust on African plains, slide around icy mountain trails in Aspen, Colorado and much more.   DiRT 3 Complete Edition features six high-octane disciplines including Rally, Rallycross and Gymkhana, […]"},{"link":"https://nmac.to/blog/dirt-showdown/","image":"https://nmac.to/wp-content/uploads/2015/08/DiRT-Showdown1.png","title":"DiRT Showdown 1.1.1 – Race, crash and hoon your way through a tour of motorised mayhem","content":"Race, crash and hoon your way through a world tour of motorised mayhem in DiRT Showdown! Crowd atmosphere, social gameplay and accessibility are all ramped up in this turbo- injected shot of driving delirium. Smash down the accelerator and earn the adulation of frenzied crowds at hyper-energised events at iconic locations. Trick, speed and smash […]"}]