[{"link":"https://nmac.to/blog/noct-1-0/","image":"https://nmac.to/wp-content/uploads/2016/05/Noct.png","title":"Noct 1.0 – 2D top-down multiplayer survival horror game","content":"Noct is a 2D top-down multiplayer survival horror game that blends arcade combat with RPG survival elements. You are a survivor of the apocalyptic purge that formed the desolate wasteland now known as Noct and view your experience in the world through a thermal image satellite system high above the Earth.   Scavenge and Survive: […]"},{"link":"https://nmac.to/blog/imyfone-umate-2-9-2/","image":"https://nmac.to/wp-content/uploads/2016/05/iMyfone-Umate.png","title":"iMyfone Umate 2.9.2 – Clean iPhone and increase storage space on iDevices","content":"iMyFone Umate is a useful iPhone Cleaner to make more storage space for iPhone users whose iDevice are running out of space. With iMyfone Umate you can free up iPhone space with three simple steps.   iMyfone Umate rescues you from below situations: Need more space for more apps or photos Upgrading to newest iOS […]"},{"link":"https://nmac.to/blog/animationist-1-1-4/","image":"https://nmac.to/wp-content/uploads/2016/05/Animationist.png","title":"Animationist 1.1.4 – Create beautiful title-art animations","content":"Animationist lets you create perfect title-art animations for your YouTube videos, iMovie or Final Cut projects, showcase videos, and even TV broadcasts. Animationist brings everything you need for professional intro and title art animations. Animationist comes with many presets, samples, and tutorials, and an easy-to-use yet flexible user interface.   Animationist offers an easy to […]"},{"link":"https://nmac.to/blog/roadmap-planner-1-7/","image":"https://nmac.to/wp-content/uploads/2016/05/Roadmap.Planner1.png","title":"Roadmap Planner 1.7 – Strategic Planner, Product Ideas Accounting","content":"Roadmap Planner is your strategic communication tool to build your marketing, business development and product vision roadmap, and show off it to your team and stakeholders at a glance. It will take you where you want to be in one, five, or 10 years.   In our busy environment, every minute counts. You can continue […]"},{"link":"https://nmac.to/blog/ismartphoto-1-7-6/","image":"https://nmac.to/wp-content/uploads/2014/12/iSmartPhoto.png","title":"iSmartPhoto 1.7.6 – Image browser and powerful image organizer","content":"iSmartPhoto is a fast image browser and powerful image organizer. Unlike iPhoto, iSmartPhoto doesn’t require you to manually import photos – it automatically pulls your photos from any folder or drive. By just double clicking a single image in Finder or dragging a folder, iSmartPhoto automatically displays every image from the selected folder and its […]"},{"link":"https://nmac.to/blog/freeway-pro-7-1-3/","image":"https://nmac.to/wp-content/uploads/2014/12/Freeway-Pro.png","title":"Freeway Pro 7.1.3 – Drag-and-drop Web design solution","content":"Freeway Pro lets you build websites with speed and precision… without writing a line of code!   With it’s user-oriented drag-and-drop interface, Freeway Pro helps you piece together the website of your dreams. Add images, audio, video and interactive content — when your masterpiece is complete, Freeway Pro converts it into clean, standards-compliant code at […]"},{"link":"https://nmac.to/blog/watch-this-1-3/","image":"https://nmac.to/wp-content/uploads/2016/01/Watch-This.png","title":"Watch This 1.3 – The new way to watch your movies and TV shows","content":"Because a video player should do more than just play videos. Watch This automatically organizes your movies and TV shows, tracks what you’ve watched and notifies you when new episodes from your favorite shows are available.   Nothing to watch right now? Watch This also has support for streaming sites like Twitch.tv as well as […]"},{"link":"https://nmac.to/blog/spillo-1-8/","image":"https://nmac.to/wp-content/uploads/2014/08/Spillo.png","title":"Spillo 1.8 – Take full control over your bookmarks on Pinboard","content":"Spillo is a powerful, beautiful and amazingly fast Pinboard client. Spillo lets you browse and organize your bookmarks in a stunning modern interface. Spillo also makes creating a bookmark from anywhere on your Mac as convenient as possible.   A beautiful interface Spillo has a beautiful modern interface that feels just right at home on […]"},{"link":"https://nmac.to/blog/quickbooks-2016-17-0-3/","image":"https://nmac.to/wp-content/uploads/2014/12/QuickBooks-2015.png","title":"QuickBooks 2016 17.0.3 – Financial management and accounting for small businesses","content":"QuickBooks Pro 2016 helps you manage your business easily and efficiently. Organize your finances all in one   place, track money going in and out of your business, and spot areas where you can save.   Built for Mac OS – Looks and works like you’d expect Create invoices, pay bills, and manage expenses Gain insight […]"},{"link":"https://nmac.to/blog/olliolli2-1-0/","image":"https://nmac.to/wp-content/uploads/2016/05/OlliOlli2.png","title":"OlliOlli2 1.0 Welcome to Olliwood – 2D skateboarding smash game","content":"Drop in to Olliwood and prepare for finger-flippin’ mayhem in this follow up to cult skateboarding smash OlliOlli. The iconic skater is going all green-screen with a stunning new look, plucking you from the street and dropping you squarely in the middle of the big screen’s most bodacious cinematic locations.   Revamped Paths and Combos: […]"}]