[{"link":"https://nmac.to/blog/x-word/","image":"https://nmac.to/wp-content/uploads/2018/01/XWord.png","title":"X Word 1.4.1 – Basic-but-powerful word processor","content":"X Word is a fantastic word processor. Quicker, simpler, and easier, it meets every essential need of your daily word-processing tasks, letting you create tables and insert pictures make your document richer and more colorful. And the automatic-save function means you don’t have to worry about losing data.   Features Perfect page layout Free graphics […]"},{"link":"https://nmac.to/blog/focus-timer/","image":"https://nmac.to/wp-content/uploads/2018/01/Focus-Timer.png","title":"Focus Timer 2.8 – Focus mind on work","content":"Focus Timer can help you focus on work and say goodbye to procrastination!   It’s the focus best timer for work & study   Main Functions:   About Focus Timer： Support the start, break, pause or stop of a Focus Time . Allow users to define the Focus time, short/long break length and intervals between […]"},{"link":"https://nmac.to/blog/video-acceleration/","image":"https://nmac.to/wp-content/uploads/2018/01/Video-Acceleration.png","title":"Video Acceleration 2.4.1 – Easy tool for fast video editing","content":"Video Acceleration is a new easy tool for FAST VIDEO EDITING.   Control the SPEED of your movie: speed up or slow it down.   Besides, you can improve COLORS with the help of its handy FILTERS collection.   Video Acceleration features: SPEED UP or SLOW DOWN your video; Use FILTERS to change the colors. […]"},{"link":"https://nmac.to/blog/endurance-antivirus/","image":"https://nmac.to/wp-content/uploads/2018/01/Endurance-Antivirus.png","title":"Endurance Antivirus 4.1.4 – The world leader in certifying security products","content":"Malware isn’t the only threat to your Mac, and yes Macs do get malware. According to our company research on cybercrime, the attacks on Mac systems had increased by more than 78% in 2017.   That’s the reason why you must choose an antivirus software from a security company like we are because we can […]"},{"link":"https://nmac.to/blog/try-to-translate/","image":"https://nmac.to/wp-content/uploads/2017/02/Try-to-translate.png","title":"Try to translate 4.0.0 – Quickly translate","content":"Try to translate can help you quickly translate.   Features Automatically detect the input source language Fast simultaneous translation capabilities Support more than 81 languages Support the translation of one language into multiple languages   Version 4.0.0: Fixed some translate bugs Updated SDK v20180111.19.39 Update Kernel SDK   Intel, 64-bit processor OS X 10.7 or […]"},{"link":"https://nmac.to/blog/mdb-accdb-viewer/","image":"https://nmac.to/wp-content/uploads/2018/01/MDB-ACCDB-Viewer.png","title":"MDB ACCDB Viewer 2.2.7 – View and export Microsoft Access databases","content":"MDB/ACCDB Viewer lets you open Microsoft Access databases on your Mac — regardless of whether they are in the olderMDB or the newer ACCDB format. A convenient search function lets you find what you are looking for. Double-clicking rows brings up a record window, perfect for reading long text or inspecting images.   MDB Viewer […]"},{"link":"https://nmac.to/blog/letter-template-lab-for-pages/","image":"https://nmac.to/wp-content/uploads/2018/01/Letter-Template-Lab-for-Pages.png","title":"Letter Template Lab for Pages 4.2.1 – Beautiful letters for personal and business needs","content":"Letter Template Lab for Pages is a rich collection of hundreds of exceptional letter templates designed for all kinds of occasions, and easily adjustable to your specific needs! The templates range from beautiful minimalist letters, to image-rich commercial newsletters – every item is crafted with the same incredible level of detail you would expect from […]"},{"link":"https://nmac.to/blog/xls2csv/","image":"https://nmac.to/wp-content/uploads/2017/03/XLS2csv-1.png","title":"XLS2csv 20171219.13.33 – Fast, simple conversion of Excel data to CSV","content":"XLS2csv a simple and intuitive XLS/XLSX-to-CSV converter for Mac. It handles .xls/.xlsx files from Microsoft Excel, Apple Numbers, Open Offices Excel and converts them to .csv text file format. This Mac XLS2csv converter app can intelligently recognize large XLS/XLSX files as well as a group of XLS/XLSX files and batch convert them to CSV format […]"},{"link":"https://nmac.to/blog/gitlab-control/","image":"https://nmac.to/wp-content/uploads/2018/01/GitLab-Control.png","title":"GitLab Control 1.2.0 – Keep track and be notified about your GitLab activities","content":"GitLab Control for macOS is the best way to keep track and be notified about your GitLab activities and merge requests.   Follow the project on twitter: @gitlabcontrol   For info on new releases, to suggest new features and to report bugs send an email to [email protected]   Restrictions: GitLab Control currently supports GitLab server […]"},{"link":"https://nmac.to/blog/dsync/","image":"https://nmac.to/wp-content/uploads/2018/01/DSync.png","title":"DSync 2.3 – Easily compare and synchronize two folders on your computer","content":"DSync can synchronize your files in only three steps: select the folders, compare them, synchronize them. Can it really be that easy? Sure it can.   After spending years, trying to use tools that are too complicated, which create hidden files, or are just too limited, we developed DSync – the easiest way to synchronize […]"}]