[{"link":"https://nmac.to/blog/menutab-pro-for-facebook-v5-6/","image":"https://nmac.to/wp-content/uploads/2013/12/APPL-PRO.175x175-754.png","title":"MenuTab Pro for Facebook v5.6 – Provides real-time Facebook access from your menu bar","content":"MenuTab Pro for Facebook is an incredibly slick and gorgeous app for quickly accessing your Facebook account directly from your Mac’s menu bar. It is one of the most popular and actively used apps on the entire Mac App Store. Why is MenuTab Pro the best app of its kind? Good question, allow us to […]"},{"link":"https://nmac.to/blog/ondesoft-screencapture-v1-16-4/","image":"https://nmac.to/wp-content/uploads/2013/12/40592.png","title":"Ondesoft ScreenCapture v1.16.4 – Screen capture utility","content":"Ondesoft ScreenCapture is currently the most powerful screen grabbing utility on Mac OS, by which you can easily capture any part on your Mac desktop such as rectangular or ellipse region, freehand region, full screen, active window or all windows from any webpage or application and so on. With this Mac screenshot capture, you can […]"},{"link":"https://nmac.to/blog/temperature-gauge-v4-0/","image":"https://nmac.to/wp-content/uploads/2013/12/logo.png","title":"Temperature Gauge v4.0 – Monitor your Mac’s temperature sensors and fan speeds","content":"Temperature Gauge lets you monitor all the temperatures and fan speeds inside your Mac. With over 500 international five star ratings and world class support, it’s a great tool for every Mac user to have. – Run in background mode with the info displayed in the menu bar. – See the temperature values in either […]"},{"link":"https://nmac.to/blog/socialite-v1-5-2/","image":"https://nmac.to/wp-content/uploads/2013/12/Socialite.175x175-75.png","title":"Socialite v1.5.2 – Creates a single interface for multiple social websites","content":"Socialite is a revolutionary social application. It seamlessly integrates many social websites, including Flickr, Facebook, Twitter, Reddit, RSS and Google Reader. It allows you to interact with them and receive notifications, all from a stunning user interface.   WHAT’S NEW Version 1.5.2: UPDATE: If you already have 1.5 and are notified of an update, please […]"},{"link":"https://nmac.to/blog/quick-tunes-v1-2/","image":"https://nmac.to/wp-content/uploads/2013/12/quick_icon.175x175-75.png","title":"Quick Tunes v1.2 – Control iTunes from the menu bar","content":"Quick Tunes lets you quickly and easily control your music playing in iTunes from the menu bar. It shows the artwork, name and artist in the menu heading so that you can always quickly see what is playing. Player controls for play/pause, skip and previous track can also be included right in the status bar […]"},{"link":"https://nmac.to/blog/hibari-v1-5-6/","image":"https://nmac.to/wp-content/uploads/2013/12/hibari.175x175-75.png","title":"Hibari v1.5.6 – Powerful Twitter client with tweet filtering and user muting","content":"Hibari is a powerful Mac Twitter app that blocks annoyances and reveals gems. Block Keywords: Hibari blocks tweets you don’t want to see based on keywords you choose. You can also block all retweets.     Mute Users: No more stressing about whether to follow someone-in Hibari, you can temporarily mute any user if their […]"},{"link":"https://nmac.to/blog/garbage-truck-v1-3/","image":"https://nmac.to/wp-content/uploads/2013/12/Garbage_Truck.175x175-751.png","title":"Garbage Truck v1.3 – The Mac’s most elegant trash solution","content":"Garbage Truck automatically empties your trash for you, saving your time and stopping piles of rubbish from filling your hard drive. Garbage Truck keeps things beautifully simple, but still allowing perfect control over your trash. With Garbage Truck you will never need to empty your trash again. Simply choose when you want Garbage Truck to […]"},{"link":"https://nmac.to/blog/favs-v1-2-1/","image":"https://nmac.to/wp-content/uploads/2013/12/Icon.175x175-7514.png","title":"Favs 1.2.1 – The app for all your Internet favorites","content":"Favs is a favourites manager for all your favourite Web and social media content. After all, if you are using social networks, you are also creating favorites: on Facebook you ‘like’, on Twitter and Google Reader you ‘star’, on Delicious and Pinboard you ‘bookmark’ and so on. Find Favorites: Instead of spreading your favorites across […]"},{"link":"https://nmac.to/blog/lock-screen-plus-v2-0/","image":"https://nmac.to/wp-content/uploads/2013/03/Lock-Screen-Plus.png","title":"Lock Screen Plus 2.0 – Secure lock screen with weather forecast","content":"Lock Screen Plus is a secure and beautiful lock screen application combining with a weather forecast. You can choose a variety of themes (totally free!) which have different layouts and unique unlock styles. The application provides a variety of themes starting with 4 themes and we are adding themes continuously. Each theme has different layout, clock, […]"},{"link":"https://nmac.to/blog/videomark-v1-7/","image":"https://nmac.to/wp-content/uploads/2013/12/icon1.png","title":"VideoMark 1.7 – Easily add watermarks to your videos","content":"VideoMark is a fully-featured yet easy-to-use video and movie watermark software which can be used to overlay a digital watermark for video protection or placing a logo for branding your products. VideoMark is the only viable and affordable watermarking solution on the Mac operating system.   VideoMark can help you easily add simple text or […]"}]