[{"link":"https://nmac.to/blog/topaz-adjust/","image":"https://nmac.to/wp-content/uploads/2017/11/Topaz-Adjust.png","title":"Topaz Adjust 5.2.0 – Magical contrast, detail, and color adjustments","content":"The award-winning Topaz Adjust adds a dash of magic to your photography. Get amazing photos that you would never be able to otherwise. Apply anything from simple photo enhancements to complete stylistic makeovers. Discover how you can make your photos unique with one of the most versatile and powerful photo editing tools available.   Our […]"},{"link":"https://nmac.to/blog/tunesover/","image":"https://nmac.to/wp-content/uploads/2015/12/TunesOver3.png","title":"TunesOver 3.9.1 – Easily Transfer Music from iPod touch/iPad/iPhone to iTunes and Mac","content":"TunesOver is the ultimate media management solution for your iDevice and Mac. It is specially designed as the updated version of iSkysoft FreeSync for Mac, which allows you to easily transfer music from iPod to iTunes on Mac (Mavericks included). You can also transfer iPhone songs, movies, TV shows, playlist, photos to Mac/iTunes. It even […]"},{"link":"https://nmac.to/blog/stikbold-a-dodgeball-adventure/","image":"https://nmac.to/wp-content/uploads/2017/11/Stikbold.A.Dodgeball.Adventure.png","title":"Stikbold! A Dodgeball Adventure 1.0 – Funny, Action & Sport Game","content":"Stikbold! A Dodgeball Adventure is an over-the-top action sports game with strong resemblance to dodgeball. Inspired by classic arcade games, Stikbold! delivers rock-solid and colorful local-multiplayer action with surprising depth.   Test your skills against friends and family in the definitive living room Battle Royale. Be victorious or go out with a salty BAM!… and […]"},{"link":"https://nmac.to/blog/guardians-of-the-galaxy/","image":"https://nmac.to/wp-content/uploads/2017/06/Guardians.of_.the_.Galaxy.png","title":"Guardians of the Galaxy EP1-5 1.0 – Superhero Adventure & Action Game","content":"    Marvel’s Guardians of the Galaxy: The Telltale Series delivers a brand new story of the universe’s unlikeliest heroes, the rag-tag band of outlaws who go by the names Star-Lord, Gamora, Drax, Rocket, and Groot. In the wake of an epic battle, the Guardians discover an artifact of unspeakable power. Each of the Guardians […]"},{"link":"https://nmac.to/blog/pillars-of-eternity/","image":"https://nmac.to/wp-content/uploads/2016/02/Pillars-of-Eternity3.png","title":"Pillars of Eternity Definitive Edition 3.7.0 – Isometric RPG and fantasy game","content":"Pillars of Eternity -The White March Part II is the conclusion to the grand expansion pack for Obsidian’s critically acclaimed RPG, Pillars of Eternity. Returning to the frozen north, your party will learn additional secrets about the gods of Eora as they adventure through brand new content. With the aid of a new companion, your […]"},{"link":"https://nmac.to/blog/image-viewer/","image":"https://nmac.to/wp-content/uploads/2017/04/Image-Viewer.png","title":"Image Viewer 2.1 – A simple and fast way to view images and photos","content":"Quickly view all images for an entire folder and subfolders. View in windowed or full screen modes and enjoy full screen slide shows. Users can navigate using mouse, trackpad, and keyboard.   Features: Open an image file or an entire folder Drag an image file or folder into Image Viewer View single images or thumbnails […]"},{"link":"https://nmac.to/blog/monologue/","image":"https://nmac.to/wp-content/uploads/2017/11/Monologue.png","title":"Monologue 1.0 – Quick and easy notes","content":"We made Monologue because we all have thoughts and memories, some of which are really important to us, but many of which we forget. Write down the things that matter. Use hashtags to highlight important words and get back to them quickly. Anytime.   Features Minimalist UI – Beautiful, minimalist, distraction-free user interface for you […]"},{"link":"https://nmac.to/blog/printlab-studio/","image":"https://nmac.to/wp-content/uploads/2017/11/PrintLab-Studio.png","title":"PrintLab Studio 3.0.1 – Lightweight, easy-to-use vector-drawing application","content":"PrintLab Studio is a lightweight, easy-to-use vector-drawing illustration application for Mac OS X. PrintLab Studio has tools you need to create basic shapes. Create designs quickly and easily change styles.   Features Layers Text editing Multi-color gradients iWork-style color picker   Version 3.0.1: PrintLab Studio 3 is fully compatible with macOS 10.13 High Sierra. Added […]"},{"link":"https://nmac.to/blog/easy-unzip/","image":"https://nmac.to/wp-content/uploads/2017/09/Easy-Unzip.png","title":"Easy Unzip 1.5 – Compress files with password","content":"Easy to unzip/compress with password. Create zip with password Unzip with password. Drag files to StatusBar   Version 1.5: Fix some Localized   OS X 10.10 or later, 64-bit processor    "},{"link":"https://nmac.to/blog/myriad/","image":"https://nmac.to/wp-content/uploads/2016/06/Myriad.png","title":"Myriad 4.2.1 – Audio batch processor","content":"Myriad is, simply put, one of the best audio batch processors. Totally redesigned, it looks beautiful and delivers incredible performance. Let Myriad do the heavy lifting while you get back to doing what you do best: creating great sounds and music.   One powerful productivity tool – Myriad packs a serious punch in a beautiful […]"}]