[{"link":"https://nmac.to/blog/toby-the-secret-mine-1-0/","image":"https://nmac.to/wp-content/uploads/2015/10/Toby.png","title":"Toby: The Secret Mine 1.0 – A challenging puzzle platformer inspired by games like Limbo","content":"A peaceful way of life in a small village in the mountains was thrown into disorder. Someone has kidnapped most of it’s residents. A couple of brave hearts tried to rescue their friends but none of them has returned. Little Toby didn’t want to just sit and wait so he decided to find them by himself. He went […]"},{"link":"https://nmac.to/blog/rebel-galaxy/","image":"https://nmac.to/wp-content/uploads/2015/10/Rebel.Galaxy.png","title":"Rebel Galaxy 2.0.0.3 – Space Simulation, Action, RPG & Adventure Game","content":"Rebel Galaxy is a swashbuckling space adventure, with action-packed combat, exploration, discovery, trade, and “negotiation” with the outlandish denizens at the edge of the known universe.   As the commander of an immensely powerful star destroyer, you’ll battle pirates, explore anomalies, befriend aliens, scavenge battle wreckage, mine asteroids, and discover artifacts. Choose your path as […]"},{"link":"https://nmac.to/blog/pimp-your-screen-2-2/","image":"https://nmac.to/wp-content/uploads/2014/06/Pimp-Your-Screen.png","title":"Pimp Your Screen 2.2 – Custom desktop wallpapers","content":"Pimp Your Screen is here to customize the look of your desktop by giving you an exclusive selection of specially designed background images and wallpapers arranged in categories. Choose from a variety of minimalistic images, abstract backgrounds and truly unique wallpapers that will bring even more beauty to your Mac. Pimp Your Screen is a […]"},{"link":"https://nmac.to/blog/ismartphoto-1-7-1/","image":"https://nmac.to/wp-content/uploads/2014/12/iSmartPhoto.png","title":"iSmartPhoto 1.7.1 – Image browser and powerful image organizer","content":"iSmartPhoto is a fast image browser and powerful image organizer. Unlike iPhoto, iSmartPhoto doesn’t require you to manually import photos – it automatically pulls your photos from any folder or drive. By just double clicking a single image in Finder or dragging a folder, iSmartPhoto automatically displays every image from the selected folder and its […]"},{"link":"https://nmac.to/blog/intensify-1-2-1/","image":"https://nmac.to/wp-content/uploads/2014/05/Intensify.png","title":"Intensify 1.2.1 – Create clarity and intensity in your photos","content":"Intensify lets discerning photographers of all skill levels create powerful photographic images with unprecedented drama and detail. Precise control of contrast, structure, detail and sharpening across different tonal ranges delivers high quality results every time.   Special algorithms to prevent image artifacts, image layer stacking with opacity control, dozens of professionally created presets, adjustment brushes, RAW […]"},{"link":"https://nmac.to/blog/word-processor-pro-2-1/","image":"https://nmac.to/wp-content/uploads/2015/10/Word.Processor.Pro_.png","title":"Word Processor Pro 2.1 – Text processor App","content":"Word Processor Pro is a text processor that has been developed to improve the user productivity by speeding up the writing process. Need an app that between TextEdit and Pages?   Word Processor Pro tries to take a practical approach over your daily text procesing needs and wants to meet word processing task with simple […]"},{"link":"https://nmac.to/blog/webcode-1-2/","image":"https://nmac.to/wp-content/uploads/2013/08/WebCode.png","title":"WebCode 1.2 – Drawing app which generates HTML5 code","content":"WebCode is a vector drawing app that instantly generates JavaScript+Canvas, CSS+HTML, or SVG code. While you are designing HTML5 games, infographics, or Web user interfaces, WebCode tirelessly writes the code for you!   Developed from the ground up with resolution-independence in mind, the code generated by WebCode works great on both Retina and non-Retina displays. […]"},{"link":"https://nmac.to/blog/draft-control-1-5-2/","image":"https://nmac.to/wp-content/uploads/2015/10/Draft.Control.png","title":"Draft Control 1.5.2 – Tracks changes in word processor documents","content":"Draft Control works alongside your word processor and automatically tracks changes over time. Every change is searchable, archived, and easy to restore. Automatically tracks changes to your documents each time they are saved. Keeps a pristine backup of each version of your document. Allows you to compare any two versions of a document. Search for […]"},{"link":"https://nmac.to/blog/spillo-1-6-1/","image":"https://nmac.to/wp-content/uploads/2014/08/Spillo.png","title":"Spillo 1.6.1 – Take full control over your bookmarks on Pinboard","content":"Spillo is a powerful, beautiful and amazingly fast Pinboard client. Spillo lets you browse and organize your bookmarks in a stunning modern interface. Spillo also makes creating a bookmark from anywhere on your Mac as convenient as possible.   A beautiful interface Spillo has a beautiful modern interface that feels just right at home on […]"},{"link":"https://nmac.to/blog/framer-studio-1-14-9/","image":"https://nmac.to/wp-content/uploads/2014/08/Framer.Studio.png","title":"Framer Studio 1.14.9 – Invent, design and experiment with interaction","content":"Framer Studio is built on Framer.js, an open source framework for rapid prototyping. Framer allows you to define animations and interactions. It runs on mobile devices, too.   Source on GitHub Hardware Accelerated Events & 3D Animations Spring Physics Framer.js used at: Google, Facebook, Instagram and Stripe   Generate Generate assets out of Sketch and […]"}]