[{"link":"https://nmac.to/blog/appdelete-4-1-4/","image":"https://nmac.to/wp-content/uploads/2014/03/AppDelete.png","title":"AppDelete 4.1.4 – The speedy and efficient way to delete your unwanted apps","content":"AppDelete is an uninstaller for Macs that will remove not only applications but also widgets, preference panes, plugins, and screensavers along with their associated files. Without AppDelete these associated items will be left behind to take up space and potentially cause issues.   There are several ways to activate AppDelete: Drag items onto main window […]"},{"link":"https://nmac.to/blog/shortcuts-2-0-2/","image":"https://nmac.to/wp-content/uploads/2014/10/Shortcuts.png","title":"Shortcuts 2.0.2 – Create keyboard shortcuts for routine activities","content":"Shortcuts will make your everyday tasks easier and help you to save time by creating keyboard shortcuts for routine things like launching applications and opening websites.   Set Shortcuts for:   Applications: You can launch applications like iCal, iTunes, and Mail by pressing a keystroke. You can easily reconfigure shortcuts and choose other apps or […]"},{"link":"https://nmac.to/blog/radium-3-0-10/","image":"https://nmac.to/wp-content/uploads/2014/03/Radium.png","title":"Radium 3.0.10 – Multi-network radio player","content":"Radium is an Internet radio player that’s designed from the ground up to be simple, intuitive, and lightweight. With its powerful search, thousands of supported stations (including Sirius/XM and DI.fm/Sky.fm Premium), and the ability to add your own streams, Radium will change the way you listen to Internet radio.   Version 3.0.10: Fixed issue that […]"},{"link":"https://nmac.to/blog/rar-5-11/","image":"https://nmac.to/wp-content/uploads/2014/10/RAR.png","title":"RAR 5.11 – Command line RAR archive utility","content":"RAR is a compression program offering an original algorithm. This new way to compress files provides greater efficiency, and makes smaller archives — especially on multimedia files and archives with many files. RAR also offers self-extracting capabilities as well as disk-spanning (or multi-volumes). RAR is the official RAR archive utility for OS X (offered as […]"},{"link":"https://nmac.to/blog/prepros-pro-4-2-0/","image":"https://nmac.to/wp-content/uploads/2014/10/Prepros.png","title":"Prepros Pro 4.2.0 – Web design & development tool","content":"Prepros is a web design & development tool that does all the heavy lifting needed to preprocess, optimize and test your sites and keeps your workflow supercharged.   Compile Everything Prepros compiles LESS, Sass, SCSS, Stylus, Jade, Slim, Coffeescript, LiveScript, Haml and Markdown.   JS Concatenation Prepros minifies and concatenates your js in the real […]"},{"link":"https://nmac.to/blog/instacast-1-2-6/","image":"https://nmac.to/wp-content/uploads/2014/04/Instacast.png","title":"Instacast 1.2.6 – Podcasts for the next generation","content":"Instacast brings you podcasts like no other. The popular iOS app is moving onto the Desktop! With managed podcast subscriptions, advanced playback controls, the ability to follow show notes, and WiFi download capability to save on your mobile broadband allowance, Instacast is the perfect solution for the mobile viewer.   Version 1.2.6: Improved integration with […]"},{"link":"https://nmac.to/blog/hardwaregrowler-2-2/","image":"https://nmac.to/wp-content/uploads/2014/10/HardwareGrowler.png","title":"HardwareGrowler 2.2 – Notification for hardware status changes","content":"HardwareGrowler is the best way to find out when hardware status changes on the Mac. If you need to know what’s going on with your Mac, then you need HardwareGrowler.   When your power cable unplugs, HardwareGrowler will spring into action and lets you know about it. Plug in a device like a keyboard, thumb […]"},{"link":"https://nmac.to/blog/bluetail-2-0/","image":"https://nmac.to/wp-content/uploads/2014/10/Bluetail.png","title":"Bluetail 2.0 – Easy-to-use vector drawing application","content":"Bluetail is a beautifully designed, easy-to-use vector drawing application to help you create inspiring vector graphics. It has all tools, giving you the power that lets you draw any kind of shape, technical illustrations, and beautiful art.   Features: 3 kinds of pencil tools Layers with blending options Freehand pen tool Drawing shapes: star, polygon, […]"},{"link":"https://nmac.to/blog/airfile-2-8/","image":"https://nmac.to/wp-content/uploads/2014/03/AirFile.png","title":"AirFile 2.8 – Manage and access all your clouds in one place","content":"AirFile for iOS now comes to Mac! It lets you manage and access all your clouds in one place. You don’t need to use each application for each cloud. It provides you a unified access to all your clouds. Are you looking for an app that allows for accessing multiple Dropbox, multiple Box, multiple Google […]"},{"link":"https://nmac.to/blog/ampkit-2-0-1/","image":"https://nmac.to/wp-content/uploads/2014/10/AmpKit.png","title":"AmpKit 2.0.1 – Powerful guitar & effects studio","content":"AmpKit transforms your Mac into a powerful guitar amp & effects studio! AmpKit includes 22 faithfully-reproduced amps with 38 separate amp channels, 28 pedals, 28 cabinets and 8 mics. Effects include various overdrive, distortion, fuzz, compression and phaser pedals, plus clean boost, delay, reverb, acoustic simulation, wah, EQ, octaver, tremolo, vibrato, chorus, and flanger. Add […]"}]