[{"link":"https://nmac.to/blog/tublme/","image":"https://nmac.to/wp-content/uploads/2013/12/Raken.175x175-75.jpg","title":"Tublme 1.0.1 – Beautiful Tumblr desktop client","content":"Tublme is a beautiful and powerful, yet easy-to-use, Tumblr desktop client. It makes browsing Tumblr a whole new experience with its minimalistic approach. Features: Lists – As in Twitter, a list is a selected group of users. Just add people (you don’t even need to be following them) to a new or existing list and […]"},{"link":"https://nmac.to/blog/garageband/","image":"https://nmac.to/wp-content/uploads/2013/12/GarageBand.175x175-75.jpg","title":"GarageBand 10.0.0 – Complete recording studio and more","content":"Rebuilt from the ground up with a fresh new look and amazing new features, GarageBand is the easiest way to create a great-sounding song on your Mac. Add realistic, impeccably produced and performed drum grooves to your song with Drummer.  Easily shape the sound of any instrument in the Sound Library with Smart Controls. Crank […]"},{"link":"https://nmac.to/blog/turbodo/","image":"https://nmac.to/wp-content/uploads/2013/12/AppIcon.175x175-751.jpg","title":"Turbodo 1.1 – Defined by your own keyboard shortcuts","content":"Turbodo helps you to open any documents, folders or apps using keyboard shortcuts, defined by your own. Turbodo seats in your status bar what allows you to add new keyboard shortcuts and edit already existing ones quickly. You can open unlimited number of apps with one click using Turbodo. For example you can open all […]"},{"link":"https://nmac.to/blog/photo-samurai/","image":"https://nmac.to/wp-content/uploads/2013/12/Photo_Samurai.175x175-75.jpg","title":"Photo Samurai 1.0 – Convert an images to a ‘collage’ of separate images","content":"Photo Samurai brings you the latest photo effect craze: photo dicing. Use it to slice and dice photos so that they look like they’re made up of multiple images. Makes photos more interesting and gives a whole new feeling. Photo Samurai offers the following features: Easy to use, with all the controls laid out in […]"},{"link":"https://nmac.to/blog/great-photo-pro/","image":"https://nmac.to/wp-content/uploads/2013/12/logo.175x175-75.jpg","title":"Great Photo Pro 3.0.0 – All-in-one photo editing","content":"Great Photo is an exceptional all-in-one Photo Editing app.   HIGHLIGHTS Perfectly produce amazing photos with the one tool that gives you all you need! Class-leading tools, from the brilliant Editing and FX Effects, photo-realistic HDR, DSLR Depth-of-field Effect, Automatic Image Enhancement, Color Splash, Collage, comprehensive image editing tools, rotate, corp, paris comparison etc to […]"},{"link":"https://nmac.to/blog/iphoto/","image":"https://nmac.to/wp-content/uploads/2013/12/NSApplicationIcon.175x175-75.jpg","title":"iPhoto 9.5 – Import, edit, and share your photos","content":"iPhoto lets you do more than you ever thought possible with your photos. It gives you easy ways to find, sort, and rediscover your favorites. Simple but powerful editing tools let you turn good shots into magnificent ones. And you can share your photos in all kinds of great ways, including fun slideshows, Facebook, and […]"},{"link":"https://nmac.to/blog/wordify/","image":"https://nmac.to/wp-content/uploads/2013/10/icon.175x175-75.jpg","title":"Wordify 2.0.1 – Typographic image creator for your photos","content":"Wordify transforms your images into typographic artwork.Choose a picture and create a list of words. Wordify will render your image with text and output the product as a high-quality PDF.   Beautiful results Includes 45 helpful templates Choose your favorite fonts and customize the style Drag and drop your images to get started quickly   […]"},{"link":"https://nmac.to/blog/arcsoft-photo-plus/","image":"https://nmac.to/wp-content/uploads/2013/10/ArcSoft-Photo.jpg","title":"ArcSoft Photo+ 2.0.90105 – Smart Photo Viewer","content":"Smart Photo Viewer for Mac. Click one photo in Finder to display all photos in the same folder without importing them. Easily browse through photos and zoom photos using track pad gestures or the keyboard. Auto rotate your vertical photos. Crop, rotate and delete your photos while browsing. Easily pick your favorite photos for displaying […]"},{"link":"https://nmac.to/blog/bad-piggies/","image":"https://nmac.to/wp-content/uploads/2013/10/Bad-Piggies1.png","title":"Bad Piggies 1.5.0 – Action-packed spin-off of the Angry Birds series","content":"Bad Piggies is colorful, high-energy challenge, starring those famous Piggies from the Angry Birds series! From the creators of Angry Birds: an all new game from the PIGS’ point of view! Create the ultimate flying/crawling/rolling/spinning/crashing device and pilot the pigs safely to the eggs!   The Bad Piggies are after the eggs again — but as usual, […]"},{"link":"https://nmac.to/blog/angry-birds/","image":"https://nmac.to/wp-content/uploads/2013/10/Angry-Birds4.png","title":"Angry Birds 4.0.0 – Popular physics-based puzzle game","content":"The survival of the Angry Birds is at stake. Dish out revenge on the green pigs who stole the Birds’ eggs. Use the unique destructive powers of the Angry Birds to lay waste to the pigs’ fortified castles. Angry Birds features hours of gameplay, challenging physics-based castle demolition, and lots of replay value. Each of […]"}]