[{"link":"https://nmac.to/blog/cyberlink-makeupdirector/","image":"https://nmac.to/wp-content/uploads/2017/10/CyberLink-MakeupDirector.png","title":"CyberLink MakeupDirector 2.0 – Create Beautiful Makeup Art","content":"Designed with photographers and makeup artists in mind, MakeupDirector’s top-notch tools and facial detection technology gives you flawless virtual makeup. Whether you are a hobbyist photographer or a professional makeup artist MakeupDirector offers endless creativity, from the simple re-touching of family photos to advanced applications such as testing makeup color palettes on your models before […]"},{"link":"https://nmac.to/blog/disk-cleaner/","image":"https://nmac.to/wp-content/uploads/2017/10/Disk-Cleaner.png","title":"Disk Cleaner 1.1 – Simple, safe way to clean your system","content":"You can use Disk Cleaner to reduce the number of unnecessary files on your drives, which can help your Mac run faster. It can delete temporary files and system files, empty the Trash Can, and remove a variety of other items that you might no longer need. Disk Cleaner will help to clean: application caches […]"},{"link":"https://nmac.to/blog/bear/","image":"https://nmac.to/wp-content/uploads/2017/10/Bear.png","title":"Bear 1.3.1 – Writing app for notes and prose","content":"Bear is a flexible writing app for crafting notes and prose. Link notes to each other to build a body of work. Use hashtags to organize for the way you think. And yet, all notes are stored in plain, portable text. Bear is perfect for everything from quick notes, to code snippets, to in-depth essays. […]"},{"link":"https://nmac.to/blog/oneradio/","image":"https://nmac.to/wp-content/uploads/2015/06/OneRadio1.png","title":"OneRadio 1.5.3 – Enjoy the pleasure of discovery","content":"Find out what’s new and what’s hot. Indulge your passion for music by discovering radio stations from all over the world.   REAL CONTENT Why listen to the same 12 songs on repeat, when you can hear to music, news, and feature programs selected daily by professionals? DJ’s are so much better when they’re real. […]"},{"link":"https://nmac.to/blog/cryptark/","image":"https://nmac.to/wp-content/uploads/2017/10/Cryptark.png","title":"Cryptark 1.2 – 2D sci-fi action & strategy shooter game","content":"Cryptark is a 2D roguelike shooter that challenges players with boarding and neutralizing procedurally generated alien starships to earn income for their Privateering enterprise. Purchase improved equipment and weapons to tackle more dangerous targets, but be cautious as failure will result in a loss of investment and profit. The decaying alien arks will defend themselves […]"},{"link":"https://nmac.to/blog/dxo-optics-pro/","image":"https://nmac.to/wp-content/uploads/2016/03/DxO-OpticsPro.png","title":"DxO Optics Pro 11.4.3 – Image enhancement for RAW and JPEG files","content":"Thanks to DxO OpticsPro’s exclusive technologies, instantly correct all the optical defects of your equipment, remove digital noise even at high sensitivities, recover fine details and textures in dark or burnt areas, and bring out all the nuances of color in your images. With DxO OpticsPro’s outstanding performance, bring out the best in your RAW […]"},{"link":"https://nmac.to/blog/tokenlock/","image":"https://nmac.to/wp-content/uploads/2014/09/TokenLock.png","title":"TokenLock 4.72 – Professional-grade Mac locking","content":"TokenLock allows you to use a Bluetooth device (with optional proximity), a USB device, a hotkey, or your Apple Remote to lock (and optionally also unlock) your Mac.   Features: Lock on USB device removal. Lock on Bluetooth device disconnect. Lock on Bluetooth device minimum signal strength (OS X 10.7 Lion) Lock with a hotkey. […]"},{"link":"https://nmac.to/blog/utorrent/","image":"https://nmac.to/wp-content/uploads/2016/11/uTorrent.png","title":"uTorrent 1.8.7 Build 43796 – Lightweight BitTorrent client ( No ADS )","content":"uTorrent is a lightweight BitTorrent client. While the interface has been polished and the overall size remains smaller than your average Facebook pic, uTorrent is now packed with some insanely powerful features: Find: Search for torrents or browse artist-sponsored content, directly from your software interface. Get: Download torrents and manage your files in the torrent […]"},{"link":"https://nmac.to/blog/bundle-for-pages-by-gn/","image":"https://nmac.to/wp-content/uploads/2017/10/Bundle-for-Pages-by-GN.png","title":"Bundle for Pages by GN 1.3 – Templates for Apple Pages","content":"Bundle for Pages (was Templates Mill, then was GN Universal Templates) is a broad collection of high-quality Pages templates. This set offers fresh-looking and eye-catching creative designs for your personal and business needs. Design is our passion, and Bundle for Pages will boost the value of your content, make it stylish and memorable – all […]"},{"link":"https://nmac.to/blog/fall-of-light/","image":"https://nmac.to/wp-content/uploads/2017/10/Fall-Of-Light.png","title":"Fall of Light 1.0 – RPG Action & Adventure Game","content":"As Nyx, an old, retired warrior, evade the Shadows and find your way through the crooked corridors of gloomy dungeons, navigate the treacherous pathways of the darkened overworld and fight emissaries of darkness in long-forgotten temples. Many puzzles and deadly traps stand between you and your goal – to bring your daughter Aether to the […]"}]