[{"link":"https://nmac.to/blog/soundbunny-v1-0-2/","image":"https://nmac.to/wp-content/uploads/2013/12/41891.png","title":"SoundBunny v1.0.2 – Tailor volume settings for individual applications","content":"SoundBunny is a simple, powerful Mac volume control application that allows you to control the volume level for all open applications on your Mac. You can set the volume high for a movie or game you’re playing, while setting the volume low for your Mail alerts or notifications.   Easy Setup SoundBunny is incredibly easy […]"},{"link":"https://nmac.to/blog/window-magician-v1-0-6/","image":"https://nmac.to/wp-content/uploads/2013/12/Window_Magician.175x175-751.png","title":"Window Magician v1.0.6 – Automatic window re-sizer and re-positioner","content":"Window Magician helps streamline your user experience and optimize your workflow by automatically resizing and repositioning windows. Create “Window Watchers” to individually process windows with specific titles, from specific applications, and of specific types. Ensure all of your Finder windows are positioned tightly in the most top-left corner of the screen. Ensure your Web browser […]"},{"link":"https://nmac.to/blog/swift-share-v2-0-6/","image":"https://nmac.to/wp-content/uploads/2013/12/25064.png","title":"Swift Share v2.0.6 – Easily create file share points across your local network","content":"Swift Share allows users to easily create file share points across your local network. Sharing files across your local network just got easier! Swift Share allows the easy creation of both Windows and Mac share points. Take control of Mac OS X’s built-in file servers and tweak them to perfection. Share points are points across the […]"},{"link":"https://nmac.to/blog/lock-n-load/","image":"https://nmac.to/wp-content/uploads/2013/01/Lock-n-Load.png","title":"Lock ‘n’ Load 1.1 – Mac Action Game","content":"Once upon a time, there was an evil little girl whose goal was to conquer the world…now it’s up to you to grab your gun and save the day.Get ready to blow some crazed creeps away in Lock ‘n’ Load, a shooter packed to the brim with style and substance.   SERIOUSLY EPIC Enchased for your […]"},{"link":"https://nmac.to/blog/galaxy-on-fire-2-full-hd-1-0-1/","image":"https://nmac.to/wp-content/uploads/2012/12/Galaxy-On-Fire-2-Full-HD.png","title":"Galaxy On Fire 2 Full HD + DLC 1.0.6 – Interstellar adventure game","content":"With the recent release of Galaxy on Fire 2 Full HD, Fishlabs Entertainment’s award-winning sci-fi saga finally blazes onto your Windows PC. Millions of installed copies and thousands of raving reviews by fans and media alike leave no doubt that Galaxy on Fire 2™ is the undisputed benchmark for open space shooters on mobile devices. […]"},{"link":"https://nmac.to/blog/im-away-v1-2/","image":"https://nmac.to/wp-content/uploads/2013/12/icon.175x175-7537.png","title":"I’m Away v1.2 – Change all your IM statuses with one click","content":"I’m Away is a simple utility that helps you change your statuses in the most popular Instant Messengers on Mac with one click only. Change your status in Skype, iChat, and Adium with one hotkey you choose yourself. Features: Changes statuses simultaneously; Compatible with iChat, Skype and Adium; Supports customizable hotkeys. Control your statuses with […]"},{"link":"https://nmac.to/blog/elsewhere-ambient-nature-sounds-v1-2/","image":"https://nmac.to/wp-content/uploads/2013/12/Elsewhere.175x175-751.png","title":"Elsewhere: Ambient Nature Sounds v1.2 – Brings harmony to your ear","content":"Want to get away from the monotonous office noises? Crave for the ocean breeze or the leaves whispering? Or maybe you need a cheer up with the sounds of the city? Any of your cravings will be satisfied with Elsewhere! Elsewhere app creates a special atmosphere around you with its ambient sounds. Elsewhere is: – […]"},{"link":"https://nmac.to/blog/ubclock-v1-8-4/","image":"https://nmac.to/wp-content/uploads/2013/12/UBClock.175x175-75.png","title":"UBClock v1.8.4 – Wonderful clock for your desktop","content":"Decorate your desktop with a stylish clock!Offers different faces, changable colors and a realistic behaviour plus old railway station style. WHAT’S NEW Version 1.8.4: 12/24 Hour (AM/PM) Support for Digital Display REQUIREMENTS Intel, Mac OS X 10.5 or later ScreenShots :         BitShare Click Here Uploaded Click Here SlingFile Click Here RapidGator […]"},{"link":"https://nmac.to/blog/osfoora-for-twitter-v1-3/","image":"https://nmac.to/wp-content/uploads/2013/12/osfo.png","title":"Osfoora for Twitter 1.3 – Clean and intuitive Twitter client","content":"Osfoora for Twitter is a powerful Twitter client with a clean and intuitive user interface. You’ll enjoy a wide set of powerful features such as Muting users, Read Later, Message Conversations, Multiple Accounts, and more.   Feature list: Multiple accounts with multi-windows. TweetMarker Support: Timeline syncing of reading position between different Twitter apps. Inline picture thumbnails […]"},{"link":"https://nmac.to/blog/sticky-notifications-v1-0-4/","image":"https://nmac.to/wp-content/uploads/2013/12/StickyNotifications.175x175-75.png","title":"Sticky Notifications v1.0.4 – Sticky notes that integrate with notification center or Growl","content":"Sticky Notifications … Sometimes you need to step away from your Mac for a moment (or to quickly deal with another task), and it can be handy to leave yourself a quick reminder of what you were doing. Many of us use sticky notes or scraps of paper, but there’s a better way! Sticky Notifications […]"}]