[{"link":"https://nmac.to/blog/dreamshot-2-0/","image":"https://nmac.to/wp-content/uploads/2015/05/DreamShot.png","title":"DreamShot 2.0 – Robust screenshot application","content":"DreamShot is a robust screenshot application. Use one shortcut to take screenshots for all of your apps, services, and destinations. View a large preview of your screenshot with an extensive list of sharing actions, including the immediate upload to a cloud service.   Version 2.0: Overhauled the interface. A shiny new icon. Float screenshot. Now […]"},{"link":"https://nmac.to/blog/voila-3-8-4/","image":"https://nmac.to/wp-content/uploads/2014/02/Voila.png","title":"Voila 3.8.4 – Capture, annotate, organize, and share media","content":"Voila is a screen-capture, recording, and annotation tool that is a full-featured replacement for Mac’s screen-capture and screen-recording capabilities. It has a large and robust set of editing, organizing, annotation, and effects tools that allows the user to create and add details to screenshots, tutorials, videos, and presentations.   Voila lets you capture any shape, […]"},{"link":"https://nmac.to/blog/videobox-4-1-7/","image":"https://nmac.to/wp-content/uploads/2014/04/Videobox.png","title":"Videobox 4.1.7 – Download Flash video through your browser","content":"Videobox allows you to quickly and easily download Flash video from most all of the popular video sites on the internet. Videobox will convert the video into a native Quicktime format so it’s ready to view on your Mac, iPod, iPhone or iTunes.   Version 4.1.7: Release notes were unavailable when this listing was updated. […]"},{"link":"https://nmac.to/blog/playonmac-4-2-8/","image":"https://nmac.to/wp-content/uploads/2015/01/PlayOnMac.png","title":"PlayOnMac 4.2.8 – Run Windows apps on your Mac","content":"PlayOnMac is like wineskin, winebottler or crossover a piece of sofware which allows you to easily install and use numerous games and softwares designed to run with Microsoft’s Windows.Interesting points to know: You don’t have to own a Windows license to use PlayOnMac. PlayOnMac is based on Wine, and so profits from all its possibilities […]"},{"link":"https://nmac.to/blog/maccaption-6-1-01/","image":"https://nmac.to/wp-content/uploads/2015/05/MacCaption.png","title":"MacCaption 6.1.01 – Add closed captions to video material","content":"MacCaption is a new improved version of CCaptionPro. Not only you can import text file and break it into individual captions, you can also format the text by clicking on a couple of icons. Many icons have been added to access each function much faster. It cuts down caption preparation time to 1/3rd the time […]"},{"link":"https://nmac.to/blog/action-henk/","image":"https://nmac.to/wp-content/uploads/2015/05/Action-Henk1.png","title":"Action Henk 1.0 – Run, jump and butt-slide into the glorious toy-filled world","content":"Run, jump and butt-slide into the glorious toy-filled world of Action Henk! Become a master of momentum and defy physics as you race against a band of ragged 90s action figures to once and for all prove that Action Henk is the fastest of them all!   With over 70 tracks all set in different […]"},{"link":"https://nmac.to/blog/vertiginous-golf-1-0/","image":"https://nmac.to/wp-content/uploads/2015/05/Vertiginous.Golf_.png","title":"Vertiginous Golf 1.0 – A dystopian steam punk mini golf adventure game","content":"Vertiginous Golf is a dystopian steam punk mini golf adventure game set in the skies above an alternate world where life on the ground is enveloped in permanent smog, constant darkness and never-ending rain.   After suffering on the ground under a haze smog and pollution, the people of Scudburough have been split in half […]"},{"link":"https://nmac.to/blog/perils-of-man/","image":"https://nmac.to/wp-content/uploads/2015/05/Perils-of-Man.png","title":"Perils of Man 1.0 – Adventure, indie and point & click game","content":"Imagine getting a glimpse into the secret clockwork of the universe. Imagine a machine that can crack the code of destiny and give you the power to tinker with fate. Imagine discovering that for generations your family has concealed this power from the outside world.   Ana Eberling may only be a teenager, but she […]"},{"link":"https://nmac.to/blog/r-b-i-baseball-15-1-0/","image":"https://nmac.to/wp-content/uploads/2015/05/R.B.I.Baseball.15.png","title":"R.B.I Baseball 15 1.0 – The legendary Major League Baseball franchise","content":"The legendary Major League Baseball franchise returns with fresh game modes, authentic ballparks, improved animations and deep stat tracking.   New game features and enhancements include:   Authentic ballparks with unique characteristics from every Major League Baseball club Modify your lineup with complete MLB rosters or play classic R.B.I. Baseball mode with 16 player rosters […]"},{"link":"https://nmac.to/blog/goat-simulator/","image":"https://nmac.to/wp-content/uploads/2015/05/GoatSimulator.png","title":"Goat Simulator 1.3 – Make as much destruction as you possibly can as a goat","content":"Goat Simulator is the latest in goat simulation technology, bringing next-gen goat simulation to YOU. You no longer have to fantasize about being a goat, your dreams have finally come true! WASD to write history.   Gameplay-wise, Goat Simulator is all about causing as much destruction as you possibly can as a goat. It has […]"}]