[{"link":"https://nmac.to/blog/grand-theft-auto-vice-city/","image":"https://nmac.to/wp-content/uploads/2013/08/GTA-VC.png","title":"Grand Theft Auto: Vice City ( GTA VC ) 1.0 – Driving action game in the big hair 80s","content":"Grand Theft Auto: Vice City…Welcome to the 1980s. From the decade of big hair, excess and pastel suits comes a story of one man’s rise to the top of the criminal pile as Grand Theft Auto returns. Vice City is a huge urban sprawl ranging from the beach to the swamps and the glitz to the […]"},{"link":"https://nmac.to/blog/ordinatore-pro-v3-0/","image":"https://nmac.to/wp-content/uploads/2013/12/Icon.175x175-753.png","title":"Ordinatore Pro 3.1 – Change your files’ and folders’ icons","content":"Ordinatore can change your files’ and folders’ icons and thus make your desktop, documents or any other kind of folder on your Mac look nicer! Have a look at the screenshots to see how your Finder could look like – better organized and unique! Ordinatore Pro In this version, there is not a single ad. […]"},{"link":"https://nmac.to/blog/symantec-encryption-desktop/","image":"https://nmac.to/wp-content/uploads/2013/12/9548.jpg","title":"Symantec Encryption Desktop 10.3.0 – Quality security/encryption for email and data","content":"Symantec Encryption Desktop provides individuals a simple, easy-to-use desktop encryption solution to automatically protect confidential communications and digitally stored information with an integrated solution based on strong, broadly accepted security technology. PGP Desktop incorporates PGP Universal technology to provide automatic encryption, decryption, digital signatures, verification, and recipient key lookup, making it appropriate for both novice […]"},{"link":"https://nmac.to/blog/browser-care/","image":"https://nmac.to/wp-content/uploads/2013/12/BrowserCare.175x175-75.jpg","title":"Browser Care 1.1 – Clean the data stored by your browser","content":"Browser Care is a powerful application that allows you to keep your browsers clean and under control since navigating accumulates files on your Mac. Browser Care provides detailed information on each item. It has everything you need to to care for your browsers in the most simple manner. Features: Care. A button for everything.   […]"},{"link":"https://nmac.to/blog/business-mix-set/","image":"https://nmac.to/wp-content/uploads/2013/12/Business_Mix_Set.175x175-75.jpg","title":"Business Mix Set 1.2 – Professional and stylish business templates for Apple’s Pages","content":"Business Mix Set presents an excellent kit of 146 templates for Pages, from business cards and newsletters to proposals and various project management forms. Some of the templates contain multiple sections, which results in an array of over 300 different layouts to meet your individual needs. This wide variability offers countless options for immediate customization, […]"},{"link":"https://nmac.to/blog/macx-iphone-video-converter/","image":"https://nmac.to/wp-content/uploads/2013/12/WinX.jpg","title":"MacX iPhone Video Converter 3.2.3 – Convert Any Video to iPhone, iPod, iPad","content":"MacX iPhone Video Converter converts any video like MKV, AVCHD, AVI, M2TS, MP4, WMV etc to iPhone, iPod, iPad, MOV, MP4 etc with original quality. MacX iPhone Video Converter is a useful Mac iPhone video converter software for Apple enthusiasts who are looking to get their favorite videos viewable on iPhone, iPod, iPad, Mac computer by […]"},{"link":"https://nmac.to/blog/omerta-city-of-gangsters/","image":"https://nmac.to/wp-content/uploads/2013/08/Omerta-City-of-Gangsters.png","title":"Omerta – City of Gangsters 1.0.7 – Simulation game with tactical turn-based combat","content":"Omerta – City of Gangsters is a simulation game with tactical turn-based combat. Taking the role of a fresh-from-the-boat immigrant, with dreams of the big life, the player will work his way up the criminal hierarchy of 1920’s Atlantic City.   Starting with small jobs, his character recruits a gang and expands his empire by […]"},{"link":"https://nmac.to/blog/whitelist/","image":"https://nmac.to/wp-content/uploads/2013/12/WhiteList.175x175-75.jpg","title":"WhiteList 1.12 – Generate a whitelist for e-mail spam","content":"WhiteList will generate a list of all people you have mailed with. This list is usually called a whitelist for e-mail spam, as those are real people. You can export that list as v-cards so you can add them to a group in your address book. Features:– shows you the top list of people you […]"},{"link":"https://nmac.to/blog/webcode/","image":"https://nmac.to/wp-content/uploads/2013/08/WebCode.png","title":"WebCode 1.1 – HTML5 Canvas drawing, CSS+HTML and SVG code","content":"WebCode is a vector drawing app that instantly generates JavaScript+Canvas, CSS+HTML or SVG code. While you are designing HTML5 games, infographics or web user interfaces, WebCode tirelessly writes the code for you!   Developed from the ground up with resolution independence in mind, the code generated by WebCode works great on both Retina and non-Retina […]"},{"link":"https://nmac.to/blog/boinxtv/","image":"https://nmac.to/wp-content/uploads/2013/12/BoinxTV_Home.175x175-75.jpg","title":"BoinxTV 1.9.2 – Live-production software for video podcasters","content":"BoinxTV is the pioneering live-production software for video podcasters that turns any recent Mac into a TV studio “for the rest of us”. Record stunning studio shows, podcasts, sports events, concerts, interviews, sermons, seminars and more using your Mac, multiple cameras, microphones and other footage.   With its innovative user interface, BoinxTV makes it easy to […]"}]