[{"link":"https://nmac.to/blog/batch-watermark-image/","image":"https://nmac.to/wp-content/uploads/2017/11/Batch-Watermark-Image.png","title":"Batch Watermark Image 1.2.0 – Batch watermark your images","content":"Batch to add image or text watermark for images.   Features: Easy to move | scale | copy | duplicate | paste | delete | undo | redo multi objects or edit objects’ attributes at the same time. Enable to save objects as a template for future use Easy to add gradient( one by one […]"},{"link":"https://nmac.to/blog/deploymate/","image":"https://nmac.to/wp-content/uploads/2017/11/Deploymate.png","title":"Deploymate 1.0 – Find and prevent app crashes","content":"Deploymate helps you identify unavailable, deprecated and obsolete API usage in your Xcode projects. Every once in a while, a new version of iOS and OS X is released, and along with them are new sets of APIs for developers to use. The problem is, if you use these new APIs your app will crash […]"},{"link":"https://nmac.to/blog/cutout-professional/","image":"https://nmac.to/wp-content/uploads/2017/11/CutOut-professional.png","title":"CutOut professional 2018 – Background removal for photographs","content":"CutOut professional lets you create the perfect photomontage by cutting out individual objects with just a few mouse clicks so that you can incorporate them into another photo. The whole thing will appear so realistic that it will look as if you had photographed the object with the new background. Let yourself create new fascinating […]"},{"link":"https://nmac.to/blog/earth-3d-animal-atlas/","image":"https://nmac.to/wp-content/uploads/2017/11/Earth-3D-Animal-Atlas.png","title":"Earth 3D Animal Atlas 1.0.0 – Discover wildlife around the globe","content":"Earth 3D Animal Atlas lets you discover the wildlife world! While rotating the globe, you will see the huge diversity of animals, birds, and marine life in their natural habitats. Among the trees and bushes, among the amazing flowers and colorful coral reefs, you will find creatures you never knew existed until now.   Features […]"},{"link":"https://nmac.to/blog/pressure-overdrive/","image":"https://nmac.to/wp-content/uploads/2017/11/Pressure-Overdrive.png","title":"Pressure Overdrive 1.0 – Action, arcade, co-op shooting game","content":"Step up a gear: Pressure returns with Overdrive! Start your steam buggy and join “La Resistance”…it’s still time to prevent Count Soap from powering his Uber-Spa with stolen water!   In Pressure Overdrive you revisit an action packed world, filled with crazy characters and funky humor. This enhanced version will challenge your skills, while you […]"},{"link":"https://nmac.to/blog/syberia-2/","image":"https://nmac.to/wp-content/uploads/2017/11/Syberia-2.png","title":"Syberia 2 1.0 – The second Kate Walker’s adventure journey in Syberia","content":"Having searched Eastern and Western Europe for a massing heir, Kate Walker finally completed her long and arduous journey, obtaining the signature of Hans Voralberg and closing the automaton factory buyout.   Mission accomplished? Not for this sophisticated New York lawyer… An unlikely pair, young Kate Walker and old, eccentric Hans Voralberg now set off […]"},{"link":"https://nmac.to/blog/syberia/","image":"https://nmac.to/wp-content/uploads/2012/12/Syberia.png","title":"Syberia 1.0.2 – An exciting and long adventure with varied high quality graphics","content":"Kate Walker, a young ambitious lawyer from New York, is handed what seems a fairly straightforward assignment – a quick stopover to handle the sale of an old automaton factory hidden in the Alpine valleys, then straight back home to the US.   Little did she imagine when embarking on this task that her life […]"},{"link":"https://nmac.to/blog/trash-without/","image":"https://nmac.to/wp-content/uploads/2017/11/Trash-Without.png","title":"Trash Without 1.4.1 – Delete files without using the Trash","content":"Trash Without allows you to delete files without “Trash” on your hard disk, USB, memory card. Are you tired of cleaning the Trash of a single large file that you don’t exactly need? Do you need to free up disk space urgently, but you have the files in the Trash, which may not have been […]"},{"link":"https://nmac.to/blog/cooler-controller-pro-for-hacker/","image":"https://nmac.to/wp-content/uploads/2016/10/Cooler-Controller-Pro-for-Hackers.png","title":"Cooler Controller Pro for Hackers 1.2.0 – Visualize you system status","content":"For Hackers Edition bundle simple Arduino tools in [pereference] – [DIYers] for help to make Extra fan and can visualize you system status.   The App buisiness aims that users make arduino or some IoT platform and additional circuit by DIY.   Feature: Bundles circuit diagrams and sketch code for arduino. On MAS Version , […]"},{"link":"https://nmac.to/blog/steamburg/","image":"https://nmac.to/wp-content/uploads/2017/11/Steamburg.png","title":"Steamburg 1.02 – An award-winning puzzle adventure game","content":"Steamburg is an award-winning puzzle adventure game with story exploration elements and unique gameplay. The game is made by Telehorse, a steampunk games company. It was awarded the Best Upcoming Game at IMGA in San Francisco in March 2017.   The main character, professor Vincent Cornelius Moore, fights robots that invaded the city of Steamburg. […]"}]