[{"link":"https://nmac.to/blog/ifunia-video-converter/","image":"https://nmac.to/wp-content/uploads/2018/03/iFunia-Video-Converter.png","title":"iFunia Video Converter 6.7.0 – All-in-one Video Converter APP","content":"iFunia Video Converter is a very easy to use and versatile Mac video format converter that allows you to edit and convert between nearly all HD/SD format videos.   With iFunia Video Converter Mac it is a super simple way to convert HD videos: H.264/MPEG-4 AVC, AVCHD (*.m2ts, *.mts), MKV, HD WMV and convert videos […]"},{"link":"https://nmac.to/blog/isoftphone/","image":"https://nmac.to/wp-content/uploads/2016/05/iSoftPhone.png","title":"iSoftPhone 4.2.5 – Advanced softphone application (was iSoftPhone Pro)","content":"iSoftPhone (was iSoftPhone Pro) is an advanced softphone with video for OS X using VoIP to provide crystal clear voice quality in an attractively sleek interface. The quick configuration will allow you to get talking to other iSoftPhone users in seconds. iSoftPhone is integrated with the OS X address book to make calls and manage […]"},{"link":"https://nmac.to/blog/morph-age/","image":"https://nmac.to/wp-content/uploads/2016/12/Morph-Age4.png","title":"Morph Age 5.1.1 – Morph faces, warp images","content":"Morph Age (was Morph Age Express) is an application for morphing faces and warping images on OS X.   Morph Age works by allowing you to define curves on one or more images and changes based on those curves are reflected in the resulting image through the corresponding distortion and morphing effect.   Definitely Mac  […]"},{"link":"https://nmac.to/blog/pdf-to-powerpoint/","image":"https://nmac.to/wp-content/uploads/2021/02/PDF-to-PowerPoint.png","title":"PDF to PowerPoint 2.0 – Easy conversion of PDF to PowerPoint format","content":"Flyingbee PDF to PowerPoint Converter exports PDF files to editable and modifiable Microsoft Office PowerPoint documents quickly and efficiently, You don’t need to spend time reformatting your output PowerPoint presentation, text, layouts, graphics are placed in the right places so that you can easily modify the content or present them to your audiences directly.   […]"},{"link":"https://nmac.to/blog/pdf-to-excel/","image":"https://nmac.to/wp-content/uploads/2021/02/PDF-to-Excel.png","title":"PDF to Excel 2.0.3 – Easy conversion of PDF to Excel format","content":"PDF to Excel for Mac convert PDF tables into fully editable Microsoft Excel spreadsheets and recovers all the numbers, text, and layout in the PDF tables, it helps you spend less time retyping, low money, copying-and-pasting PDF data, as it quickly and accurately turns your native PDF files to editable Microsoft Excel spreadsheet(.xlsx), retaining text […]"},{"link":"https://nmac.to/blog/alba-a-wildlife-adventure/","image":"https://nmac.to/wp-content/uploads/2021/02/Alba-A-Wildlife-Adventure.png","title":"Alba: A Wildlife Adventur‪e‬ 1.2.1 – Together, we got this","content":"From the BAFTA-Award winning studio behind Monument Valley and Assemble with Care comes something entirely new!   Join Alba as she visits her grandparents on a Mediterranean island. She is ready for a peaceful summer of wildlife exploration with her friend Ines, but when she sees an animal in danger, she realises she needs to […]"},{"link":"https://nmac.to/blog/slash-quest/","image":"https://nmac.to/wp-content/uploads/2021/02/Slash-Quest.png","title":"Slash Quest 1.2 – A big talking sword adventure","content":"The Queen’s evergrowing talking sword is lost in a faraway land. Luckily you showed up to wield it back to the castle. You do know how to swing a sword, right? Right?!   Forget your power fantasy. Slash Quest’s simple yet unfamiliar controls will put you in the shoes of an unlikely knight with a […]"},{"link":"https://nmac.to/blog/lumen/","image":"https://nmac.to/wp-content/uploads/2021/02/lumen.png","title":"lumen‪ 1.2 – Puzzle your way with light","content":"lumen. is a puzzle game with unique mechanics, where you have to solve levels using lights, lenses and mirrors.   You will find yourself in the old attic and discover the mysterious antique box of Ms. Olivia McLumen, who lived in Scotland over a hundred years ago and was a great inventor of her time, […]"},{"link":"https://nmac.to/blog/the-bradwell-conspiracy/","image":"https://nmac.to/wp-content/uploads/2021/02/The-Bradwell-Conspiracy.png","title":"The Bradwell Conspiracy 176.1384f – Will You Uncover the Truth","content":"Following a sudden explosion at the Stonehenge Museum fundraiser, you find yourself trapped in a hidden underground complex. Your only means of escape is by sending photographs of your surroundings to another survivor confined elsewhere. But before long, a disturbing truth begins to dawn…   Created by a team of award-winning BAFTA luminaries and AAA […]"},{"link":"https://nmac.to/blog/south-of-the-circle/","image":"https://nmac.to/wp-content/uploads/2021/02/South-of-the-Circle.png","title":"South of the Circle 1.2 – Love. Memory. Survival Game","content":"A narrative adventure game by the BAFTA winning studio State of Play.   Antarctica, 1964.   A crashed aircraft, tail to the sky.   Cambridge academic Peter stumbles from the wreckage in search of help, fighting the cold. As his attempts to escape the ice grow more desperate, the lines between his past and present […]"}]