[{"link":"https://nmac.to/blog/leap/","image":"https://nmac.to/wp-content/uploads/2018/05/Leap4.png","title":"Leap 4.0.4 – Comprehensive file management application [FIX]","content":"Leap is a combination Spotlight, Bridge, Finder, and more. The Finder on OS X is slow, cumbersome, and limited. The Finder search interface is very cumbersome. Leap shows you all your files and more importantly – where they are on your computer. No other tool does this. Works great for images and PDF’s, too. Leap […]"},{"link":"https://nmac.to/blog/textual/","image":"https://nmac.to/wp-content/uploads/2017/10/Textual7.png","title":"Textual 7.2.1 – Lightweight IRC client [FIX]","content":"Textual is a lightweight IRC client created specifically for OS X. It was designed with simplicity in mind. Textual has taken the best of IRC and built it into a single client. Its easy-to-use functionality combined with scripting support makes it an ideal IRC client for novice to advanced users.   Version 7.2.1: Apple Silicon […]"},{"link":"https://nmac.to/blog/weather-guru/","image":"https://nmac.to/wp-content/uploads/2016/02/Weather-Guru.png","title":"Weather Guru 2.5.2 – Accurate Weather Forecasts","content":"Weather Guru is a beautiful and highly accurate weather app for your Mac. With its gorgeous and easy to use interface, the app provides live weather forecasts, helpful notifications and always keeps you updated with hourly data for 7 days ahead.   KEY FEATURES: Get live weather updates at any location (day/date/time all displayed clearly) […]"},{"link":"https://nmac.to/blog/netspot-pro/","image":"https://nmac.to/wp-content/uploads/2014/07/NetSpot-Pro.png","title":"NetSpot Pro 2.14.1033 – Wireless survey tool","content":"NetSpot is a simple and accessible wireless survey tool for Mac users, which allows collecting, visualizing and analyzing Wi-Fi data using any MacBook.   NetSpot can visualize your wireless network by building a visual Wi-Fi map. It will let you see dead zones without coverage and place hotspots (Access Points) correctly. Using the visualized map […]"},{"link":"https://nmac.to/blog/inboard/","image":"https://nmac.to/wp-content/uploads/2017/09/Inboard1.png","title":"Inboard 1.1.6 – Image, Screenshot and Photo Organizer","content":"Inboard helps you organize your screenshots and photos like your own private, desktop-based version of Pinterest. It helps you to organize images that otherwise get lost in Finder and serves as an inspiration you can browse through to get inspired for your next project.   Inboard is built creative types – great for designers, photographers […]"},{"link":"https://nmac.to/blog/quickres/","image":"https://nmac.to/wp-content/uploads/2015/12/QuickRes.png","title":"QuickRes 4.9 – Quickly switch resolutions on your Retina display","content":"QuickRes is the quickest and easiest way to switch between screen resolutions on your Mac. With the MacBook Pro with Retina Display, you can set your resolution all the way up to an extreme 3840 x 2400! With other Macs, you can set your resolutions to things you’ve never seen before, including a HiDPI mode, […]"},{"link":"https://nmac.to/blog/fresh/","image":"https://nmac.to/wp-content/uploads/2018/05/Fresh4.png","title":"Fresh 4.0.4 – File managing app [FIX]","content":"Fresh allows you to instantly find attachments you download, no matter what weird name they have. Rename files that you just downloaded, then file them with a single click.   Filed Documents is a place where Fresh will file items by date, helping keep you organized. With Fresh you can easily find any file – […]"},{"link":"https://nmac.to/blog/textsniper/","image":"https://nmac.to/wp-content/uploads/2021/02/TextSniper.png","title":"TextSniper 1.7.0 – Capture text from your screen [FIX]","content":"TextSniper is an easy-to-use desktop Mac OCR app that can extract and recognize any non-searchable and non-editable text on your Mac’s screen. As an extra feature, it can turn OCR text into speech. It is a super convenient alternative to complicated optical character recognition tools.   The tool is intuitive to use and makes extracting […]"},{"link":"https://nmac.to/blog/jupiter-hell/","image":"https://nmac.to/wp-content/uploads/2020/10/Jupiter-Hell.png","title":"Jupiter Hell 1.1 – Turn-Based Strategy & RPG Game","content":"Jupiter Hell is a classic, turn-based roguelike set in a 90’s flavored sci-fi universe. Set on the moons of Jupiter, the game pits a lone space marine against overwhelming demonic forces. Rip and tear zombies, demons and unmentionable monstrosities, using classic weaponry such as shotguns, chainguns, railguns and the trusty chainsaw. All to the shine […]"},{"link":"https://nmac.to/blog/the-jackbox-party-pack-8/","image":"https://nmac.to/wp-content/uploads/2021/11/The-Jackbox-Party-Pack-8.png","title":"The Jackbox Party Pack 8 1.0.0 – Party Board Game","content":"The eighth installment of the beloved Jackbox Party Pack franchise is here! Five hilarious new games will energize your next game night, holiday party, happy hour, or video call.    No extra controllers needed – players use their phones or tablets to play along! Got a bigger group? Play with up to 10 players and […]"}]