[{"link":"https://nmac.to/blog/oh-my-mind-mapping-2/","image":"https://nmac.to/wp-content/uploads/2017/10/Oh-My-Mind-Mapping-2.png","title":"Oh! My Mind Mapping 2 1.1.14 – Organize your ideas in the most convenient way","content":"Memorize ideas or organize your brainstorming process in the most convenient way with Oh My Mind Mapping 2. Pick all your ideas together and create a clear mind map. Visual diagrams will help you to keep in mind any flow of information!   DIFFERENT PRE-INSTALLED TYPES OF VISUALIZATION One-sided mind map; Tree-structured; Fish-shaped; Sun-shaped.   […]"},{"link":"https://nmac.to/blog/download-buddy/","image":"https://nmac.to/wp-content/uploads/2017/10/Download-Buddy.png","title":"Download Buddy 1.8.5 – Easy-to-use Internet-download manager","content":"Download Buddy is a sophisticated but extremely easy-to-use Internet-download manager. It supports everything you need for stress-free and reliable downloading and does not disturb you with useless features or meaningless gimmicks.   Features Start multiple downloads with just one mouse click. Context menu to start your downloads directly from Safari or every other application that […]"},{"link":"https://nmac.to/blog/particles/","image":"https://nmac.to/wp-content/uploads/2016/07/Particles.png","title":"Particles 2.4.4 – Create professional Cocos2D particle emitters","content":"Particles gives you the power to create professional Cocos2D particle emitters in minutes for iOS and OS X. Customize your emitter by using the sliders or fine tune it with exact numbers. Change the colours, preview with a background or use a custom texture for the particles. Save your emitters to a plist file easily […]"},{"link":"https://nmac.to/blog/fluctus/","image":"https://nmac.to/wp-content/uploads/2017/10/Fluctus.png","title":"Fluctus 3.9.1 – Audio file editor for the most basic audio engineering needs","content":"Fluctus is the audio editor for both the newcomer and the expert. We strived to create a clean user interface without loss of functionality and customisation. Fluctus includes a unique processing engine, that we call cDSP. By designing our own audio engine, we added power and flexibility with extraordinary efficiency.   Features Editing and recording […]"},{"link":"https://nmac.to/blog/auction-listing-designer/","image":"https://nmac.to/wp-content/uploads/2017/10/Auction-Listing-Designer.png","title":"Auction Listing Designer 5.84.1 – Create beautiful and professional auction listings","content":"Auction Listing Designer helps you create beautiful and professional auction listings.   Features Create professional listings – Add unlimited number of images, paragraphs and hyper links with the simple to use drag and drop editor. Save, update and reuse – Save your customized listing designs and make copies of your work so you can increase […]"},{"link":"https://nmac.to/blog/mawatermarker/","image":"https://nmac.to/wp-content/uploads/2017/02/maWatermarker.png","title":"maWatermarker 1.5.1 – Simple and easy to use watermark utility","content":"maWatermarker is a simple and easy to use watermark utility.Watermark pictures with text (multi line) or images, one by one or in batch mode. Supported file types: JPEG, PNG, TIFF.   Options define relative position of the watermark x/y offset rotation angle opacity shadow shadow color shadow x/y offset shadow radius font type font size […]"},{"link":"https://nmac.to/blog/goodsync/","image":"https://nmac.to/wp-content/uploads/2014/07/GoodSync.png","title":"GoodSync Pro 10.6.1 – Backup and file synchronization software","content":"GoodSync for Mac is easy and reliable file backup and file synchronization software. It automatically analyzes, synchronizes, and backs up your emails, precious family photos, contacts, MP3s, financial documents, iTunes, and other important files locally – between desktops, laptops, servers, external drives, and mobile devices, as well as remotely with FTP, SFTP, WebDAV (including MobileMe), […]"},{"link":"https://nmac.to/blog/airstreamer/","image":"https://nmac.to/wp-content/uploads/2017/01/AirStreamer-for-Apple-TV.png","title":"AirStreamer 1.6 – for Apple TV","content":"AirStreamer is a better way to play non-quicktime videos on Apple TV.   There are two ways to play non-quicktime videos (MKV, AVI, WMV…) on Apple TV now: Convert them to quicktime format. Download an Apple TV video player. But all of them are inconvenient: Video conversion takes a long time to complete. Apple TV […]"},{"link":"https://nmac.to/blog/gn-templates-bundle-for-iwork/","image":"https://nmac.to/wp-content/uploads/2017/10/GN-Templates-Bundle-for-iWork.png","title":"GN Templates Bundle for iWork 1.6 – Templates for iWork","content":"Bundle for iWork by GN is the perfect tool for users of iWork who desires quickly and easy create high-quality Banners, Headers, Infographics or Twitter and Facebook covers. This set offers over 550 templates and textures.   Focus on content – leave design for us. Just in minutes create professional looking works!   FEATURES:   […]"},{"link":"https://nmac.to/blog/battle-chasers-nightwar/","image":"https://nmac.to/wp-content/uploads/2017/10/Battle.Chasers.Nightwar.png","title":"Battle Chasers: Nightwar 1.0 – RPG Turn-Based Combat Game","content":"Battle Chasers: Nightwar is an RPG inspired by the classic console greats, featuring deep dungeon diving, turn-based combat presented in a classic JRPG format, and a rich story driven by exploration of the world. Classic turn-based combat inspired by the console RPG greats, with a unique overcharge mana system and incredible Battle Bursts. Beautiful, randomly-generated […]"}]