[{"link":"https://nmac.to/blog/favs-v1-3/","image":"https://nmac.to/wp-content/uploads/2013/12/Icon.175x175-7510.png","title":"Favs v1.3 – The app for all your Internet favorites","content":"Favs is a favourites manager for all your favourite Web and social media content. After all, if you are using social networks, you are also creating favorites: on Facebook you ‘like’, on Twitter and Google Reader you ‘star’, on Delicious and Pinboard you ‘bookmark’ and so on. Find Favorites: Instead of spreading your favorites across […]"},{"link":"https://nmac.to/blog/choco-v1-4-2/","image":"https://nmac.to/wp-content/uploads/2013/12/Choco1.png","title":"Choco v1.4.2 – Design photo collages","content":"Choco is the ultimate photo collage designer, loaded with more than 100 helpful templates, layout generators, frames, shadows and built-in effects to bring your images to life. Templates library Choco features more than 100 pre-built templates, divided into helpful categories: Classic – Create classic collages with a clean-and-simple grid layout, featuring fixed numbers of rows […]"},{"link":"https://nmac.to/blog/calcmadeeasy-v3-0/","image":"https://nmac.to/wp-content/uploads/2013/12/icon.175x175-7524.png","title":"CalcMadeEasy v3.0 – Financial planning, scientific calculations and unit conversions","content":"CalcMadeEasy is a versatile app which makes it easy to do financial planning/decision making, scientific/mathematical calculations, unit conversions and notes. It’s like 4 apps in 1 at one low price, NO extra packages to purchase later. Once start using this, you won’t go to other calculator. Whether you are casual user, school/college student, in finance […]"},{"link":"https://nmac.to/blog/mypoint-pro-v1-3/","image":"https://nmac.to/wp-content/uploads/2013/12/AppIcon_Pro.175x175-75.png","title":"myPoint Pro v1.3 – Coordinates tool for Mac desktop","content":"myPoint Pro combines five tools in one: Crosshairs, Grille, Coordinates, Mouse Locator and Shade. All tools are customizable: hotkeys, color, opacity, size, thickness, offset.   myPoint will show its information above all other windows and applications, even when other application is active or in full screen.   Crosshairs tool displays two thin lines according mouse position. […]"},{"link":"https://nmac.to/blog/spotlife-v1-0-4/","image":"https://nmac.to/wp-content/uploads/2013/12/DesktopCalApp.175x175-75.png","title":"Spotlife 1.0.4 – Desktop-based calendar viewer","content":"Spotlife is the fastest, easiest way to view the important happenings in your life.   Spotlife puts your calendar directly on your desktop, so it’s always available to you. Press a keyboard shortcut at any time from any application, and the Desktop Calendar will zoom forward above all other windows — now you’ll truly be […]"},{"link":"https://nmac.to/blog/snapper-v2-0-6/","image":"https://nmac.to/wp-content/uploads/2013/12/27160.png","title":"Snapper v2.0.6 – Audio file player and converter and more","content":"What’s Snapper? When you select an audio file in the Mac Finder, Snapper immediately appears right beneath the current window, showing you the wave form.  Play: Hit the space bar or double-click in the wave form to play. Or use auto-play to start playing the moment you select the file. Vari-speed is available too. Drag, […]"},{"link":"https://nmac.to/blog/im-away-v1-3/","image":"https://nmac.to/wp-content/uploads/2013/12/icon.175x175-7526.png","title":"I’m Away v1.3 – Change all your IM statuses with one click","content":"I’m Away is a simple utility that helps you change your statuses in the most popular Instant Messengers on Mac with one click only. Change your status in Skype, iChat, and Adium with one hotkey you choose yourself. Features: Changes statuses simultaneously; Compatible with iChat, Skype and Adium; Supports customizable hotkeys. Control your statuses with […]"},{"link":"https://nmac.to/blog/iclipboard-v4-1-8/","image":"https://nmac.to/wp-content/uploads/2013/12/iClipboard.175x175-751.png","title":"iClipboard 4.1.8 – A flexible clipboard manager","content":"iClipboard automatically keeps a history of everything you copy to the clipboard from any application. You can then paste any clipping from the history five different ways:   1) the Shelf on the side of the screen. 2) the special menu in the menu bar. 3) the Rapid-Fire hot key. 4) the Services menu. 5) […]"},{"link":"https://nmac.to/blog/image-smith-v1-2-7/","image":"https://nmac.to/wp-content/uploads/2013/12/298161.png","title":"Image Smith v1.2.7 – Powerful batch image processing tool","content":"Image Smith is a powerful batch image processing tool. With a variety of features you can easily scale, reorient, recolorize, convert, and flatten images. Image Smith can open numerous different picture file types, and output in the most common industry standard formats like JPEG, GIF, and PNG. Use the numerous predefined presets in Image Smith to […]"},{"link":"https://nmac.to/blog/moviechapterizer-v4-98/","image":"https://nmac.to/wp-content/uploads/2013/12/233222.png","title":"MovieChapterizer v4.98 – Add chapter names to your movies","content":"MovieChapterizer provides an easy way to add chapter names into movies you can view with QuickTime Player. Use MovieChapterizer to add chapter names to numerous points in your movies by simply moving the playhead slider and entering chapter names wherever you want. Then open the movie in QuickTime Player and the chapter popup button allows you […]"}]