[{"link":"https://nmac.to/blog/ifoto-montage-2-6-1067/","image":"https://nmac.to/wp-content/uploads/2016/09/iFoto-Montage.png","title":"iFoto Montage 2.6.1067 – Easy Mosaic Photo Maker","content":"iFoto Montage is a special photomontage maker to create stunning mosaic photo with many tile-images. The advanced tiling techniques and special effects empower you to create photo collage in shape with ease. And you can also perfect the montage photo with micro-image pattern, repetition, grid and border options and other splendid features.   As a […]"},{"link":"https://nmac.to/blog/falcon-1-4-3/","image":"https://nmac.to/wp-content/uploads/2016/06/Falcon.png","title":"Falcon 1.4.3 – A simple, markdown based note-taking app","content":"Falcon is a simple, markdown based note-taking app.   Features Write notes, journals and research Organise notes in multiple notebooks for various topics Supports adding images to your notes Search notes easily by their title, content or tags Editor-only and Preview-only modes allow to edit and read notes in an uncluttered and focused way. Backup […]"},{"link":"https://nmac.to/blog/bundle-for-wedding-1-2/","image":"https://nmac.to/wp-content/uploads/2016/09/Bundle-for-Wedding.png","title":"Bundle for Wedding 1.2 – Templates for wedding planning","content":"Bundle for Wedding is an excellent tool for organizing the beautiful and memorable wedding you’ve been dreaming of, providing you with unique templates for Pages documents, spreadsheet templates for Numbers, first-class slideshow themes for Keynote, and illustrations. Focus on your exciting plans and leave the invitations and other paperwork to us to us!   All […]"},{"link":"https://nmac.to/blog/virginia-1-0/","image":"https://nmac.to/wp-content/uploads/2016/09/Virginia.png","title":"Virginia 1.0 – A single-player first-person thriller Game","content":"1992. George H. W. Bush and Boris Yeltsin officially put an end to the Cold War. Barcelona held the summer Olympic Games. The Tonight Show aired its last show with Johnny Carson…   … and Lucas Fairfax disappeared from his bedroom in Kingdom, Virginia.   Synopsis. Virginia is a single-player first-person thriller set in a […]"},{"link":"https://nmac.to/blog/lastfight-1-02/","image":"https://nmac.to/wp-content/uploads/2016/09/LASTFIGHT.png","title":"LASTFIGHT 1.02 – Bringing 2v2 3D fighting back to your living room!","content":"Pick up any available object in one of the 8 stages and teach your opponents a lesson!   Play in local multiplayer mode, for up to 4 players, or one-player story mode, with a cast of 10 characters inspired by the comic book LASTMAN.   LASTFIGHT is the perfect game to play with friends on […]"},{"link":"https://nmac.to/blog/the-bunker-1-0/","image":"https://nmac.to/wp-content/uploads/2016/09/The.Bunker.png","title":"The Bunker 1.0 – Action, Horror & Adventure Game","content":"As the last remaining survivor in a nuclear bunker, John’s daily routine is the one thing that keeps him sane. But when an alarm goes off, his mind starts to self destruct. He has to venture into long forgotten areas, recovering long repressed memories and unlocking the dark secrets of The Bunker.   The Bunker […]"},{"link":"https://nmac.to/blog/layouts-for-keynote-3-0-1/","image":"https://nmac.to/wp-content/uploads/2016/09/Layouts-for-Keynote3.png","title":"Layouts for Keynote 3.0.1 – Keynote themes with customizable elements","content":"Layouts for Keynote is a collection of themes created for unique slideshows. Outline your ideas, proposals, contracts, and solutions. Then, enhance them with stylish backgrounds, charts, diagrams, tables, and other data-visualization elements to attain all you have been working for.   Each theme contains 20 master slides, covering everything from basic bullet layouts to complex […]"},{"link":"https://nmac.to/blog/business-mix-for-pages-3-0-1/","image":"https://nmac.to/wp-content/uploads/2015/07/Business.Mix_.for_.Pages2_.png","title":"Business Mix for Pages 3.0.1 – business templates for Apple Pages","content":"Business Mix Set gives a boost to the chemistry between you and your clients! Pick up 146 professional and stylish business templates for Apple’s Pages application.   Business Mix Set presents an excellent kit of 146 templates for Pages, from business cards and newsletters to proposals and various project management forms. Some of the templates […]"},{"link":"https://nmac.to/blog/corporate-packs-for-pages-3-0-1/","image":"https://nmac.to/wp-content/uploads/2016/09/Corporate-Packs-for-Pages.png","title":"Corporate Packs for Pages 3.0.1 – Collection of professional Pages templates","content":"Corporate Packs for Pages gives your Pages documents a new look! It features packs with different designs. Each of them contains more than 80 layouts for virtually any type of documents you may need in your office. Give your clients and partners a “wow” moment!   Each pack contains up to 41 different templates, from […]"},{"link":"https://nmac.to/blog/inspiration-set-for-pages-4-0-1/","image":"https://nmac.to/wp-content/uploads/2016/07/Inspiration-Set-for-Pages.png","title":"Inspiration Set for Pages 4.0.1 – Unique page-template designs for Apple Pages","content":"Inspiration Set for Pages includes a large range of templates, providing a wide selection of documents, from business cards and jewel case covers to brochures and books.   Some templates contain up to 28 different sections, so the package provides an ample array of over 700 layouts to meet your most exclusive requirements. Each and […]"}]