[{"link":"https://nmac.to/blog/inotepad/","image":"https://nmac.to/wp-content/uploads/2018/05/iNotepad3.png","title":"iNotepad 5.7 – Write and perfectly organize all your texts and notes","content":"Write and manage from one location hundreds or even thousands of texts. iNotepad is an app designed specifically to allow you to write and perfectly organize all your texts and notes. Try it now and it will soon become essential for all aspects related to writing texts with your Mac. Designed to support all the […]"},{"link":"https://nmac.to/blog/lotto-wizard/","image":"https://nmac.to/wp-content/uploads/2021/12/Lotto-Wizard.png","title":"Lotto Wizard 2.2 – Lottery wheeling system","content":"Lotto Wizard uses advanced statistical analysis to select the most popular winning patterns consisted of active, average and passive numbers. Our lottery software works with almost all lotto-type lotteries that draw 5-6 numbers out of a number pool from 1 to 99. It covers 180 major lotteries. Its build-in Suggested sequence Wizard lets you to […]"},{"link":"https://nmac.to/blog/super-lrc-player/","image":"https://nmac.to/wp-content/uploads/2021/11/Super-LRC-Player.png","title":"Super LRC Player 7.1.2 – A MP3 player showing local lrc","content":"Synchronous display local lrc file content while mp3 playing   You can drag the transparent lyrics window to any position, You can set the font size and font color for lyrics in Preference.   Operation Instructions: Click the ‘Add mp3(s) and lrc(s)’ button; Choose the both mp3 files(s) and lrc file(s); Attention, the related lrc […]"},{"link":"https://nmac.to/blog/movist/","image":"https://nmac.to/wp-content/uploads/2018/11/Movist22.png","title":"Movist Pro 2.8.1 – Media player with a high-quality caption feature and more","content":"Movist Pro is a movie player for Mac OS X based on QuickTime and FFmpeg. Supports QuickTime and FFmpeg Customizable high quality caption Supports smi, srt format captions Playlist support Media playback control Full screen control panel Simple user interface Universal binary   Version 2.8.1: Resolved a damaged app issue Resolved a YouTube issue (macOS 10.15 […]"},{"link":"https://nmac.to/blog/minicad/","image":"https://nmac.to/wp-content/uploads/2021/11/MiniCAD.png","title":"MiniCAD 4.4.5 – DWG/DXF/DWF file viewer","content":"MiniCAD is a fast and easy-to-use DWG/DXF/DWF(AutoCAD R14-R2017) file viewer.   Features Open various DXF, DWG versions ( R14-R2017) and DWF Identify literal fonts and entity color correctly Layer properties management, on/off, freeze/thaw, lock/unlock Properties palette displays details Print with plot styles and plot to PDF View both 2D objects and 3D models   Version […]"},{"link":"https://nmac.to/blog/radarscope/","image":"https://nmac.to/wp-content/uploads/2021/06/RadarScope.png","title":"RadarScope 4.5.4 – Display utility for weather enthusiasts and meteorologists","content":"RadarScope is a specialized display utility for weather enthusiasts and meteorologists that allows you to view NEXRAD Level 3 radar data and severe weather warnings. It can display the latest reflectivity, velocity, and other radar products from any NEXRAD radar site in the United States, Guam, or Puerto Rico. These aren’t smoothed PNG or GIF […]"},{"link":"https://nmac.to/blog/optimage/","image":"https://nmac.to/wp-content/uploads/2019/07/Optimage.png","title":"Optimage 3.5.1 – Image optimization using advanced algorithms","content":"Optimage is an advanced image-optimization tool to minimize images in a visually lossless way for websites, apps, storage, and sharing. It uses advanced metrics to automatically adjust image quality for up to 10x smaller image files that are visually perceived as originals. Maximum compression ratio is achieved by exhaustively trying various compression parameters and image-data […]"},{"link":"https://nmac.to/blog/bookmacster/","image":"https://nmac.to/wp-content/uploads/2017/05/BookMacster2.png","title":"BookMacster 2.12.4 – Organize and manage bookmarks, sync across browsers","content":"BookMacster, the Bookmarks Master for your Mac, is compatible with iCloud’s Safari. Choose one, two, or all three: Manage Browser Bookmarks. Add alphabetizing and tagging. Verify, fix dupes, consolidate. Cross-Browser Syncing. Sync bookmarks of Safari Firefox, Chrome, and more among all your devices. Central Store. Keep your bookmarks in one central store, accessible within web […]"},{"link":"https://nmac.to/blog/synkmark/","image":"https://nmac.to/wp-content/uploads/2021/01/Synkmark.png","title":"Synkmark 2.12.4 – Keeps Safari, Chrome, and Firefox bookmarks in sync","content":"Synkmark is your bridge for keeping bookmarks in sync among Safari, Firefox, Opera, Vivaldi and Google Chrome. Synkmark can also keep your bookmarks alphabetized as you prefer, verified and free of duplicates. Synkmark is compatible with iCloud Safari, Firefox Sync, Opera Sync and Sign in to Chrome, so that if you use these apps on […]"},{"link":"https://nmac.to/blog/ia-writer/","image":"https://nmac.to/wp-content/uploads/2016/12/iA-Writer4.png","title":"iA Writer 5.6.16 – Distraction-free digital writing tool","content":"iA Writer is a digital writing tool that makes sure that all your thoughts go into the text instead of the program. Here is what makes iA Writer different: Character: No preferences. It is how it is. It works like it works. Love it or hate it. Signal vs Noise: Focus mode allows me to […]"}]