[{"link":"https://nmac.to/blog/battery-health/","image":"https://nmac.to/wp-content/uploads/2018/06/Battery-Health.png","title":"Battery Health 6.0 – Monitor Battery Stats and Usage","content":"With Battery Health, you can easily see all the important information about your MacBook’s battery, such as current charge level, battery capacity, power usage, number of times it has been charged and much more.   Be sure to check out the ‘Tips’ section within the app to learn a host of useful ways to improve […]"},{"link":"https://nmac.to/blog/drm-converter/","image":"https://nmac.to/wp-content/uploads/2018/03/DRM-Converter.png","title":"DRM Converter 6.1.0 – DRM removal and conversion for music and audiobooks","content":"DRM Converter for Mac is a professional DRM removal app that easily converts iTunes M4P, DRM-protected audio and Apple Music to MP3 or AAC. Batch-convert iTunes DRM-protected or unprotected music to MP3, AAC, AC3, M4A, MKA, AIFF, or AU files, ready for use on any computer or mobile music devices such as iPad, iPhone, PSP, […]"},{"link":"https://nmac.to/blog/akvis-magnifier/","image":"https://nmac.to/wp-content/uploads/2018/09/AKVIS-Magnifier.png","title":"AKVIS Magnifier 9.5 – Algorithmically enlarge images to high resolution","content":"AKVIS Magnifier allows you to enlarge images to high resolution with sophisticated algorithms. AKVIS Magnifier upscales digital images with advanced enlargement algorithms, preserving edge to edge image sharpness while improving image appearance by removing unwanted noise and compression artifacts. Get super-high resolution pictures and produce stunning enlargements and poster-size prints. The sophisticated algorithms keep edges […]"},{"link":"https://nmac.to/blog/arq/","image":"https://nmac.to/wp-content/uploads/2016/09/arq5.png","title":"Arq 5.13.2 – Online backup to Google Drive, Amazon Glacier, SFTP","content":"Arq is super-easy online backup for the Mac. Back up to your own Google Drive storage (15GB free storage), your own Amazon Glacier ($.01/GB per month storage) or S3, or any SFTP server. Arq backs up and faithfully restores all the special metadata of Mac files that other products don’t, including resource forks, ACLs, and […]"},{"link":"https://nmac.to/blog/paprika-recipe-manager/","image":"https://nmac.to/wp-content/uploads/2014/01/Paprika-Recipe-Manager.png","title":"Paprika Recipe Manager 2.2.1 – Simple recipe management for everyone","content":"Paprika Recipe Manager is a delightfully simple recipe management for everyone: from aspiring cooks to professional chefs. With ingredient scaling, grocery lists and meal planning, Paprika is the perfect kitchen companion. If you love to cook, Paprika will be most useful app you’ve ever downloaded!   Features: Automatically download recipes with a single tap from […]"},{"link":"https://nmac.to/blog/iphone-data-recovery/","image":"https://nmac.to/wp-content/uploads/2018/09/iPhone-Data-Recovery.png","title":"iPhone Data Recovery 2.2.0 – Recover Deleted Data on iPhone","content":"Your best choice to recover the deleted notes, calendar, reminder and other personal information on iPhone, iPad or iTunes backup.   When you delete a note, for example, on an iPhone, the first place it goes is to the Recently Deleted folder. Emptying the recycle bin makes this note invisible, but doesn’t actually remove it. […]"},{"link":"https://nmac.to/blog/max-payne-3/","image":"https://nmac.to/wp-content/uploads/2018/09/Max.Payne_.3.png","title":"Max Payne 3 1.0.009388 – Third-Person Shooter Game","content":"For Max Payne, the tragedies that took his loved ones years ago are wounds that refuse to heal. No longer a cop, close to washed up and addicted to pain killers, Max takes a job in São Paulo, Brazil, protecting the family of wealthy real estate mogul Rodrigo Branco, in an effort to finally escape […]"},{"link":"https://nmac.to/blog/raw-right-away/","image":"https://nmac.to/wp-content/uploads/2016/08/Raw-Right-Away.png","title":"Raw Right Away 4.0.1 – Browsing raw camera files faster! In Finder","content":"Browse faster! In Finder, select a Nikon Raw (.NEF), Canon Raw 2 (.CR2), Sony Raw (.ARW) or JPEG file and press spacebar to display the image – the system will invoke Raw Right Away to generate an enhanced preview that includes photo metadata and a graphical summary of exposure settings. Best of all: it’s very […]"},{"link":"https://nmac.to/blog/akvis-smartmask/","image":"https://nmac.to/wp-content/uploads/2018/09/AKVIS-SmartMask.png","title":"AKVIS SmartMask 10.5 – Application/plug-in for making selections on images","content":"AKVIS SmartMask is an efficient selection tool that saves time and is fun to use. Selection has never been so simple! There are many occasions when you need to target a specific area of an image; image when selecting this area, it is often necessary to highlight a great number of simple regions to which […]"},{"link":"https://nmac.to/blog/munin/","image":"https://nmac.to/wp-content/uploads/2018/09/Munin.png","title":"Munin 1.0 – Casual Adventure & Puzzle Game","content":"Imagine you could move mountains – literally! With realistic physics, Norse runes, rotating platforms and a lot of gray cells you’ll help Munin, Odin’s messenger in her very own 2D-adventure, to reclaim her power on a journey through Yggdrasil.   VENTURE TO A WORLD OF NORSE MYTHOLOGY Munin the raven, faithful messenger to Odin, now […]"}]