[{"link":"https://nmac.to/blog/macscan/","image":"https://nmac.to/wp-content/uploads/2016/01/MacScan.png","title":"MacScan 3.1 – Security tool detect trojan horses and spyware","content":"MacScan – designed exclusively for Mac OS X, and including full support for Apple’s latest release of OS X 10.11–provides protection against the continued growth of malware by offering advanced detection and removal of security and privacy threats.   MacScan makes it easy to protect against malware with an intuitive interface and enhanced scan capabilities. […]"},{"link":"https://nmac.to/blog/cleangenius/","image":"https://nmac.to/wp-content/uploads/2017/08/CleanGenius.png","title":"CleanGenius 5.0 – Clean up junk files and monitor disk space","content":"CleanGenius offers the easiest way to scan and clean your Mac in seconds, saving the disk space and keeping your Mac clean and healthy.   Features Fast Clean – Scan and clean your Mac in seconds. It will remove the user caches, logs, trash, Safari Internet caches, and more, making you regain the valuable disk […]"},{"link":"https://nmac.to/blog/movavi-audio-converter/","image":"https://nmac.to/wp-content/uploads/2017/08/Movavi-Audio-Converter.png","title":"Movavi Audio Converter 1.0.0 – Easy music converter for Mac","content":"Looking for a fast and easy-to-use app that converts music and video to a range of different audio formats? Just install Movavi Audio Converter! The speed and performance champion, this app will never get in the way of work or other activities on your Mac. Just run the conversion and keep using your computer as […]"},{"link":"https://nmac.to/blog/hemingway-editor/","image":"https://nmac.to/wp-content/uploads/2014/10/Hemingway-Editor.png","title":"Hemingway Editor 3.0.3 – Word processor supporting markdown","content":"Hemingway Editor makes your writing bold and clear.   Hemingway Editor for Mac and PC highlights common errors. Use it to catch wordy sentences, adverbs, passive voice, and dull, complicated words. Use Hemingway Editor wherever you write – on the train, at the beach, or in a coffee shop with spotty Wi-Fi. As long as […]"},{"link":"https://nmac.to/blog/diskkeeper-pro/","image":"https://nmac.to/wp-content/uploads/2016/06/DiskKeeper-Pro.png","title":"DiskKeeper Pro 1.4.15 – Disk, Cache, System Clean and Uninstaller Tool","content":"DiskKeeper Pro – Cleaner & Uninstaller in 1 tool. The utility that makes difference.   PRIMARY CLEANING FEATURES Applications cache and junk data Browsers cache (Safari, Firefox, Chrome) User logs (keeping you protected and junk free) Email cache Trash can   ADVANCED FEATURES Launch Quick Clean from the menu bar Automatic cleanup when preset junk […]"},{"link":"https://nmac.to/blog/stellar-volume-optimizer/","image":"https://nmac.to/wp-content/uploads/2014/07/Stellar.Volume.Optimizer.png","title":"Stellar Volume Optimizer 2.0.0.3 – Scan, Repair & create backup of Mac volume(s)","content":"Stellar Volume Repair is the most powerful and secure utility to rebuild a Mac’s damaged volume directory. It uses a unique mechanism, which backup the data from the old directory and replaces it with a new one. In addition, it repairs corrupted files and folders on partitions making them error-free. Moreover, the software checks for […]"},{"link":"https://nmac.to/blog/brochure-maker/","image":"https://nmac.to/wp-content/uploads/2017/07/Brochure-Maker.png","title":"Brochure Maker 1.1.0 – Design beautiful brochures","content":"Brochure Maker is the easiest way to design beautiful and effective brochures for your business or organization. With the intuitive drag-and-drop design tools, you’ll be creating great-looking brochures in minutes — even if you have no prior design experience.   This app takes away the challenge of designing and formatting a brochure. Simply select a […]"},{"link":"https://nmac.to/blog/email-designer-pro/","image":"https://nmac.to/wp-content/uploads/2017/07/Email-Designer-Pro.png","title":"Email Designer Pro 1.1.0 – Create & send mail designs","content":"Email Designer Pro ( Mail Master ) is the easiest way to design beautiful emails for business or personal use. Simply drag and drop images, text, buttons, clip art, shapes, and even maps onto an email canvas, then send it to your mailing list with a click.   Design amazing emails for your business, school, […]"},{"link":"https://nmac.to/blog/chatty-for-hangouts/","image":"https://nmac.to/wp-content/uploads/2017/07/Chatty-for-Google-Hangouts.png","title":"Chatty for Hangouts 1.9.5 – Desktop client for Google Hangouts","content":"Chatty for Hangouts (was Hangouts Plus) is beautiful, native desktop client for Google Hangouts which supports Hangouts Video Hangouts on Air and Chat.   Features Apple Messages UI style for Hangouts All-in-one design–buddies, conversations, and chat in a single window Support Hangouts video call Hangouts on Air video Support SMS Phone call with Google Voice […]"},{"link":"https://nmac.to/blog/iconiq/","image":"https://nmac.to/wp-content/uploads/2017/07/Iconiq.png","title":"Iconiq 2.1 – Versatile icon generator","content":"Iconiq could be the only icon generator you’ll ever need. Do you simply want to take your icon design and automatically generate all the needed icons, depending on the platform, without the fuss of going through them one by one? Do you want to be able to do it with a single click? Look no […]"}]