[{"link":"https://nmac.to/blog/archive-expert-5-01/","image":"https://nmac.to/wp-content/uploads/2014/03/Archive.Expert.png","title":"Archive Expert 5.01 – File archive manager tool","content":"Archive Expert is a professional, full-featured file archive manager tool. It help you to Browse, Extract, Create, Modify, Split multiple file archives. View, preview files, show advanced file information inside archives.   EXTRACTION FORMATS zip, rar, 7z, lha, zipx, stufflt, hqx, bin, gzip, gz, tgz, tar-gz, bz2, bzip2, bz, txz, tar, iso, cdi, nrg, mdf, […]"},{"link":"https://nmac.to/blog/receiptbox-2-0/","image":"https://nmac.to/wp-content/uploads/2014/03/receiptbox.png","title":"ReceiptBox 2.0 – Keep track of your receipts","content":"ReceiptBox is a very easy to use application designed to help you keep track of your receipts.   Features: Organize your receipts into multiple accounts. Import-export to file Receipts templates Autocompletes receipt data Search into records Print report Total amount per expenses category   Version 2.0: Export to Excel file (XLS) Auto save Crop tool […]"},{"link":"https://nmac.to/blog/quickmailer-1-3/","image":"https://nmac.to/wp-content/uploads/2014/03/QuickMailer.png","title":"QuickMailer 1.3 – Send emails quickly and easily through your menu bar","content":"With QuickMailer, sending emails have never been more snappy than with the help of this neat tool in your menubar. QuickMailer sends emails using your primary Mail App account, so no configuration is needed. It also looks up your previous recipients to provide auto-completion. You have the possibility of making the app remember individual fields […]"},{"link":"https://nmac.to/blog/optimal-layout-2-2-26/","image":"https://nmac.to/wp-content/uploads/2014/03/Optimal-Layout.png","title":"Optimal Layout 2.2.26 – Move, resize, and reorganize windows","content":"Optimal Layout (formerly WindowFlow Pro) makes organizing your application windows a breeze: Keyboard commands allow you to smoothly move and resize windows that snap into alignment. Window tiling instantly reorganizes a messy group of overlapping windows to optimally fill your screen. Window switching that lists all your open app windows, even those that are minimized […]"},{"link":"https://nmac.to/blog/radium-3-0-6/","image":"https://nmac.to/wp-content/uploads/2014/03/Radium.png","title":"Radium 3.0.6 – Multi-network radio player","content":"Radium is an Internet radio player that’s designed from the ground up to be simple, intuitive, and lightweight. With its powerful search, thousands of supported stations (including Sirius/XM and DI.fm/Sky.fm Premium), and the ability to add your own streams, Radium will change the way you listen to Internet radio.   Version 3.0.6: Proper app icon […]"},{"link":"https://nmac.to/blog/full-diskfighter-1-4-1/","image":"https://nmac.to/wp-content/uploads/2014/03/FULL-DISKfighter.png","title":"FULL-DISKfighter 1.4.1 – Discover extra space on your Mac","content":"FULL-DISKfighter keeps your Mac free of junk. With three powerful utilities in one, you can easily find unneeded files, review what’s taking up space (and delete what you don’t need) and remove those duplicate files you didn’t know you had.   With FULL-DISKfighter, you get 3 valuable tools in 1 app: Fast Cleaner – Clean […]"},{"link":"https://nmac.to/blog/escapes-1-1-0/","image":"https://nmac.to/wp-content/uploads/2014/03/Escapes.png","title":"Escapes 1.1.0 – ANSI NFO DIZ ASC viewer/editor","content":"Escapes is an ANSI NFO DIZ ASC viewer/editor for Mac OS X.   Feature roundup: Admire ANSi art of any kind. Easy. All types supported. Built-in editor for ASCII art (NFO, DIZ, ASC) and text files. Retina Engine: renders both ANSi and ASCII art in high DPI. Retina UI: a gorgeous interface and stunning file […]"},{"link":"https://nmac.to/blog/quadranto-1-4-1/","image":"https://nmac.to/wp-content/uploads/2014/03/Quadranto.png","title":"Quadranto 1.4.1 – Manage tasks in a 4-zone layout (was Eisenpower)","content":"Quadranto (was Eisenpower) is all about getting something done. The app is based on a quite popular productivity method known as The Eisenhower Principle.   Dwight D. Eisenhower, 34th President of the United States, came up with the idea that every single task can be qualified by the criteria important/ not important and urgent/ not […]"},{"link":"https://nmac.to/blog/macaw-0-7-5/","image":"https://nmac.to/wp-content/uploads/2014/02/Macaw.png","title":"Macaw 0.7.5 – The code-savvy web design tool","content":"Stop writing code. Start drawing it.   Macaw provides the same flexibility as your favorite image editor but also writes semantic HTML and remarkably succinct CSS. It’s time to expect more from a web design tool.   Fluid canvas and grid Macaw is engineered for fluid widths. Resize the canvas and your grids and elements […]"},{"link":"https://nmac.to/blog/hibari-1-5-9/","image":"https://nmac.to/wp-content/uploads/2014/03/Hibari.png","title":"Hibari 1.5.9 – Powerful Twitter client with tweet filtering and user muting","content":"Hibari is a powerful Mac Twitter app that blocks annoyances and reveals gems.   Block Keywords: Hibari blocks tweets you don’t want to see based on keywords you choose. You can also block all retweets.   Mute Users: No more stressing about whether to follow someone. In Hibari, you can temporarily mute any user if […]"}]