[{"link":"https://nmac.to/blog/lifeslide/","image":"https://nmac.to/wp-content/uploads/2021/01/Lifeslide.png","title":"Lifeslide 1.2.0 – A metaphorical journey","content":"Take flight as a paper plane as you embark on a metaphorical journey through seven stages of life.   Lifeslide is a new take on flying games where gravity is your engine. The braver you are, the better you will fly. Dive down close to the ground to increase your speed and make split-second decisions […]"},{"link":"https://nmac.to/blog/guildlings/","image":"https://nmac.to/wp-content/uploads/2021/01/Guildlings.png","title":"Guildlings 1.2.1 – Wizards and Wifi","content":"This summer, you and your best friends are heading out on a quest. You’ll climb through dark tunnels to reach mystical mountain temples. You’ll test your wits against goblins, ghosts and sentient coffeemakers. You might even save the world from tearing itself apart.   What do you need to get this quest started? A magical […]"},{"link":"https://nmac.to/blog/hogwash/","image":"https://nmac.to/wp-content/uploads/2021/01/Hogwash.png","title":"Hogwash 1.0.2 – Multiplayer Barnyard Bedlam","content":"A succulent serving of multiplayer barnyard bedlam, Hogwash is guaranteed to have you squealing with delight!   Pitching one player against three in a race against the clock, this color-soaked rasher of chaos is the ultimate team-based, feel-good game.   Will you side with the bumbling farmhand as he struggles to keep the farm squeaky-clean? […]"},{"link":"https://nmac.to/blog/worlds-end-club/","image":"https://nmac.to/wp-content/uploads/2021/01/Worlds-End-Club.png","title":"World’s End Club 1.0.1 – Twelve kids, A 1200km journey","content":"A new type of action-adventure game that fuses a thrilling story with 2D side-scrolling action.   A “dream team” adventure game with scenario written by Zero Escape series creator, Kotaro Uchikoshi, and Danganronpa’s Kazutaka Kodaka as creative director.   Game features Simple controls A fusion of 2D scrolling puzzle-action game and story-adventure game Key player […]"},{"link":"https://nmac.to/blog/murder-mystery-machine/","image":"https://nmac.to/wp-content/uploads/2021/01/Murder-Mystery-Machine.png","title":"Murder Mystery Machine 1.5 – Episodic Detective Puzzler","content":"A politician murdered in his home, a detective with baggage and a rookie with a hidden purpose…   Join detectives Cassandra Clarke and Nate Houston as they investigate a simple murder that soon entwines the two into a complex, interconnected series of crimes that’s anything but an open-and-shut-case.   Murder Mystery Machine is a compelling […]"},{"link":"https://nmac.to/blog/promesa/","image":"https://nmac.to/wp-content/uploads/2021/01/Promesa.png","title":"Promesa 24.11.2020 – Story Rich, Walking Simulator Game","content":"Promesa is a personal project born from a conversation between a grandfather and his grandchild, where you wander through their dreams and memories.   While listening to someone trying to remember their experiences, past and present blend together, forming a stream of images that are both personal and shared.   From memories of homes and […]"},{"link":"https://nmac.to/blog/retina-5k-wallpaper-set/","image":"https://nmac.to/wp-content/uploads/2021/01/Retina-5K-Wallpaper-Set.png","title":"Retina 5K Wallpaper Set 3.4.1 – Beautiful images for desktop","content":"A big collection of unique professional images in 5K resolution.   Variety of categories, simple interface, photos from all over the world — all these features make Retina 5K Wallpaper Set an excellent app for desktop decoration.   BIG CHOICE OF IMAGES Various categories available: sunset, animals, sea and much more.   WALLPAPER MANAGER Preview […]"},{"link":"https://nmac.to/blog/passwordtool/","image":"https://nmac.to/wp-content/uploads/2017/12/PasswordTool.png","title":"PasswordTool 1.1.3 – Generate random passwords","content":"PasswordTool is a simple application that quickly and easily generates random passwords.   Version 1.1.3: Fixes an UI glitch that occured when using macOS 11.   Intel, 64-bit processor OS X 10.10 or later    "},{"link":"https://nmac.to/blog/xscan/","image":"https://nmac.to/wp-content/uploads/2017/01/xScan_4.png","title":"xScan 4.5.5 – Computer monitoring tool","content":"xScan allows you to monitor the behavior and health of your computer.   Main Features: Modern user interface where you can drag and drop the widgets of your choice on a main window For each widget, you can setup amazing display options You can configure the display differently for each computer according to the specific […]"},{"link":"https://nmac.to/blog/reiboot/","image":"https://nmac.to/wp-content/uploads/2018/12/ReiBoot-Pro.png","title":"ReiBoot Pro 7.5.3 – One click solution to enter/exit iOS recovery mode","content":"ReiBoot enables you to fix various iOS system issues without losing a single byte, like recovery mode, white Apple logo, black screen, looping on start. etc.   ReiBoot not only helps get iPhone out of recovery mode and fix common stuck issues, but also downgrade iPhone software, fix Apple TV problem and other 50 + […]"}]