[{"link":"https://nmac.to/blog/altos-odyssey/","image":"https://nmac.to/wp-content/uploads/2020/06/Altos-Odyssey.png","title":"Alto’s Odyssey 1.0.7 – Discover the endless desert","content":"Just beyond the horizon sits a majestic desert, vast and unexplored.   Join Alto and his friends and set off on an endless sandboarding journey to discover its secrets.   Soar above windswept dunes, traverse thrilling canyons, and explore long-hidden temples in a fantastical place far from home.   Along the way, you’ll grind across […]"},{"link":"https://nmac.to/blog/altos-adventure/","image":"https://nmac.to/wp-content/uploads/2020/06/Altos-Adventure.png","title":"Altos Adventure 1.0.3 – A serene snowboarding odyssey","content":"Above the placid ivory snow lies a sleepy mountain village, brimming with the promise of adventure.   Join Alto and his friends as they embark on an endless snowboarding odyssey. Journey across the beautiful alpine hills of their native wilderness, through neighbouring villages, ancient woodlands, and long-abandoned ruins.   Along the way you’ll rescue runaway […]"},{"link":"https://nmac.to/blog/calendarique/","image":"https://nmac.to/wp-content/uploads/2016/09/Calendarique2.png","title":"Calendarique 4.1 – Calendar widget for Notification Center and menu bar","content":"Calendarique is there whenever you need it: simply slide out Notification Center to get an overview of any month. Colored marks for each category of events are right there in the monthly view. No need to select a specific date to see whether business or family events are scheduled, or if it’s just a holiday […]"},{"link":"https://nmac.to/blog/onyx/","image":"https://nmac.to/wp-content/uploads/2019/08/OnyX37.png","title":"OnyX 3.8.2 – Maintenance and optimization tool for macOS Catalina 10.15","content":"OnyX is a multifunction utility that you can use to verify the startup disk and the structure of its system files, to run miscellaneous maintenance and cleaning tasks, to configure parameters in the Finder, Dock, Safari, and some of Apple’s applications, to delete caches, to remove certain problematic folders and files, to rebuild various databases […]"},{"link":"https://nmac.to/blog/medieval-ii/","image":"https://nmac.to/wp-content/uploads/2018/11/Medieval-II-Total-War.png","title":"Medieval II: Total War 1.1.1 – Medieval Historical Strategy Game","content":"Rally to the standard and light up the Dark Ages in this classic Total War game of real-time battles and turn-based strategy.   As a warrior king, expand your area of influence and consolidate power with an artful mix of diplomacy, commerce and war.   Rule wisely across the campaign map to build your empire’s […]"},{"link":"https://nmac.to/blog/transport-fever/","image":"https://nmac.to/wp-content/uploads/2018/02/Transport-Fever.png","title":"Transport Fever 18381 – A railroad-focused tycoon game","content":"Transport Fever is a railroad­-focused tycoon game. Players start in 1850 and build up a thriving transport company. As an emerging transport tycoon, the player constructs stations, airports, harbors and makes money by connecting areas requiring transport services.   Construct complex road­-rail-water-air networks in the endless game and experience more than 150 year of transportation […]"},{"link":"https://nmac.to/blog/simcity-4-de/","image":"https://nmac.to/wp-content/uploads/2014/04/SimCity4.png","title":"SimCity 4 Deluxe Edition 1.2.1 – The classic city simulation game returns to the Mac","content":"In SimCity 4, you don’t just build your city; you breathe life into it. Sculpt mountains, dig riverbeds, and seed forests as you lay the groundwork for your creation. Then, use your god-like powers to construct the most realistic metropolis you can imagine.   Whether you want to build mansions on mountainsides or cross canyons […]"},{"link":"https://nmac.to/blog/cities-in-motion-2/","image":"https://nmac.to/wp-content/uploads/2013/08/Cities.in_.Motion.2.png","title":"Cities in Motion 2 Include DLCs 1.6.3 – Popular mass transit simulation game [32bit ONLY]","content":"Cities in Motion 2 is the sequel to the popular mass transit simulation game Cities in Motion. Build, manage and lead your transportation network to provide cities with their ever changing needs. CIM2 introduces new features including multiplayer game modes, day and night cycles, timetables and dynamic cities.   Building the transportation network will directly […]"},{"link":"https://nmac.to/blog/check-off/","image":"https://nmac.to/wp-content/uploads/2017/06/Check-Off.png","title":"Check Off 5.8 – To-do list for your menu bar","content":"Check Off is a to-do list that sits in your menu bar. Simply click the check mark and your personal to-do list will appear. Organize your tasks by folder and label Add notes to each task Finder-like labels Notes have full font support, and can contain links to websites and local files The ability to […]"},{"link":"https://nmac.to/blog/calendar-366/","image":"https://nmac.to/wp-content/uploads/2020/01/Calendar-366-II20.png","title":"Calendar 366 II 2.8.4 – Complete menu-bar calendar","content":"Calendar 366 II helps you keep track of appointments and to-do’s, meetings and deadlines, birthdays and dates. Anything a calendar can do, Calendar 366 II can do better — and all functions can be adjusted easily and intuitively. Individual Display – Pick your preferences – year or month, week or day, list or not, from […]"}]