[{"link":"https://nmac.to/blog/qr-capture/","image":"https://nmac.to/wp-content/uploads/2021/01/QR-Capture.png","title":"QR Capture 2.3 – Advanced QR Scanner","content":"The most simple & easy QR Reader. Capture QR codes like you would do on phone. Perfect for computer beginners.   FEATURES Code Scanner – scans QR codes (screen or camera*) Drag & Drop on icon to scan Scan your clipboard for a QR code Full screen scan (File->Full Screen scan, App Icon->Full Screen scan) […]"},{"link":"https://nmac.to/blog/subtitle-studio/","image":"https://nmac.to/wp-content/uploads/2017/06/Subtitle-Studio1.png","title":"Subtitle Studio 1.5.4 – A complete subtitle solution","content":"Subtitle Studio is the only subtitle solution you will ever need: find, adjust, edit, create, embed. Everything in one app — and we are just getting started.   It’s great to watch movies in their original language. Subtitles help everybody enjoy the movie. With Subtitle Studio, it’s as easy as 1-2-3, or maybe even easier. […]"},{"link":"https://nmac.to/blog/bom-2/","image":"https://nmac.to/wp-content/uploads/2017/02/Boom21.png","title":"Boom 2 1.6.13 – System-wide pro audio app for Mac","content":"Boom 2 is a system-wide volume booster and equalizer app that is designed especially for OS X 10.10 Yosemite.   It comes with a smart interface, self-calibrates itself according to your Mac, offers hands-on advanced equalizer controls for finer audio control and amazing audio effects for enhanced audio output. You get a personalized acoustic experience […]"},{"link":"https://nmac.to/blog/xline/","image":"https://nmac.to/wp-content/uploads/2016/03/xLine_3.png","title":"xLine 3.0 – Mind-mapping application","content":"xLine allows you to visually organise your thoughts or ideas.A mind map is considered a great way to brainstorm and generate more ideas. It helps you create a number of small ideas from one big idea, to see how different ideas could be connected, and to create a plan of action.   Visualize your plan […]"},{"link":"https://nmac.to/blog/weclean-pro/","image":"https://nmac.to/wp-content/uploads/2021/01/WeClean-Pro.png","title":"WeClean Pro 3.3.0 – Cleaner and uninstaller app","content":"WeClean can clean trash, logs, and cache files to free up hard drive space. Its Duplicates and Old Files Finder can further clean up more space for users.Uninstaller can remove application related files.   Key Feature:   System Cleanup WeClean can clean trash, logs, and cache files to free up hard drive space.   Photo […]"},{"link":"https://nmac.to/blog/xplan4-desktop/","image":"https://nmac.to/wp-content/uploads/2021/01/xPlan4-Desktop.png","title":"xPlan4 Desktop 4.0.3 – Project management with Gantt charts","content":"You can finally create Gantt charts without scratching your head. Our product shines thanks to its ease of use and simplicityWe focus our attention on the features that the majority of project managers actually use. In addition, the generated charts are both beautiful and visually appealing. A picture is worth a thousand words.   Main […]"},{"link":"https://nmac.to/blog/textastic/","image":"https://nmac.to/wp-content/uploads/2020/07/Textastic_5.png","title":"Textastic 5.0 – Simple text, code, and markup editor","content":"Textastic is a simple and fast text, code, and markup editor. With support for more than 80 source code and markup languages, it brings the powerful syntax coloring engine of the popular iOS code editor to the Mac: Syntax highlighting for more than 80 languages Compatible with TextMate syntax definitions and themes Code completion for […]"},{"link":"https://nmac.to/blog/thundersoft-file-lock/","image":"https://nmac.to/wp-content/uploads/2021/01/ThunderSoft-File-Lock.png","title":"ThunderSoft File Lock 1.0.0 – Lock and protect your files","content":"ThunderSoft File Lock is an easy to use software to protect your files on Mac computer. It provides an easy way to hide your personal files and folders, prevent them from opening, copying, modification and deletion. The hidden files are completely invisible, no one can find them on your computer, and you can switch the […]"},{"link":"https://nmac.to/blog/pyka-unlimited/","image":"https://nmac.to/wp-content/uploads/2018/04/Pyká-Unlimited.png","title":"Pyká Unlimited 1.0.20 – Takes your project library to a whole new level","content":"Pyká is a revolutionary new project library app and the world’s first Work Hub. Designed for people who work in project-based environments, Pyká takes your project library to a whole new level. There are many challenges and problems that arise when individuals or teams work on projects. While many solutions exist to help people manage […]"},{"link":"https://nmac.to/blog/mirethmusic/","image":"https://nmac.to/wp-content/uploads/2018/11/mirethMusic.png","title":"mirethMusic 4.5.0 – Rip, convert, burn and play MP3, WAV, AAC, M4A and more","content":"Discover the easy way to rip, convert, burn and play MP3, WAV, unprotected WMA, AAC, M4A, M4B, MP2, Ogg Vorbis, AIFF and midi on Mac OS. mirethMusic is easy to use and includes all the features you need from a converter, CD Ripper, CD Burner, Player, ID3 Tag editor. Convert most formats – MP3, WMA, […]"}]