[{"link":"https://nmac.to/blog/onetrash-v2-0-1/","image":"https://nmac.to/wp-content/uploads/2013/12/OneTrash.175x175-75.png","title":"OneTrash v2.0.1 – Select files to delete from the trash","content":"OneTrash erases items from your Trash. Individually.  Main features – Remove Files (Icons Mode). – Remove Folders (Icons Mode). – Remove all items (List Mode). – Repair System Trash for TimeMachine issues. WHAT’S NEW Version 2.0.1: Fixed menu bar icon issue. REQUIREMENTS Intel, Mac OS X 10.6.6 or later ScreenShots :         […]"},{"link":"https://nmac.to/blog/tofu-v2-0/","image":"https://nmac.to/wp-content/uploads/2013/12/TOfU_std.175x175-75.png","title":"TOfU v2.0 – Upload your media to Facebook quickly","content":"TOfU (Totally Osm Facebook Uplaoder) is the quickest way to upload your pictures and videos to Facebook. Uploading pictures and videos was never this easy, drag and drop files onto the dock icon, select an album name from your Facebook albums or make a new album and then start uploading. OSX Lion Users : Click […]"},{"link":"https://nmac.to/blog/reclip-clipboard-history-v2-1/","image":"https://nmac.to/wp-content/uploads/2013/12/Icon.175x175-7511.png","title":"ReClip clipboard history v2.1 – Keep all history on your clipboard","content":"ReClip keep a history of all the text that you copied. By clicking on any item in the history it comes back to the clipboard. REQUIREMENTS Mac OS X 10.8 or later, 64-bit processor ScreenShot :         online marketing BitShare Click Here Uploaded Click Here SlingFile Click Here RapidGator Click Here 1fichier […]"},{"link":"https://nmac.to/blog/rapid-note-v2-0/","image":"https://nmac.to/wp-content/uploads/2013/12/Icon.175x175-7512.png","title":"Rapid Note v2.0 – Take notes rapidly whenever and wherever you need to","content":"Rapid Note enables you to rapidly write or paste in short notes. It is as little intrusive as possible, lives in system status bar area and won’t chew up your system resources. Press a key combination, enter note and get back to what you’ve been doing. If you need, you can export them to plain […]"},{"link":"https://nmac.to/blog/chronoslider-2-0-6/","image":"https://nmac.to/wp-content/uploads/2013/12/Icon.175x175-7513.png","title":"ChronoSlider 2.0.6 – Manage alarms and timers","content":"ChronoSlider is a nice tiny tool to help you manage alarms, timers and reminders with a unique user interface.   Define a global hotkey and set an alarm or timer with only two mouse clicks. You choose the alarm time and a predefined alarm message with sliding your mouse across the screen.   Features: Global […]"},{"link":"https://nmac.to/blog/webradio-v1-47/","image":"https://nmac.to/wp-content/uploads/2013/12/lesicones.175x175-751.png","title":"WebRadio v1.47 – Radio stations","content":"WebRadio can simply listen to French radio stations and other radio stations of your choice on your Mac. A discreet icon gives you access to the main function: – Display of logo and information radio (title song) – Ability to add their own radio – Touring favorites for quick access to radio – Pause function […]"},{"link":"https://nmac.to/blog/super-image-resizer-v3-1-1/","image":"https://nmac.to/wp-content/uploads/2013/12/Super_Image_Resizer.175x175-75.png","title":"Super Image Resizer v3.1.1 – Image resizing and transformation","content":"Super Image Resizer is very handy Mac OS application for image resizing and transformation. Resize single or hundreds of image files into user defined destination image size in no time. It allows you to resize image formats like JPEG, JPEG2000, PNG, TIFF, GIF and BMP as well as many more image formats. Simple four steps […]"},{"link":"https://nmac.to/blog/tab-for-google-pro-v3-1/","image":"https://nmac.to/wp-content/uploads/2013/12/APPL-PRO.175x175-752.png","title":"Tab for Google+ Pro v3.1 – Provides real-time google+ access from your menu bar","content":"Tab for Google+ Pro is the complete app for all your Google+ needs. By removing all advertisements and giving you a host of new features, we’ve made the best even better! Simply put, this is the best and only Google+ app you will ever need for your Mac. Be at the forefront of your social activity […]"},{"link":"https://nmac.to/blog/Pieces/","image":"https://nmac.to/wp-content/uploads/2013/12/Pieces.175x175-75.png","title":"Pieces v1.03 – Combine or divide complexly structured files","content":"Pieces helps you manage your files by letting you divide large files into multiple smaller ones. Conversely, it can also consolidate disparate component files into a single file, making it your one-stop solution for dealing with complexly structured files. You may have downloaded files from the Internet ending in .001, .002 (*) etc and not known […]"},{"link":"https://nmac.to/blog/mailtab-pro-for-gmail-v5-4/","image":"https://nmac.to/wp-content/uploads/2013/12/APPL-PRO.175x175-753.png","title":"MailTab Pro for Gmail v5.4 – Access Gmail from the menu bar","content":"MailTab Pro for Gmail is an incredibly slick and gorgeous app for quickly accessing your Gmail account directly from your Mac’s menu bar.   Why is MailTab Pro the best Mac app for your Gmail needs? Good question, allow us to explain just how fully loaded this app is: – Instant access to Gmail via […]"}]