[{"link":"https://nmac.to/blog/imageminify-2-19/","image":"https://nmac.to/wp-content/uploads/2016/10/ImageMinify.png","title":"ImageMinify 2.19 – Image resizing and compression","content":"ImageMinify is an image compressor/optimizer for common image-file formats.   Minify PNG, JPEG, JPG, GIF, and SVG image file formats Compress JPEG, JPG, and GIF images Lossless compression of PNG images Lossless compression of SVG images Batch conversion   Version 2.19: Apple developers’ signature update UI component upgrade   Intel, 64-bit processor OS X 10.7 […]"},{"link":"https://nmac.to/blog/graphsketcher-5-17/","image":"https://nmac.to/wp-content/uploads/2016/10/GraphSketcher.png","title":"GraphSketcher 5.17 – A professional graphics designer editor","content":"GraphSketcher is a professional graphics designer editor.   The one thing I couldn’t get it to do was curves. The feature list does say that it supports “curved paths,” but I couldn’t figure it out, despite previously having worked with Inkscape, CorelDRAW, and Illustrator. Other than that, GraphSketcher gracefully handled just about anything that I […]"},{"link":"https://nmac.to/blog/epublr-1-2-2/","image":"https://nmac.to/wp-content/uploads/2016/03/ePublr.png","title":"ePublr 1.2.2 – Convert PDF, FB2, DOC, and TXT books or documents to epub files","content":"ePublr converts all your books or documents into epubs for comfortable reading. It is extremely easy to use. It not only creates copies of your books in a different format, but also optimizes layout, text, and images. All converted books can be easily opened with iBooks for syncing and reading. And for convenience, ePublr contains […]"},{"link":"https://nmac.to/blog/datastorm-4-23/","image":"https://nmac.to/wp-content/uploads/2016/10/DataStorm.png","title":"DataStorm 4.23 – Batch data conversion","content":"DataStorm offers a plethora of options for the conversion of data formats.   Conversion file data between JSON, XML, CSV, PLIST, INI, the .properties and YML Support batch conversion Support customized conversion parameters Support complex data file processing, in particular converter nested JSON files to CSV Support converting to CSV, CSV fields to sort and […]"},{"link":"https://nmac.to/blog/colorsquid-1-2-2/","image":"https://nmac.to/wp-content/uploads/2016/10/ColorSquid.png","title":"ColorSquid 1.2.2 – Create harmonious color schemes and palettes","content":"ColorSquid lets you create aesthetic color schemes and palettes in virtually no time. Inspired by the principles of color theory and good interface design it helps you craft beautiful palettes and schemes in no time.   With ColorSquid you can: Invent new color combinations with no more than one click Explore tints, shades and their […]"},{"link":"https://nmac.to/blog/hide-my-ip-6-1-19/","image":"https://nmac.to/wp-content/uploads/2016/10/Hide-My-IP.png","title":"Hide My IP 6.1.19 – Access Blocked Websites and Enjoy Private Web Surfing","content":"Hide My IP offers you the possibility to protect your online identity without having to deal with complicated procedures. The utility resides in your status bar and can automatically change the IP address at user specified intervals.   Hide your real IP address through a network of servers scattered all over the world Once you […]"},{"link":"https://nmac.to/blog/videotoolbox-1-0-18/","image":"https://nmac.to/wp-content/uploads/2015/09/VideoToolbox.png","title":"VideoToolbox 1.0.18 – Set of video tools for both novices and professionals","content":"VideoToolbox is a set of MP4 an d M4V tools made for both novices and professionals. This app allows you to easily access all your tools in a beautiful and clear interface. You no longer need to launch Quicktime X or Final Cut Pro to simply extract a picture or change the resolution. VideoToolbox will […]"},{"link":"https://nmac.to/blog/noiseless-ck-1-3-2/","image":"https://nmac.to/wp-content/uploads/2016/10/Noiseless.CK_.png","title":"Noiseless CK 1.3.2 – Remove luma and chroma noise from photos","content":"Noiseless CK (was Noiseless Pro) breathes new life into every photo! When taking photos in low light situations, every smartphone, compact camera, or DSLR creates “noise”, small color or light speckles that can ruin an otherwise cool photo. Noiseless CK cleans up digital noise fast, with advanced technology to retain sharp details, with one-click operation, […]"},{"link":"https://nmac.to/blog/mapublisher-9-8-1/","image":"https://nmac.to/wp-content/uploads/2016/06/MAPublisher.png","title":"MAPublisher 9.8.1 – Plugins for Illustrator, cartographic/GIS production","content":"MAPublisher allows you to produce the best quality maps possible in the most efficient and accurate manner.   MAPublisher does just that by allowing you to use the powerful and vast design tools of the major vector graphics applications, Adobe Illustrator and Macromedia FreeHand, in order to produce maps from geographic information systems (GIS) map […]"},{"link":"https://nmac.to/blog/barcode-uv-7-16/","image":"https://nmac.to/wp-content/uploads/2016/10/BarcodeUV.png","title":"Barcode UV 7.16 – Easy and simple custom barcode creator","content":"Barcode UV is a Mac OS X utility that easy and simple custom create more beautiful barcode.   Features: support border style setting. support background and model color setting. support text font, color ,font size, position adjustment setting. support barcode size, checksum, position adjustment setting. support background transparent setting. support save to pdf,png,gif,jpeg,jpg,eps,svg,tiff file format. […]"}]