[{"link":"https://nmac.to/blog/cookn-recipe-organizer/","image":"https://nmac.to/wp-content/uploads/2017/10/Cookn.Recipe.Organizer.png","title":"Cook’n Recipe Organizer 12.14.6 – The Ultimate Recipe Organizer","content":"Cook’n is the perfect solution to organize your personal recipes. When you have entered your personal recipes into Cook’n you can: Create a family Cookbook Share your recipes easily Create menus and meal plans Enhance the recipe by adding photos and stories Get the nutritional facts for your recipes and much more!   Plan daily, […]"},{"link":"https://nmac.to/blog/the-gardens-between/","image":"https://nmac.to/wp-content/uploads/2019/03/The-Gardens-Between.png","title":"The Gardens Between 1.05 – A surreal puzzle adventure game","content":"The Gardens Between is a single-player adventure-puzzle game about time, memory and friendship.   Best friends Arina and Frendt fall into a series of vibrant, dreamlike island gardens peppered with everyday objects from their childhood. Together they embark on an emotional journey that examines the significance of their friendship: the memories they’ve built, what must […]"},{"link":"https://nmac.to/blog/blackguards/","image":"https://nmac.to/wp-content/uploads/2019/03/Blackguards.png","title":"Blackguards Special Edition 1.6 – Turn-Based Tactical & Strategy Game","content":"What happens when the only hope of a threatened world lies not with heroes in shining armor, but in the hands of a band of misfits and criminals? Blackguards, a new turn-based strategy RPG, explores this very question. You will discover over 180 unique hex-based battlegrounds within a dark and mature story of crime, drugs, […]"},{"link":"https://nmac.to/blog/syberia-3/","image":"https://nmac.to/wp-content/uploads/2017/05/Syberia-31.png","title":"Syberia 3 1.5.07 – The next generation in adventure games","content":"The limitless imagination of Benoît Sokal continues in Syberia 3, focusing on an entirely new adventure. After abandoning the island, Kate is found dying on the edge of a river by the Youkole tribe, a nomadic people migrating with their snow ostriches. Stuck in Valsembor village, together they must find a way to continue their […]"},{"link":"https://nmac.to/blog/halo/","image":"https://nmac.to/wp-content/uploads/2019/03/Halo.png","title":"Halo 2.0.4 – First-person shooter action game","content":"Halo… Join the battle. Live the epic adventure yourself. The most anticipated game in Mac history is available now!   You are the last of your kind. Bred for combat, built for war. You will fight on foot, in vehicles, in the air and beneath the surface of a mysterious alien ring orbiting in the […]"},{"link":"https://nmac.to/blog/any-video-converter-ultimate/","image":"https://nmac.to/wp-content/uploads/2017/02/Any-Video-Converter-Ultimate.png","title":"Any Video Converter Ultimate 6.1.10 – 30X Faster Video Conversion, Higher Quality","content":"Any Video Converter Ultimate is simply the best choice for your video conversion needs because it supports all the major file formats and convert them 30X faster than traditional converters. Compatible with over 200 video formats; 30 times faster than traditional converters; Preserve 100% of the original image and audio quality; Optimized output profiles for […]"},{"link":"https://nmac.to/blog/cloudtv/","image":"https://nmac.to/wp-content/uploads/2017/02/CloudTV.png","title":"CloudTV 3.9.9 – International TV on your Desktop","content":"CloudTV allows you to watch over 400 live TV channels from all over the world, as well as download thousands of catch-up programmes from the UK and France, complete with smart playlists and support for AirPlay.   Version 3.9.9: Updated French channels : TF1, TMC, TFX, TF1 Séries Films, LCI, C8, LCP, Public Sénat, BFM […]"},{"link":"https://nmac.to/blog/truberbrook/","image":"https://nmac.to/wp-content/uploads/2019/03/Truberbrook.png","title":"Truberbrook 1.10 – A thrilling mystery-sci-fi adventure game","content":"Enjoy an adventurous vacation to a 1960’s parallel universe! A Sci-Fi-Mystery Adventure Game with handmade scenery.   Imagine yourself on a vacation to Europe in the late sixties. Now, picture yourself as a young American scientist; Hans Tannhauser. Yes, that’s your name in this scenario. While you’re at it, think of Trüberbrook, a remote village […]"},{"link":"https://nmac.to/blog/car-mechanic-simulator/","image":"https://nmac.to/wp-content/uploads/2018/07/Car-Mechanic-Simulator-2018.png","title":"Car Mechanic Simulator 2018 1.5.25.3 – Local garages and dealership repair shops game","content":"Car Mechanic Simulator 2018 challenges players to repair, paint, tune and drive cars.   Find classic, unique cars in the new Barn Find module and Junkyard module. You can even add your self-made car in the Car Editor.   Build and expand your repair service empire in this incredibly detailed and highly realistic simulation game, […]"},{"link":"https://nmac.to/blog/gravel/","image":"https://nmac.to/wp-content/uploads/2019/03/Gravel.png","title":"Gravel 1.0 – Ultimate Off-Road Racing Game","content":"Gravel is the ultimate off-road experience. The most extreme racing game that will let you try out amazing stunts in the wildest places on the planet!   Pure fun, spectacular scenery and no-holds barred competition where each race will turn into a memorable battle!   Take part in the wildest show on the Gravel Channel […]"}]