[{"link":"https://nmac.to/blog/pastebot/","image":"https://nmac.to/wp-content/uploads/2016/12/Pastebot.png","title":"Pastebot 2.4 – Clipboard manager with custom clippings","content":"Pastebot saves everything you copy so that you can quickly recall them in the future. Save and organize frequently-used clippings into custom pasteboards and create keyboard shortcuts to access pasteboards and paste specific clippings. Build filters with a live preview and apply them as you paste. Create keyboard shortcuts to quickly paste using your filters […]"},{"link":"https://nmac.to/blog/myary/","image":"https://nmac.to/wp-content/uploads/2020/08/Myary_2.png","title":"Myary 2.1.0 – Simple diary application","content":"Myary is an easy-to-use app for creating diaries, project documentations, blog entries, and any other text that should be saved in conjunction with a date. Saving your entries. Every single entry will be stored in a separate file and you can freely choose where your entries should be saved to. Myary automatically creates a covenant […]"},{"link":"https://nmac.to/blog/tab-space/","image":"https://nmac.to/wp-content/uploads/2021/01/Tab-Space.png","title":"Tab Space 3.8.2 – Tab Saver & Bookmark manager","content":"Tab Space is a Safari extension app which is born for improving web browsing productivity.   ### Note: this app only works with Safari 12.1 or later version.   Now you can export your saved sessions as text, markdown or HTML!   It mainly includes the following functions: Save your browsing tabs at 1 click […]"},{"link":"https://nmac.to/blog/batchoutput-ppt/","image":"https://nmac.to/wp-content/uploads/2019/04/BatchOutput-PPT.png","title":"BatchOutput PPT 2.2.19 – Automate printing and PDF production from PowerPoint","content":"BatchOutput PPT automates printing and PDF production from Microsoft PowerPoint. Just add PowerPoint files to the BatchOutput PPT list, adjust the settings, and BatchOutput will do the rest automatically. For example, you can print dozens of PowerPoint files with just a click of a button; or leave BatchOutput to work overnight and pick up the […]"},{"link":"https://nmac.to/blog/batchoutput-doc/","image":"https://nmac.to/wp-content/uploads/2018/02/BatchOutput-DOC.png","title":"BatchOutput DOC 2.5.19 – Automate printing and PDF production from Word","content":"BatchOutput DOC automates PDF production and printing from Microsoft Word. Just add Word files to the BatchOutput DOC list, adjust the settings, and BatchOutput DOC will do the rest for you automatically.   BatchOutput DOC offers the following advanced PDF production options: Print and export multiple Word files to PDF automatically Save pages as single […]"},{"link":"https://nmac.to/blog/barner-barcode-batch-scanner/","image":"https://nmac.to/wp-content/uploads/2021/01/Barner-Barcode-Batch-Scanner.png","title":"Barner – Barcode Batch Scanner 1.4.7 – Scan & Verify Barcodes at once","content":"Scan Multiple Barcode Images.   Right tool for professionals that need to scan/verify 10s/100s of QR codes with embedded picture before printing them.   Features: scan multiple barcodes at once* decode message in each barcode detect barcodes that failed to scan sort result by creation date/filename/scan result/decoded message export results into file works with PDF […]"},{"link":"https://nmac.to/blog/textbundle-editor/","image":"https://nmac.to/wp-content/uploads/2020/06/Textbundle_Editor_1.png","title":"Textbundle Editor 1.0.1 – Open, edit and create new Textbundle- and Textpack-files","content":"With Textbundle Editor you can quickly and easily open, edit and create new Textbundle- and Textpack-files.   Customize your Editor It is completely up to you what the text editor should look like. Textbundle Editor allows you to freely set the font, font size, font color, and background color of the text-editor as you like […]"},{"link":"https://nmac.to/blog/plainpad/","image":"https://nmac.to/wp-content/uploads/2020/08/PlainPad_1.png","title":"PlainPad 1.0.1 – Notepad and plain text editor","content":"PlainPad is an editor for plain text files with a clean interface. With its extensive default settings, PlainPad offers a myriad of options to customize the writing environment to your own needs and preferences. Whether quick notes, ideas, tasks or extensive texts, PlainPad offers an environment for all types of writing to put your thoughts […]"},{"link":"https://nmac.to/blog/liquivid-video-improve/","image":"https://nmac.to/wp-content/uploads/2017/12/liquivid-Video-Improve2.png","title":"liquivid Video Improve 2.8.3 – Easy-to-use video and photo correction","content":"liquivid Video Improve (was liquivid) is an intuitive, easy-to-use editor for your videos and photos. Clean up and improve all your captures with a single click, and have more fun viewing and sharing your memories. liquivid fixes lens distortion caused by wide angle lenses (as in most action-cams), removes camera shake and image noise, and […]"},{"link":"https://nmac.to/blog/hydra/","image":"https://nmac.to/wp-content/uploads/2020/06/Hydra_4.png","title":"Hydra 4.5 – Create artistic or photorealistic HDR images","content":"Hydra lets you create beautiful high-dynamic-range (HDR) images by merging multiple exposures, effectively capturing both dark and bright subjects to make it more natural, or to enhance scene drama. A single photo cannot represent the entire dynamic range of light in a scene, due to the physical limitations of the sensor. The picture is either […]"}]