[{"link":"https://nmac.to/blog/similar-image-detector/","image":"https://nmac.to/wp-content/uploads/2014/07/Similar-Image-Detector.png","title":"Similar Image Detector 2.0.0 – Simple and efficient utility for finding similar photos","content":"Do you have many similar images on your Mac and you don’t know how to eliminate them in batches? With Similar Image Detector, you can do it at a click. Similar Image Detector is a simple and efficient utility for finding similar photos on your Mac and organizing them with Trash, Move and Copy functions. […]"},{"link":"https://nmac.to/blog/ams-any-video-to-mp4/","image":"https://nmac.to/wp-content/uploads/2018/12/AMS-Any-Video-To-MP4.png","title":"AMS Any Video To MP4 2.0.0 – Convert video & music to mp4","content":"AMS AnyVideo2MP4 is the fastest, easiest and most powerful utility for Mac to convert video & music to mp4 you want. Enjoy them on iPhone, iPad, Apple TV and Android devices.   Support English, French, German, Portuguese, Spanish, Italian, Japanese.   Version 2.0.0: Release notes were unavailable when this listing was updated.   Intel, 64-bit […]"},{"link":"https://nmac.to/blog/privacyscan/","image":"https://nmac.to/wp-content/uploads/2017/04/PrivacyScan1.png","title":"PrivacyScan 1.9.5 – Seek and destroy privacy threats, secure delete history and wipe tracks","content":"PrivacyScan provides protection by scanning your Mac for files that could compromise your privacy and offers multiple levels of shredding to securely erase them from your system. Now available for demo download! Safely and securely destroy Internet files used for tracking your whereabouts such as cache files, browsing history, cookies, flash cookies and temporary files […]"},{"link":"https://nmac.to/blog/ams-audio-converter/","image":"https://nmac.to/wp-content/uploads/2018/12/AMS-Audio-Converter.png","title":"AMS Audio Converter 2.0.0 – Convert your audio and video files to others audio formats","content":"AMS Audio Converter is a powerful tool, designed to convert your audios and videos files to others audio formats. The converter can analyze every single source file, calculate optimal values for Bit Rate, Sample Rate, Channels and apply calculated values to the output audio. Automatic audio settings preserve maximum sound quality with minimum file size. […]"},{"link":"https://nmac.to/blog/ams-imedia-converter/","image":"https://nmac.to/wp-content/uploads/2018/12/AMS-iMedia-Converter.png","title":"AMS iMedia Converter 2.0.0 – Video & Music converter","content":"AMS iMedia Converter is the powerful utilities for Mac to convert video & music to any format you want, and enjoy them on iPhone, iPad, Apple TV, or Android devices! Not just a converter, but also a editor to clip, crop, rotate, flip, add watermark, add brightness, contrast, saturation, hue, sharpness effect.   Support a […]"},{"link":"https://nmac.to/blog/ams-ringtone-maker/","image":"https://nmac.to/wp-content/uploads/2018/12/AMS-Ringtone-Maker.png","title":"AMS Ringtone Maker 2.0.0 – Application for creating ringtones","content":"With AMS Ringtone Maker, you can create your own ringtones, up to 40 seconds long, using music or video files on your Mac, for your smartphone.   Features: Use the waveform to help you find the right part of your song Zoom in to choose the start and end of your ringtone with sub-second accuracy […]"},{"link":"https://nmac.to/blog/ams-anyvideo2gif/","image":"https://nmac.to/wp-content/uploads/2018/12/AnyVideo2Gif.png","title":"AMS AnyVideo2Gif 2.0.0 – Video & music to gif converter","content":"AMS Any Video To Gif is the fastest, easiest and most powerful utility for Mac to convert video & music to gif you want. Enjoy them on iPhone, iPad, Apple TV and Android devices.   Support English, French, German, Portuguese, Spanish, Italian, Japanese.   Version 2.0.0: Release notes were unavailable when this listing was updated. […]"},{"link":"https://nmac.to/blog/pano2vr/","image":"https://nmac.to/wp-content/uploads/2016/07/Pano2VR.png","title":"Pano2VR 6.0.1 – Converts panoramic images into HTML5, Flash, or QTVR","content":"Pano2VR creates virtual tours for desktop and mobile devices by using a single responsive design. Convert your panoramic images into interactive 360 degree panoramas in HTML5, Flash, or QuickTimeVR.   Version 6.0.1: Release notes were unavailable when this listing was updated.   Intel, 64-bit processor OS X 10.7.1 or later    "},{"link":"https://nmac.to/blog/wordfast-pro/","image":"https://nmac.to/wp-content/uploads/2018/11/Wordfast.Pro_.png","title":"Wordfast Pro 5.6.0 – Powerful Translation Memory Tool For Any Platform","content":"Wordfast Pro 5 is our latest standalone, multi- platform TM tool designed to address the needs of translators, language service providers and multinational corporations. Wordfast Pro 5 offers a complete translation environment that stores your translated content for reuse on future projects, thereby maximizing efficiency, increasing overall consistency and reducing translation costs.    BENEFITS    […]"},{"link":"https://nmac.to/blog/datagrip/","image":"https://nmac.to/wp-content/uploads/2016/07/DataGrip.png","title":"DataGrip 2018.3 – IDE for professional SQL developers","content":"    DataGrip is a new database IDE that is tailored to suit specific needs of professional SQL developers.   Features: Intelligent query console: allows you to execute queries in different modes and provides local history that keeps track of all your activity and protects you from losing your work. Efficient schema navigation: lets you […]"}]