[{"link":"https://nmac.to/blog/filechute-4-6/","image":"https://nmac.to/wp-content/uploads/2016/07/FileChute.png","title":"FileChute 4.6 – Quick Internet file transfer tool","content":"FileChute offers an easier way to send large files. How many times have you tried to email a large file only to have it bounce?   FileChute makes sending files easy. Just drag a file and drop it on FileChute. FileChute puts the file on your Dropbox or website and generates a Web link for […]"},{"link":"https://nmac.to/blog/steam-squad-1-0/","image":"https://nmac.to/wp-content/uploads/2016/07/Steam-Squad.png","title":"Steam Squad 1.0 – Tactical Strategy War-game based on World War I","content":"Steam Squad – tactical wargame, where gameplay takes place at the alternative universe with steampunk details during the times of the Great War amongst colorful anime like settings as if drawn by Miyazaki himself. Game is posing a question what if? What if Tianxian Empire was able to colonize Siberia before Russia did and later […]"},{"link":"https://nmac.to/blog/tom-vs-the-armies-of-hell-1-0/","image":"https://nmac.to/wp-content/uploads/2016/07/Armies-Of-Hell.png","title":"Tom vs. The Armies of Hell 1.0 – A challenging indie Action-Adventure game","content":"Tom vs. the Armies of Hell is a challenging indie Action-Adventure game from Darkmire Entertainment. You play Tom, a down-trodden software-engineer turned reluctant half-demon hero when an experiment gone awry sends his entire office complex plummeting into Hell.   Armed with an experimental gun that turns captured souls into high-tech, multi-colored death, as well as […]"},{"link":"https://nmac.to/blog/usb-lock-4-0-0/","image":"https://nmac.to/wp-content/uploads/2016/07/USB-Lock.png","title":"USB Lock 4.0.0 – Lock and unlock your screen with a usb storage device","content":"USB Lock – Lock and unlock your screen with a usb storage device.   Features: Screen turns black or displays selected image when locked and optional password text box appears when key pressed or mouse clicked. Use global hot key to lock the screen. Does not sleep or shutdown running applications. Leave applications running while […]"},{"link":"https://nmac.to/blog/screenshot-creator-1-0/","image":"https://nmac.to/wp-content/uploads/2016/07/Screenshot-Creator.png","title":"Screenshot Creator 1.0 – Design Screenshots for Your Apps","content":"Design the screenshots of your iOS apps with just a few clicks. Forget those times when you had to pay graphical designers serious money to create screenshots for your app. You can now do that yourself using Screenshot Creator and at just a fraction of the price.   Here is a list of what Screenshot […]"},{"link":"https://nmac.to/blog/franz-3-1-1/","image":"https://nmac.to/wp-content/uploads/2016/03/Franz.png","title":"Franz 3.1.1 – A free messaging app for Slack, Facebook Messenger, WhatsApp and more","content":"Franz is a free messaging app/former Emperor of Austria and combines chat & messaging services into one application. He currently supports Slack, HipChat, Facebook Messenger, Telegram, WhatsApp, Google Hangouts, Skype and Grape. You can download Franz for Mac and he is soon coming to Windows as well.   Franz allows you to add every service several […]"},{"link":"https://nmac.to/blog/excel2plist-3-0-0/","image":"https://nmac.to/wp-content/uploads/2016/07/Excel2Plist.png","title":"Excel2Plist 3.0.0 – Convert (.xls and .xlsx) documents into .plist files","content":"Excel2Plist is a lightweight conversion tool to help developers to improve development efficiency. You can convert your datas or configuration from excel(.xls and .xlsx) document into .plist file or .sqlite database quickly when you develop iOS or Android Apps. And also it will generate corresponding access codes by Objective-C and Java. You just need to […]"},{"link":"https://nmac.to/blog/marble-mountain-1-0/","image":"https://nmac.to/wp-content/uploads/2016/07/Marble.Mountain.png","title":"Marble Mountain 1.0 – An exciting adventure and puzzle game","content":"Marble Mountain combines the retro game play of Marble Madness and Super Monkey Ball with the cinematic experience of Indiana Jones to deliver an exciting adventure anyone can enjoy, but with depth for gamers to master. Balance, roll and puzzle your way through increasingly difficult levels on your way to the top of the mountain. […]"},{"link":"https://nmac.to/blog/forced-showdown-45-612/","image":"https://nmac.to/wp-content/uploads/2016/07/FORCED.SHOWDOWN.png","title":"FORCED SHOWDOWN 45.612 – RPG, Action & Strategy Game","content":"Greetings Human and welcome to FORCED SHOWDOWN: “The only show in the galaxy with lives on the line!” Pick one of the 4 contestants from across the FORCED universe – each a master of their own style of combat – and try to become a superstar of my show, as you battle through worlds of […]"},{"link":"https://nmac.to/blog/7-mages-1-1-31112729/","image":"https://nmac.to/wp-content/uploads/2016/07/7mages.png","title":"7 Mages 1.1.31112729 – RPG fantasy game","content":"The oppressed peasants on Roven Island hire seven mages to protect their homes and crops.   The legendary Roven Island is said to be the place where the gods rested after they created the world. The earth, water and air there are still imbued with magic, which lures magic prospectors. These prospectors conduct savage raids […]"}]