[{"link":"https://nmac.to/blog/cisdem-appcrypt/","image":"https://nmac.to/wp-content/uploads/2016/02/AppCrypt.png","title":"Cisdem AppCrypt 7.0.0 – Password-protect access to your apps","content":"Cisdem AppCrypt is designed specifically for protecting your apps to make sure you’re the only master running your Mac. Simply by setting a password and adding the apps to lock to the lock list, no one is able to access your protected apps without the correct password.   The app does not modify anything in […]"},{"link":"https://nmac.to/blog/terraria/","image":"https://nmac.to/wp-content/uploads/2022/04/Terraria.png","title":"Terraria 1.4.3.6 v2 – 2D Open World Sandbox & Survival Game","content":"Dig, Fight, Explore, Build: The very world is at your fingertips as you fight for survival, fortune, and glory. Will you delve deep into cavernous expanses in search of treasure and raw materials with which to craft ever-evolving gear, machinery, and aesthetics? Perhaps you will choose instead to seek out ever-greater foes to test your […]"},{"link":"https://nmac.to/blog/ziggurat/","image":"https://nmac.to/wp-content/uploads/2022/04/Ziggurat_2.png","title":"Ziggurat 2 16.02.2022 – First Person Shooting Game","content":"Ziggurat is back, and now it’s even better! Use powerful weapons and spells to break through hordes of enemies and explore labyrinthine dungeons in this hectic roguelite FPS, while you improve your skills and discover new equipment. Will you be up to the task?   Evil lurks in the depths As a member of the […]"},{"link":"https://nmac.to/blog/hundred-days/","image":"https://nmac.to/wp-content/uploads/2021/05/Hundred-Days.png","title":"Hundred Days 1.3.3m1 – Winemaking Simulator Game","content":"In Hundred Days you will have complete control of a new Winery. First choose which vines to grow, learn how to grow them and when to harvest. Then following the entire winemaking process deciding on the type of wine you want to produce or the market requires. You will also have to sell the wine […]"},{"link":"https://nmac.to/blog/legend-of-keepers/","image":"https://nmac.to/wp-content/uploads/2020/07/Legend-of-Keepers.png","title":"Legend of Keepers: Career of a Dungeon Manager 1.0.9 – Turn-Based Combat Game","content":"In this original mix of Dungeon Management and Roguelite, you will lead your career as a Dungeon Master!   Features Join the Dungeons Company and climb the corporate ladder Crush so-called “heroes” and protect the company’s treasures Hire monsters, manage your employees and your stock of traps Deal with employee strikes and other fun events […]"},{"link":"https://nmac.to/blog/what-the-golf/","image":"https://nmac.to/wp-content/uploads/2020/08/What-the-Golf.png","title":"What the Golf 15.01.2022 – Golf for people who hate golf","content":"A silly physics-based golf parody where every golf course is a new surprising type of golf, some brilliant or hilarious, others so absurd you will ask yourself: WHAT THE GOLF?   Bring your car to the driving range, golf a bird to get a Birdy, or a house and get a Home In One!   […]"},{"link":"https://nmac.to/blog/project-hospital/","image":"https://nmac.to/wp-content/uploads/2018/11/Project-Hospital.png","title":"Project Hospital 1.2.22644 – Management Simulation & Strategy Game","content":"Become an ace doctor, an aspiring architect and a successful manager at the same time. Design your very own hospital, tweak every detail or use one of the predefined models and just jump to the doctor’s duty.   Contract different insurance companies to gain access to patients with interesting medical conditions, perform examinations, laboratory tests […]"},{"link":"https://nmac.to/blog/tunic/","image":"https://nmac.to/wp-content/uploads/2022/03/Tunic.png","title":"Tunic 1.0.t1360 – RPG Exploration Game","content":"Explore a land filled with lost legends, ancient powers, and ferocious monsters in TUNIC, an isometric action game about a small fox on a big adventure. Stranded in a ruined land, and armed with only your own curiosity, you will confront colossal beasts, collect strange and powerful items, and unravel long-lost secrets.   BECOME A […]"},{"link":"https://nmac.to/blog/dead-cells/","image":"https://nmac.to/wp-content/uploads/2020/07/Dead.Cells_.png","title":"Dead Cells 1.18.0 – Pixel Graphics Action-Platformer Game","content":"Dead Cells is a rogue-lite, metroidvania inspired, action-platformer. You’ll explore a sprawling, ever-changing castle… assuming you’re able to fight your way past its keepers in 2D souls-lite combat. No checkpoints. Kill, die, learn, repeat.   You grew up with the roguelikes, witnessed the rise of the roguelites and even the birth of the roguelite-lites? We’d […]"},{"link":"https://nmac.to/blog/ghost-on-the-shore/","image":"https://nmac.to/wp-content/uploads/2022/03/Ghost-on-the-Shore.png","title":"Ghost on the Shore 1.1.4 – Story Rich Exploration Game","content":"You play as Riley, a young woman who finds herself stranded on a desolate island with a headstrong ghost, dead for as long as he can remember.   As you explore the crumbling homes of the vanished islanders and discover their belongings, you get to know the ghost Josh. As you make irrevocable choices in […]"}]