[{"link":"https://nmac.to/blog/promotee-2-0-0/","image":"https://nmac.to/wp-content/uploads/2015/09/Promotee.png","title":"Promotee 2.0.0 – Create pixel-perfect artwork for apps","content":"Promotee is an application to create pixel-perfect and professional looking artwork for iOS, Mac, Apple Watch and Android apps. Just drop a screenshot from your app onto a template in Promotee and our graphics engine will blend it into the template to generate a gorgeous looking result.   You’ve invested hundreds of hours crafting your […]"},{"link":"https://nmac.to/blog/chasing-dead-1-0/","image":"https://nmac.to/wp-content/uploads/2016/03/Chasing.Dead_.png","title":"Chasing Dead 1.0 – A story-based, Sci-fi/Horror First-Person Action Shooter game","content":"The game begins with a strange phenomenon in which another Earth appears in our skies. The curiosity and fear of a doppelganger planet initiates multiple missions in order to make contact with the duplicate Earth. A team of agents, astronauts, and scientists were sent 955,600 miles across space by NASA and the US Military, however […]"},{"link":"https://nmac.to/blog/carnivore-land-1-0/","image":"https://nmac.to/wp-content/uploads/2016/03/Carnivore.Land_.png","title":"Carnivore Land 1.0 – 3D top-down shooter game","content":"Like to chew gum and shoot zombies? Yeah? Cause we’re all outta gum… luckily, there is no shortage of zombies, weapons and ammo in this damned city… Carnivore Land, come for the thrill stay for the kills!   Something smells rotten… it must be the zombies… oh yeah… there are zombies. Lot’s of them… and […]"},{"link":"https://nmac.to/blog/tuneup-2-6-3/","image":"https://nmac.to/wp-content/uploads/2016/03/TuneUp.png","title":"TuneUp 2.6.3 – Fix, clean, and organize your entire iTunes music library","content":"TuneUp is the must-have plug-in for iTunes and Windows Media Player that lets you manage, organize and discover your music library like never before. TuneUp uses cutting-edge acoustic fingerprinting technology to intelligently fix mislabeled song info (like “Track 01” and “Unknown Artist”), fill in missing album artwork and remove duplicate songs. Explore your world of […]"},{"link":"https://nmac.to/blog/stellar-partition-manager-3-0-0-3/","image":"https://nmac.to/wp-content/uploads/2014/06/StellarPartitionManager.png","title":"Stellar Partition Manager 3.0.0.3 – Partition management utility for Mac OS","content":"Stellar Partition Manager is a reliable disk partition Mac utility to manage your Apple partitions safely. This powerful Mac OS disk utility partition manager optimizes your hard drive performance by helping you create, format, delete, hide/reveal, shift and resize different partitions in your Mac hard drive.   Sometimes, you may find your Mac partition to […]"},{"link":"https://nmac.to/blog/lightpaper-1-3-1/","image":"https://nmac.to/wp-content/uploads/2016/03/LightPaper.png","title":"LightPaper 1.3.1 – Markdown editor","content":"LightPaper is a simple, beautiful, powerful, yet free text editor for passionate writers. You can use LightPaper to write any kind of text documents — blogs, articles, notes, READMEs, TODOs, or the next chapter of your new novel. Its simple interface gets out of your way, allowing you to focus on writing. To remove distractions, […]"},{"link":"https://nmac.to/blog/goldfish-4-0-1/","image":"https://nmac.to/wp-content/uploads/2016/03/Goldfish.png","title":"Goldfish 4.0.1- Web design for all devices in a few easy steps","content":"Goldfish is the easy-to-use solution to design stunning, custom websites in very little time, using the latest HTML5 technologies. We come from the creative world, and understand how you think as an illustrator, creative, and designer. All our knowledge and our experience in developing websites, informed by the feedback from the Goldfish community, are now […]"},{"link":"https://nmac.to/blog/franz-0-9-8/","image":"https://nmac.to/wp-content/uploads/2016/03/Franz.png","title":"Franz 0.9.8 – A free messaging app for Slack, Facebook Messenger, WhatsApp and more","content":"Franz is a free messaging app/former Emperor of Austria and combines chat & messaging services into one application. He currently supports Slack, HipChat, Facebook Messenger, Telegram, WhatsApp, Google Hangouts, Skype and Grape. You can download Franz for Mac and he is soon coming to Windows as well.   Franz allows you to add every service several […]"},{"link":"https://nmac.to/blog/epubor-ultimate-3-0-7-1/","image":"https://nmac.to/wp-content/uploads/2016/03/Epubor.Ultimate.png","title":"Epubor Ultimate 3.0.7.1 – Convert eBook formats and remove DRM","content":"Epubor Ultimate lets you convert and remove DRM from eBooks. The software can decrypt and convert eBooks purchased from: Amazon Kindle, Kobo, Sony, Google Play, Barnes, Noble Nook, Smashwords, and even public libraries.   What’s Unique New eBook conversion core developed by Epubor, 5x faster than others Now supports the Kobo DRM version 3.19, which […]"},{"link":"https://nmac.to/blog/typestyler-11-4/","image":"https://nmac.to/wp-content/uploads/2016/03/TypeStyler.png","title":"TypeStyler 11.4 – Classic type styling tool","content":"TypeStyler is a tool for text shaping, styling, flow and layout, expanded further by utilizing Apple’s latest technologies such as Unicode, Core Image, OpenGL, QuickTime and Quartz compositions.   Version 11.4: All installed fonts are available for use in TypeStyler 11.4.   Intel OS X 10.6.6 or later    "}]