[{"link":"https://nmac.to/blog/plist-converter/","image":"https://nmac.to/wp-content/uploads/2021/02/Plist-Converter.png","title":"Plist Converte‪r 1.4.1 – Convert a plist to and from the XML, JSON, and Binary format","content":"Plist Converter is the fastest and easiest way to convert plist files on the Mac. Convert a plist to and from the XML, JSON, and Binary format with this GUI app. You can even convert CSV to Plist files with this app. You can also use Plist Converter to batch convert many plist files in […]"},{"link":"https://nmac.to/blog/here/","image":"https://nmac.to/wp-content/uploads/2021/02/here.png","title":"her‪e‬ 3.02 – Idle Mouse Pointer Indicator","content":"Take your eyes off the screen and ‘here’ will show you exactly where your mouse pointer is. No shaking your mouse and losing your position.   Creating a critical spreadsheet, retouching a complex photo, or reading a scientific paper? After you answer your phone, rub your eyes, or step away, you’ll waste precious time looking […]"},{"link":"https://nmac.to/blog/as-far-as-the-eye/","image":"https://nmac.to/wp-content/uploads/2021/02/As-Far-As-The-Eye.png","title":"As Far As The Eye 1.1.1a – Single player Strategy & Survival Game","content":"Wake up, swell up and get up, Sigh. It is time to bring back to me the Pupils scattered throughout the world and to guide them. Do not worry, they will recognize you as soon as they feel your breath on their faces, as soon as they see their woolen clothes spinning, they will understand […]"},{"link":"https://nmac.to/blog/rayman-mini/","image":"https://nmac.to/wp-content/uploads/2020/12/Rayman-Mini.png","title":"Rayman Mini 1.11 – New epic journey for your hero","content":"Rayman has been shrunk to the size of an ant! To undo this spell, insects, mushrooms, leaves, and other plants will be your allies as you find your way through a wonderful, macro-photographic world.   From a gorgeous river to a spider nest or the deep recesses of a tree, Rayman Mini thrusts players into […]"},{"link":"https://nmac.to/blog/next-rc-flight-simulator/","image":"https://nmac.to/wp-content/uploads/2021/02/Next-RC-Flight-Simulator.png","title":"Next RC Flight Simulator 1.702 – RC Flight Simulator Game","content":"The neXt level of radio control flight simulation. We gave our rc Flight Simulator the name neXt because it heralds the next evolution in the model flight simulator industry.   Thanks to the highly effective programming beneath the hood of the graphics engine, you’ll get the highest quality not only on the latest hardware, but […]"},{"link":"https://nmac.to/blog/company-of-crime/","image":"https://nmac.to/wp-content/uploads/2020/08/Company-of-Crime.png","title":"Company of Crime 1.0.5.1086 – A criminal empire-builder game","content":"Company of Crime is a criminal empire-builder featuring tactical turn-based missions. It takes place in 1960s London, the cultural capital of the world and home to a plethora of subcultures and businesses. Your task is to build a company that will own the criminal underworld, or if you play as the chief inspector of Scotland […]"},{"link":"https://nmac.to/blog/simplifier-for-facebook/","image":"https://nmac.to/wp-content/uploads/2021/02/Simplifier-for-Facebook.png","title":"Simplifier for Facebook 1.4 – Block whatever they don’t like on Facebook","content":"Facebook has become cluttered with Mark Zuckerbeg’s side businesses, lame flash games, and secondhand Snapchat features. Facebook Simplifier lets users block whatever they don’t like on Facebook, so they can focus on what they do like.   Version 1.4: Previously, blocking the “create post” field would block the newsfeed as well. This bug has been […]"},{"link":"https://nmac.to/blog/xstand/","image":"https://nmac.to/wp-content/uploads/2015/05/xstand_6.png","title":"xStand 6.8.2 – Secure fullscreen web browser for internet kiosks","content":"xStand is a Web browser designed to present Web-based content or run Web applications in a safe and stable way. Mostly used for public access terminals in museums or libraries, xStand can also be used as the default Web browser for all members of a company or an organization. xStand allows you to restrict access […]"},{"link":"https://nmac.to/blog/presentify/","image":"https://nmac.to/wp-content/uploads/2021/01/Presentify.png","title":"Presentify 4.1.5 – Screen Annotation and Cursor Highlight for Mac","content":"Presentify is a macOS menu bar app that helps you give better presentations by letting you annotate any screen, highlight your cursor, and more.   It is the perfect tool for recording tutorials, capturing screenshots, giving a demo or a presentation, working remotely, and the list goes on.   Features   Draw anywhere anytime You […]"},{"link":"https://nmac.to/blog/pdf-image-xtractor/","image":"https://nmac.to/wp-content/uploads/2017/01/PDF-Image-Xtractor.png","title":"PDF Image Xtractor 1.3.7 – The easiest way to get images out of a PDF file [UPDATE]","content":"Have a PDF file that contains images you need? Did you lose the word processing document you used to create the PDF and now all your are left with is a virtually un-editable PDF file? How are you supposed to get those images out? Many PDF software programs that offer an image extraction feature are […]"}]