[{"link":"https://nmac.to/blog/albumstomp/","image":"https://nmac.to/wp-content/uploads/2018/04/AlbumStomp.png","title":"AlbumStomp 1.55 – Professional album design software","content":"Design, align, style, and stomp. AlbumStomp makes it easy and fun.  Drag a few images onto a page or spread and let our layout generator arrange the images for you.  Don’t stop there, tweak your design with total free-form control at any time.   For a seamless experience add AlbumPrufr to share an album with your clients, and get revisions […]"},{"link":"https://nmac.to/blog/blogstomp/","image":"https://nmac.to/wp-content/uploads/2016/05/BlogStomp.png","title":"BlogStomp 3.6.2 – Blog like a boss, then relax","content":"Resize, collage, crop, and watermark your images in one fell swoop using BlogStomp.   Create multiple styles for your blog, Facebook, gallery, or wherever you share images online.  Upload to those sites all from within the app! Stand out from the crowd and personalize your stomps with text, border, color blocks and a ton of other […]"},{"link":"https://nmac.to/blog/numeracy/","image":"https://nmac.to/wp-content/uploads/2018/04/Numeracy.png","title":"Numeracy 1.0 – OCT/DEC/HEX converter","content":"Numeracy – ein Helfer bei Dump-Analyse mit OCT/DEC/HEX-Konverter zur Berechnung von Adressen und Offsets in einem Dump.   Version 1.0: Initial release   Intel, 64-bit processor OS X 10.10 or later    "},{"link":"https://nmac.to/blog/chief-architect-premier/","image":"https://nmac.to/wp-content/uploads/2016/09/Chief-Architect-Premier-X10.png","title":"Chief Architect Premier X10 20.2.2.3 – Professional Home Design Software","content":"Chief Architect — professional 3D architectural home design software. Automated building tools make home design, remodeling, interior design, and kitchen & bath design easy. Discover why Chief Architect is the home design software product of choice for 2D and 3D design.   For all aspects of residential and light commercial design. As you draw walls […]"},{"link":"https://nmac.to/blog/batman-the-enemy-within/","image":"https://nmac.to/wp-content/uploads/2017/10/Batman-The-Enemy-Within.png","title":"Batman: The Enemy Within EP5 1.0.17 – Story Rich Batman Adventure Game","content":"In this latest chapter from the award-winning studio behind Batman – The Telltale Series, both Bruce Wayne and Batman will be forced into precarious new roles. The Riddler has returned to terrorize Gotham City, but his gruesome puzzles merely foreshadow an even greater crisis. With the arrival of a ruthless federal agent and the return […]"},{"link":"https://nmac.to/blog/proencryptor/","image":"https://nmac.to/wp-content/uploads/2017/01/ProEncryptor.png","title":"ProEncryptor 1.7.7 – Professional encryption software","content":"ProEncryptor is a professional encryption software, support AES128 and AES256 algorithm, according to the need of higher security, we specially made optimization, and support for cross platform encryption and decryption, such as Windows, OS X, iOS, Android and Windows Phone platform.   Version 1.7.7: Bug fixes   Intel, 64-bit processor OS X 10.8 or later […]"},{"link":"https://nmac.to/blog/date-format-creator/","image":"https://nmac.to/wp-content/uploads/2018/02/Date-Format-Creator.png","title":"Date Format Creator 1.3 – Date formatter app ( For Developers )","content":"If you’re a developer you’ll know that working with dates can be difficult. Try to do anything reasonably complex with dates and before long you’ll be imagining a perfect world where countries stop shifting their hours backwards and forwards in a quest for more daylight, every month has the same number of days, timezones are […]"},{"link":"https://nmac.to/blog/screen-recorder-hd-pro/","image":"https://nmac.to/wp-content/uploads/2018/04/Screen-Recorder-HD-Pro.png","title":"Screen Recorder HD Pro 3.1.2 – Screen capture utility","content":"We’ve created the world’s best screen-capture app. Screen Recorder HD Pro can record your actions in any application on macOS and save those captures into any popular video or audio format, for use on any software. It’s perfect for professional videos, screencasts, presentations and anything else you want to create.    Best of all, Screen […]"},{"link":"https://nmac.to/blog/watchme/","image":"https://nmac.to/wp-content/uploads/2016/12/WatchMe1.png","title":"WatchMe 2.0.9 – Search and download episodes from popular TV series","content":"WatchMe is a small and handy app that will allow you to quickly search and download episodes from the most popular series these days. Just input a name and get your episode, in your desired format, with a few clicks!   Version 2.0.9: GDPR compliance.   Intel, 64-bit processor OS X 10.8 or later   […]"},{"link":"https://nmac.to/blog/call-of-duty-modern-warfare-2/","image":"https://nmac.to/wp-content/uploads/2018/04/Call-of-Duty-Modern-Warfare-2.png","title":"Call of Duty Modern Warfare 2 1.2.211 – First-person action game","content":"The most-anticipated game of the year and the sequel to the best-selling first-person action game of all time, Modern Warfare 2 continues the gripping and heart-racing action as players face off against a new threat dedicated to bringing the world to the brink of collapse.   Call of Duty: Modern Warfare 2 features for the […]"}]