[{"link":"https://nmac.to/blog/capture-gif-1-4-0/","image":"https://nmac.to/wp-content/uploads/2016/06/Capture.Gif.png","title":"Capture Gif 1.4.0 – Record your screen as an animated GIF","content":"With Capture Gif, you can easily record your entire screen or just an area as an animated GIF image. Capture Gif has support for multiple displays, is Retina-ready, and always generates clear GIF images.   Features Record any connected display Optionally capture the mouse cursor Can record OS X menu bar area (or anywhere on […]"},{"link":"https://nmac.to/blog/cloudmagic-email-7-12-46/","image":"https://nmac.to/wp-content/uploads/2016/01/CloudMagic.png","title":"CloudMagic Email 7.12.46 – One app for all of your email accounts","content":"CloudMagic is the perfect app to handle your email accounts.   Instant push notifications for ALL types of email accounts: Gmail, Exchange, Yahoo, Outlook, iCloud, Google Apps, Office 365, IMAP – you name it! Supports all versions of Exchange: ActiveSync (EAS), EWS and IMAP. Handoff: Effortlessly hand off what you’re doing on iPhone, iPad or […]"},{"link":"https://nmac.to/blog/sketches-pro-1-2/","image":"https://nmac.to/wp-content/uploads/2016/06/Sketches-Pro.png","title":"Sketches Pro 1.2 – The most versatile and user-friendly sketching app on Mac","content":"Because beautiful tools make beautiful drawings, we endlessly refined Sketches brushes to create the most realistic drawing tools.   With a modern and clean UI, Sketches Pro is the most versatile and user-friendly sketching app available on Mac.   Features Over 20 ultra realistic tools Incredibly realistics watercolor wet brushes Smart Brushes Editor Color Eyedropper […]"},{"link":"https://nmac.to/blog/iphone-data-recovery-6-7-1-1/","image":"https://nmac.to/wp-content/themes/nmac/images/placeholder-320.png","title":"iPhone Data Recovery 6.7.1.1 – Recover all what you want back on iPhone","content":"There are various situations when you just simply need to save personal messages and important contacts from your phone to your PC. However, due to virus attacks or phone damages, you might lose your sensitive data.   Tenorshare iPhone Data Recovery is a comprehensive and reliable piece of software geared toward users who need to […]"},{"link":"https://nmac.to/blog/excubitor-1-0/","image":"https://nmac.to/wp-content/uploads/2016/06/Excubitor.png","title":"Excubitor 1.0 – A classic inspired Tower Defense Bullet Hell Shooter game","content":"In 1935, Albert Einstein and Nathan Rosen predicted the existence of wormholes; shortcuts through space-time enabling instantaneous travel across vast regions of space. A century later, a discovery was made that turned their theory into reality – plunging mankind into an interstellar space race to claim the ultimate prize: the Voidshards.   The events of […]"},{"link":"https://nmac.to/blog/moneywiz-2-3-3/","image":"https://nmac.to/wp-content/uploads/2015/02/MoneyWiz2.png","title":"MoneyWiz 2.3.3 – Personal finance solution","content":"All your accounts, budgets and bills in one place! With powerful reports, worldwide online banking and instant sync between all your devices!   That’s MoneyWiz – the world’s most powerful and beautiful finance software.   HOW CAN MONEYWIZ HELP YOU? GET OUT OF DEBT : We’ve built MoneyWiz in a way that makes it easy […]"},{"link":"https://nmac.to/blog/amazingslider-6-2/","image":"https://nmac.to/wp-content/uploads/2016/06/Amazing-Slider.png","title":"AmazingSlider 6.2 – Create stunning jQuery slideshows","content":"AmazingSlider is an easy-to-use application to create beautiful, professional, and responsive jQuery sliders, YouTube video galleries, WordPress slider plugins, and Joomla slideshow modules.   With a wizard-style user interface, fancy transition effects, plenty of professionally made templates, and support for both images and YouTube videos, making an Amazing Slider has never been easier or so […]"},{"link":"https://nmac.to/blog/wheelman-1-0/","image":"https://nmac.to/wp-content/uploads/2016/06/WheelMan.png","title":"WheelMan 1.0 – Thrill ride game based on Vin Diesel movie [WineSkin]","content":"The streets are his battleground the car his weaponProduct InformationVin Diesel stars as Wheelman an undercover operative and highly skilled driverwho must infiltrate the criminal underworld of Barcelona to gather informationabout a covert heist.  Posing as a driver for hire he must raise thetension between the bitter rival city gangs whilst staying one step ahead […]"},{"link":"https://nmac.to/blog/tumbleweed-express-1-0/","image":"https://nmac.to/wp-content/uploads/2016/06/Tumbleweed.Express.png","title":"Tumbleweed Express 1.0 – A tower defense game set in the American West.","content":"The year is 1885, the height of the Age of Steam in the United States of America. But something is not quite right in the land of destiny and the free market: Dirigibaus, a ruthless entrepreneur, has monopolized trade in the West with a fleet of airships! Dirigibles and zeppelins dot the skies as agents […]"},{"link":"https://nmac.to/blog/franz-0-9-10/","image":"https://nmac.to/wp-content/uploads/2016/03/Franz.png","title":"Franz 0.9.10 – A free messaging app for Slack, Facebook Messenger, WhatsApp and more","content":"Franz is a free messaging app/former Emperor of Austria and combines chat & messaging services into one application. He currently supports Slack, HipChat, Facebook Messenger, Telegram, WhatsApp, Google Hangouts, Skype and Grape. You can download Franz for Mac and he is soon coming to Windows as well.   Franz allows you to add every service several […]"}]