[{"link":"https://nmac.to/blog/checkmate/","image":"https://nmac.to/wp-content/uploads/2017/09/Checkmate1.png","title":"Checkmate 1.1.9 – Monitor your Mac’s health","content":"Checkmate monitors your Mac’s health.   Disk and system utilities, like our flagship product TechTool Pro, are great for repairing disk issues and recovering data after something goes terribly wrong. But what if there was a way to catch these problems sooner? What if there was a product that would continuously monitor all of the […]"},{"link":"https://nmac.to/blog/jriver-media-center/","image":"https://nmac.to/wp-content/uploads/2016/04/JRiver.Media_.Center.png","title":"JRiver Media Center 26.0.18 – Manage and playback almost any type of media","content":"JRiver Media Center is one of the most comprehensive and seamless applications available for managing and playing your media. Its scope includes almost all formats of audio, video, and images. Media Center can also record television and manage documents. And if you’re looking for the best audio player or the best video player, you’ve found […]"},{"link":"https://nmac.to/blog/switch-4/","image":"https://nmac.to/wp-content/uploads/2016/11/Switch.png","title":"Switch 4.5.7 – Play, inspect, and correct your media files","content":"Switch is a media playback, inspection, and conversion tool for professionals that gives you everything you need to play, inspect, and correct your multiformat media in one easy-to-use application.   Version 4.5.7: IMPROVEMENTS: Customer Requested Improvements: Updated the Inspector title bar to allow for standard MacOS functionality such as Command-Click to show path, reveal in […]"},{"link":"https://nmac.to/blog/ibeesoft-data-recovery/","image":"https://nmac.to/wp-content/uploads/2020/01/iBeesoft-Data-Recovery.png","title":"iBeesoft Data Recovery 3.6 – Recover data from a variety of media","content":"iBeesoft Data Recovery can recover data due to accidental deletion, formatting drive/partition, improper operation, virus infection, and most other reasons on your Mac, USB devices, hard drive, memory card, digital camera, and many other storage devices. The Mac data-recovery software offers two scanning modes; it can scan any Mac-based hard drive or external hard drive […]"},{"link":"https://nmac.to/blog/iskysoft-dvd-creator/","image":"https://nmac.to/wp-content/uploads/2018/08/iSkysoft-DVD-Creator.png","title":"iSkysoft DVD Creator 6.0.1 – Edit, Enhance and Burn Video to DVD Easily","content":"Got video downloads and home movies sitting on your Mac? iSkysoft DVD Creator for Mac (including 10.13 macOS High Sierra) lets you burn video to DVD disc, DVD folder and ISO file on Mac effortlessly, so you can play everything directly on your big screen TV or Mac’s DVD Player. Apart from organizing and burning […]"},{"link":"https://nmac.to/blog/murus/","image":"https://nmac.to/wp-content/uploads/2017/09/Murus1.png","title":"Murus Pro 2.0 – Advanced GUI for OS X PF firewall","content":"Murus is the entry level member of the Murus family. It’s a simple front end for the OS X PF network firewall and features inbound filtering, bandwidth throttling, logging, presets and ports management. Interface is based on icons, leds, and collection views. Set the firewall rules by dragging and dropping icons and selecting checkboxes. No […]"},{"link":"https://nmac.to/blog/easy-translator/","image":"https://nmac.to/wp-content/uploads/2019/07/Easy-Translator1.png","title":"Easy Translator 15.0.0 – Quickly and easily translate text","content":"Easy Translator employs the power of Internet machine language translation engines, and enables you to easily translate Web contents, letters, chat, and emails between major international languages.   This translation software can also convert text to MP3 audio files so that you can listen to the audio in your favorite music player.   Version 15.0.0: […]"},{"link":"https://nmac.to/blog/onecast/","image":"https://nmac.to/wp-content/uploads/2018/12/OneCast.png","title":"OneCast 1.13 – Xbox One game streaming for iPhone, iPad and Mac","content":"Stream your Xbox One games to your iPhone, iPad or Mac and play from anywhere with access to your home network. Never again will your gaming be interrupted when someone else needs to use the TV!   Features   iPhone and iPad Convenience Transfer your gaming session to your iPhone or iPad when the TV […]"},{"link":"https://nmac.to/blog/icash/","image":"https://nmac.to/wp-content/uploads/2016/01/iCash.png","title":"iCash 7.8.1 – Personal finance tracker","content":"iCash is intended to help you control your personal finances, keeping track of incomes, expenses, credits, debts, and bank transactions for you. As simple as creating the accounts you need and moving money between them! You don’t even need to know about accounting or even care about it! Your finances depend largely on good organization […]"},{"link":"https://nmac.to/blog/ortelius/","image":"https://nmac.to/wp-content/uploads/2014/12/Ortelius2.png","title":"Ortelius 2.2.3 – Vector drawing app especially for cartography work","content":"Ortelius is a full-featured vector drawing application especially for map design. Ortelius allows you to draw directly with features such as roads, rivers, coastlines, buildings, symbols and contours. Ortelius is known for its unique “connectable tracks” and expert stacked styles that make drawing tedious map features easy. Every object supports attribute data that can be […]"}]