[{"link":"https://nmac.to/blog/simplekeys-2-5-2/","image":"https://nmac.to/wp-content/uploads/2014/01/SimpleKeys.png","title":"SimpleKeys 2.5.2 – Create keyboard shortcuts for your common tasks","content":"SimpleKeys is a complete rewrite of the popular f-key shortcut program. Now in addition to programing your function keys, SimpleKeys allows you to:   Execute an action with any key combination Now types as fast as the recieving application can accept keystrokes Create Macros by combining multiple actions under a single KeyStroke Import and Export […]"},{"link":"https://nmac.to/blog/chatbook-pro-1-5/","image":"https://nmac.to/wp-content/uploads/2014/01/ChatBook.Pro_.png","title":"ChatBook Pro 1.5 – Stay connected with all your Facebook friends","content":"ChatBook Pro is a brand new way of chatting in Facebook! Chatting has become super easy with Chatbook Pro. Chat, share, and stay connected with all your friends. It helps you connect with your friends and share on the go. It gives an excellent user-experience that’s super simple to use for unlimited chatting.   Features: […]"},{"link":"https://nmac.to/blog/taskdeck-1-1-3/","image":"https://nmac.to/wp-content/uploads/2014/01/Taskdeck1.png","title":"Taskdeck 1.1.3 – Versatile task management in the menu bar","content":"Taskdeck is quick-and-easy task and to-do management.   Organize Group related tasks into lists. A badge indicates the number of open, due, or overdue tasks in each list. Prioritize Drag tasks up or down the list to prioritize. Important stuff goes to the top, less important issues to the bottom. Find Quickly locate tasks by […]"},{"link":"https://nmac.to/blog/beeralchemy-2-0-17/","image":"https://nmac.to/wp-content/uploads/2014/01/BeerAlchemy.png","title":"BeerAlchemy 2.0.17 – Recipe formulation tool for brewers","content":"BeerAlchemy aims to make creating great beers easier. It offers recipe formulation tools that give the brewer immediate feedback on how changes they make will affect theirfinished beers. The program supports all-grain, partial mash and extract brewing as well as bothfly and batch sparging. It also helps the brewer keep organised by storing all their […]"},{"link":"https://nmac.to/blog/xplan-3-5-8/","image":"https://nmac.to/wp-content/uploads/2014/01/xPlan.png","title":"xPlan 3.5.8 – Track your projects","content":"With xPlan, creating, tracking, and managing your projects is easier than ever! xPlan is designed to keep track of tasks, milestones, and calculate a project’s cost.   If you’re not a professional project manager, you probably want something that’s easy to learn and inexpensive, but it’s got to pump out a professional project-management plan too. […]"},{"link":"https://nmac.to/blog/pixa-1-1-3/","image":"https://nmac.to/wp-content/uploads/2014/01/Pixa.png","title":"Pixa 1.1.3 – Quickly and easily organize your images","content":"Pixa is an image-organizing application. The new app functions well, is easy to use, and helps people organize their images quickly and easily on their computers.   For those who prefer not to use the Pixa library, the application can still find images when the user searches for them. So, either way, Pixa makes it […]"},{"link":"https://nmac.to/blog/cleanmyphone-1-0-1/","image":"https://nmac.to/wp-content/uploads/2014/01/CleanMyPhone.png","title":"CleanMyPhone 1.0.1 – Keep your iPhone, iPad, or iPod touch clean and well-organized","content":"CleanMyPhone is an ingeniously simple and powerful application that will help you keep your iPhone, iPad, or iPod touch clean and running smoothly. It includes useful tools such as Disk Manager, App Cleaner, Removal of Document and Data, Find Large Files, One-Click-Copy, and more.   Configure, Organize and Manage Files and Apps on Your iOS […]"},{"link":"https://nmac.to/blog/zepheer-2-2/","image":"https://nmac.to/wp-content/uploads/2014/01/Zepheer.png","title":"Zepheer 2.2 – Add beautiful filters and styles to your photos","content":"Zepheer is designed to be a best friend of every photography enthusiasts on Mac OS. This small app delivers dozens built-in photo styles and allows to make your photos warm, charming, beautiful, impressing, to give them the soul – even when the photos were taken with a low-end camera and bad conditions.   The application […]"},{"link":"https://nmac.to/blog/appfresh-1-0-5/","image":"https://nmac.to/wp-content/uploads/2014/01/appfresh.png","title":"AppFresh 1.0.5 – Update for all Mac OS apps","content":"AppFresh helps you to keep all applications, widgets, preference panes and application plugins installed on your Mac up to date. All from one place, easy to use and fully integrated into Mac OS X. AppFresh works by checking the excellent osx.iusethis.com for new versions and lets you download and install available updates easily.   Software […]"},{"link":"https://nmac.to/blog/freespace-1-2-7/","image":"https://nmac.to/wp-content/uploads/2014/01/FreeSpace.png","title":"FreeSpace 1.2.7 – Manage all your connected drives from the menu bar","content":"FreeSpace is a menu bar utility that lets you manage your connected drives.   Features: Lists all the free spaces of all your connected drives on the status menu! Eject All external drives with one click! Drives are grouped and displayed in their own categories Mount and Eject Indicator Pin any local drive to the status […]"}]