[{"link":"https://nmac.to/blog/vampire-the-masquerade/","image":"https://nmac.to/wp-content/uploads/2020/05/Vampire.The_.Masquerade.png","title":"Vampire: The Masquerade – Coteries of New York 1.0 – Vampires, Interactive Fiction Game","content":"Vampire: The Masquerade – Coteries of New York is a narrative experience set in the rich universe of Vampire: The Masquerade 5th Edition. It presents the struggle for power between two vampiric factions – the Camarilla and the Anarchs – bathed in the night lights of the Big Apple.   Vampire: The Masquerade – Coteries […]"},{"link":"https://nmac.to/blog/broken-lines/","image":"https://nmac.to/wp-content/uploads/2020/03/Broken.Lines_.png","title":"Broken Lines 1.0.3.5 – World War II Turn-Based Strategy Game","content":"Your squad has crash-landed behind enemy lines, in the heart of an alternate history Eastern Europe. With no intel or leadership to support them, these soldiers must fight their way back home before the horrors of war break them. Teamwork and strategy are paramount…   Broken Lines combines a tactical RPG with story-driven gameplay. As […]"},{"link":"https://nmac.to/blog/clipboard-center/","image":"https://nmac.to/wp-content/uploads/2016/04/Clipboard-Center22.png","title":"Clipboard Center 2.2.2 – Easy-to-use and powerful clipboard manager","content":"Clipboard Center is an easy-to-use and powerful clipboard manager. Through a history, lists and a flexible interface, this app allows you to copy and paste texts, images and files in the most efficient way.   Capture the Clipboard Every texts, images and files copied in your apps will be added seamlessly to the history from […]"},{"link":"https://nmac.to/blog/liquivid-video-exposure-and-effects/","image":"https://nmac.to/wp-content/uploads/2017/10/liquivid-Exposure-and-Effects1.png","title":"liquivid Video Exposure and Effects 1.4.1 – Apply different visual effects to clip’s exposure","content":"Liquivid Video Exposure and Effects is an easy-to-use app that allows you to change a clip’s exposure, saturation and white balance and apply different visual effects (also known as filters).   Imports all common video formats and codecs in any resolution (including HD, 2K, 4K).   Exports videos as MP4 files with H.264 codec.   […]"},{"link":"https://nmac.to/blog/liquivid-video-deflickering/","image":"https://nmac.to/wp-content/uploads/2020/04/liquivid-Video-Deflickering1.png","title":"liquivid Video Deflickering 1.4.1 – Easy-to-use video flickering removal","content":"liquivid Video Deflickering is an easy-to-use app that reduces or removes flickering from video.   Flickering refers to an inconsistent exposure of video frames and can appear in time lapse videos or when recording under certain lighting conditions (e.g. when using pulsating light sources like incandescent blubs).   The app imports all common video formats […]"},{"link":"https://nmac.to/blog/liquivid-video-merge/","image":"https://nmac.to/wp-content/uploads/2020/04/liquivid-Video-Merge.png","title":"liquivid Video Merge 1.4.1 – Combine multiple video clips into a single one","content":"Liquivid Video Merge is an easy-to-use app that allows you to combine multiple video clips into a single one.   For each input video, you can select which part of the clip to export and you can optionally choose a music soundtrack for the output file.   The app imports all common video formats and […]"},{"link":"https://nmac.to/blog/liquivid-video-stabilization/","image":"https://nmac.to/wp-content/uploads/2020/04/liquivid-Video-Stabilization1.png","title":"liquivid Video Stabilization 1.4.1 – Easy-to-use video stabilization app","content":"Liquivid Video Stabilization is an easy-to-use app that reduces camera shake from handheld footage or clips taken with action cameras or aerial vehicles (e.g. quadrocopters).   Imports all common video formats and codecs in any resolution (including HD, 2K, 4K).   Exports videos as MP4 files with H.264 codec.   Note that stabilization in post-production […]"},{"link":"https://nmac.to/blog/liquivid-video-fisheye-removal/","image":"https://nmac.to/wp-content/uploads/2017/06/liquivid-Video-Fisheye-Removal1.png","title":"liquivid Video Fisheye Removal 1.4.1 – Easy-to-use video fisheye distortion removal","content":"Liquivid Video Fisheye Removal is an easy-to-use app that removes fisheye distortion from videos taken with action cameras or other extreme wide angle lenses.   The app contains lens profiles for the following cameras: DJI Phantom 3, Zenmuse X3 (Osmo, Inspire 1) Drift HD Ghost Garmin VIRB GitUp Git2 GoPro Hero3, Hero3+, Hero4 Back & […]"},{"link":"https://nmac.to/blog/the-jackbox-party-pack/","image":"https://nmac.to/wp-content/uploads/2020/04/The-Jackbox-Party-Pack-2.png","title":"The Jackbox Party Pack 2 1.0.23 – FIVE fresh, rib-tickling party games","content":"The sequel to the party game phenomenon The Jackbox Party Pack, featuring FIVE fresh, rib-tickling party games!   Games include:   Fibbage 2 (2-8 players) The runaway hit bluffing game with over 500 brand-new questions, more than 2x the original! Plus new features, like the deFIBrillator!   Earwax (3-8 players) The hear-larious sound-effects game that […]"},{"link":"https://nmac.to/blog/void-bastards/","image":"https://nmac.to/wp-content/uploads/2019/05/Void-Bastards.png","title":"Void Bastards 2.0.24 – A revolutionary new strategy-shooter game","content":"Forget everything you know about first-person shooters: Void Bastards asks you to take charge, not just point your gun and fire. Your task is to lead the rag-tag Void Bastards out of the Sargasso Nebula. You make the decisions: where to go, what to do and who to fight. And then you must carry out […]"}]