[{"link":"https://nmac.to/blog/timberborn/","image":"https://nmac.to/wp-content/uploads/2021/09/Timberborn.png","title":"Timberborn Early Access 0.1.1.1 – Colony Sim Game","content":"Mankind turned Earth into a dry wasteland and perished, but some species adapted and evolved. Pick one of the beaver factions and see how long your colony can last.   Beaver societies Control one of two beaver factions: the nature-friendly Folktails or the industrious Iron Teeth. Each faction has a unique style, buildings, and gameplay […]"},{"link":"https://nmac.to/blog/craft-the-world/","image":"https://nmac.to/wp-content/uploads/2021/01/Craft-the-World.png","title":"Craft the World 1.9.006 – A unique sandbox strategy game","content":"Craft The World is a unique sandbox strategy game, the mix of Dungeon Keeper, Terraria and Dwarf Fortress.   Explore a random generated world populated by dangerous creatures, build a dwarf fortress, gather resources, and craft all the items, weapons, and armor you need.   GOD-SIMULATION You control a tribe of dwarves by giving them […]"},{"link":"https://nmac.to/blog/unpacking/","image":"https://nmac.to/wp-content/uploads/2021/11/Unpacking.png","title":"Unpacking 1.3 – Casual Pixel Graphics Game","content":"Unpacking is a zen game about the familiar experience of pulling possessions out of boxes and fitting them into a new home. Part block-fitting puzzle, part home decoration, you are invited to create a satisfying living space while learning clues about the life you’re unpacking. Over the course of eight house moves, you are given […]"},{"link":"https://nmac.to/blog/fontdoctor/","image":"https://nmac.to/wp-content/uploads/2017/10/FontDoctor10.png","title":"FontDoctor 10.9 – Diagnose and repair damaged fonts","content":"FontDoctor is a professional software tool that locates and eliminates hard-to-find font problems that wreak havoc on Macintosh system performance and applications. FontDoctor has long been the industry standard for font problem diagnosis and repair for publishing and design professionals. FontDoctor will scan your fonts to locate and repair common font illnesses, including missing Postscript […]"},{"link":"https://nmac.to/blog/besiege/","image":"https://nmac.to/wp-content/uploads/2016/12/Besiege1.png","title":"Besiege 1.10.17046 – Physics based building game","content":"Besiege is a physics based building game in which you construct medieval siege engines and lay waste to immense fortresses and peaceful hamlets. Build a machine which can crush windmills, wipe out battalions of brave soldiers and transport valuable resources, defending your creation against cannons, archers and whatever else the desperate enemies have at their […]"},{"link":"https://nmac.to/blog/black-book/","image":"https://nmac.to/wp-content/uploads/2022/02/Black-Book.png","title":"Black Book 1.0.35 – Turn-Based Tactics Game","content":"A fusion of card-based RPGs and Adventure games, “Black Book” is a haunting tale of a young sorceress, who gave her life to serve the dark forces. Dive into the cold, yet alluring world of Slavic folktales – and uncover the secrets that hide in the darkness.   A young girl named Vasilisa, destined to […]"},{"link":"https://nmac.to/blog/skyorb/","image":"https://nmac.to/wp-content/uploads/2013/03/SkyORB-2021.png","title":"SkyORB 2021.12.5 – 3D planetarium featuring star-gazing and epheremis","content":"SkyORB features a 3D interface, a search engine, a large catalog of stars (Hyparcos), deep objects (NGC/IC 2000) planets, current satellite (including current launch missions) (MPC) and let you choose see the actual sky from any point on Earth.   Key features: Allows you to fine tune your observation location from the database of by […]"},{"link":"https://nmac.to/blog/fonepaw-ios-data-backup-and-restore/","image":"https://nmac.to/wp-content/uploads/2022/02/FonePaw-iOS-Data-Backup-and-Restore.png","title":"FonePaw iOS Data Backup and Restore 6.9.0 – Do A Safe Backup for Your iPhone","content":"With iOS Data Backup & Restore it’s only one click to do a whole backup for your iPhone or iPad data, like contacts, messages, photos, videos, podcast, music, WhatsApp, Messenger, etc. And easily export data from backups partially or completely after previewing.   Version 6.9.0: Release notes were unavailable when this listing was updated.   […]"},{"link":"https://nmac.to/blog/avdshare-audio-converter/","image":"https://nmac.to/wp-content/uploads/2022/02/Avdshare-Audio-Converter.png","title":"Avdshare Audio Converter 7.4.1 – Audio Converter Mac","content":"Convert between audio formats with zero quality loss; Extract audio from video; Directly Play Media Files, Edit Audio like merge, adjust audio volume, channel, bitrates etc.   Supported Audio Formats: AAC, AC3, Apple Lossless ALAC, APE, AU, AUD, AIFF, AIF, AIFC, AMR, AWB, CAF, DTS, DSS, FLAC, GSM, MP3, M4A, M4B, M4R, MKA, MPC, MP1, […]"},{"link":"https://nmac.to/blog/mindup-x/","image":"https://nmac.to/wp-content/uploads/2022/02/MindupX.png","title":"Mindup X 2020.1 – mindmap: power and efficiency","content":"MindupX is an efficient mind mapping App. It can help you focus on your target in fullscreen mode or cooperate with other software in split view mode.   MindupX can present your contents just like keynote or powerpoint but in mind map style ( try to press shift+? on the keyboard after running the App […]"}]