[{"link":"https://nmac.to/blog/adele-following-the-signs-1-0/","image":"https://nmac.to/wp-content/uploads/2016/06/Adele.png","title":"Adele: Following the Signs 1.0 – Puzzle-platform strategy & adventure game","content":"The year is 2029. It is the end of the world. Take on the role of Mike; who is in the woods with his daughter, fleeing from an attacking wave of zombies. During the escape, Mike slips, falls and loses consciousness. He awakes to find that Adele is nowhere to be found. His only chance […]"},{"link":"https://nmac.to/blog/mapublisher-9-7-0/","image":"https://nmac.to/wp-content/uploads/2016/06/MAPublisher.png","title":"MAPublisher 9.7.0 – Plugins for Illustrator, cartographic/GIS production","content":"MAPublisher allows you to produce the best quality maps possible in the most efficient and accurate manner.   MAPublisher does just that by allowing you to use the powerful and vast design tools of the major vector graphics applications, Adobe Illustrator and Macromedia FreeHand, in order to produce maps from geographic information systems (GIS) map […]"},{"link":"https://nmac.to/blog/zend-studio-13-5-0/","image":"https://nmac.to/wp-content/uploads/2014/02/ZendStudio.png","title":"Zend Studio 13.5.0 – Professional-strength PHP development environment","content":"Zend Studio is the only Integrated Development Environment (IDE) designed for professional developers that encompasses all the development components necessary for the full PHP application lifecycle.   Through a comprehensive set of editing, debugging, analysis, optimization, database tools and testing Zend Studio 5 speeds development cycles and simplifies complex projects.   To reflect varying developers’ […]"},{"link":"https://nmac.to/blog/xilisoft-youtube-video-converter-5-6-5/","image":"https://nmac.to/wp-content/uploads/2016/06/Xilisoft-YouTube-Video-Converter.png","title":"Xilisoft YouTube Video Converter 5.6.5 – Download and convert YouTube videos","content":"Would you like to watch favorite YouTube videos on your multimedia devices on the go? Xilisoft YouTube Video Converter for Mac is an easy application for Mac users and YouTube fans.   It can download all YouTube videos (even 3D videos and HD videos) and convert YouTube videos to various video formats for watching YouTube […]"},{"link":"https://nmac.to/blog/stocktab-1-4/","image":"https://nmac.to/wp-content/uploads/2015/07/StockTab.png","title":"StockTab 1.4 – Keep an eye on the markets from your menu bar","content":"StockTab is the slickest and simplest way to keep an eye on the markets, right from your menu bar. We’ve beautifully crafted this app to ensure you are at the forefront of the financial markets, be it following individual stock prices or checking out fluctuations in global exchange rates. The app has been designed from […]"},{"link":"https://nmac.to/blog/particleshop-1-2-566/","image":"https://nmac.to/wp-content/uploads/2016/06/ParticleShop.png","title":"ParticleShop 1.2.566 – Plug-in for Adobe Photoshop, powered by Corel Painter","content":"ParticleShop–a powerful new plug-in for Adobe Photoshop, powered by Corel Painter–creates one-of-a-kind effects. Experience living grab-and-go particle brushes that are easy to use with a pressure sensitive tablet, touchscreen, or mouse, and which allow you to artistically enhance photos, designs, and illustrations with strokes of genius.   Features Explore an array of 11 imaginative brushes–including […]"},{"link":"https://nmac.to/blog/ares-commander-2016-1/","image":"https://nmac.to/wp-content/uploads/2016/06/ARES.Commander.png","title":"ARES Commander 2016.1 – Professional CAD with 3D-Modeling and more","content":"ARES Commander Edition … Professional CAD with 3D-Modeling and additional programming interfaces.   ARES Commander Edition for Mac OS X offers Apple Mac users professional, DWG/DXF based CAD running on native Mac OS X (no emulation!) on latest standards. ARES Commander Edition for Mac OS X takes full advantage of the ease-of-use of the Apple […]"},{"link":"https://nmac.to/blog/sandvox-2-10-6/","image":"https://nmac.to/wp-content/uploads/2014/02/Sandvox.png","title":"Sandvox 2.10.6 – Easily build eye-catching Web sites","content":"Sandvox is for Mac users who want to create a professional looking website quickly and easily. With Sandvox, you don’t need to be a Web genius to build a stylish, feature-rich, standards-compliant website that’s functional and user friendly. Sandvox’s drag and drop interface lets you watch your website take shape and come to life as […]"},{"link":"https://nmac.to/blog/paintcode-for-sketch-1-0-1/","image":"https://nmac.to/wp-content/uploads/2016/06/PaintCode-for-Sketch.png","title":"PaintCode for Sketch 1.0.1 – Code Generator Plugin for Sketch","content":"PaintCode Plugin for Sketch makes it really easy to export your drawings into Swift or Objective-C.   Integrating the generated code into your Xcode projects is simple and straightforward.   By using code, you can make your apps truly resolution-independent. No more 1x, 2x and 3x images.   Version 1.0.1: Release notes were unavailable when […]"},{"link":"https://nmac.to/blog/stellar-partition-manager-3-0-0-4/","image":"https://nmac.to/wp-content/uploads/2014/06/StellarPartitionManager.png","title":"Stellar Partition Manager 3.0.0.4 – Partition management utility for Mac OS","content":"Stellar Partition Manager is a reliable disk partition Mac utility to manage your Apple partitions safely. This powerful Mac OS disk utility partition manager optimizes your hard drive performance by helping you create, format, delete, hide/reveal, shift and resize different partitions in your Mac hard drive.   Sometimes, you may find your Mac partition to […]"}]