[{"link":"https://nmac.to/blog/macbreakz/","image":"https://nmac.to/wp-content/uploads/2017/07/MacBreakZ5.png","title":"MacBreakZ 5.44 – Reminds you to take periodic breaks from your projects","content":"MacBreakZ is a sophisticated Personal Ergonomic Assistant designed to promote healthy and productive computer use.   MacBreakZ offers a unique way of acquiring ergonomic skills that can safe you a lot of discomfort and shield you from serious health and career-threatening disorders.   MacBreakZ features sophisticated keyboard and mouse monitoring (without invading your privacy) that […]"},{"link":"https://nmac.to/blog/kplayer/","image":"https://nmac.to/wp-content/uploads/2015/08/KPlayer2.png","title":"KPlayer 2.1.0 – Video playback app with subtitle support","content":"KPlayer is a video playback app with subtitle support. It can also play 720p, 1080p video files better smoothly if ‘H.264 hardware acceleration’ is supported.   H.264 hardware acceleration support: requires a Mac with an NVIDIA GeForce 9400M or GeForce 320M or GeForce GT 330M GPU when most MP4, MOV, M4V video files (encoded in […]"},{"link":"https://nmac.to/blog/nimble-commander-pro/","image":"https://nmac.to/wp-content/uploads/2016/10/Nimble-Commander.png","title":"Nimble Commander Pro 1.2.9 – Minimalist dual-pane file manager","content":"Nimble Commander Pro (was Files Pro) is a modern file manager designed specifically for Mac computers. It is built with efficiency in mind, providing blazing performance and immediate user-interface feedback. On other hand, Files exploits the classic dual-pane ideology and traditional hotkeys layout, while maintaining a clean, minimalist UI design.   Features Classic dual-pane interface: […]"},{"link":"https://nmac.to/blog/screen-tint/","image":"https://nmac.to/wp-content/uploads/2021/02/Screen-Tint.png","title":"Screen Tint 1.0.4 – Control Brightness & Color","content":"Screen Tint is a handy utility app that is designed to reduce the brightness of your Mac’s screen, proving particularly useful for users with sensitive eyes and for those that wish to use their Mac in a darker environment, but find that their screen’s brightness to be too harsh.   We recommend to use a […]"},{"link":"https://nmac.to/blog/ommwriter/","image":"https://nmac.to/wp-content/uploads/2017/08/ommwriter.png","title":"Ommwriter 1.66 – A simple text editor for writers","content":"Ommwriter is a simple text editor for writers. Ommwriter is a simple text processor that firmly believes in making writing a pleasure once again, vindicating the close relationship between writer and paper. The more intimate the relation, the smoother the flow of inspiration.   If you are a scriptwriter, blogger, journalist, copywriter, poet or just […]"},{"link":"https://nmac.to/blog/photolemur/","image":"https://nmac.to/wp-content/uploads/2017/08/Photolemur.png","title":"Photolemur 3 1.1.1 – Automated photo enhancement","content":"Photolemur instantly makes your photos much better and more vivid with the help of computer science, artificial intelligence and a bit of magic. It bridges the gap between what your eyes see and what your camera captures. In real life, no camera is powerful enough to transmit the actual beauty of the world that we […]"},{"link":"https://nmac.to/blog/airmagic/","image":"https://nmac.to/wp-content/uploads/2019/03/AirMagic.png","title":"AirMagic 1.0.2.7263 – Boost Your Drone Photography Automatically","content":"Powered by AI and advanced algorithms, AirMagic improves your aerial photos automatically. Simply drag & drop all your pictures to the app, and let technology do the work.   Packed With Unique Technologies Remove Haze Haze can hide important details and is common in drone photos. AirMagic removes haze automatically. Enhance the Sky AirMagic automatically […]"},{"link":"https://nmac.to/blog/waifu2x/","image":"https://nmac.to/wp-content/uploads/2020/05/WaiFu2x.png","title":"WaiFu2x 2.10 – Increase images resolution","content":"Single-Image Super-Resolution for Anime-Style Art using Deep Convolutional Neural Networks. And it supports photo.   support batch process mode.   Version 2.10: Improved UI   Intel, 64-bit processor macOS 10.13 or later    "},{"link":"https://nmac.to/blog/svgmaker/","image":"https://nmac.to/wp-content/uploads/2020/05/SVGMaker.png","title":"SVGMaker 1.16 – Easy Scalable Vector Graphics","content":"SVG is a markup language for describing two-dimensional graphics applications and images, and a set of related graphics script interfaces.   SVGMaker is a application for designing SVG content for HTML5 web pages, mobile apps, animation design, and general graphics usage.   Main Features: Outline view of SVG XML document structure. Elements can be imported […]"},{"link":"https://nmac.to/blog/easeus-recexperts/","image":"https://nmac.to/wp-content/uploads/2021/02/EaseUS-RecExperts.png","title":"EaseUS RecExperts 1.5.3 – An easy-to-use Mac screen recorder","content":"EaseUS RecExperts is designed to save you the hassle of screen capture on Mac. It covers nearly all your screen capture needs, such as recording screen with audio, capturing webcam, record audio only, etc., from Mac or even iOS device.   Record Your Screen Activity on Mac You might not be able to record screen […]"}]