[{"link":"https://nmac.to/blog/devonagent-pro-3-9-5/","image":"https://nmac.to/wp-content/uploads/2014/04/DEVONagent.Pro_.png","title":"DEVONagent Pro 3.9.5 – Maximize Web search efficiency","content":"DEVONagent Pro helps you search more efficiently on the web. It searches multiple sources, frees you from hunting for the really relevant results, and gives you power tools for your research.   Filters bad results so you don’t have to Shows results the way you want Creates reports in many formats Saves searches so you […]"},{"link":"https://nmac.to/blog/anymp4-avchd-converter-6-2-27/","image":"https://nmac.to/wp-content/uploads/2016/08/AnyMP4-AVCHD-Converter.png","title":"AnyMP4 AVCHD Converter 6.2.27 – MTS and M2TS video converter","content":"AnyMP4 AVCHD Converter lets you convert AVCHD video MTS and M2TS to any popular video formats like MKV, MP4, MOV, M4V, AVI, MPEG, WMV, FLV, and WebM. Thus importing MTS and M2TS file to Final Cut Pro, iMovie, and Avid Media Composer and watching AVCHD video on any digital device like iPad, iPhone, iPod and […]"},{"link":"https://nmac.to/blog/templates-bundle-for-iwork-5-0/","image":"https://nmac.to/wp-content/uploads/2017/02/Templates-Bundle-for-iWork.png","title":"Templates Bundle for iWork 5.0 – Templates Guru for iWork","content":"Templates Bundle for iWork – Templates Guru is the ultimate tool for users of iWork, providing you with over 800 templates for Pages, Numbers and Keynote.   This collection includes 680 unique designs for your Pages documents, 35 quality presentation themes for Keynote, and 90 spreadsheet templates for Numbers.   All templates are easily customizable […]"},{"link":"https://nmac.to/blog/herald-an-interactive-period-drama-book-i-ii-1-0/","image":"https://nmac.to/wp-content/uploads/2017/02/Herald.png","title":"Herald: An Interactive Period Drama – Book I & II 1.0 – A choice-driven adventure game","content":"Herald is a choice-driven adventure game set during an alternate 19th century in which the West is united as a colonial superpower: the Protectorate.   Help tell the story of Devan Rensburg, a man of mixed heritage who became steward on board of the HLV Herald, a merchant ship set for his country of birth. […]"},{"link":"https://nmac.to/blog/dr-os-disk-cleaner-3-7/","image":"https://nmac.to/wp-content/uploads/2017/02/Dr.Duplicate-Cleaner.png","title":"Dr.OS Disk Cleaner 3.7 – Clean your hard drive","content":"Clean, optimize, and maintain your Mac. Just two click to scan your system and removes gigabytes of junk.   Main Feature Disk Clean (In App Purchase) Fast scan-engine and advanced junk detection technology safely cleans unnecessary junk files, caches and logs, etc that gorge over your hard drive space and rage your Mac seed down […]"},{"link":"https://nmac.to/blog/trimaginator-1-3/","image":"https://nmac.to/wp-content/uploads/2017/02/Trimaginator.png","title":"Trimaginator 1.3 – Unleash your creativity and transform your photos into unique Works","content":"Trimaginator is inspired by the triangulation invented by the mathematician Boris Delaunay in 1934. To put it simple, the image is reduced to its essentials and turned into a triangle mesh. Think cubism, think surreal geometric landscapes, think turning your face into a logo, or your cat’s face, or well, anything that has or doesn’t […]"},{"link":"https://nmac.to/blog/floradora-1-0-1/","image":"https://nmac.to/wp-content/uploads/2017/02/Floradora.png","title":"Floradora 1.0.1 – Sending yourself a note has never been easier","content":"Have you ever sent yourself a quick email just to remind yourself to do something later? Maybe it’s an article or a PDF or just a question to follow up on.   I do this *all the time*, because I treat my email inbox like a todo-list: if there’s an email I haven’t read, then […]"},{"link":"https://nmac.to/blog/cleanusbdrive-1-2-5/","image":"https://nmac.to/wp-content/uploads/2016/09/CleanUSBDrive.png","title":"CleanUSBDrive 1.2.5 – The fastest DS_Store remover for external drives","content":"CleanUSBDrive is an utility to eject any external drive removing those files that you don’t want to see in your smartTV multimedia-browser, for example. It cleans all drives from system junk before ejecting, with a very high performance.   Features Simple and fast Very minimalist design Status bar App Remove .DS_Store, ._AppleDouble, Thumbs.db, .Trashes, .Spotlight, […]"},{"link":"https://nmac.to/blog/video-editor-robot-1-5/","image":"https://nmac.to/wp-content/uploads/2017/02/Video.Editor.Robot_.png","title":"Video Editor Robot 1.5 – Edit video, audio, image, titles using fabulous tools","content":"Video Editor Robot editing video is only three-step: Step 1, Import media; Step 2, Edit video, audio, image, titles using fabulous tools Step 3, Export video.   Supported Input Formats Support high-resolution videos such as 4K, 3D, 8K Video formats: MPG, MPEG, MPEG 2, VOB, DAT, MP4, M4V, TS, MTS, M2TS, RM, RMVB, WMV, ASF, […]"},{"link":"https://nmac.to/blog/remixvideo-1-0-1/","image":"https://nmac.to/wp-content/uploads/2017/02/Remixvideo.png","title":"Remixvideo 1.0.1 – Enhance your live shows with Remixvideo, the intuitive video sampler","content":"Remixvideo is the weapon of choice for creative video mixing, with a slick grid interface that makes DJs/producers instantly feel at home.   It offers two ways to enhance music performances with visuals: linking audio samples to video pads in standalone mode, or playing it as a video plug-in within your favorite music software. Running […]"}]