[{"link":"https://nmac.to/blog/worms-special-edition/","image":"https://nmac.to/wp-content/uploads/2013/12/mzi.mnyuuazu.175x175-75.png","title":"Worms Special Edition 1.0.0 – Classic turn-based strategy game","content":"With Worms Special Edition, the turn-based comic mayhem is back! In a game of Worms, each player takes turns to pick off their opponents’ worms using a host of crazy weapons and crafty tactics. Worms die if they lose all of their health, or if they drown in the water.   The last player standing […]"},{"link":"https://nmac.to/blog/add-movie-wallpaper-hd-2-0/","image":"https://nmac.to/wp-content/uploads/2013/12/icons.175x175-752.png","title":"Add Movie Wallpaper (HD) v2.0 – Add life to your desktop","content":"You want some action, you want to add life to your desktop. Add a movie! This app lets you display a movie as your main screen wallpaper. Choose from a selection of stunning movies or choose from your own selection. To change the movie, you need to go in the Preferences. To do so, click on […]"},{"link":"https://nmac.to/blog/cleanmedia-1-5-0/","image":"https://nmac.to/wp-content/uploads/2013/12/CleanMedia.175x175-75.png","title":"CleanMedia v1.5.0 – Remove hidden files from external SD-Cards","content":"Removes the specific Mac OSX hidden files from external SD-Cards, USB sticks and disks form connected mobile phones, if they are to be used with other operating systems. You can only use media with FAT16/32, NTFS and exFAT filesystem. CleanMedia also increases your available disk space, while it removes the deleted files and folder from […]"},{"link":"https://nmac.to/blog/radium-3-0-1/","image":"https://nmac.to/wp-content/uploads/2013/12/radium.175x175-752.png","title":"Radium v3.0.1 – Multi-network radio player; supports XM Online, AOL Radio, and more","content":"Radium is an Internet radio player that’s designed from the ground up to be simple, intuitive, and lightweight. With its powerful search, thousands of supported stations (including Sirius/XM and DI.fm/Sky.fm Premium), and the ability to add your own streams, Radium will change the way you listen to Internet radio.   Version 3.0.1: Added VoiceOver support. […]"},{"link":"https://nmac.to/blog/mac-os-x-mountain-lion-10-8-2/","image":"https://nmac.to/wp-content/uploads/2013/12/lion.png","title":"Mac OS X Mountain Lion 10.8.2 build 12C60","content":"OS X Mountain Lion – the latest version of the most advanced operating system in the world. Mountain Lion includes over 200 new features that extend the capabilities of your Mac. With the new Messages app, you can send text, photos, videos, contacts, links and documents to any user Mac, iPhone, iPad, or iPod touch […]"},{"link":"https://nmac.to/blog/solar-walk-2-0-1/","image":"https://nmac.to/wp-content/uploads/2013/12/solarwalk.175x175-75.png","title":"Solar Walk 2.0.1 – Astronomer-friendly space exploration tool","content":"This 3D Solar System model enables you to navigate through space and time, observe all the planets in close-up, learn their trajectories, inner structure, history of their exploration, points of interest and more. Use 3D mode to get a more realistic experience! And zoom out to view and spin the entire Galaxy!   MAIN FEATURES: […]"},{"link":"https://nmac.to/blog/lock-screen-plus-2-1/","image":"https://nmac.to/wp-content/uploads/2013/03/Lock-Screen-Plus.png","title":"Lock Screen Plus 2.1 – Secure lock screen with weather forecast","content":"Lock Screen Plus is a secure and beautiful lock screen application combining with a weather forecast. You can choose a variety of themes (totally free!) which have different layouts and unique unlock styles. The application provides a variety of themes starting with 4 themes and we are adding themes continuously. Each theme has different layout, clock, […]"},{"link":"https://nmac.to/blog/webcrusher-2-3-2/","image":"https://nmac.to/wp-content/uploads/2013/12/WebCrusher.175x175-75.png","title":"WebCrusher v2.3.2 – One-click website filesize optimization","content":"WebCrusher offers one-click website optimization, reducing the time it takes for your website to load in your customer’s Web browser. Create your Web site any way you like then run it through WebCrusher and publish it to your Web server. In less than 5 minutes you will have a faster loading Web site with absolutely […]"},{"link":"https://nmac.to/blog/elsewhere-ambient-nature-sounds-1-3/","image":"https://nmac.to/wp-content/uploads/2013/12/Elsewhere.175x175-75.png","title":"Elsewhere: Ambient Nature Sounds v1.3 – Brings harmony to your ear","content":"Want to get away from the monotonous office noises? Crave for the ocean breeze or the leaves whispering? Or maybe you need a cheer up with the sounds of the city? Any of your cravings will be satisfied with Elsewhere! Elsewhere app creates a special atmosphere around you with its ambient sounds. Elsewhere is: – […]"},{"link":"https://nmac.to/blog/squirrel-0-9-2/","image":"https://nmac.to/wp-content/uploads/2013/12/Squirrel.175x175-75.png","title":"Squirrel v0.9.2 – Simple way to track and plan finances","content":"Squirrel is a personal finance application that helps you track and plan your finances with ease and fun. Forecast and track your spendings, analyze where your money is going with graphs, and stay on track with your finances thanks to budgets. WHAT’S NEW Version 0.9.2: Improved OFX importer Improved transaction name autocompletion Fixed an issue […]"}]