[{"link":"https://nmac.to/blog/unibox/","image":"https://nmac.to/wp-content/uploads/2015/12/Unibox1.png","title":"Unibox 1.9.2 – Email client with messages organized by person","content":"Unibox is a people-centric email client that organizes your messages by person. It avoids having email like a to-do list.   Features Unibox supports IMAP servers: Gmail iCloud, me.com, mac.com Yahoo! Exchange if IMAP is enabled Hotmail, outlook.com, live.com Self-hosted IMAP servers Many more Single window: Instantly compose your messages without opening new windows. Conversations: […]"},{"link":"https://nmac.to/blog/recordam/","image":"https://nmac.to/wp-content/uploads/2016/12/Recordam.png","title":"Recordam 1.3.3 – One-click audio recording","content":"Recordam, an elegant and easy-to-use application for recording audio, lets you create a new record in one click. It combines a powerful high-quality audio recorder and convenient storage for recorded audio files. The modern, user-friendly interface allows you to see everything at a glance, including the current input device and an input-volume level so you […]"},{"link":"https://nmac.to/blog/lucid-dream/","image":"https://nmac.to/wp-content/uploads/2018/10/Lucid-Dream.png","title":"Lucid Dream 1.0 – Emotional point & click adventure game","content":"Lucid Dream is the story of little Lucy, who goes on an adventure into the world of dreams with the mission to save her mother.   Lucid Dream is an award-nominated, handcrafted, colorful and emotional point&click adventure game. During the mission to save Lucy’s mother, you will discover worlds such as: Lunar roofs – where […]"},{"link":"https://nmac.to/blog/enigma/","image":"https://nmac.to/wp-content/uploads/2018/10/Enigma.png","title":"Enigma 2.2 – Text encryption software","content":"Enigma can three touch to encrypt the text.   Enigma is also in the App Store for iOS and support other platforms (see Enigma menu).   Agree with the person about Your “Key” encryption (for example, the number “563”), and he will be able to decrypt Your message.   Features: as the encryption key, you […]"},{"link":"https://nmac.to/blog/inpixio-photo-eraser/","image":"https://nmac.to/wp-content/uploads/2017/10/InPixio-Photo-Eraser.png","title":"InPixio Photo Eraser 1.1 – Remove unwanted elements like magic","content":"Tired of taking pictures with all those unwanted background images? Have you ever wanted to just get rid of that sign behind your or those people walking by? Well now you can erase anything in your picture that you don’t want there with Photo Eraser Mac. All you need to do is decide which image […]"},{"link":"https://nmac.to/blog/controllermate/","image":"https://nmac.to/wp-content/uploads/2017/08/ControllerMate4.png","title":"ControllerMate 4.11.1 – Use joystick, gamepad, trackball in place of keyboard","content":"ControllerMate is a controller programming tool that allows custom functionality to be added to standard HID devices (joysticks, trackballs, gamepads, keyboards, and more).   Using a graphical interface and drag-and-drop editing, users can program controller buttons to perform complex keyboard and mouse sequences. Programming is accomplished using “building blocks”. Each type of building block performs […]"},{"link":"https://nmac.to/blog/ommbits/","image":"https://nmac.to/wp-content/uploads/2018/04/OmmBits.png","title":"OmmBits 1.2.0 – An instant teleport to a short writing experience","content":"OmmBits is an instant access to a minimal world where you can better isolate your thoughts and focus on your words.   Like a very short teleportation.   Like a note taking app in a more minimal and relaxing space.   Almost as if you could write with your eyes closed.   We imagine OmmBits as […]"},{"link":"https://nmac.to/blog/chatty-for-facebook/","image":"https://nmac.to/wp-content/uploads/2016/07/Chatty2.png","title":"Chatty for Facebook 2.6.0 – Lightweight Facebook chat","content":"Chatty for Facebook is a lightweight, but fully functional app for chatting with your Facebook friends. It is a whole new way of keeping in touch with your buddies.   Features Messenger functionality. Supports Retina display. Choose the appearance that fits for you for the best experience. Compact mode – to make chatting more comfortable […]"},{"link":"https://nmac.to/blog/grabber/","image":"https://nmac.to/wp-content/uploads/2016/12/Grabber.png","title":"Grabber 1.7 – Screenshot Master","content":"Grabber : Screenshot Master allows you to capture the screen as a layered PSD file or single PNG image.   Great timesaver : Open and edit in Photoshop, Pixelmator or any other PSD compatible graphic editor. Hide, reorder and move any layer to customise screenshot.   Grabber lives in your status bar, you can use […]"},{"link":"https://nmac.to/blog/chatmate-for-whatsapp/","image":"https://nmac.to/wp-content/uploads/2017/10/ChatMate-for-WhatsApp.png","title":"ChatMate for WhatsApp 4.3.1 – Powerful WhatsApp client","content":"ChatMate for WhatsApp (was App for WhatsApp) is a powerful app for using WhatsApp.   These unique features can only be found in ChatMate for WhatsApp: Send and receive text messages, voice messages, photos, videos, documents and Emojis Record videos and photos directly in app and share them with your friends Dark Mode: With a […]"}]