[{"link":"https://nmac.to/blog/blow-up/","image":"https://nmac.to/wp-content/uploads/2018/09/Blow-Up.png","title":"Blow Up 3.1.4.402 – Photoshop image sharpen plug-in","content":"Blow Up keeps photos crystal clear during enlargement. Especially in large prints hung on a wall, the difference between Blow Up and Photoshop is astounding. Version 3 makes pictures even sharper without computer artifacts. If you understand Photoshop’s resize command then you already know how to use Blow Up. Our large library of standard paper […]"},{"link":"https://nmac.to/blog/airmail/","image":"https://nmac.to/wp-content/uploads/2020/02/Airmail_4.png","title":"Airmail 5.5.3 – Powerful, minimal email client","content":"Airmail is an mail client with fast performance and intuitive interaction. Support for iCloud, MS Exchange, Gmail, Google Apps, IMAP, POP3, Yahoo!, AOL, Outlook.com, Live.com.   Airmail was designed from the ground to retain the same experience with a single or multiple accounts and provide a quick, modern and easy-to-use user experience. Airmail is clean […]"},{"link":"https://nmac.to/blog/videoproc/","image":"https://nmac.to/wp-content/uploads/2017/05/VideoProc.png","title":"VideoProc 4.7 – HD Video Converter For Mac","content":"VideoProc preserves the main feature of WinX HD Video Converter for Mac, namely, video conversion. It uniquely adopts Intel QSV, NVIDIA CUDA/NVENC, and AMD powered level-3 hardware acceleration tech, thus converting, compressing and processing Blu-ray videos, HDTV/HD-camcorders videos, 4K UHD HEVC/H.264 videos, 1080p multi-track HD videos, standard MP4, MOV, AVI, MPEG and other videos 64x […]"},{"link":"https://nmac.to/blog/grandtotal/","image":"https://nmac.to/wp-content/uploads/2020/11/GrandTotal_7.png","title":"GrandTotal 7.3.1 – Create invoices and estimates","content":"GrandTotal is an application to create invoices and estimates based on your own templates. The built-in template editor allows you to adjust your layout to fit your company’s corporate design. GrandTotal works great in conjunction with TimeLog.   Version 7.3.1: New Preview Feature: Sending mails via SMTP/IMAP Server New: Support for dutch time tracking Keeping. […]"},{"link":"https://nmac.to/blog/texpad/","image":"https://nmac.to/wp-content/uploads/2021/06/Texpad_1.png","title":"Texpad 1.9.9 – LaTeX editor","content":"Texpad is a LaTeX editor designed for straightforward navigation of projects of any size. When Texpad opens a document it scans through it, looking for LaTeX structure commands and any included files, then it presents you with an outline view with which you can swiftly navigate the entire project.   Texpad replaces LaTeX’s obscure console […]"},{"link":"https://nmac.to/blog/cardhop-manage/","image":"https://nmac.to/wp-content/uploads/2021/03/Cardhop_2.png","title":"Cardhop 2.0.10 – Manage your contacts","content":"Cardhop lets you search, add, edit, and interact with your contacts in a fun and interactive way. Just type what you want and Cardhop will figure it out.   Features: Search: Instantly find what you’re looking for by typing the name or details and let Cardhop handle the rest. Add or edit: Add new contacts […]"},{"link":"https://nmac.to/blog/oka-unarchiver/","image":"https://nmac.to/wp-content/uploads/2022/04/Oka_Unarchiver_2.png","title":"Oka Unarchiver Pro 2.1.4 – ZIP, 7z Compress & Decompress","content":"Oka Unarchiver is upgraded to version 2.0. New interface, optimized operation experience.   Compression formats supported: ZIP   Extraction formats supported: 7Z, ZIP, RAR, TAR, GZIP, BZIP2, XZ, LZIP, ACE, ISO, CAB, PAX, JAR, AR, CPIO, and more   The Oka Unarchiver is a small and easy-to-use program that can archive or unarchive many different […]"},{"link":"https://nmac.to/blog/super-photocut-pro/","image":"https://nmac.to/wp-content/uploads/2017/03/Super-PhotoCut-Pro.png","title":"Super PhotoCut Pro 2.8.6 – Transparent Wedding Gown Cutout","content":"Pioneering in the world, Super PhotoCut Pro is an unprecedented tool designed to AUTO cut out transparent objects and wedding dresses.   Removing image background from transparent objects (veil, glass, water, fire…) is a complex and difficult matting task even on the premise that you are proficient in Photoshop. Now it could be easily done […]"},{"link":"https://nmac.to/blog/downcast/","image":"https://nmac.to/wp-content/uploads/2016/02/Downcast2.png","title":"Downcast 2.11.9 – Download, play, and sync your podcasts","content":"Downcast lets you download, play, and sync  your favorite podcasts with an intuitive interface built specifically for podcasts.   Subscription Features Search, subscribe to, and download audio and video podcasts Manually subscribe to podcasts via URL Download podcasts automatically (including resuming downloads) Browse and download older podcast episodes Auto-update podcast feeds based on schedule Settings […]"},{"link":"https://nmac.to/blog/start/","image":"https://nmac.to/wp-content/uploads/2021/02/start_5.png","title":"start 5.6 – Open applications, documents or folders quickly and easily","content":"innovative::bytes’ start is an unique launcher for macOS that allows you to open applications, documents or folders quickly and easily. Create tidiness in your Dock and start items with the smart launcher app start instead.   start supports you and your workflow with a well planned organizational system for your items and quick access to […]"}]