[{"link":"https://nmac.to/blog/doyourdata-super-eraser/","image":"https://nmac.to/wp-content/uploads/2017/04/DoYourData-Super-Eraser5.png","title":"DoYourData Super Eraser 5.7 – Secure deletion of data","content":"DoYourData Super Eraser offers reliable data erasure to permanently erase selected files/folders, as well as to wipe entire hard drives and storage media, and to wipe unused disk space to destroy deleted data and traces. After erasure with DoYourData Super Eraser, the erased data is permanently removed, and can’t be recovered by any data recovery […]"},{"link":"https://nmac.to/blog/reus/","image":"https://nmac.to/wp-content/uploads/2014/02/Reus1.png","title":"Reus 1.6.5 – Take control of nature through the hands of mighty giants","content":"In Reus, you control powerful giants that help you shape the planet to your will. You can create mountains, oceans, forests and more. Enrich your planet with plants, minerals and animal life. There is only one thing on the planet that you do not control: mankind, with all their virtues and and all their vices. […]"},{"link":"https://nmac.to/blog/mousecraft/","image":"https://nmac.to/wp-content/uploads/2014/07/MouseCraft1.png","title":"MouseCraft 1.20 – Puzzle game with wonderful hand-crafted levels","content":"MouseCraft is an A to B puzzle game where players help mice in their relentless quest for cheese by stacking the world’s most famous blocks: Tetrominos. Gather collectibles, fight enemies, use different types of bricks, blow up things and avoid enviromental hazards in 80 hand crafted levels.   Key Game Features: Experience a remix of […]"},{"link":"https://nmac.to/blog/broken-sword/","image":"https://nmac.to/wp-content/uploads/2014/07/Broken-Sword-5.png","title":"Broken Sword 5 2.2 – Point & Click Mystery & Adventure Game","content":"A robbery… a murder… and the beginning of another epic, original Broken Sword adventure.   From multi-award winning Revolution Software comes the latest explosive episode in this classic series. Playing as intrepid American George Stobbart and sassy French journalist Nico Collard, you find yourself on the trail of a stolen painting – and a murderous […]"},{"link":"https://nmac.to/blog/deponia-doomsday/","image":"https://nmac.to/wp-content/uploads/2016/03/Deponia.Doomsday.png","title":"Deponia Doomsday 1.2.0267 – Unique Adventure & Comedy Game","content":"One fateful night, Rufus awakes from a haunting nightmare: he sacrificed himself to save Deponia. But at what price? Elysium, the floating city crash-landed on the planet. As the last surviving Deponian, he fought savage fewlocks, but in the end, there was only one way out: He had to blow up Deponia! And… He grew […]"},{"link":"https://nmac.to/blog/outlast/","image":"https://nmac.to/wp-content/uploads/2015/04/Outlast2.png","title":"Outlast: Whistleblower 2.0.0.2 – First-Person Survival Horror Game","content":"Hell is an experiment you can’t survive in Outlast, a first-person survival horror game developed by veterans of some of the biggest game franchises in history. As investigative journalist Miles Upshur, explore Mount Massive Asylum and try to survive long enough to discover its terrible secret… if you dare.   Synopsis: In the remote mountains […]"},{"link":"https://nmac.to/blog/botanicula/","image":"https://nmac.to/wp-content/uploads/2019/03/Botanicula.png","title":"Botanicula 2.0.0 – Casual Point & Click Adventure & Puzzle Game","content":"Botanicula is a humor-filled adventure game created by the makers of award-winning Machinarium and Samorost series, studio Amanita Design and Czech band DVA.   Five friends, little tree creatures, set out on a journey to save the last seed from their home tree which is infested by evil parasites.   Key Features: Relaxed game perfect […]"},{"link":"https://nmac.to/blog/big-pharma/","image":"https://nmac.to/wp-content/uploads/2016/03/Big.Pharma.png","title":"Big Pharma 1.08.02 – Simulation, Strategy & Management of Pharmaceutical Business","content":"What if you had it in your power to rid the world of disease, to improve the lives of millions, to ease suffering and cure the sick… and earn a tidy profit?   As the head of your own Pharmaceutical Conglomerate you have this power resting in your hands. Will you use it for good? […]"},{"link":"https://nmac.to/blog/memoria/","image":"https://nmac.to/wp-content/uploads/2013/09/Memoria1.png","title":"Memoria 1.2.3 – Point & Click Adventure, Fantasy & Puzzle Game","content":"Two stories, two main characters, one epic experience: in Memoria, players travel through different time periods, while following two distinct protagonists: Sadja, a southern princess who wants to be a war hero, and Geron, a bird catcher who wants to lift a curse from his girlfriend. The game combines point & click gameplay with unique […]"},{"link":"https://nmac.to/blog/the-lego-movie-2-videogame/","image":"https://nmac.to/wp-content/uploads/2019/03/The-LEGO-Movie-2-Videogame.png","title":"The LEGO Movie 2 Videogame 1.0.1 – Story Rich Casual LEGO Game","content":"Alien monster invaders have left Bricksburg in ruins. It is now up to Emmet and a host of heroic characters to go beyond their world and save their friends from the strange inhabitants of the Systar System.   Journey into outer space, discover new worlds, and test your Master Building skills!   FAN-FAVORITE CHARACTERS Emmet, […]"}]