[{"link":"https://nmac.to/blog/magic-flowers-2-1/","image":"https://nmac.to/wp-content/uploads/2017/04/Magic-Flowers.png","title":"Magic Flowers 2.1 – Beautiful slow-moving timelapse flowers","content":"Magic Flowers brings your Mac into full bloom with beautiful slow-moving timelapse flowers for your Wallpaper and Screen Saver. Enjoy 42 unique flowers captured by the master of timelapse Louie Schwartzberg. #1 Entertainment App and featured by Apple in Best New Apps.   Magic Flowers uses timelapse to reveal an intimate and unprecedented high-definition glimpse […]"},{"link":"https://nmac.to/blog/corebreach-1-1-6/","image":"https://nmac.to/wp-content/uploads/2017/04/CoreBreach.png","title":"CoreBreach 1.1.6 – Anti-gravity racing game","content":"CoreBreach is THE brand-new futuristic “anti-gravity” racing game for Mac OS X.   Features:   6 Exciting anti-gravity ships: CoreBreach offers 6 great ships from easy maneuverable to rigid but ultra fast – and an unbelievable bonus ship. 6 Race tracks & reverse mode: You can choose from 6 beautiful, detailed and futuristic tracks of […]"},{"link":"https://nmac.to/blog/battle-worlds-kronos/","image":"https://nmac.to/wp-content/uploads/2014/01/BattleWorlds.Kronos.png","title":"Battle Worlds: Kronos 1.4.3 – Turn-based strategy game","content":"Battle World: Kronos is a classic turn-based strategy game in the tradition of Battle Isle, Advance Wars and Panzer General. Have you ever wondered what games like that would look like today? Well, we did. As a result, we decided to develope Battle Worlds: Kronos.   Key Featues: Two Single Player Campaigns (~50 hours of […]"},{"link":"https://nmac.to/blog/the-beggars-ride-1-0/","image":"https://nmac.to/wp-content/uploads/2017/04/The.Beggars.Ride_.png","title":"The Beggar’s Ride 1.0 – Unique and innovative Platform Puzzle & Adventure Game","content":"The Beggar’s Ride is a unique, story driven puzzle-platformer. While exploring a queer land as an old beggar, you can wear ancient masks to see the world through the eyes of a god! Use the powers of the masks to solve puzzles by altering the very fabric of world!   Follow the beggar’s ride to […]"},{"link":"https://nmac.to/blog/orwell/","image":"https://nmac.to/wp-content/uploads/2017/04/Orwell.png","title":"Orwell 1.1 – Search & investigate about the responsible of terror attacks","content":"Big Brother has arrived – and it’s you. Investigate the lives of citizens to find those responsible for a series of terror attacks. Information from the internet, personal communications and private files are all accessible to you. But, be warned, the information you supply will have consequences…   Orwell is a new governmental security program […]"},{"link":"https://nmac.to/blog/finch-for-inbox-2-1/","image":"https://nmac.to/wp-content/uploads/2017/04/Finch-for-Inbox.png","title":"Finch for Inbox 2.1 – Quickly access your email without a web browser","content":"Finch for Inbox is an advanced Inbox by Gmail desktop client on your Mac. It’s perfect for quickly accessing your Inbox account without ever needing to open a web browser. Full of extra features exclusive to Finch for Inbox.   Features MacBook Pro Touch Bar-ready (pro) Pretty reader mode (pro) Copy/paste image, files, HTML Use […]"},{"link":"https://nmac.to/blog/tasks-1-0-3/","image":"https://nmac.to/wp-content/uploads/2016/08/Tasks.png","title":"Tasks 1.0.3 – Manage all your daily tasks and get them done in style","content":"Tasks is a wonderful productivity companion which helps you to manage all your daily tasks and get them done in style. Never miss to track a task again.   Tasks Management Simplified Tasks app helps you to track all your tasks and ensure that they are completed. The simple and data focussed interface helps you […]"},{"link":"https://nmac.to/blog/system-cleaner-antivirus-movavi-2-4/","image":"https://nmac.to/wp-content/uploads/2016/08/System.Cleaner.and_.Antivirus.Movavi.png","title":"System Cleaner & Antivirus Movavi 2.4 – Protect your computer against internet threats","content":"System Cleaner & Antivirus Movavi is a powerful yet user-friendly application for OS X systems that will speed up your Mac and protect it against a whole range of cyberthreats. When computers start running slowly, it’s often because the hard drive gets clogged up with unnecessary files that users don’t even know exist. System Cleaner […]"},{"link":"https://nmac.to/blog/greeting-card-shop-4-0-3/","image":"https://nmac.to/wp-content/uploads/2017/04/Greeting-Card-Shop4.png","title":"Greeting Card Shop 4.0.3 – Create cards for life’s special moments","content":"Greeting Card Shop helps you create cards for life’s special moments. Whether you’re sending an invitation for a birthday, or sharing your sympathies, the software makes it easy to stay close to those who are important to you. The fastest, easiest way to create greeting cards and invitations!   Version 4.0.3: Updated web links in […]"},{"link":"https://nmac.to/blog/audio-cutter-3-2-0/","image":"https://nmac.to/wp-content/uploads/2014/01/Audio.Cutter.png","title":"Audio Cutter 3.2.0 – Quick way to cut your audio files visually","content":"iFunia Audio Cutter is a neat application to quick and easy cut your music and audio file on Mac. You could cut out a desired musical fragment from almost all audio formats: mp3, mp2, wma, wav, ogg, aac, ac3, m4a, mka, aiff, ape, flac.   Simple steps to cut the music and audio files to […]"}]