[{"link":"https://nmac.to/blog/music-collector/","image":"https://nmac.to/wp-content/uploads/2017/03/Music-Collector.png","title":"Music Collector 20.3.2 – Catalog your CDs in a database automatically","content":"Music Collector lets you catalog your CDs in a database automatically. Just insert a CD in your CD-ROM drive, scan its barcode, or type artist and title to download all data from various sources on the Internet. Use the integrated TWAIN support to scan cover images directly into the program.   Browse your collection by […]"},{"link":"https://nmac.to/blog/repix/","image":"https://nmac.to/wp-content/uploads/2017/07/RepixPro.png","title":"RePix Pro 2.2 – Resize multiple images at once","content":"An all in one solution for all your tasks related to Applying Filters, Resizing, Cropping, and renaming all of your images at once. Batch Processing of images was never this easy. whether it be one image or thousands of them, processing them is as easy as snapping your fingers. whether you have strict size criteria […]"},{"link":"https://nmac.to/blog/flashcard-hero/","image":"https://nmac.to/wp-content/uploads/2014/08/Flashcard-Hero2.png","title":"Flashcard Hero 3.2 – Elegant yet versatile study aid","content":"Flashcard Hero is a study app that lets you make your own flash cards and take the pressure out of test preparation. It keeps track of what facts you already know so you can focus on what you don’t know, saving a lot of time.   Beyond your average vocabulary app: Flashcard Hero is for […]"},{"link":"https://nmac.to/blog/gamepedia/","image":"https://nmac.to/wp-content/uploads/2020/02/Gamepedia.png","title":"Gamepedia 6.1.1 – Catalog video and computer games","content":"Gamepedia is a powerful cataloging application for video and computer games which allows you to retrieve all your game information from the Internet, either by using keywords or using an iSight or a scanner for the search.   Gamepedia lets you to search several international gaming sites for information about your video and board games. […]"},{"link":"https://nmac.to/blog/kitchen-timer-with-alarm/","image":"https://nmac.to/wp-content/uploads/2021/06/Kitchen-timer-with-alarm.png","title":"Kitchen timer with alarm 1.2 – Multiple alarms for cooking","content":"Kitchen timer app is the first professional cooking timer designed to cook up to 12 dishes at the same time.   Forget the traditionally boiled egg timer, now you can cook complex dishes like a real chef and avoid burning your food.   Why is the kitchen timer app better? Its the only one with […]"},{"link":"https://nmac.to/blog/one-chat/","image":"https://nmac.to/wp-content/uploads/2016/10/One-Chat2.png","title":"One Chat 4.9.7 – All in one Messenger","content":"One Chat combines chat and messaging services into one simple Mac application.   WhatsApp, Facebook Messenger, Hangouts, Telegram, Skype, Slack, WeChat, Twitter, YahooChat, ICQ chat, HipChat, Discord, GroupMe, QQ and Facebook Page messenger.   One App for all messaging services.   Use it for the following messenger and chat like a boss:-   WhatsApp, Facebook […]"},{"link":"https://nmac.to/blog/mr-zipper/","image":"https://nmac.to/wp-content/uploads/2021/06/Mr.-Zipper.png","title":"Mr. Zipper 2.80 – Zip Files and Unzip Archives","content":"Mr.Zipper is an excellent, professional compression and extraction tool with personalized settings. It can protect your data by a password.   It features more supported formats than other zip tools.   Supported extraction formats: RAR, 7Z, ISO, CAB, MSI, Zip, Stuffit, Arj, Z, Lzma, Tar, Gzip, Bzip2, EXE, PAX.   Supported compression formats: 7Z, Zip, […]"},{"link":"https://nmac.to/blog/juno-editor/","image":"https://nmac.to/wp-content/uploads/2018/05/Juno-Editor.png","title":"Juno Editor 2.5.1 – Roland Juno 106 and MKS7 Librarian","content":"Juno Editor is a preset editor and library for the Roland Juno 106 and MKS7 Synthesizers. Save, organize and edit presets via a simple MIDI connection.   Presets can be created from scratch or received from the synthesizer’s inner memory, and are stored as .jep documents or .syx files (sysex) on your hard drive.   […]"},{"link":"https://nmac.to/blog/profanity-filter/","image":"https://nmac.to/wp-content/uploads/2021/06/Profanity-Filter.png","title":"Profanity Filter 1.0.3 – Filter inappropriate words","content":"Filter profanity online! Useful for young children who are surfing the internet – or users trying to reduce the exposure to inappropriate language online.   Version 1.0.3: This update includes a new icon, and removes the popover.   Intel, 64-bit processor macOS 10.15 or later    "},{"link":"https://nmac.to/blog/adobe-dimension-cc/","image":"https://nmac.to/wp-content/uploads/2020/04/Adobe-Dimension-2020.png","title":"Adobe Dimension CC 3.4.3 – Full-featured 3D design platform","content":"Adobe Dimension is a powerful and user-friendly utility created to help you speed up the process of designing 3D photorealistic package and product art from scratch, such as mockups, advertising shots, logos, and branding, even if you have little to no previous with similar solutions.   With the help of the Adobe Dimension design software […]"}]