[{"link":"https://nmac.to/blog/pdf-protector/","image":"https://nmac.to/wp-content/uploads/2015/12/PDF.Protector.png","title":"PDF Protector 1.5.1 – Easily encrypt and decrypt PDF documents","content":"PDF Protector is an easy to use utility to encrypt or decrypt your PDF documents.   Features Supports Adobe Standard 40-bit Encryption and Adobe Advanced 128-bit Encryption. Password protect opening of the document. Unlock password protected documents. Prevent printing of the document. Prevent copying and changes to the document. Easy to use. Compatible with all […]"},{"link":"https://nmac.to/blog/prismalog/","image":"https://nmac.to/wp-content/uploads/2020/12/PrismaLog.png","title":"PrismaLog 1.4 – Log time in task,story,project","content":"PrimaLog helps you to track the time spent per project, story and task. It is a small tool for working at home or in projects to track time as agile as the projects are running.   With PrismaLog, the focus is on the simplest possible time recording with a clearly defined specification of a 3-level […]"},{"link":"https://nmac.to/blog/doublepane/","image":"https://nmac.to/wp-content/uploads/2016/08/DoublePane_1.png","title":"DoublePane 1.8 – Reposition windows effortlessly","content":"DoublePane is an effortless window positioning helper.   Have you ever wasted time repositioning application windows so you can see two windows simultaneously? Do you struggle to move and resize windows so that they don’t overlap?   DoublePane effortlessly repositions application windows to maximize your screen space for easy side-by-side viewing.   With one click, […]"},{"link":"https://nmac.to/blog/macgourmet-deluxe/","image":"https://nmac.to/wp-content/uploads/2014/02/MacGourmet-Deluxe.png","title":"MacGourmet Deluxe 4.3.0 – Easily create, build and share your recipe collection","content":"With MacGourmet Deluxe, you can easily create, build, and share your recipe collection. Make notes about your favorite wines; plan meals for a day or a week and then sync to iCal. Get the nutritional values of foods, recipes and individual servings by accessing the USDA database included in MacGourmet. Print out shopping lists or […]"},{"link":"https://nmac.to/blog/tableplus/","image":"https://nmac.to/wp-content/uploads/2019/05/TablePlus.png","title":"TablePlus 3.11.0 – Modern, native tool for relational databases","content":"TablePlus is a modern, native, and friendly tool for relational databases.   Features: Native, Fast, and Secured: Query, edit, and save your database easily with a native app that can run fast like a lambo. It’s also equipped with many security features to protect your database, including native libssh and TLS to encrypt your connection. […]"},{"link":"https://nmac.to/blog/gpg-suite/","image":"https://nmac.to/wp-content/uploads/2018/09/GPG-Suite.png","title":"GPG Suite 2020.2 – OpenPGP on macOS","content":"GPG Suite (was GPGTools Installer) is an open source installer for OS X. It installs all related OpenPGP applications, plugins and dependencies.   Version 2020.2: Native Support for Apple Silicon All of our Apps and Services are optimized for Apple Silicon MacGPG will launch in Rosetta 2 compatibility mode for now but should be available […]"},{"link":"https://nmac.to/blog/tenorshare-4ddig/","image":"https://nmac.to/wp-content/uploads/2020/11/Tenorshare-4DDiG.png","title":"Tenorshare 4DDiG 3.2.0 – Recover Unlimited Mac Data","content":"Do you want to recover previously deleted files on the macOS computer? Tenorshare 4DDiG – Mac can help you. With support to more than 550+ file types, it’s a very simple task to get your lost/deleted/formatted files back to Mac.   Photos JPEG, JPG, PNG, PSD, DNG, GIF, RAW, MRW, PCD, RAF, SVG, RAF, BMP, […]"},{"link":"https://nmac.to/blog/fotomagico/","image":"https://nmac.to/wp-content/uploads/2016/03/FotoMagico5.png","title":"FotoMagico 5.6.14 – Powerful slideshow creator with multi-app integration","content":"FotoMagico lets you create professional slideshows from your photos and music with just a few, simple mouse clicks. It sports a very clean and intuitive yet powerful user interface. High image quality, fast performance, and user flexibility were some of the design goals for this application.   Create the most spectacular slideshows: Scale, move, rotate, […]"},{"link":"https://nmac.to/blog/idatabase/","image":"https://nmac.to/wp-content/uploads/2018/04/iDatabase4.png","title":"iDatabase 6.6 – Organize all your information and data","content":"iDatabase is a basic and easy-to-use database manager that offers the most natural and easy way to organize information and data. With this database manager for Mac, you can manage membership lists, expenses, projects, keep track of your Internet accounts and much more! You can choose from 22 ready to use and easy to personalize […]"},{"link":"https://nmac.to/blog/my-favorites/","image":"https://nmac.to/wp-content/uploads/2020/11/My-Favorites.png","title":"My Favorites 2.2 – Favorites items at fingertips","content":"My Favorites is an incredibly handy app that allows you to bookmark your files, folders, web bookmarks, apps, text notes and color swatches that you need lightning fast access to.   The best part of the app is that it lives in the top menu-bar of your Desktop and allows you to add-in unlimited number […]"}]