[{"link":"https://nmac.to/blog/jixipix-premium-pack/","image":"https://nmac.to/wp-content/uploads/2018/09/JixiPix-Premium-Pack.png","title":"JixiPix Premium Pack 1.2.4 – 18 incredible creative apps into one powerful package","content":"For maximum savings and convenience, the Premium Pack bundles 18 incredible creative apps into one powerful package: Aquarella, Artista Haiku, Artista Oil, Artista Sketch, Artoon, Chalkspiration, Dramatic Black&White, Grungetastic, Kyoobik Photo, Moku Hanga, NIR Color, Pop Dot Comics, Portrait Painter, Rainy Daze, Romantic Photo, Simply HDR, Snow Daze and Vintage Scene. The Premium Pack comes […]"},{"link":"https://nmac.to/blog/swinsian/","image":"https://nmac.to/wp-content/uploads/2017/06/Swinsian2.png","title":"Swinsian 3.0 Preview 1 – Music manager and player","content":"Swinsian is a music manager and player for OS X.   Features: Supports FLAC/Ogg Vorbis as well as MP3, AAC, WAV, APE, AC3, WavPack, WMA, and cue files Copies tracks from iPods and iPhones Watches folders for new files Fetches album art Quick control window Imports iTunes libraries Playback over AirTunes Duplicate finding Bulk tag […]"},{"link":"https://nmac.to/blog/zgallery/","image":"https://nmac.to/wp-content/uploads/2021/05/zGallery_4.png","title":"zGallery 4.51 – Image and photo viewer","content":"zGallery is the elegant software that shows, browses and edits images and photos in your folder and disk. It is very easy to use but provides all must-have powerful functions.   Features Shows almost every common format image Thumbnail browsing for all type of file. (even video image files) Folder search browsing in tree panel […]"},{"link":"https://nmac.to/blog/desktop-curtain/","image":"https://nmac.to/wp-content/uploads/2019/02/Desktop_Curtain_3.png","title":"Desktop Curtain 3.1.3 – Displays temporary desktop picture in front of real one","content":"Desktop Curtain is a simple tool to hide the clutter on your desktop. It’s perfect for teachers, presenters, writers, developers, and anyone else that hates clutter and/or needs to take screenshots with a clean background.   Version 3.1.3: Fixed support for macOS 10.9 Mavericks.   Intel, 64-bit processor OS X 10.9 or later    "},{"link":"https://nmac.to/blog/dark-reader-for-safari/","image":"https://nmac.to/wp-content/uploads/2020/04/Dark.Reader.for_.Safari.png","title":"Dark Reader for Safari 1.4.4 – Create dark themes for websites on the fly","content":"This eye-care extension enables night mode creating dark themes for websites on the fly. Dark Reader inverts bright colors making them high contrast and easy to read at night. It perfectly suits to system dark mode.   Configure brightness and contrast to fit your display, choose between Dynamic and Filter mode, toggle individual websites, auto-toggle […]"},{"link":"https://nmac.to/blog/untitled-goose-game/","image":"https://nmac.to/wp-content/uploads/2020/08/Untitled-Goose-Game.png","title":"Untitled Goose Game 1.1.4 – Funny Stealth & Action Game","content":"Untitled Goose Game is a slapstick-stealth-sandbox, where you are a goose let loose on an unsuspecting village. Make your way around town, from peoples’ back gardens to the high street shops to the village green, setting up pranks, stealing hats, honking a lot, and generally ruining everyone’s day.   Featuring: A horrible goose (that’s you) […]"},{"link":"https://nmac.to/blog/goldie-app/","image":"https://nmac.to/wp-content/uploads/2019/06/Goldie-App.png","title":"Goldie App 2.0.1 – A designer’s ruler with superpowers","content":"Goldie helps you easily visualize or calculate the golden ratio and many other proportions right on your screen.   Here are two ways Goldie can help you:   RULERS They overlay on your screen allowing you to visually reference the golden ratio, the rule of thirds, the diagonal rule of thirds and the baroque proportions […]"},{"link":"https://nmac.to/blog/duplicate-manager-pro/","image":"https://nmac.to/wp-content/uploads/2017/01/Duplicate-Manager-Pro.png","title":"Duplicate Manager Pro 1.4.2 – Auto find and delete duplicate and large files","content":"Duplicate Manager Pro quickly and effectively cleans up your Mac from the duplicates and keeps your precious time! Ease to use and operation speed these are the basic principles in the app concept.   Why It’s for You Pre-installed scan jobs. Automatically scans on a schedule any number of scan jobs. The app scans folders […]"},{"link":"https://nmac.to/blog/bongiovi-dps/","image":"https://nmac.to/wp-content/uploads/2020/08/Bongiovi-DPS.png","title":"Bongiovi DPS 2.2.7.1 – Optimize the sound of your Mac’s audio devices","content":"Bongiovi DPS (was Digital Power Station) is a revolutionary audio enhancer that changes the way you listen to sound, whether it’s your favorite music, movies, Internet communication, streaming video or games. Bongiovi DPS “plugs in” to your computer’s sound system so all audio from any application on your Mac will receive the sonic benefits of […]"},{"link":"https://nmac.to/blog/filmwizard/","image":"https://nmac.to/wp-content/uploads/2019/05/Filmwizard3.png","title":"Filmwizard 3.5.0 – Easy-to-use tools for make movies","content":"Filmwizard is easy-to-use tools for make movies. It’s can record, edit and create high-quality movies and encode them as MPEG-4 files, or publish them directly to video sites such as Youtube, for your audience to enjoy.   Import, edit, share With Filmwizard, you can easily import photos from Photos, music/video from iTunes, and record voice […]"}]