[{"link":"https://nmac.to/blog/remixvideo-1-2-0/","image":"https://nmac.to/wp-content/uploads/2017/02/Remixvideo.png","title":"Remixvideo 1.2.0 – Enhance your live shows with Remixvideo, the intuitive video sampler","content":"Remixvideo is the weapon of choice for creative video mixing, with a slick grid interface that makes DJs/producers instantly feel at home.   It offers two ways to enhance music performances with visuals: linking audio samples to video pads in standalone mode, or playing it as a video plug-in within your favorite music software. Running […]"},{"link":"https://nmac.to/blog/sky-break-1-0/","image":"https://nmac.to/wp-content/uploads/2017/06/Sky-Break.png","title":"Sky Break 1.0 – Sci-fi Open World Adventure & RPG Game","content":"Humanity is threatened. A deadly virus is rapidly spreading.   The particular flora of Arcania, a planet once used by humans for space colonization, may help in the creation of a cure. But the planet has been abandoned ever since working drones turned against humans.   A group of researchers has been sent to this […]"},{"link":"https://nmac.to/blog/dust-an-elysian-tail-1-0/","image":"https://nmac.to/wp-content/uploads/2017/06/Dust-An-Elysian-Tail.png","title":"Dust: An Elysian Tail 1.0 – RPG & Action Platformer Game","content":"Immerse yourself in a gorgeous hand-painted world on a search for your true identity. As the mysterious warrior, Dust, your action-packed journey will take you from peaceful glades to snowy mountaintops and beyond. At your disposal is the mythical Blade of Ahrah, capable of turning its wielder into an unstoppable force of nature, and the […]"},{"link":"https://nmac.to/blog/expert-set-2-0/","image":"https://nmac.to/wp-content/uploads/2017/06/Expert-Set.png","title":"Expert Set 2.0 – Templates for Pages, Keynote, Numbers","content":"Are you a small-business owner or an entrepreneur? If so, you surely need a clear visual identity, and there’s no better value for money than Set for Business.   With Set for Business, you get 10 packs or in total 300 of templates.   Every pack contains templates for Pages: Business Cards Brochures Faxes Flyers […]"},{"link":"https://nmac.to/blog/templates-by-expert-3-1/","image":"https://nmac.to/wp-content/uploads/2017/05/Templates-by-Expert.png","title":"Templates by Expert 3.1 – Templates Bundle for Pages","content":"The premium-quality Pages Templates selection offers 87 beautiful and functional designs for Apple’s Pages for business and personal use.   The Templates for Pages 2016 set gives a large selection of templates from invitations to posters and brochures. Some templates consist of up to 6 different pages, so the package provides a variety of around […]"},{"link":"https://nmac.to/blog/hitman-absolution-elite-edition/","image":"https://nmac.to/wp-content/uploads/2017/05/Hitman-Absolution.png","title":"Hitman: Absolution – Elite Edition 1.1.1 – Stealth action shooter game","content":"    In Hitman: Absolution – Elite Edition become Agent 47, a genetically-engineered killer, and use your skill and ingenuity to turn assassination into an art. With extraordinary reflexes, creative stealth techniques and a powerful arsenal of weapons at your fingertips, pulling off the perfect hit has never been so much fun.   Get ready […]"},{"link":"https://nmac.to/blog/aiseesoft-audio-converter-9-1-10/","image":"https://nmac.to/wp-content/uploads/2017/05/Aiseesoft-Audio-Converter.png","title":"Aiseesoft Audio Converter 9.1.10 – Convert audio/video file to any audio format","content":"Aiseesoft Audio Converter – Convert audio file to MP3, AAC, M4A, AIFF, ALAC, WAV, FLAC and more with fast speed and high quality. Moreover, it can extract audio track from HD/SD video and convert the audio to your preferred audio format.   Convert any audio format Audio Converter for Mac can convert audio files to […]"},{"link":"https://nmac.to/blog/invitation-expert-2-1/","image":"https://nmac.to/wp-content/uploads/2017/05/Invitation-Expert.png","title":"Invitation Expert 2.1 – Templates for MS Word","content":"Organizing an event? Make sure everyone’s invited stylishly! With 102 original invitation templates, Alungu’s Invitations is your trusty companion to craft that perfect invitation for any kind of event. Birthday party, picnic, wedding, Christmas, New Year, Thanksgiving – Invitations Templates have you covered!   Every template is highly-customizable so unleash your creativity: edit, replace, resize […]"},{"link":"https://nmac.to/blog/expert-designs-3-1/","image":"https://nmac.to/wp-content/uploads/2017/05/Expert-Designs.png","title":"Expert Designs 3.1 – Templates for Pages","content":"The premium-quality Templates for Pages selection offers 87 beautiful and functional designs for Apple’s Pages.   Leave design for us – focus on content!   Features:   More than 200 layouts Themes for Pages – Templates Guru – brochures, reports set gives a large selection of templates from Invitations to Posters and Brochures. Some templates […]"},{"link":"https://nmac.to/blog/expert-templates-3-1-1/","image":"https://nmac.to/wp-content/uploads/2017/02/Template-Guru.png","title":"Expert Templates 3.1.1 – Pro Templates for Pages","content":"Template Guru (Templates Pro for Pages) gives you the power to turn your envelopes and invoices into a key part of a successful advertising campaign.   Each of the Templates Pro for Pages packs contains five templates in an elegant, consistent style: Brochure, Business Cards, Envelope, Invoice, and Letter. All templates are available in both […]"}]