[{"link":"https://nmac.to/blog/toki/","image":"https://nmac.to/wp-content/uploads/2019/06/Toki.png","title":"Toki 1.1 – The return of the wacky monkey","content":"Toki sets off on a new adventure! The cult action/platform game originally released on arcade machines in 1989 is back with a super-simian new version, featuring all-new hand-drawn graphics and re-orchestrated music!   Toki the warrior lived peacefully in the jungle with his sweetheart Miho. Appearing out of nowhere, the terrifying voodoo sorcerer Vookimedlo and […]"},{"link":"https://nmac.to/blog/applocker/","image":"https://nmac.to/wp-content/uploads/2017/01/AppLocker.png","title":"AppLocker 2.7.0 – Password protection for individual apps","content":"AppLocker can password protect individual apps on your Mac. It’s easy to use, and there is absolutely no configuration required. Just start AppLocker, add a password, and select the apps you want to keep private.   Use this tool and stop worrying about your privacy when you borrow your computer to a guest, friend, or […]"},{"link":"https://nmac.to/blog/gang-beasts/","image":"https://nmac.to/wp-content/uploads/2019/06/Gang-Beasts.png","title":"Gang Beasts 1.09 – Funny Multiplayer Fighting Game","content":"Gang Beasts is a silly multiplayer party game with surly gelatinous characters, brutal slapstick fight sequences, and absurd hazardous environments, set in the mean streets of Beef City.   Customise your character and fight local and online enemies in the melee game mode or fight with friends against the gangs of Beef City in the […]"},{"link":"https://nmac.to/blog/metal-gear-rising-revengeance/","image":"https://nmac.to/wp-content/uploads/2019/06/METAL-GEAR-RISING-REVENGEANCE.png","title":"METAL GEAR RISING: REVENGEANCE 1.0.4 – An epic story-telling & action game","content":"Developed by Kojima Productions and PlatinumGames, METAL GEAR RISING: REVENGEANCE takes the renowned METAL GEAR franchise into exciting new territory with an all-new action experience. The game seamlessly melds pure action and epic story-telling that surrounds Raiden – a child soldier transformed into a half-human, half-cyborg ninja who uses his High Frequency katana blade to […]"},{"link":"https://nmac.to/blog/solar-shifter-ex/","image":"https://nmac.to/wp-content/uploads/2019/06/Solar-Shifter-EX.png","title":"Solar Shifter EX 1.0 – A sci-fi shoot ’em up action game","content":"Warp into action with Solar Shifter EX. Man your ship and dive into fierce combat situations in space and over beautiful and distant planet surfaces. Solar Shifter EX is a sci-fi shoot ’em up with the unique ability to ‘shift’.   Your only weapon is your ship: The Phase Shifter has been outfitted with a […]"},{"link":"https://nmac.to/blog/memorytamer/","image":"https://nmac.to/wp-content/uploads/2016/10/MemoryTamer1.png","title":"MemoryTamer 1.5.2 – Automatic memory-freeing app","content":"MemoryTamer is an automatic memory-freeing app that runs in your menu bar. It supports notifications with both Growl and Notification Center, and also lets you free memory whenever you want with the “Free memory now” menu item.   On OS X 10.9, it gets even better! By tapping into a system function introduced in OS […]"},{"link":"https://nmac.to/blog/calendarpro-for-google/","image":"https://nmac.to/wp-content/uploads/2017/08/CalendarPro-for-Google3.png","title":"CalendarPro for Google 3.6 – Google Calendar application","content":"Calendar Pro for Google is a Google calendar app with intuitive design. Now, it’s so easy to get every event organized. It has a simple and neat look and is accessible, highly responsive and reliable.   Highlights Quick access to Google Calendar Fast and responsive Add multiple Google accounts and access different calendars in different […]"},{"link":"https://nmac.to/blog/dd-lords-of-waterdeep/","image":"https://nmac.to/wp-content/uploads/2019/06/Waterdeep.png","title":"D&D Lords of Waterdeep 1.0 – Dungeons & Dragons Strategy Board Game","content":"Wizards of the Coast and Playdek present the award-winning Dungeons & Dragons board game Lords of Waterdeep!   Welcome to Waterdeep, the City of Splendors! A city run by a secret society of masked Lords who rule with shady back-door dealings and unmatched political power. In Lords of Waterdeep players will play as one of […]"},{"link":"https://nmac.to/blog/star-wars-the-force-unleashed/","image":"https://nmac.to/wp-content/uploads/2019/06/Star-Wars-The-Force-Unleashed.png","title":"Star Wars: The Force Unleashed 1.3.0 – Experience the Power of the Dark Side of Star Wars","content":"Star Wars: The Force Unleashed completely re-imagines the scope and scale of the Force and casts players as Darth Vader’s “Secret Apprentice” unveiling new revelations about the Star Wars galaxy seen through the eyes of a mysterious new character armed with unprecedented powers.   The story and action of Star Wars: The Force Unleashed expands […]"},{"link":"https://nmac.to/blog/killing-floor/","image":"https://nmac.to/wp-content/uploads/2019/06/Killing-Floor.png","title":"Killing Floor 1.0 – 6-player co-op survival horror game","content":"Killing Floor is a Co-op Survival Horror FPS set in the devastated cities and countryside of England after a series of cloning experiments for the military goes horribly wrong. You and your friends are members of the military dropped into these locations with a simple mission: Survive long enough to cleanse the area of the […]"}]