[{"link":"https://nmac.to/blog/instant-translate/","image":"https://nmac.to/wp-content/uploads/2016/07/Instant-Translate.png","title":"Instant Translate 3.1.0 – Translate words and phrases between over 100 languages","content":"Instant Translate allows you to translate words and phrases between over 100 languages, use text-to-speech, and browse through already-done translations in the history.   You can quickly swap languages in the pop-up using Control+S.   Key Features: 100+ languages supported text-to-speech offline history of translations translate in the pop-up window that’s always in the menu […]"},{"link":"https://nmac.to/blog/lightweaver/","image":"https://nmac.to/wp-content/uploads/2017/08/LightWeaver.png","title":"LightWeaver 1.2 – A revolutionary photo effect software","content":"LightWeaver is a revolutionary photo effect that bombards your images with particles, finding edges and contours with different degrees of freedom and expressiveness : a refreshing take on generative sketching! Perfect for portrait pictures or faces : LightWeaver makes it easy for everyone to get an awesome social media profile picture Artists will explore new realms […]"},{"link":"https://nmac.to/blog/boris-red/","image":"https://nmac.to/wp-content/uploads/2017/08/Boris-RED.png","title":"Boris Red 5.6.0 – 3D video titling and effects solution","content":"Boris RED is the only integrated 3D compositing, titling, and effects application to deliver unparalleled performance to video editing software from Adobe, Apple, Avid, Grass Valley, Media 100, and Sony. An indispensable tool for post-production and broadcast professionals, RED offers a wide range of features right on your NLE timeline and adds a standalone engine […]"},{"link":"https://nmac.to/blog/vikings-wolves-of-midgard/","image":"https://nmac.to/wp-content/uploads/2017/08/Vikings-Wolves-of-Midgard.png","title":"Vikings – Wolves of Midgard 2.01 – Strive to survive the growing cold of Fimbulwinter","content":"Fear the wolves. They are cold, they are hungry – and they will stop at nothing to survive…   Ragnarok. Legend has it that when the coldest winter descends, the Jotan will return to take their vengeance against the Gods of Asgard. The world is on the road to perdition and the fate of Midgard […]"},{"link":"https://nmac.to/blog/escape/","image":"https://nmac.to/wp-content/uploads/2017/08/Escape.png","title":"Escape 2.0.2 – Track every time you open your email or social network","content":"Escape is a small application that tracks every time you opened your email or social network, even for a few seconds.   With deep concentration it is like when you’re trying to fall asleep. If you hear a 5 second alarm every 10 minutes, there’s no way you’d drift away. It would be better for […]"},{"link":"https://nmac.to/blog/turner/","image":"https://nmac.to/wp-content/uploads/2017/08/Turner.png","title":"Turner 1.0 – A 2D platformer puzzle game","content":"Turner is a 2D platformer puzzle game set in an insane asylum where you take the role of Turner, a man with a troubled past and an unstable state of mind. Complete over 500 levels by rotating the world around you. Solve a variety of puzzles, traverse through challenging levels, collect mysterious notes scattered throughout […]"},{"link":"https://nmac.to/blog/tanks-vs-aliens/","image":"https://nmac.to/wp-content/uploads/2017/08/Tanks.vs_.Aliens.png","title":"Tanks vs Aliens 1.0 – Real-time strategy and base defense game","content":"Hordes of alien tanks have flooded the streets, spreading chaos and terror everywhere they go. You’re the only one who can save humanity! Explore the world of futuristic tank battles in a brand new real-time strategy and base defense game.   Features: Complete 30 brain-twisting levels Utilize various strategies to achieve the top result Explore […]"},{"link":"https://nmac.to/blog/tuneskit-ibook-copy/","image":"https://nmac.to/wp-content/uploads/2016/06/iBook.Copy_.png","title":"TunesKit iBook Copy 2.1.3 – iBook DRM removal tool","content":"TunesKit iBook Copy is a unique iBook DRM removal tool in the market, TunesKit iBook Copy can easily remove DRM protection from Apple iBooks and copy DRM protected iBooks to DRM free ePub files with 1:1 ratio quality. With this iBook copy tool, you can keep the original meta information completely including the author, cover, […]"},{"link":"https://nmac.to/blog/pinner/","image":"https://nmac.to/wp-content/uploads/2017/08/Pinner.png","title":"Pinner 1.0 – Upload to Pinterest","content":"Pinner allows you to upload to Pinterest. If you want to share web pages in Safari, simply hit the share button, choose an account you want to pin from, a board you want to pin to, and you’re done!   Features: Multiple accounts Choose which board you want to pin to Supports sharing web pages […]"},{"link":"https://nmac.to/blog/easeus-data-recovery-wizard/","image":"https://nmac.to/wp-content/uploads/2016/05/EaseUS-Data-Recovery-Wizard.png","title":"EaseUS Data Recovery Wizard 10.9 – Recover unlimited types of data","content":"EaseUS Data Recovery Wizard offers you easy-to-use and reliable data-recovery. It can recover unlimited types of data from your Mac as well as from various other types of media storage Four easy modules can help users recover lost data safely and quickly: Photo Recovery, Deleted File Recovery, Deep Scan Recovery, and Lost Partition Recovery.   […]"}]