[{"link":"https://nmac.to/blog/singlemizer/","image":"https://nmac.to/wp-content/uploads/2018/01/Singlemizer.png","title":"Singlemizer 4.7.0 – Remove duplicate files from your Mac","content":"Use Singlemizer to remove unnecessary file duplicates, and bring order to file chaos. Minimalist UI External drives support Folders priorities Efficient scan algorithm Progressive results Duplicate folders detection Duplicates filtering Duplicates sorting Instant Quick Look preview One-click duplicates selection Safe duplicates removal Linking duplicates to the original item   Version 4.7.0: complete redesign to the […]"},{"link":"https://nmac.to/blog/mac-video-downloader/","image":"https://nmac.to/wp-content/uploads/2017/10/Mac-Video-Downloader.png","title":"Mac Video Downloader 3.4.5 – Download Videos and Music from 200,000+ Sites","content":"Mac Video Downloader is the unique web video downloader chosen by millions of people.   Mac Video Downloader can download pretty much any video that can be downloaded, and from any video hosting site, too. It can help you download your videos with just one click and at up to 10x normal download speeds. Download […]"},{"link":"https://nmac.to/blog/construct/","image":"https://nmac.to/wp-content/uploads/2018/01/Construct.png","title":"Construct: Escape the System 1.0 – A sci-fi themed first person platformer game","content":"Construct: Escape the System is a sci-fi themed first person platformer that sees you trapped in a computer system, trying to escape.   Explore the system and locate the 8 empowering ‘ability orbs’. Find and download the 5 ‘player upgrades’. Seek out and extract the 16 ‘system core power orbs’. Do all this and maybe […]"},{"link":"https://nmac.to/blog/legacy-of-the-elder-star/","image":"https://nmac.to/wp-content/uploads/2018/01/Legacy-of-the-Elder-Star.png","title":"Legacy of the Elder Star 1.206 – A mouse-driven shoot ’em up for the rest of us","content":"Legacy of the Elder Star is a mouse-driven shoot ’em up for the rest of us. You are the Cosmonaut, an eternal cosmic hero who must shatter the robotic Infinite Legion and rekindle a dying star!   Using a one-handed, mouse-driven control scheme, you’ll dodge and strike with 1:1 precision and unlimited movement speed. Evade […]"},{"link":"https://nmac.to/blog/innerspace/","image":"https://nmac.to/wp-content/uploads/2018/01/InnerSpace.png","title":"InnerSpace 1.0 – An exploration flying game","content":"    In the final days of the Inverse, you must help the Archaeologist recover the last remaining memories before they are lost forever. Fly through ancient skies and abandoned oceans to discover the lost history of this fading realm, where entire civilizations have died, yet their gods still wander.   InnerSpace is an exploration […]"},{"link":"https://nmac.to/blog/particle-fleet/","image":"https://nmac.to/wp-content/uploads/2018/01/Particle.Fleet_.png","title":"Particle Fleet: Emergence 1.1.4 – Space Simulation & Strategy Game","content":"Build and design your own fleets and stand opposed to the Particulate in this physics/strategy/RTS/fleet hybrid. Build partially destructible and self repairing ships that interact with enemies less controlled by some scripted logic and more driven by a real time massive physics particle simulation.   As Chief Executive Ticon you should have been the Galactic […]"},{"link":"https://nmac.to/blog/mindmaple-pro/","image":"https://nmac.to/wp-content/uploads/2015/01/MindMaple-Pro1.png","title":"MindMaple Pro 1.3.1 – Visually organizing your ideas and thoughts onto a mind map","content":"MindMaple is a fast and intuitive way of organizing and prioritizing information for project management, brainstorming sessions, idea sharing, drafting lesson plans, taking lecture notes, problem solving, managing schedules and more.   Create and edit collaborative mind maps with a user-friendly interface and numerous features to assist in maximizing productivity and efficiency.   More Functions […]"},{"link":"https://nmac.to/blog/tinyeye/","image":"https://nmac.to/wp-content/uploads/2018/01/TinyEye.png","title":"TinyEye 2016.1 – Monitor your Mac’s behavior and health","content":"TinyEye (was xScan) lets you see how your computer is functioning and where it’s using the most resources. With functional monitoring tools and a natural graphic interface, you’ll be on top of your Mac’s behavior at all times. Utilize our beautiful widgets to monitor changes from anywhere. All of this in one highly customizable platform […]"},{"link":"https://nmac.to/blog/dragonburn/","image":"https://nmac.to/wp-content/uploads/2014/04/Dragon-Burn.png","title":"DragonBurn 4.5.0.45 – CD/DVD burning software","content":"Dragon Burn enables Mac desktop and PowerBook notebook computer users to quickly and easily begin producing audio, data and mixed-mode CDs and DVDs without poring over the software’s user’s guide. The new Dragon Burn multi-burning engine allows users to simultaneously write multiple CDs or DVDs. It also fully supports new 4x DVD-R internal and external […]"},{"link":"https://nmac.to/blog/barcody/","image":"https://nmac.to/wp-content/uploads/2017/05/Barcody3.png","title":"Barcody 3.16 – Barcode generator with LinkBack support","content":"Barcody makes creating barcodes a piece of cake. Create barcodes series in no time. Barcody supports Linkback Technology as well as 31 different barcode types. Print barcodes on label sheets. Send barcodes via email directly from Barcody.   Barcody offers the following 31 barcodes: Codabar Code 11 Code 128 Code 2/5 Industrial Code 2/5 Interleaved […]"}]