[{"link":"https://nmac.to/blog/lego-star-wars-battles/","image":"https://nmac.to/wp-content/uploads/2021/12/LEGO-Star-Wars-Battles.png","title":"LEGO Star Wars Battles 1.76.2 – RTS multiplayer PVP games!","content":"Lead your favorite LEGO Star Wars characters into real-time, multiplayer PvP battles in arenas inspired by iconic locations from throughout the galaxy!   What happens when an Ewok takes on a Tusken Raider? Can a flock of porgs tackle a stormtrooper in a standoff? Could Chewbacca go toe-to-toe with Boba Fett? Who would win in […]"},{"link":"https://nmac.to/blog/solitaire-stories/","image":"https://nmac.to/wp-content/uploads/2021/12/Solitaire-Stories.png","title":"Solitaire Stories 1.02 – Classic Klondike Challenge","content":"Behold! The world’s greatest card game, Solitaire… now with progressive difficulty storylines, gorgeous deck designs, daily challenges, global leaderboards, and a weird sense of humor. If you like classic Klondike Solitaire and have a wild imagination, you’re going to love Solitaire Stories.   STORIES Solitaire with a story? Weird. Solitaire Stories are a progressive journey […]"},{"link":"https://nmac.to/blog/angry-birds-reloaded/","image":"https://nmac.to/wp-content/uploads/2021/12/Angry-Birds-Reloaded.png","title":"Angry Birds Reloaded 1.6 – Classic Slingshot Action!","content":"The world’s most famous flock has returned in a new version of the mobile game that took the world by storm. Join Red, Chuck, Bomb, Silver and the rest of the gang for classic slingshot action that will please fans of all ages. Angry Birds Reloaded features familiar physics-based gameplay from the original game – […]"},{"link":"https://nmac.to/blog/zookeeper-world/","image":"https://nmac.to/wp-content/uploads/2021/12/Zookeeper-World.png","title":"Zookeeper World 1.0.2 – Match-3 Puzzle & Zoo Building","content":"Zookeeper, the definitive action-puzzle game played by more than 30 million people, is now available as an Apple Arcade exclusive!   Get through a variety of puzzles and collect Coins to fill your zoo with cute animals, plants and more! They’ll increase your zoo’s Charm and attract all sorts of visitors!   As you complete […]"},{"link":"https://nmac.to/blog/football-manager/","image":"https://nmac.to/wp-content/uploads/2021/03/Football-Manager-2022.png","title":"Football Manager 2022 22.1.1 – Famous Sport Simulation Game","content":"Football isn’t just about being the best and winning. It’s about overcoming the odds, realising your dreams, and earning your success. Fighting your way to the top and shocking the world or clawing your way back from the brink – these moments taste sweetest.   Game Description There are 123 leading football leagues at your […]"},{"link":"https://nmac.to/blog/forgotten-fields/","image":"https://nmac.to/wp-content/uploads/2021/04/Forgotten-Fields.png","title":"Forgotten Fields 1.5 – Narrative Adventure Game","content":"Sid is a writer struggling with writer’s block, attempting to recapture the feelings of inspiration he felt when he was younger. In order to pay the bills, he needs to think up a story and apply for a grant – the deadline is today – a lazy Sunday in the middle of summer.   On […]"},{"link":"https://nmac.to/blog/stellaris/","image":"https://nmac.to/wp-content/uploads/2016/05/stellaris.png","title":"Stellaris 3.2.2 include DLCs – Space Strategy & Simulation Game","content":"Explore a vast galaxy full of wonder! Paradox Development Studio, makers of the Crusader Kings and Europa Universalis series presents Stellaris, an evolution of the grand strategy genre with space exploration at its core.   Featuring deep strategic gameplay, a rich and enormously diverse selection of alien races and emergent storytelling, Stellaris has engaging challenging […]"},{"link":"https://nmac.to/blog/surviving-mars/","image":"https://nmac.to/wp-content/uploads/2018/06/Surviving-Mars-TERESHKOVA.png","title":"Surviving Mars 1010558 – City Builder Simulation & Survival Game","content":"Welcome Home! The time has come to stake your claim on the Red Planet and build the first functioning human colonies on Mars! All you need are supplies, oxygen, decades of training, experience with sandstorms, and a can-do attitude to discover the purpose of those weird black cubes that appeared out of nowhere. With a […]"},{"link":"https://nmac.to/blog/zen-pinball-party/","image":"https://nmac.to/wp-content/uploads/2021/12/Zen-Pinball-Party.png","title":"Zen Pinball Party 1.0.27234 – 14 amazing tables await!","content":"Zen Pinball Party delivers the ultimate pinball experience with carefully crafted tables that are inspired by some of the biggest brands from DreamWorks Animation and Hasbro, as well as popular pinball classic themes. Players will challenge their friends and family for the highest score on fun and unique tables featuring DreamWork Animation’s Trolls, Kung Fu […]"},{"link":"https://nmac.to/blog/artlantis-studio/","image":"https://nmac.to/wp-content/uploads/2017/10/Artlantis2019.png","title":"Artlantis 2021.2 9.5.2.29009 – 3D rendering of interior and exterior homes and buildings","content":"Artlantis is a unique and ideal tool for performing very high resolution rendering easily and in real time. The new FastRadiosity engine now lets you compute images in radiosity-even in preview. Another innovative feature of Artlantis is that 3D objects and vegetation can be used directly in the preview window by simply dragging and dropping them. […]"}]