[{"link":"https://nmac.to/blog/sketchode-2-0-1/","image":"https://nmac.to/wp-content/uploads/2017/02/Sketchode2.png","title":"Sketchode 2.0.1 – Graphical representation of a design project created in Sketch","content":"The second version of Sketchode with extended functionality, a software solution for developers that provides quick access to the element of design project created in Sketch. More fast, with renewed design and improved interface, Sketchode 2 became more convenient tool to work with.   The main working process with Sketchode 2 remains unchanged: Designer finishes […]"},{"link":"https://nmac.to/blog/garageband-10-1-6/","image":"https://nmac.to/wp-content/uploads/2015/07/GarageBand10.png","title":"GarageBand 10.1.6 – Complete recording studio and more","content":"The new GarageBand is a whole music creation studio right inside your Mac — complete with keyboard, synths, orchestral and percussion instruments, presets for guitar and voice, an entirely redesigned sound library, and virtual session drummers. A beautiful and intuitive interface makes it easy to learn, play, record, and create great-sounding songs. And you can […]"},{"link":"https://nmac.to/blog/density-1-0-2/","image":"https://nmac.to/wp-content/uploads/2016/02/Density.png","title":"Density 1.0.2 – Pixel Calculator App","content":"Density is a simple OS X utility app made for Designers & Developers to help them calculate the dimensions for multiple screen sizes.   Special Features: Easily generate and save a text file with all the sizes from the app Make Density’s window “Float on top” so it won’t disappear when switched to another application. […]"},{"link":"https://nmac.to/blog/rage-campaign-edition-1-0-1/","image":"https://nmac.to/wp-content/uploads/2017/02/RAGE.png","title":"RAGE: Campaign Edition 1.0.1 – First-person shooter from id software","content":"RAGE: Campaign Edition features the full, unaltered RAGE single-player campaign, plus bonus equipment formerly exclusive to the Anarchy Edition, including Double Barrel Shotgun, Rat Rod Buggy, Fists of RAGE, and Crimson Elite Armor. Access the bonus Wasteland Sewers Missions which feature additional mutant blasting gameplay and looting opportunities.   STORY OVERVIEW  Developed by id® Software, […]"},{"link":"https://nmac.to/blog/world-explorer-premium-3-1/","image":"https://nmac.to/wp-content/uploads/2017/02/World.Explorer.PREMIUM.png","title":"World Explorer Premium 3.1 – Tour the world virtually","content":"World Explorer Premium is a new and exciting way to discover what is interesting around you and around the world. Search for any place in the world, take a virtual walk in the streets, learn more about any monument…. Browse two times more points of interest in this version everywhere in the world. Get many […]"},{"link":"https://nmac.to/blog/templates-for-keynote-theme-guru-2-0/","image":"https://nmac.to/wp-content/uploads/2017/02/Templates-for-Keynote.png","title":"Templates for Keynote – Theme Guru 2.0 – Professional presentations themes for Keynote","content":"Create Professional presentations and save time with this easy tool – Pro Themes for keynote. This collection consists of 32 high-quality designs for Keynote presentations. These are more than just beautiful backgrounds – each of them includes up to 21 different master slides, thus allowing you to choose the best layout for the information. The […]"},{"link":"https://nmac.to/blog/template-guru-3-0/","image":"https://nmac.to/wp-content/uploads/2017/02/Template-Guru.png","title":"Template Guru 3.0 – Templates for Pages","content":"Template Guru (Templates Pro for Pages) gives you the power to turn your envelopes and invoices into a key part of a successful advertising campaign.   Each of the Templates Pro for Pages packs contains five templates in an elegant, consistent style: Brochure, Business Cards, Envelope, Invoice, and Letter. All templates are available in both […]"},{"link":"https://nmac.to/blog/hashtab-6-0/","image":"https://nmac.to/wp-content/uploads/2017/02/HashTab.png","title":"HashTab 6.0 – File hashing application and Finder context menu extension","content":"HashTab is a file hashing application and Finder context menu extension. The Finder menu extension adds a menu item called “File Hashes” that will allow you to launch the hashing application on a specific file from directly within Finder. Supports numerous common hashing algorithms SHA1 SHA-256 SHA-512, MD2, MD4, MD5, RIPEMD160, RIMPEMD 320, HAVAL, TIGER, […]"},{"link":"https://nmac.to/blog/file-sumo-1-1/","image":"https://nmac.to/wp-content/uploads/2017/02/FileSumo.png","title":"File Sumo 1.1 – Find And Delete Huge Files","content":"File Sumo is an awesome utility app which helps you to discover and handle huge files that are cluttering and slowing down your Mac space.   Find and Delete Top 10 / 50 /100 Large Files File Sumo provides the list of top 10/50/100 Large files and their sizes along with the options to view […]"},{"link":"https://nmac.to/blog/total-manager-3-8-0/","image":"https://nmac.to/wp-content/uploads/2015/01/Total.Manager.png","title":"Total Manager 3.8.0 – Archive utility and media viewer","content":"Total Manager is a powerful file manager with a classic double-window and multi-tab interface. It is not only a professional archiving app that can easily compress, extract and preview almost all archive files like ZIP, RAR, 7z and more, but also supports viewing images, playing audios / videos together with basic operation such as copy, […]"}]