[{"link":"https://nmac.to/blog/n-track-studio-suite/","image":"https://nmac.to/wp-content/uploads/2021/02/n-Track-Studio-Suite.png","title":"n-Track Studio Suite 9.1.5.4730 – Audio and MIDI multitrack recorder","content":"n-Track Studio Suite is an audio and MIDI multitrack recorder that turns your Mac into a full-fledged recording studio. You can record and playback a virtually unlimited number of tracks. The program supports simultaneous recording from multiple 16- and 24-bit soundcards, and real-time audio effects can be applied non-destructively to each track. Built-in effects include […]"},{"link":"https://nmac.to/blog/sharks-3d/","image":"https://nmac.to/wp-content/uploads/2014/09/Sharks-3D1.png","title":"Sharks 3D 2.1.0 – 3D live shark wallpaper","content":"Sharks 3D is a live 3D wallpaper background featuring sharks in various settings.   Features: 4 different 3D scenes 6 species of sharks high-quality 3D graphics and effects Retina display ready original music track compatible with OS X 10.9 Mavericks screen saver mode with password protection full multi-monitor support removing dock icon autostart at login […]"},{"link":"https://nmac.to/blog/digital-clock-3d/","image":"https://nmac.to/wp-content/uploads/2018/11/Digital_Clock_3D_2.png","title":"Digital Clock 3D 2.1.0 – Enjoy digital time with this live wallpaper","content":"Digital Clock 3D brings you retro tube clocks, the latest OLED timepieces, and everything in between with this live wallpaper. Choose the style you like most or leave it to chance, savoring the ultra-realistic 3D graphics!   Features: 6 different types of clocks high-quality 3D graphics and effects Retina display ready original music track compatible […]"},{"link":"https://nmac.to/blog/textmate/","image":"https://nmac.to/wp-content/uploads/2017/07/TextMate2.png","title":"TextMate 2.0.23 – Code/markup editor with many features","content":"TextMate is a versatile plain text editor with a unique and innovative feature set which caused it to win an Apple Design Award for Best Mac OS X Developer Tool in August 2006.   A rapidly growing community have created modes for more than a hundred different “modes” including support for all major programming languages, […]"},{"link":"https://nmac.to/blog/textfridge/","image":"https://nmac.to/wp-content/uploads/2020/01/TextFridge.png","title":"TextFridge 1.3.1 – Store text you often use","content":"TextFridge (was TextOnTrays) allows you to store lots of texts that you often need to write (up to 150 text snippets). Its interface is minimalist and user-friendly.   The basic use is as simple as can be: drag text from anywhere to TextFridge, drag text from TextFridge to anywhere.   Of course many other functionalities […]"},{"link":"https://nmac.to/blog/shapes/","image":"https://nmac.to/wp-content/uploads/2017/05/Shapes4.png","title":"Shapes 5.0 – Simple diagramming app","content":"Shapes is a simple, elegant diagramming app for OS X. Shapes gives you all of the most important features you need in a diagramming tool without all the extra cruft, and without breaking the bank!   Shapes is great for programmers and Web designers looking for a simple tool for quickly designing charts, laying out […]"},{"link":"https://nmac.to/blog/gtasks-pro/","image":"https://nmac.to/wp-content/uploads/2021/08/gTasks-Pro.png","title":"gTasks Pro 1.3.24 – Sync your tasks with Google and across your Mac, iPhone & iPad devices","content":"gTasks Pro is created for sync your tasks with Google and across your Mac, iPhone & iPad devices.   Main features Sync your tasks with Google Tasks. Sync tasks between your Mac, iPhone & iPad devices. Keep your tasks organized with subtasks. Set repeating tasks such as “Pay bills” every month. Google tasks Naturally integrating […]"},{"link":"https://nmac.to/blog/reaper-5/","image":"https://nmac.to/wp-content/uploads/2015/11/REAPER5.png","title":"REAPER 6.37 – Digital audio workstation","content":"REAPER is a digital audio workstation: a complete multitrack audio and MIDI recording, editing, processing, mixing, and mastering environment. REAPER is designed to let you work quickly and creatively, without imposing any artificial limits on what you can do. It includes professional plugins, advanced customization, and compatibility with almost any hardware. It supports both VST […]"},{"link":"https://nmac.to/blog/desktop-aquarium/","image":"https://nmac.to/wp-content/uploads/2021/03/Aquarium-Live-HD.png","title":"Aquarium Live HD 3.3.0 – Live dynamic wallpaper scenes","content":"Turn your screen into a beautiful Aquarium! Run Aquarium scenes manually or as a screensaver.   The most popular Aquarium app on Mac, iPhone and iPad. Over a million downloads worldwide! A selection of beautiful, long HD Videos to choose from Featuring Sharks, Clownfish (Nemo), Blue Tang (Dory) and many other colourful fish Optional sounds […]"},{"link":"https://nmac.to/blog/aragami/","image":"https://nmac.to/wp-content/uploads/2016/10/Aragami.png","title":"Aragami 1.09.10 – A third person action & adventure stealth game","content":"You are Aragami, a vengeful spirit with the power to control the shadows. You’ve been summoned by Yamiko, a girl imprisoned in the city fortress of Kyuryu. Embark on a dark journey full of blood and secrets to discover the truth about aragami. Infiltrate the occupied city of Kyuryu with your supernatural powers and fight […]"}]