[{"link":"https://nmac.to/blog/frozen-state-1-0/","image":"https://nmac.to/wp-content/uploads/2016/08/Frozen.State_.png","title":"Frozen State 1.0 – A Brutal, Horror & Action Survival Game","content":"The entire world is embraced by the man-made ice age meant to protect the human race from alien hybrids. The last survivors have formed the Resistance.   On the way to the Resistance, the main character gets stranded in the closed experimental city Duga-40, where he has to survive and repair his transport to continue […]"},{"link":"https://nmac.to/blog/bloom-1-0-467/","image":"https://nmac.to/wp-content/uploads/2016/02/Bloom.png","title":"Bloom 1.0.467 – Lightweight, cross-platform, procedural graphics editor","content":"Bloom (was Ormr) is a fast, lightweight, cross-platform procedural graphics editor that lets you tweak any action you have ever performed — organized by layer. In Bloom, everything is numerically adjustable – all the time, long after the initial effect has been applied. You can tweak and adjust every detail to your heart’s delight until […]"},{"link":"https://nmac.to/blog/after-focus-1-5-5/","image":"https://nmac.to/wp-content/uploads/2016/08/After-Focus.png","title":"After Focus 1.5.5 – Photo Background Blur Bokeh Effects","content":"After Focus professionally adds focus and depth to your photos without expensive camera lenses. It easily defines a focus area and achieves lens blur, motion blur effects. After Focus extends filter and lens functionality beyond your camera and allows you to adjustable controls to add custom focus options to make any photo stand-out.   Post-processing […]"},{"link":"https://nmac.to/blog/adoreshare-dvd-creator-3-2-0-0/","image":"https://nmac.to/wp-content/uploads/2016/08/Adoreshare-DVD-Creator.png","title":"Adoreshare DVD Creator 3.2.0.0 – Quickly Burn Any Videos to DVD","content":"DVD Creator for Mac enables you to stylize your DVDs with lots of fabulous DVD menu themes. No menu is also supported.   Dozens of DVD menu templates including Dynamic, Static and 1.0 template. Set background music/picture for DVD menu as you like. Customize your DVD menu with your favorite, frame, button, text, etc. Set […]"},{"link":"https://nmac.to/blog/super-resize-1-2-1/","image":"https://nmac.to/wp-content/uploads/2016/03/Super-Resize.png","title":"Super Resize 1.2.1 – The professional tool to resize images","content":"Super Resize Quickly allows you to resize your images, add thumbnails automatically, and create the code for a web gallery alongside. With an emphasis on image quality. Because you don’t want your resized images to be blurry and lose all detail. Preview everything before you export. File sizes, compression, thumbnails. Highest quality output. Highest level […]"},{"link":"https://nmac.to/blog/super-mp3-converter-6-1-31/","image":"https://nmac.to/wp-content/uploads/2015/03/Super.MP3.Converter.png","title":"Super MP3 Converter 6.1.31 – Convert any videos or audios to MP3, AAC and more","content":"Super MP3 Converter can convert almost all videos and audios to MP3, AAC, AIFF, ALAC, WAV and M4A with lightening speed and zero quality loss. With this wonderful MP3 Music Converter App, users can convert any audio file like OGG, FLAC, AC3, and more to other popular audio formats. Also, it enables users to extract […]"},{"link":"https://nmac.to/blog/onewaysync-3-1/","image":"https://nmac.to/wp-content/uploads/2016/08/OneWaySync.png","title":"OneWaySync 3.1 – Create mirrors of folders","content":"The purpose of OneWaySync is to safely create mirrors of folders in a simple and quick way. It will sync in only one way, this means the source directory will not be changed and only the destination directory will be affected. By switching off the option “Delete on Destination” you can keep all files backed […]"},{"link":"https://nmac.to/blog/mov-converter-pro-6-5-15/","image":"https://nmac.to/wp-content/uploads/2016/08/MOV-Converter-Pro.png","title":"MOV Converter Pro 6.5.15 – Convert MOV to 4K MP4/WMV/AVI","content":"Aiseesoft MOV Converter Pro can convert videos to and from MOV format conveniently. MOV Converter Pro can convert MOV to MP4, WMV, AVI, MPG and other video formats easily. Also, 4K videos are supported. It also helps you to convert MP4/WMV/AVI video to MOV for playing and editing in QuickTime, Final Cut Pro, etc.   […]"},{"link":"https://nmac.to/blog/keyflow-pro-1-6-1/","image":"https://nmac.to/wp-content/uploads/2016/08/KeyFlow-Pro.png","title":"KeyFlow Pro 1.6.1 – Personal Asset Management and More","content":"KeyFlow Pro is a simple, but powerful media asset management app for single user and small workgroup.   KeyFlow Pro keeps all your assets online, searchable, editable, and easily sharable.   On more thing, KeyFlow Pro provides seamless workflow with Final Cut Pro X as well as other applications.   KEY FEATURES   ALL MEDIA […]"},{"link":"https://nmac.to/blog/hot-simple-image-viewer-1-2/","image":"https://nmac.to/wp-content/uploads/2016/08/Hot-Simple-Image-Viewer.png","title":"Hot Simple Image Viewer 1.2 – keyboard and mouse controlled image viewer","content":"Hot Simple Image Viewer is keyboard and mouse controlled viewer intended to make viewing of files inside one folder easy.   Inspired by good ol’ Irfan view it uses simply shortcuts: space to move to next file in directory; enter to toggles full screen view; arrow keys to navigate back and forth. cmd+o to open […]"}]