[{"link":"https://nmac.to/blog/tab-launcher-2-8-4/","image":"https://nmac.to/wp-content/uploads/2013/12/Tab-Launcher.png","title":"Tab Launcher 2.8.4 – Clean up and organize the Dock","content":"The idea of Tab Launcher is not to replace the system’s dock, but to help keep it clean, with only the applications that are currently running.   By removing all the application from the dock and organizing them on tabs, you can quickly find and run any application you want.   Apart from that, you […]"},{"link":"https://nmac.to/blog/iphone-care-pro-2-2-0-1/","image":"https://nmac.to/wp-content/uploads/2015/06/iPhone.Care_.Pro_.png","title":"iPhone Care Pro 2.2.0.1 – Fix all iOS Problems and Tuneup iPhone, iPad and iPod","content":"You can easily transfer files on your iPhone, iPad and iPod to PC for free. Simply connect your device with PC and all the rest can be done within several clicks.   Manage 8 types of files: Contacts, Notes, Calendar, APP, Video, Bookmark, Photo and Music. Directly add items to iOS devices. Detect & delete […]"},{"link":"https://nmac.to/blog/flightradar24-2-0-2/","image":"https://nmac.to/wp-content/uploads/2014/01/Flightradar24.png","title":"Flightradar24 2.0.2 – Turns your Mac into an air traffic radar monitor","content":"Flightradar24 turns your Mac into an air traffic radar monitor. See airplane traffic around the world move in real-time. Discover why millions are already using Flightradar24. Please note that coverage will vary. We are rapidly improving Flightradar24’s coverage across the world.   Features: Planes moving in real-time Comprehensive information for each individual plane, including route, […]"},{"link":"https://nmac.to/blog/slender-the-arrival/","image":"https://nmac.to/wp-content/uploads/2015/12/Slender-The-Arrival.png","title":"Slender: The Arrival 2.0 – First-Person Horror Survival Game","content":"You’re on your own. No one to come for you. No one to help you. No one to hear you scream. Slender: The Arrival is the official videogame adaption of Slender Man, developed in collaboration with Eric “Victor Surge” Knudson, creator of the paranormal phenomenon that has been terrifying the curious-minded around the world since […]"},{"link":"https://nmac.to/blog/now-playing-3-0-1/","image":"https://nmac.to/wp-content/uploads/2015/12/Now-Playing.png","title":"Now Playing 3.0.1 – Control your iTunes music from your mac menu bar","content":"Macs are simple. Mac apps should be too. I understand, you’re busy. You’ve got work to do. Writing. Coding. Drawing. And how about do your work with a song?   The best way you’ll make it through all the things that you need to do is to control your iTunes without switch between the windows, […]"},{"link":"https://nmac.to/blog/r-studio-4-6/","image":"https://nmac.to/wp-content/uploads/2015/12/R-Studio.png","title":"R-Studio 4.6 – Data Recovery Software for Mac","content":"In the family of powerful and cost-effective data recovery software from R-TT, R-Studio for Mac is specially designed for the Mac OS environment. It recovers files from HFS/HFS+ (Macintosh), FAT/NTFS/ReFS (Windows), UFS1/UFS2 (FreeBSD/OpenBSD/NetBSD/Solaris) and Ext2/Ext3/Ext4 FS (Linux) partitions. In addition, raw file recovery (scan for known file types) can be used for heavily damaged or […]"},{"link":"https://nmac.to/blog/cut-out-shapes-pro-1-0/","image":"https://nmac.to/wp-content/uploads/2015/12/Cut-Out-Shapes-Pro.png","title":"Cut Out Shapes Pro 1.0 – Easy photo editing software","content":"Cut Out Shapes Pro is a new useful tool that helps you delete the background in your pics.   Enjoy easy photo editing with this eraser-like tool.   Cut Out Shapes Pro features: Opportunity to delete backgrounds; Minimalist design and user-friendly interface.   How to Use: Click the Folder symbol in order to open a […]"},{"link":"https://nmac.to/blog/mocha-pro-4-1-3/","image":"https://nmac.to/wp-content/uploads/2015/12/mocha.Pro_.png","title":"mocha Pro 4.1.3 – Award winning Planar Tracking App","content":"mocha Pro is a stand alone software utility optimized for visual effects and post-production challenges. Planar Motion Tracking Advanced Roto & Mask Creation Object Removal & Clean Plate Lens Distortion Calibration 3D Camera Solver Screen Inserts & Mesh Warper Image Stabilization & more   mocha Pro with advanced tools for stereoscopic 3D, customizable keyboard shortcuts, Adobe […]"},{"link":"https://nmac.to/blog/battery-time-indicator-1-1-1/","image":"https://nmac.to/wp-content/uploads/2015/12/Battery.Time_.Indicator.png","title":"Battery Time Indicator 1.1.1 – Useful battery remaining time indicator","content":"This Battery Indicator looks like a default one, but it combines the battery icon and the remaining time indicator, hence saves some space in the status bar   Version 1.1.1: Fixed launch at login   OS X 10.8 or later, 64-bit processor                               […]"},{"link":"https://nmac.to/blog/video-converter-hd-4-0-0/","image":"https://nmac.to/wp-content/uploads/2015/11/Video.Converter.HD_.png","title":"Video Converter HD 4.0.0 – Effective Mac HD video converter","content":"A simple yet effective Mac HD video converter and light-weight HD video editor. Convert between popular HD video file formats, including HD AVI, HD WMV, HD MOV, HD FLV, HD MKV, H.264/AVC, HD MPEG-4, HD TS, etc. Convert standard definition to HD video as well, and with this Video Converter HD, you could DIY your […]"}]