[{"link":"https://nmac.to/blog/music-tag-pro-3-1-4/","image":"https://nmac.to/wp-content/uploads/2016/05/Music-Tag-Pro.png","title":"Music Tag Pro 3.1.4 – Batch ID3 Edit","content":"Music Tag Pro is a professional application to help you organize your music collection.   With the app you can easily edit information such as a song’s artist, title, album, cover, year, track, disc number, composer, grouping, genre, bpm, rating, comments and lyrics .   Batch edit your music tag, you can apply your editing […]"},{"link":"https://nmac.to/blog/labels-addresses-1-7-3/","image":"https://nmac.to/wp-content/uploads/2014/01/Labels-Addresses.png","title":"Labels & Addresses 1.7.3 – Powerful label and envelope printing tool","content":"Labels & Addresses is a home and office tool for printing all sorts of labels, envelopes, inventory labels, and price tags. Merge-printing capability makes the program a great tool for holiday seasons by helping users to design and print multiple greeting envelopes and postcards with automatically substitutable addresses and postal barcodes.   Key features Change […]"},{"link":"https://nmac.to/blog/back-to-bed-1-0/","image":"https://nmac.to/wp-content/uploads/2016/05/Back-to-Bed.png","title":"Back to Bed 1.0 – Guide the sleepwalker Bob to the safety of his bed","content":"Back to Bed is an artistic 3D puzzle game with a surreal twist. It tells the story of Bob, an unlucky narcoleptic who has a tendency of falling asleep in his boring office and then proceeding to sleepwalk into the dangers of the big city. Luckily, Bob has a subconscious guardian named Subob, whom spawns from the mind of Bob and whose job it is to […]"},{"link":"https://nmac.to/blog/neverending-nightmares-2-1/","image":"https://nmac.to/wp-content/uploads/2016/05/Neverending-Nightmares.png","title":"Neverending Nightmares 2.1 – A psychological horror game","content":"Neverending Nightmares is a psychological horror game inspired by the developer’s actual battle with mental illness. In the game, you take on the role of Thomas who awakens from a terrible nightmare only to find that he is still dreaming. As he descends deeper through the layers of hellish dreamscapes, he must hide from horrifying […]"},{"link":"https://nmac.to/blog/notebook-4-0-7/","image":"https://nmac.to/wp-content/uploads/2013/07/NoteBook.png","title":"NoteBook 4.0.7 – Electronic notebook for taking notes, managing and organized","content":"NoteBook stores and organizes your notes and other information in electronic notebooks that look and work just like the paper ones you’ve used all your life. With outlining, diagramming, sketching, voice annotation, even PDF mark-up, NoteBook helps you take great notes whatever your note-taking style.   And NoteBook makes it easy to find anything with […]"},{"link":"https://nmac.to/blog/infinite-space-iii-1-1-2/","image":"https://nmac.to/wp-content/uploads/2016/05/Infinite-Space-III.png","title":"Infinite Space III: Sea of Stars 1.1.2 – Adventures game in Infinite Space","content":"Sea of Stars continues the Infinite Space series of games that defined the genre of short-form space roguelikes in Strange Adventures in Infinite Space (2001) and Weird Worlds: Return to Infinite Space (2005). It compresses a galaxy-spanning starship adventure into the space of a single sitting, but as the game world is randomly generated each […]"},{"link":"https://nmac.to/blog/gamepad-companion-3-3-1/","image":"https://nmac.to/wp-content/uploads/2016/05/GamePad.Companion.png","title":"GamePad Companion 3.3.1 – Make any joystick compatible with OS X","content":"GamePad Companion allows you to use HID compatible devices (gamepads, joysticks, etc..) with Mac OS X. This means that you can use many of the joysticks and gamepads that haven’t had their drivers updated for Mac OS X! It should be possible to simultaneously use up to 5 HID devices with GamePad Companion.   Version […]"},{"link":"https://nmac.to/blog/economacs-6-0-53/","image":"https://nmac.to/wp-content/uploads/2016/05/Economacs.png","title":"Economacs 6.0.53 – Invoicing and double-entry bookkeeping","content":"Economacs is an invoicing and double-entry bookkeeping solution.   Features Double-entry book-keeping Ledger and journal of entries Balance sheet and profit and loss account Tag entries and invoices Localized VAT reports for some countries included Send invoices in several languages and currencies Automatically files entries for sent/paid invoices Use the built-in invoice template or design […]"},{"link":"https://nmac.to/blog/cabinet-1-0-2/","image":"https://nmac.to/wp-content/uploads/2016/05/Cabinet.png","title":"Cabinet 1.0.2 – Quick access for your photos","content":"Everyday we work on our photos in different ways. We share them, upload them on website, use them on your documents or maybe import to your design as assets.   Introducing Cabinet.   Cabinet is a tool that stays on your menu bar. You can access it any time you want.   It connects with […]"},{"link":"https://nmac.to/blog/awesome-screenshot-1-2/","image":"https://nmac.to/wp-content/uploads/2016/05/Awesome-Screenshot.png","title":"Awesome Screenshot 1.2 – Capture, annotate and share screenshots","content":"Awesome Screenshot lets you:   Capture Capture or clip selected area, or all visible portion, or a window. Support PNG format   Annotate and Edit Annotate it with rectangles, circles, arrows, lines and text Crop and scroll and Show crop area dimension Use eraser to hide sensitive information   Save and Share Save to local […]"}]