[{"link":"https://nmac.to/blog/art-of-rally/","image":"https://nmac.to/wp-content/uploads/2020/09/Art-of-Rally.png","title":"Art of Rally 1.3.3 – Race in the golden era of rally","content":"art of rally is a stylized experience inspired by the golden era of rally from the creator of Absolute Drift   Race across the world through colorful and stylized environments in top-down view.   Compete for first place in the leaderboards with daily and weekly challenges.   Will you master the art of rally?   […]"},{"link":"https://nmac.to/blog/old-world/","image":"https://nmac.to/wp-content/uploads/2021/11/OldWorld.png","title":"Old World 1.0.55852 – Turn-Based Strategy Game","content":"Old World is a historical strategy game where you lead your empire through multiple generations, building a grand legacy to last beyond your own years. This is an era of great leaders, from the revered to the feared. Which will you be?   Marry for politics, raise your heirs, and manage your relationship with the […]"},{"link":"https://nmac.to/blog/stockfolio/","image":"https://nmac.to/wp-content/uploads/2017/12/Stockfolio.png","title":"Stockfolio 1.8.1 – Stocks and real-time stock portfolio [FIX]","content":"Stockfolio is an investment app for macOS that allows you to research and track interesting stocks. It is extremely easy to set up and the best way to manage and follow your investment portfolio.   Features Track equities from around the world using realtime quotes. Get detailed charts (line and candlestick) on the price history […]"},{"link":"https://nmac.to/blog/unclutter/","image":"https://nmac.to/wp-content/uploads/2017/03/Unclutter2.png","title":"Unclutter 2.1.24d – Store notes, files, and pasteboard clips on the Desktop [FIX]","content":"Unclutter is a new handy place on your desktop for storing notes, files and pasteboard clips. To open the pocket, simply move your mouse to the very top of screen and scroll down. Drag items from other applications to the top of screen to store them in Unclutter.   Features Instant, configurable access even in […]"},{"link":"https://nmac.to/blog/before-we-leave/","image":"https://nmac.to/wp-content/uploads/2021/11/Before-We-Leave.png","title":"Before We Leave 1.0307 – A city building game","content":"Rediscover what was lost and nurture your reborn civilisation in Before We Leave, a city building game set in a cozy corner of the universe. Grow, gather and manage resources to help your settlements thrive, and share goods between the hexagonal lands and planets around you. Relax and expand the fabric of your growing societies […]"},{"link":"https://nmac.to/blog/hot-brass/","image":"https://nmac.to/wp-content/uploads/2021/08/Hot-Brass.png","title":"Hot Brass 2.2.1 – 2D Real Time Tactics, Stealth & Crime Game","content":"When SWAT gets the call, everything else has failed. Experience the high-risk world of the elite SWAT operator.   The job is tense, and every split-second decision has consequences. From infiltration to de-escalation: keen awareness, expert tactics and a strategic use of equipment are key to becoming a master of tactical strategy.   MASTER EACH […]"},{"link":"https://nmac.to/blog/aur-hdr/","image":"https://nmac.to/wp-content/uploads/2017/03/Aurora.HDR_.2017.png","title":"Aurora HDR 2019 1.0.1 – Advanced HDR software [FIX]","content":"Aurora HDR 2019 is one of the world’s most advanced and amazing HDR applications, co-developed by Macphun and Trey Ratcliff — the world’s most famous HDR photographer. You get tools, power, flexibility and creative freedom to make amazing HDR photos in minutes, without Adobe Photoshop, Lightroom, or any other software.   Features HDR Excellence. Aurora […]"},{"link":"https://nmac.to/blog/charterstone/","image":"https://nmac.to/wp-content/uploads/2021/04/Charterstone.png","title":"Charterstone 1.2.7 – Build the new Eternal City","content":"The official digital adaptation of Jamey Stegmaier’s board game – Charterstone!   It’s a campaign strategy game with high replayability, where players build the new Eternal City!    Just take a look at the honors the board game received:  2018 Diana Jones Award for Excellence in Gaming Nominee 2017 Meeples’ Choice Nominee 2017 Golden Geek […]"},{"link":"https://nmac.to/blog/ivi/","image":"https://nmac.to/wp-content/uploads/2013/08/iVI4.png","title":"iVI 4.746 – Easily convert and import video files into iTunes or iMovie [FIX]","content":"iVI is a video converter that can import files into iTunes or iMovie with a simple drag and drop. iVI will also add metadata if movies or TV shows are identified.   Features Movie and TV-show information is found on the Internet automatically and added to your shows before they are placed in iTunes iVI […]"},{"link":"https://nmac.to/blog/disk-drill-media-recovery/","image":"https://nmac.to/wp-content/uploads/2020/02/Disk_Drill_Media_Recovery_4.png","title":"Disk Drill Media Recovery 4.5 – User-friendly data recovery app for Mac","content":"Disk Drill Media Recovery is the most user-friendly data recovery app for Mac.   Disk Drill can recover your lost pictures and photos, music, documents, applications, videos and other data. “Quick Scan” and “Search for lost partitions” can recover files of any format. “Deep Scan” file recovery method works on a lower level and analyzes […]"}]