[{"link":"https://nmac.to/blog/touch-forms-pro/","image":"https://nmac.to/wp-content/uploads/2018/06/Touch-Forms-Pro.png","title":"Touch Forms Pro 7.40.3 – Drag-and-drop Web form builder","content":"Touch Forms Pro is a simple-to-use web form builder. It’s full-featured, standalone software, purchasable via a one-time payment with no monthly subscription fees! Touch Forms allows you to build beautiful web forms with an intuitive drag-and-drop designer, publish to your own web host through FTP. The Pro Edition provides all-new advanced multi-form management interface and […]"},{"link":"https://nmac.to/blog/vidsolo-video-converter-ultimate/","image":"https://nmac.to/wp-content/uploads/2018/04/VideoSolo-Video-Converter1.png","title":"VideoSolo Video Converter Ultimate 1.0.32 – Convert all HD/SD videos as easy as pie","content":"VideoSolo Video Converter Ultimate for Mac supports a huge number of formats including MP4, MOV, M4V, WMV, AVI, FLV, VOB, AVCHD Video (MTS, M2TS, TS, MOD, TOD, MXF), HD MP4, HD MOV, HD WMV, MP3, AAC, AC3, WAV, WMA, M4A, OGG, FLAC and more. In addition, it offers preset profiles for iPhone/iPad/iPod, iMovie, FCP, Avid, […]"},{"link":"https://nmac.to/blog/record-lectures/","image":"https://nmac.to/wp-content/uploads/2016/01/Record-Lectures.png","title":"Record Lectures 3.1.4 – Record lectures, meetings and conversations","content":"Record Lectures was built with the purpose of allowing anyone who records lectures, meetings and conversations to be able to store them in a calendar and be able to share these recordings easily.   Record Lectures is a must have app for everyone who is going to school or attends conferences or meetings. Record Lectures […]"},{"link":"https://nmac.to/blog/sigma-theory/","image":"https://nmac.to/wp-content/uploads/2019/04/Sigma-Theory.png","title":"Sigma Theory: Global Cold War 1.2.0.0 – A Turn-based Strategy & Simulation Game","content":"From the creators of the award-winning sci-fi game Out There…   In the near future, a paradigm-shifting scientific discovery looms over the world, promising radical new technologies. The world’s superpowers realize they could have the power to destroy the global financial system, wipe out entire countries or even gain access to immortality.    However, this […]"},{"link":"https://nmac.to/blog/pacify/","image":"https://nmac.to/wp-content/uploads/2020/06/Pacify.png","title":"Pacify 4.22.3 – Co-op Horror & Survival Game","content":"You just signed on with PAH Inc. Paranormal Activity Helpers Incorporated, yeah sounds corny, but the pay is great. They said you won’t ever be in any real danger, and they have tons of work right now. Your first job is at some old haunted house. There is a broker wanting to put the house […]"},{"link":"https://nmac.to/blog/mac-backup-guru/","image":"https://nmac.to/wp-content/uploads/2020/06/Mac-Backup-Guru.png","title":"Mac Backup Guru 6.8.2 – Backup focused on simplicity and reliability","content":"Mac Backup Guru lets you copy and paste a bootable volume in the Finder, or make incremental snapshots. It is the only software which has the ease-of-use to allow you to copy and paste anything – even a bootable volume – using the contextual menu in the Finder (OS X 10.10 Yosemite and later only). […]"},{"link":"https://nmac.to/blog/yojimbo/","image":"https://nmac.to/wp-content/uploads/2016/04/Yojimbo4.png","title":"Yojimbo 4.5 – Data information organizer","content":"Yojimbo empowers Mac users to manage, effortlessly and securely, the onslaught of information encountered every day at work and at home, even across multiple computers. Yojimbo stores different data types: text notes, passwords, Web bookmarks, product serial numbers, PDFs, and Web archives.   Data input into Yojimbo follows familiar Mac user interface gestures such as […]"},{"link":"https://nmac.to/blog/noteapp/","image":"https://nmac.to/wp-content/uploads/2020/06/NoteApp.png","title":"NoteApp 1.0.1 – Plain-text editor","content":"NoteApp is a text editor for people who need something really simple yet beautiful. It works with plain text (TXT) files. It does not support any text formatting. The application supports light and dark modes. It looks fantastic in full-screen and split-view modes. NoteApp does not support markdown, and we’re not going to change it. […]"},{"link":"https://nmac.to/blog/starships/","image":"https://nmac.to/wp-content/uploads/2015/03/Starships.png","title":"Sid Meier’s Starships 1.3 – Turn-Based Space Strategy","content":"Take command of a fleet of powerful starships in this adventure-driven strategy game from legendary designer Sid Meier. Travel to new worlds, completing missions to help save and protect the planets and their people from dangerous Space Pirates, to powerful Marauders and other hostile factions. Build a planetary federation as you strengthen your fleet and […]"},{"link":"https://nmac.to/blog/beautiful-desolation/","image":"https://nmac.to/wp-content/uploads/2020/04/Beautiful.Desolation.png","title":"Beautiful Desolation 1.0.3.7 – 2D isometric adventure game","content":"BEAUTIFUL DESOLATION is a 2D isometric adventure game set in the distant future. Explore a post-apocalyptic landscape, solve puzzles, meet new friends and make powerful enemies, mediate conflicts and fight for your life as you unravel the secrets of the world around you.   FEATURING A story-driven adventure set in a dystopian post-apocalyptic future. A […]"}]