[{"link":"https://nmac.to/blog/barcodepro-8-1/","image":"https://nmac.to/wp-content/uploads/2016/10/BarcodePro.png","title":"BarcodePro 8.1 – Professional Barcode Builder","content":"A barcode is an optical machine-readable representation of data relating to the object to which it is attached. Originally barcodes systematically represented data by varying the widths and spacings of parallel lines, and may be referred to as linear or one-dimensional (1D). Later they evolved into rectangles, dots, hexagons and other geometric patterns in two […]"},{"link":"https://nmac.to/blog/visio-viewer-3-0-0/","image":"https://nmac.to/wp-content/uploads/2016/10/Visio-Viewer.png","title":"Visio Viewer 3.0.0 – A fast Visio file viewer for Mac","content":"Enolsoft Visio Viewer is a fast Visio file viewer for Mac users to easily open and read Microsoft Visio files, as well as convert the Visio drawing documents to PDF file or print out.   Highlight: Open and view any .vsd & .vsdx files quickly and easily on Mac. Support opening and viewing Visio files […]"},{"link":"https://nmac.to/blog/star-vikings-1-0-1/","image":"https://nmac.to/wp-content/uploads/2016/10/StarVikings.png","title":"Star Vikings 1.0.1 – A casual Puzzle/RPG fun game","content":"Star Vikings is a casual Puzzle/RPG that is fun, easy to get into and that respects players’ intelligence. Developed by the creators of Relic Hunters Zero, Chroma Squad and Dungeonland!   Star Vikings was designed for people who miss casual games from a time before “free to play” and microtransactions, when quality, fun and accessibility […]"},{"link":"https://nmac.to/blog/necropolis-brutal-edition-1-1-1/","image":"https://nmac.to/wp-content/uploads/2016/07/Necropolis.png","title":"NECROPOLIS: BRUTAL EDITION 1.1.1 – Third-person Action & Adventure Game","content":"NECROPOLIS: BRUTAL EDITION is a major update featuring a new playable adventurer (The Brute), a completely new outdoor environment (The Black Forest), and lots of new enemies, weapons, armor, traps, potions, scrolls, and other big improvements to the game.   The BRUTAL EDITION is the definitive NECROPOLIS experience. HERE’S WHAT’S NEW: The Brute – a […]"},{"link":"https://nmac.to/blog/syndrome-1-0/","image":"https://nmac.to/wp-content/uploads/2016/10/Syndrome.png","title":"Syndrome 1.0 – A sci-fi survival horror game","content":"You wake up dazed and confused, probably from the effects of cryosleep.   No one can be seen around, but you soon start to find the bodies of your dead crewmen.   The ship is adrift, and whoever – or whatever – killed your crewmates is probably still around.   Syndrome is a sci-fi survival […]"},{"link":"https://nmac.to/blog/project-highrise-1-0-6/","image":"https://nmac.to/wp-content/uploads/2016/09/Project.Highrise.png","title":"Project Highrise 1.0.6 – A skyscraper construction and management sim [Native]","content":"Your job as the architect and developer is to build world-famous skyscrapers that will be the envy of the entire city, masterpieces of art and engineering. But a skyscraper is more than just steel and glass, it’s an intricate ecosystem, full of people that live and work in the building. They become a complex machine […]"},{"link":"https://nmac.to/blog/the-warlock-of-firetop-mountain-1-0/","image":"https://nmac.to/wp-content/uploads/2016/10/The.Warlock.of_.Firetop.Mountain.png","title":"The Warlock of Firetop Mountain 1.0 – Action, RPG & Board Game","content":"The Warlock of Firetop Mountain is a tabletop adventure come to life! This fantasy solo RPG combines unique, simultaneous turn-based combat with a journey that changes based on each figurine you take into Firetop Mountain! Which hero will you take into Zagor’s lair THIS time?   The original 1982 Fighting Fantasy gamebook paperback, written by […]"},{"link":"https://nmac.to/blog/meme-engine-2-3/","image":"https://nmac.to/wp-content/uploads/2016/10/Meme-Engine.png","title":"Meme Engine 2.3 – Create your own memes","content":"Meme engine let’s you create awesome memes.   With a collection of 83 standard meme images, you can create outstanding memes, even with your own images. You have full control, setting the font, size, color…   Features Great set of meme images. 83 standard memes. You can use your own meme image. Rich Text Editing […]"},{"link":"https://nmac.to/blog/copyless-1-8-10/","image":"https://nmac.to/wp-content/uploads/2014/12/CopyLess.png","title":"CopyLess 1.8.10 – Store and access up to 100 clipboard items","content":"CopyLess is an advanced and flexible clipboard manager.   Unlike the system clipboard CopyLess can store up to 100 items to which you have instant access at any time. With CopyLess is no longer necessary to switch constantly between different applications or windows just to copy and paste several different items. Everything can now be […]"},{"link":"https://nmac.to/blog/dr-fone-for-ios-7-4-5/","image":"https://nmac.to/wp-content/uploads/2016/10/Dr.Fone-for-iOS.png","title":"Dr.Fone for iOS 7.4.5 – iPhone Data Recovery Software","content":"Dr.Fone for iOS – World’s 1st Mac iPhone and iPad data recovery software.   Recover iPhone data on Mac with three ways. Able to recover contacts, SMS, notes, call logs, photos, video, etc. Compatible with latest iPhone and Mac OS.   Other Scenarios Data lost after factory restore Data lost due to iOS update Device […]"}]