[{"link":"https://nmac.to/blog/dumper-1-2/","image":"https://nmac.to/wp-content/uploads/2016/03/Dumper.png","title":"Dumper 1.2 – Class dumping has never been more convenient","content":"Dumper lets you extract, browse and inspect the class declarations from any Mach-O file containing Objective-C runtime information. In other words, it generates information for all Objective-C classes and protocols present in a Mach-O executable in a nice and friendly header file format.   Class dumping is a drop away Class dumping has never been […]"},{"link":"https://nmac.to/blog/cloudmagic-email-7-8-30/","image":"https://nmac.to/wp-content/uploads/2016/01/CloudMagic.png","title":"CloudMagic Email 7.8.30 – One app for all of your email accounts","content":"CloudMagic is the perfect app to handle your email accounts.   Instant push notifications for ALL types of email accounts: Gmail, Exchange, Yahoo, Outlook, iCloud, Google Apps, Office 365, IMAP – you name it! Supports all versions of Exchange: ActiveSync (EAS), EWS and IMAP. Handoff: Effortlessly hand off what you’re doing on iPhone, iPad or […]"},{"link":"https://nmac.to/blog/lego-marvels-avengers-1-0/","image":"https://nmac.to/wp-content/uploads/2016/03/LEGO.Marvels.Avengers.png","title":"LEGO Marvel’s Avengers 1.0 – Avengers in classic LEGO humor","content":"LEGO Marvel’s Avengers features characters and storylines from the critically-acclaimed film Marvel’s The Avengers and the smash hit sequel Marvel’s Avengers: Age of Ultron, as well as playable content based on additional Marvel Studios blockbusters, including Marvel’s Captain America: The First Avenger, Iron Man 3, Thor: The Dark World and Captain America: The Winter Soldier. […]"},{"link":"https://nmac.to/blog/spacious-2-0/","image":"https://nmac.to/wp-content/uploads/2016/03/Spacious.png","title":"Spacious 2.0 – Control Spaces with any mouse","content":"Spacious is for you if you are tired of having to use your keyboard to switch to another OS X space. Use your mouse for this instead?!   Spacious adds fun, innovative OS X spaces and app navigation capabilities to every mouse.   The middle button becomes your starting point for gestures to quickly switch […]"},{"link":"https://nmac.to/blog/faux-pas-1-6-1/","image":"https://nmac.to/wp-content/uploads/2016/03/Faux.Pas_.png","title":"Faux Pas 1.6.1 – Inspect Xcode projects for bugs and other issues","content":"Faux Pas inspects your iOS or Mac app’s Xcode project and warns about possible bugs, as well as about maintainability and style issues.   What the Clang Static Analyzer is to your code, Faux Pas is to your whole Xcode project. Faux Pas doesn’t just look at your code – it inspects all the elements […]"},{"link":"https://nmac.to/blog/pdf-to-epub-2-7-0/","image":"https://nmac.to/wp-content/uploads/2016/03/PDF.to_.EPUB_.png","title":"PDF to EPUB 2.7.0 – Convert PDF files into EPUB eBooks","content":"The Enolsoft PDF to EPUB is a simple utility that helps you convert PDF files(scanned PDFs not included) into EPUB eBooks format for your mobile device.   Features Support batch conversion. Support Drag and Drop. Keep the original layouts and fonts. Convert PDF to EPUB format eBooks for reading on all kinds of mobile devices. […]"},{"link":"https://nmac.to/blog/docktime-1-1/","image":"https://nmac.to/wp-content/uploads/2016/03/DockTime.png","title":"DockTime 1.1 – Always displays the current time at your mac dock","content":"DockTime adds a clock to the Dock, which always displays the current time. The appearance can be chosen from a selection of beautiful, timeless designs. While other apps often bring many, non-essential functions, DockTime remains discreetly in the background and does only what a clock is made for: It displays the time.   Version 1.1: […]"},{"link":"https://nmac.to/blog/anime-studio-pro-11-2-1/","image":"https://nmac.to/wp-content/uploads/2016/01/Anime-Studio-Pro11.png","title":"Anime Studio Pro 11.2.1 – Complete 2D animation software for professionals","content":"Anime Studio Pro 11 is perfect for professionals looking for a more efficient alternative to tedious frame-by-frame animation. The intuitive and affordable feature set offers a solution to traditional animation tasks that are not available anywhere else at the same price point. With an intuitive interface, a visual content library and powerful features such as […]"},{"link":"https://nmac.to/blog/triplety-1-0-4/","image":"https://nmac.to/wp-content/uploads/2016/03/Triplety.png","title":"Triplety 1.0.4 – Live preview of HTML, CSS, and Javascript code","content":"Triplety is an HTML, CSS, and Javascript playground for Web designers and developers. With Triplety, you can save the hassle of writing boilerplate code. Your code works with live preview and live reload.   Features: Built-in Preview with live reload Local HTTP server with live reload for external browsers (Live reload for modern browsers including […]"},{"link":"https://nmac.to/blog/stardrive-2-sector-zero-1-0/","image":"https://nmac.to/wp-content/uploads/2016/03/StarDrive-2.png","title":"StarDrive 2: Sector Zero 1.0 – A turn-based space strategic game","content":"This baby takes the base game of StarDrive 2 and overhauls it with massive changes to the structure of the galaxy. First and foremost, the galaxy is now divided into Hexagonal Sectors, providing new resources, terrain features, chokepoints, and reasons for you to commit genocide on the friendly plant people. New deep space construction mechanics […]"}]