[{"link":"https://nmac.to/blog/imovie/","image":"https://nmac.to/wp-content/uploads/2017/05/iMovie10.png","title":"iMovie 10.1.10 – Edit personal videos and share them","content":"With a streamlined design and intuitive editing features, iMovie lets you enjoy your videos and tell stories like never before. Browse your video library, share favourite moments, and create beautiful movies that you can edit at resolutions up to 4K. You can even start editing movies on an iPhone or iPad, and finish them on a Mac. […]"},{"link":"https://nmac.to/blog/tripmode-2/","image":"https://nmac.to/wp-content/uploads/2017/10/TripMode2.png","title":"TripMode 2.2.1 – Prevent any app from access the internet easily from your mac menu","content":"TripMode only allows Internet access to apps important to you. Allow more apps when you need to.   TripMode helps you control your traffic and mobile data bills.   TripMode is turned ON automatically when your Mac is connected to a mobile hotspot.   When TripMode is ON, it prevents all your Mac apps from accessing the Internet but […]"},{"link":"https://nmac.to/blog/total-video-tools/","image":"https://nmac.to/wp-content/uploads/2017/12/Total-Video-Tools.png","title":"Total Video Tools 1.2.3 – Movie Edit Software","content":"Total Video Tools = Video Editor (Trim/Cut/Rotate/Merge/Extract…) + Screen/Voice Recorder + HD Video/Audio Converter + Video Player   Total Video Tools is the most powerful all-in-one essential video and audio toolset to edit movie, capture screen, convert, merge, compress, and play any video and audio on Mac.   Key Features:   Lossless Screen/Voice Recorder Support […]"},{"link":"https://nmac.to/blog/kpvid-video-converter/","image":"https://nmac.to/wp-content/uploads/2018/01/KeepVid-Video-Converter.png","title":"KeepVid Video Converter 2.0.0 – Easy, Powerful, and Professional Converter Tool","content":"KeepVid Video Converter helps you to convert videos to any video/audio formats you want, and offers 30x faster converting speed. Convert videos to more than 1000 video/audio formats. Offer 30x faster converting speed. Fully support HD videos, such as HD, 1080P, 4K, 8K videos, etc. Compatible with popular hi-tech video types like VR, 3D and […]"},{"link":"https://nmac.to/blog/proud/","image":"https://nmac.to/wp-content/uploads/2018/11/Proud.png","title":"Proud 1.1.1 – Take control over your time, productivity, and success","content":"Proud is the app for you if you want to be more productive, control your time better, and maximize your potential for success. From lists, reminders, and timers, to useful superpowers like: “Give me more time”, “De-stress”, or “Travel back in time”.   When an idea or a thought comes to your mind or you […]"},{"link":"https://nmac.to/blog/garden-planner/","image":"https://nmac.to/wp-content/uploads/2016/01/Garden-Planner3.png","title":"Garden Planner 3.6.36 – Plan out your garden","content":"Garden Planner lets you design your Dream Garden.   Garden Planner is an easy to use garden and landscaping design tool. Arrange plants, trees, buildings and objects using an easy to use ‘drag and drop’ interface. Use tools to quickly create paving, paths and fences. Then produce a high quality color image or print out […]"},{"link":"https://nmac.to/blog/tf-apple-music-converter/","image":"https://nmac.to/wp-content/uploads/2017/06/TuneFab-Apple-Music-Converter2.png","title":"TuneFab Apple Music Converter 4.1.1 – Convert Apple Music and M4P tracks","content":"TuneFab Apple Music Converter allows you to convert Apple Music and M4P tracks to plain MP3, AC3, M4A, M4R, AIFF, FLAC, MKA or AU 2.   Features: Convert iTunes and Audible audiobooks to MP3 or M4A with chapter information retained Customize output file parameters and name format to organize hundreds of songs easily Extract audio […]"},{"link":"https://nmac.to/blog/lego-marvel-super-heroes-2/","image":"https://nmac.to/wp-content/uploads/2018/11/LEGO-Marvel-Super-Heroes-2.png","title":"LEGO Marvel Super Heroes 2 1.0 – Superhero Action LEGO Game","content":"Join your favorite Super Heroes and Super Villains from different eras and realities as they go head-to-head with the time-traveling Kang the Conqueror!   CHRONOPOLIS OPEN WORLD Explore 18 different Marvel locations ripped from time and space, all of which come together to form one huge, incredible Chronopolis Open Hub World.   ORIGINAL STORY Picking […]"},{"link":"https://nmac.to/blog/state-of-mind/","image":"https://nmac.to/wp-content/uploads/2018/11/State.Of_.Mind_.png","title":"State Of Mind 1.1 – A futuristic thriller game delving into transhumanism","content":"Berlin, 2048 – The world is on the brink. Lack of resources, illnesses caused by polluted air and water, crime on the rise, war. Governments and companies promise remedies through technological progress. Drones and humanoid robots replace humans in the public sector, everything is interconnected, surveillance has become omnipresent.   Richard Nolan is one of […]"},{"link":"https://nmac.to/blog/memoranda/","image":"https://nmac.to/wp-content/uploads/2018/11/Memoranda.png","title":"Memoranda 1.1 – 2D point and click adventure game","content":"Memoranda is a game about forgetting and being forgotten!   A point and click adventure game with magic realism elements that tells the story of a young lady who gradually realizes she is forgetting her own name. Is she really losing her memory or is there something else that could explain the strange circumstances?   […]"}]