[{"link":"https://nmac.to/blog/the-dream-machine/","image":"https://nmac.to/wp-content/uploads/2020/05/The-Dream-Machine.png","title":"The Dream Machine 1.0.2 – Point & Click Puzzle & Adventure Game","content":"The Dream Machine is an award-winning adventure game about dreams. It’s built by hand using materials such as clay, cardboard and broccoli.   In Chapter 1 you play as Victor Neff, the husband in a young couple who’ve just moved into a new apartment. While trying to get settled in you discover that all is […]"},{"link":"https://nmac.to/blog/filebot/","image":"https://nmac.to/wp-content/uploads/2015/01/FileBot.png","title":"FileBot 4.9.1 – Quickly rename video or music files","content":"FileBot helps you easily and quickly organize and rename movies, TV shows, and music files. Automatic naming. FileBot retrieves file information from various online databases but leaves room for you to manage file naming how you like using groovy expressions. Add subtitles. Manually search for, download, and add subtitles using features built into FileBot. Command-line […]"},{"link":"https://nmac.to/blog/agent-a/","image":"https://nmac.to/wp-content/uploads/2020/05/Agent-A.png","title":"Agent A: A puzzle in disguise 5.2.5 – A secret agent escape room","content":"Agent A, your new mission is in from headquarters. An enemy spy known as Ruby La Rouge has been targeting our secret agents. Your mission is to find and capture her.   First we need you to follow Ruby, then locate and infiltrate her secret lair. Once inside it is imperative that you uncover her […]"},{"link":"https://nmac.to/blog/tinertia/","image":"https://nmac.to/wp-content/uploads/2016/05/Tinertia1.png","title":"Tinertia 1.0 – Action Platformer Game: Without Jump Button!","content":"TINERTIA features a unique Twinstick Movement mechanic that lets the player rocket-jump and rapidly gain speed. The game’s 3D environments are stunning and intricate, especially in Virtual Reality, where players can truly immerse themselves in the world. Tinertia’s unique mechanics deliver an exciting mix of methodical platforming and fast-twitch shooting. Rocket Jumping: Master the fluid […]"},{"link":"https://nmac.to/blog/star-crawlers/","image":"https://nmac.to/wp-content/uploads/2017/05/StarCrawlers.png","title":"StarCrawlers 1.1.4.1 – A modern take sci-fi RPG game","content":"Build a crew of renegade adventurers on the fringes of space, taking jobs from megacorps to hunt bounties, sabotage rivals and conduct corporate espionage. If you can navigate the intricate politics of wealth and power, you might just survive long enough to spend your hard-won credits.   You’re a Crawler, and that means you work […]"},{"link":"https://nmac.to/blog/flat-kingdom/","image":"https://nmac.to/wp-content/uploads/2016/04/Flat-Kingdom-Papers.png","title":"Flat Kingdom Paper’s Cut Edition 1.0.6 – 2D Action & Adventure Platformer Game","content":"Flat Kingdom is filled with fun platforming action, puzzles and some Metroidvania elements. It also features a unique combat system! Instead of directly attacking your foes, you’ll have to touch them while transformed in the correct shape to beat them! Kinda like a rock-paper-scissor game.   Every shape in Flat Kingdom beats the opposite, so […]"},{"link":"https://nmac.to/blog/civilization-v-campaign-edition/","image":"https://nmac.to/wp-content/uploads/2015/11/Civilization.png","title":"Civilization V: Complete Edition 1.4.2 – Lead your people to a new frontier","content":"Civilization V brings all the features and functionality of the single-player campaign to the Mac App Store. Become Ruler of the World by establishing and leading a civilization from the dawn of man into the space age: Wage war, conduct diplomacy, discover new technologies, go head-to-head with some of history’s greatest leaders and build the most […]"},{"link":"https://nmac.to/blog/smart-utility/","image":"https://nmac.to/wp-content/uploads/2016/10/SMART-Utility3.png","title":"SMART Utility 3.2.6 – Checks the hardware diagnostics system of hard drives","content":"SMART Utility is an application to scan the internal hardware diagnostics system of hard drives. SMART (Self-Monitoring Analysis and Reporting Technology) is a system built into hard drives by their manufacturers to report on various measurements (called attributes) of a hard drive’s operation. The attributes can be used to detect when a hard drive is […]"},{"link":"https://nmac.to/blog/serviio-pro/","image":"https://nmac.to/wp-content/uploads/2016/01/Serviio.png","title":"Serviio Pro 2.1 – Stream music, photos and video to PS3, Xbox 360 and more","content":"Serviio Pro is a DLNA media server. It allows you to stream your media files (music, video or images) to any DLNA-certified renderer device (e.g., a TV set, Blu-ray player, games console) on your home network.   Serviio is based on Java technology and therefore runs on most platforms, including Windows, Mac, and Linux (incl. […]"},{"link":"https://nmac.to/blog/anamorphic/","image":"https://nmac.to/wp-content/uploads/2018/01/Anamorphic.png","title":"Anamorphic 2.3 – Turns your ordinary photos into cinematic masterpieces","content":"Anamorphic turns your ordinary photos into cinematic masterpieces.   Edit iPhone Portrait Mode photos on your Mac!   Integration with the Mac Photos app makes it easy to edit your portrait shots.   Features Bokeh Style Lens Distortion Focal Depth LUT Film Filters   Depth Data Load and edit shots with depth data for a […]"}]