[{"link":"https://nmac.to/blog/day-of-the-tentacle-remastered-1-0/","image":"https://nmac.to/wp-content/uploads/2016/03/Day.of_.the_.Tentacle.Remastered.png","title":"Day of the Tentacle Remastered 1.0 – Point & Click Adventure Game","content":"Dr. Fred’s mutated purple tentacle is about to take over the world, and only you can stop him!   Originally released by LucasArts in 1993 as a sequel to Ron Gilbert’s ground breaking Maniac Mansion, Day of the Tentacle is a mind-bending, time travel, cartoon puzzle adventure game in which three unlikely friends work together […]"},{"link":"https://nmac.to/blog/boost-up-memory-2-9-1/","image":"https://nmac.to/wp-content/uploads/2016/03/Boost.up_.Memory.png","title":"Boost up Memory 2.9.1 – Memory And Disk Optimization Utility – ALL in ONE","content":"Boost up Memory, Clean and Optimize Disk – ALL in ONE – Supports 30 languages   Macs are used daily for intensive usage like editing, programming, and much more! Having too many apps open can damage or slow down your disk! That’s why you need to buy our app, which is Ranked top Paid Apps […]"},{"link":"https://nmac.to/blog/quick-css-menu-1-2/","image":"https://nmac.to/wp-content/uploads/2016/03/Quick-CSS-Menu.png","title":"Quick CSS Menu 1.2 – Easily create a beautiful drop down CSS Menu","content":"With CSS 3 and HTML 5 developer can easily create a beautiful drop down menu that was once only able to be achieved using java script and static background image. Menu created with CSS can be easily adapted to a different size without losing any quality and will greatly reduce bandwidth usage. Although CSS is […]"},{"link":"https://nmac.to/blog/quick-css-gradient-1-0/","image":"https://nmac.to/wp-content/uploads/2016/03/Quick-CSS-Gradient.png","title":"Quick CSS Gradient 1.0 – Quickly design a complex gradient","content":"Finding the right formula for gradient color is quite a challenge. Using Quick CSS Gradient you can visually design a complex gradient with multiple color stops easily.   Key features: Support all major web browsers Horizontal, vertical, and diagonal, and radial gradients Multi-stop gradients Support multiple color formats (Hex, rgb, rgba, hsl, hsla) Save and […]"},{"link":"https://nmac.to/blog/quick-css-button-1-5-1/","image":"https://nmac.to/wp-content/uploads/2016/03/Quick.CSS.Button.png","title":"Quick CSS Button 1.5.1 – Create button using CSS and HTML","content":"With improved support from major web browsers for CSS 3 and HTML 5, developer today prefer to create button using CSS and HTML than using static image. With CSS, button can easily adapt to a different size without losing any quality and will greatly reduce bandwidth usage. Creating button with CSS is pretty easy. Everyone […]"},{"link":"https://nmac.to/blog/privacy-guard-1-0/","image":"https://nmac.to/wp-content/uploads/2016/03/Privacy-Guard.png","title":"Privacy Guard 1.0 – Find & Remove Threats","content":"Privacy Guard is designed to protect your privacy by cleaning up all the unwanted history data on your Mac. With simply one click, Privacy Guard allows you to erase cache files, browsing history, cookies, temporary files and more.   Use Privacy Guard for the following; Web browsers (Safari, Chrome, Firefox, etc): Remove Caches, Cookies, History, […]"},{"link":"https://nmac.to/blog/imagetobase64-1-2/","image":"https://nmac.to/wp-content/uploads/2016/03/ImageToBase64.png","title":"ImageToBase64 1.2 – Convert image to base64 string","content":"ImageToBase64 is a tool to convert image to base64 string (CSS Image). Converting an image to base64 string is needed if you wish to embed images directly into a web page. The program is not only provide conversion to Base64 string, but also tell you how to use the string in your web project. A […]"},{"link":"https://nmac.to/blog/hotkey-1-1-2/","image":"https://nmac.to/wp-content/uploads/2016/03/HotKey.png","title":"HotKey 1.1.2 – Define keyboard shortcuts to launch Applications or open folders in Finder","content":"With HotKey You can define keyboard shortcuts to launch Applications or open folders in Finder. Another way is to open the Apps by selecting them from the Status-Menu in Your Mac’s menu bar.   Another Feature: Show the content of the clipboard with one keyboard shortcut.   OS X 10.11 or later, 64-bit processor   […]"},{"link":"https://nmac.to/blog/el-capitan-cache-cleaner-10-0-4/","image":"https://nmac.to/wp-content/uploads/2015/11/El.Capitan.Cache_.Cleaner.png","title":"El Capitan Cache Cleaner 10.0.4 – Clear caches, access hidden OS X settings, and more","content":"El Capitan Cache Cleaner is an award-winning general purpose tool for OS X. ElCC makes system maintenance simple with an easy point-and-click interface to many OS X functions. Novice and expert users alike will appreciate the powerful toolset ElCC provides. El Capitan Cache Cleaner is one of the world’s leading maintenance tools, with millions of […]"},{"link":"https://nmac.to/blog/tiny-knight-1-0/","image":"https://nmac.to/wp-content/uploads/2016/03/TinyKnight.png","title":"Tiny Knight 1.0 – A single-player adventure platformer set in a fantastical world","content":"Tiny Knight is a single-player adventure platformer set in a fantastical world   Our little hero lives in a peaceful village which comes under attack on a fateful night. After seeing your village destroyed, you set out on an adventure to stop the mysterious attacker from wreaking havoc upon the rest of the province. You […]"}]