[{"link":"https://nmac.to/blog/super-dungeon-tactics-1-0/","image":"https://nmac.to/wp-content/uploads/2016/12/Super-Dungeon-Tactics.png","title":"Super Dungeon Tactics 1.0 – Turn-Based Tactics & Strategy Game","content":"Super Dungeon Tactics is a tactical turn-based game in which players create a guild of Heroes to combat the Dark Consul’s forces throughout Crystalia. As the guild master you choose to take on bounties, answer the pleas of the public, or answer a noble call to adventure. Whether for altruistic reasons, just getting your cut, […]"},{"link":"https://nmac.to/blog/templates-bundle-for-iwork-alungu-designs-4-0/","image":"https://nmac.to/wp-content/uploads/2016/12/Templates-Bundle-for-iWork.png","title":"Templates Bundle for iWork – Alungu Designs 4.0 – The ultimate tool for users of iWork","content":"Templates Bundle for iWork – Alungu Designs is the ultimate tool for users of iWork, providing you with 680 unique designs for your Pages documents, 35 quality presentation themes for Keynote, and 90 spreadsheet templates for Numbers. All templates are easily customizable and available in the US and international page formats.   Pages Templates The […]"},{"link":"https://nmac.to/blog/onedocs-1-8-1/","image":"https://nmac.to/wp-content/uploads/2016/12/OneDocs1.png","title":"OneDocs 1.8.1 – Create Microsoft Office 365 documents in OneDrive","content":"OneDocs is magic and easy-to-use app help you easier to create Microsoft office 365 documents in OneDrive on your Mac.   Features Create Word, Excel and PowerPoint documents Sync documents in OneDrive’s Documents folder to local Keep track all changes of online documents and automatic update on local Calendar and manage email with Outlook Browse […]"},{"link":"https://nmac.to/blog/layouts-for-keynote-3-1-2/","image":"https://nmac.to/wp-content/uploads/2016/09/Layouts-for-Keynote3.png","title":"Layouts for Keynote 3.1.2 – Keynote themes with customizable elements","content":"Layouts for Keynote is a collection of themes created for unique slideshows. Outline your ideas, proposals, contracts, and solutions. Then, enhance them with stylish backgrounds, charts, diagrams, tables, and other data-visualization elements to attain all you have been working for.   Each theme contains 20 master slides, covering everything from basic bullet layouts to complex […]"},{"link":"https://nmac.to/blog/her-majestys-spiffing-1-0/","image":"https://nmac.to/wp-content/uploads/2016/12/Her.Majestys.SPIFFING.png","title":"Her Majesty’s SPIFFING 1.0 – A quaint graphic adventure game","content":"In the wake of political developments during the summer of 2016 and the events that followed, Britain found itself increasingly isolated from global society. Frustrated by the demise of this once great nation Her Majesty the Queen concluded that the elected representatives at Westminster were no longer fit to govern her United Kingdom.   Having […]"},{"link":"https://nmac.to/blog/3d-converter-6-3-89/","image":"https://nmac.to/wp-content/uploads/2016/11/3D-Converter.png","title":"3D Converter 6.3.89 – 2D to 3D video conversion","content":"3D Converter – The best 3D Video Converter with most 3D modes.   If you are 3D video lover, you shouldn’t miss this 3D Video Converter.It can convert 2D Video to 3D Effect, 3D video to other 3D modes, 3D video to common 2D video easily and fast. It provides Anaglyph, Side by Side or […]"},{"link":"https://nmac.to/blog/giant-machines/","image":"https://nmac.to/wp-content/uploads/2016/12/Giant.Machines.png","title":"Giant Machines 2017 1.1.2 – Take control over the biggest industrial machines","content":"Giant Machines 2017 enables you to control seven of the biggest industrial machines ever created on Earth. They will introduce you into the world of hissing hydraulic systems, excavator buckets and the smell of diesel.   Unlike contemporary simulators, the 14 main missions are all part of one story. The goal is to send a […]"},{"link":"https://nmac.to/blog/word-air-1-7-4/","image":"https://nmac.to/wp-content/uploads/2016/12/Word-Air1.png","title":"Word Air 1.7.4 – for Microsoft Word Edition & Open Office Format","content":"Word Air is a beautiful, easy-to-use text editor that is designed to make writing convenient, efficient and comfortable. Word Air is ease, fast and uncluttered. It starts up quickly, has a live word count, easy on the eyes and you can export all the common formats: .pdf, .rtf, .doc, .txt and more .   Features […]"},{"link":"https://nmac.to/blog/graphics-for-iwork-3-1-1/","image":"https://nmac.to/wp-content/uploads/2016/09/Graphic.Styles3.png","title":"Graphics for iWork 3.1.1 – Collection of icons, frames, and patterns","content":"The Graphics for iWork (was Graphic Styles) set contains a generous selection of high-quality designs to help you create unique Pages content or Keynote presentations. It is an excellent collection for adding some exclusivity to your slides with original bullets, characters, patterns, and image frames.   All images include transparent backgrounds that allow placing them […]"},{"link":"https://nmac.to/blog/video-slave-3-1-1325/","image":"https://nmac.to/wp-content/uploads/2016/12/Video-Slave3.png","title":"Video Slave 3.1.1325 – Timecode synchronized video player","content":"Use Video Slave 3 to play movie clips in sync with Pro Tools, Cubase, Nuendo, Logic Pro X, Studio One and many other popular DAWs. Video Slave 3 uses MIDI Timecode – a protocol supported by most Digital Audio Workstations on the market today – to drive synchronized movie playback as well as MIDI Machine Control for full scrubbing […]"}]