[{"link":"https://nmac.to/blog/spyder/","image":"https://nmac.to/wp-content/uploads/2020/12/Spyder.png","title":"Spyder 2.1 – Save the World!","content":"Save the world with Agent 8 in this Spy on The Wall adventure.   Set in a retro universe, British Spy Agency ‘EP-8’ has created Agent 8, the most sophisticated miniature robot spider on earth! Built using experimental technology, this itsy-bitsy superspy is equipped with all the gadgets and gizmos you’ll need; cut through panels, […]"},{"link":"https://nmac.to/blog/the-pathless/","image":"https://nmac.to/wp-content/uploads/2020/12/The-Pathless.png","title":"The Pathless 1.0.5 – A mythic adventure","content":"From the creators of ABZÛ, The Pathless is the mythic adventure of an archer and an eagle in a vast forest.   Archery and Falconry Become the Hunter, a master of archery who travels to a mystical island to dispel a curse of darkness that grips the world. Forge a connection with your eagle companion […]"},{"link":"https://nmac.to/blog/markdown/","image":"https://nmac.to/wp-content/uploads/2020/12/Markdown_plus.png","title":"Markdown+ 2.1 – Advanced Markdown editor","content":"Markdown+ was designed for simplicity of use, allowing you to create beautiful Web documents without having to write a lot of code.   Features Works in macOS High Sierra Ultra-intuitive, easy-to-use interface Live Preview (Preview as-you-type) 12 different styles from which to choose Export option, to save your document directly as HTML Full-blown Markdown editing, […]"},{"link":"https://nmac.to/blog/itsmine-video-watermark-maker/","image":"https://nmac.to/wp-content/uploads/2019/08/itsMine-Video-Watermark-Maker.png","title":"itsMine Video Watermark Maker 2.6 – Add professional logos to your videos","content":"itsMine Video Watermark Maker makes it easy to add professional logos to your videos to help protect your creative work and promote brand awareness. Also available for iPhone and iPad (iOS edition sold separately on the App Store)   Key Features: Drag and drop to add text, shapes and image logo overlays to your videos. […]"},{"link":"https://nmac.to/blog/photochef/","image":"https://nmac.to/wp-content/uploads/2020/11/PhotoChef_1.png","title":"PhotoChef 1.3 – Make creative compositions in no time","content":"With PhotoChef you can make creative compositions in no time.   It features a complete set of tools: add how many images you want, mix, blend, compose, transform with no limits to your creativity. And with chroma key and brush you can compose by color or by shape.   From fun photography to sophisticated photomontages […]"},{"link":"https://nmac.to/blog/prefedit/","image":"https://nmac.to/wp-content/uploads/2016/06/PrefEdit.png","title":"PrefEdit 4.5.1 – Inspect and edit all preference settings for OS X apps","content":"PrefEdit is a utility that allows you to inspect and edit all preference settings for OS X applications. The settings are displayed in a browser and can be edited by simple point-and-click operations. You can also do a full-text search on all settings, or clean up unused entries of applications that have been uninstalled.   […]"},{"link":"https://nmac.to/blog/joystick-monitor/","image":"https://nmac.to/wp-content/uploads/2020/12/Joystick-Monitor.png","title":"Joystick Monitor 1.3 – Joystick status monitor app for macOS","content":"Joystick Monitor is a beautiful joystick status monitor application for macOS.   This app allows you to check the input value and status information of your Joysticks and Gamepads.   Simple, beautiful and easy to use.   The voice assistant will speak your joystick’s name and connection status.   Supported Joysticks Sony DUALSHOCK 3 Sony […]"},{"link":"https://nmac.to/blog/appkiller/","image":"https://nmac.to/wp-content/uploads/2017/02/AppKiller_3.png","title":"AppKiller 3.0 – Close all open apps at once","content":"AppKiller lets you close all your open apps, with the fuss of going through them one-by-one. Do you want to be able to do with a single click? Or – even better – with a single… keyboard shortcut? Look no further!   Features Easy-to-use: App Killer sleeps unobtrusively in your status bar and waiting for… […]"},{"link":"https://nmac.to/blog/ui-browser/","image":"https://nmac.to/wp-content/uploads/2020/05/UI_Browser_3.png","title":"UI Browser 3.0.2 – Monitor the user interface of OS X apps","content":"PFiddlesoft’s UI Browser helps you to explore, manipulate, and monitor the user interface of most OS X applications running on your computer. With the push of a button, it also generates AppleScript statements to control any application using GUI Scripting, even applications that are not otherwise scriptable. No other utility provides all of the information […]"},{"link":"https://nmac.to/blog/speakme/","image":"https://nmac.to/wp-content/uploads/2020/12/SpeakMe.png","title":"SpeakMe 1.4 – Convert plain text to audio with one click","content":"SpeakMe: Do you want to have your Mac read to you your favourite e-book? Do you also want to digitize it and export it as audio? Perhaps, you need to put audio narration to a video of yours? Look no further!   Easy-to-use, intuitive UI Speak any plain text Export to audio (.aiff) Speak/Export Whole […]"}]