[{"link":"https://nmac.to/blog/realms-of-arkania-star-trail/","image":"https://nmac.to/wp-content/uploads/2017/08/Realms.of_.Arkania.Star_.Trail_.png","title":"Realms of Arkania: Star Trail 1.0 – A challenging isometric turn-based combat game","content":"The united orc tribes attempted to invade the region of Thorwal, but a group of valiant adventurers thwarted their plans during their previous quest. Now the orcs have regrouped and attacked other, more vulnerable areas – Lowangen is occupied and half the Svellt Valley lies in ashes. An elf ambassador summons the party to the […]"},{"link":"https://nmac.to/blog/causality/","image":"https://nmac.to/wp-content/uploads/2017/08/Causality.png","title":"Causality 1.2.5 – Time Manipulating & Puzzle Game","content":"Causality is a puzzle game about manipulating time, altering the sequence of events and changing the outcome of each level.   Set across strange and alien landscapes, help a group of stranded astronauts find a route to safety. Travel through time, work with your past selves and solve paradoxes as you take on this uniquely […]"},{"link":"https://nmac.to/blog/subject-13/","image":"https://nmac.to/wp-content/uploads/2017/08/SUBJECT-13.png","title":"Subject 13 1.0 – Exploration Adventure & Puzzle Game","content":"Subject 13 is the new adventure game developed by Paul Cuisset—the man behind “Flashback”, “Future Wars: Adventures in Time” and “Moto Racer”—in partnership with Microïds. This is a true adventure game. It depicts a mysterious universe filled with secret hiding places and all kinds of mechanisms that the player discovers, analyzes, and activates. There are […]"},{"link":"https://nmac.to/blog/numbers/","image":"https://nmac.to/wp-content/uploads/2014/10/Numbers2.png","title":"Numbers 4.2 – Apple’s spreadsheet app from the iWork suite","content":"With Numbers, sophisticated spreadsheets are just the start. The whole sheet is your canvas. Just add dramatic interactive charts, tables, and images that paint a revealing picture of your data. You can work seamlessly between Mac and iOS devices. And work effortlessly with people who use Microsoft Excel.   Version 4.2: Enhance your spreadsheets using […]"},{"link":"https://nmac.to/blog/pages/","image":"https://nmac.to/wp-content/uploads/2014/10/Pages2.png","title":"Pages 6.2 – Apple’s word processor from the iWork suite","content":"Apple Pages is a powerful word processor that gives you everything you need to create documents that look beautiful. And read beautifully. It lets you work seamlessly between Mac and iOS devices. And even work effortlessly with people who use Microsoft Word.   Version 6.2: Enhance your documents using a library of over 500 professionally […]"},{"link":"https://nmac.to/blog/keynote/","image":"https://nmac.to/wp-content/uploads/2014/10/Keynote2.png","title":"Keynote 7.2 – Apple’s presentation designer from the iWork suite","content":"Easily create gorgeous presentations with the all-new Keynote, featuring powerful yet easy-to-use tools and dazzling effects that will make you a very hard act to follow.   The Theme Chooser lets you skim through an impressive collection of 30 new and updated Apple-designed themes. Once you’ve chosen the perfect canvas for your presentation, simply replace […]"},{"link":"https://nmac.to/blog/booxter/","image":"https://nmac.to/wp-content/uploads/2014/03/Booxter.png","title":"Booxter 2.7.19 – Manage your book, music, movie and comic collections","content":"Booxter is an application to help you manage your collections of books, music, movies, and comic books.   Booxter gathers information from various sources on the Internet to allow you to view, edit, sort, categorize, export, and print books. music, movies and comics of interest to you.   With Booxter you can: Add items one […]"},{"link":"https://nmac.to/blog/the-low-road/","image":"https://nmac.to/wp-content/uploads/2017/08/The-Low-Road.png","title":"The Low Road 1.0 – Lie, blackmail, and steal your way down","content":"Set in the world of the 1970s automobile industry, The Low Road is a point-and-click graphic adventure game which follows a team of corporate spies dedicated to the protection (and appropriation) of game-changing industry secrets. Sporting a unique visual style inspired by gouache paintings and a pulsating rock and roll score, “The Low Road” will […]"},{"link":"https://nmac.to/blog/justbroadcaster-for-periscope/","image":"https://nmac.to/wp-content/uploads/2017/08/JustBroadcaster.for_.Periscope.png","title":"JustBroadcaster for Periscope 1.0 – Broadcast from your Mac to Periscope","content":"JustBroadcaster for Periscope allows you to stream live content. Just insert the video sources into the prepared templates and start stream. Easy logo and background setup. The application supports built-in, USB, DV, HDMI cameras. Simple capturing of the screen and application windows. Cursor capture is supported. You can broadcast iOS games and applications by simply […]"},{"link":"https://nmac.to/blog/movavi-media-player/","image":"https://nmac.to/wp-content/uploads/2017/08/Movavi-Media-Player.png","title":"Movavi Media Player 2.0 – Versatile media player","content":"Movavi Media Player is a versatile and powerful video player for your entire media collection. Forget about compatibility problems: play video and audio files in any popular format, including HD – guaranteed freeze-free.   Watch video in AVI, WMV, MP4, MTS, FLV and other formats, play music in MP3, AAC, M4A, WAV, WMA, OGG, FLAC, […]"}]