[{"link":"https://nmac.to/blog/archiver/","image":"https://nmac.to/wp-content/uploads/2019/10/Archiver_4.png","title":"Archiver 4.0.0 – Compress files and folders & extract archives [FIX]","content":"Archiver is a powerful, feature-rich archiving utility for the Mac to open archives, compress files, as well as split and combine files.   Why Archiver? Smooth, easy-to-use user interface that blends beautifully into your Mac Smart drag & drop to save you time Conveniently preview archives Lighting-fast archive decompression Tailor to your needs with flexible […]"},{"link":"https://nmac.to/blog/renamer/","image":"https://nmac.to/wp-content/uploads/2016/08/Renamer5.png","title":"Renamer 6.0.6 – Rename files in batches [FIX]","content":"Renamer is a powerful, feature-rich batch-file renamer that makes renaming many files quick and easy. If you ever had to rename hundreds or thousands of files file by hand and thought “there must be an easier way”, then Renamer is for you. With Renamer, you can save hours of tedious typing at the stroke of […]"},{"link":"https://nmac.to/blog/postico/","image":"https://nmac.to/wp-content/uploads/2017/03/Postico1.png","title":"Postico 1.5.20 – A modern PostgreSQL Client","content":"Postico provides an easy to use interface, making Postgres more accessible for newcomers and specialists alike. Postico will look familiar to anyone who has used a Mac before. Just connect to a database and begin working with tables and views. Start with the basics and learn about advanced features of PostgreSQL as you go along. […]"},{"link":"https://nmac.to/blog/shortcut-bar/","image":"https://nmac.to/wp-content/uploads/2016/09/Shortcut-Bar.png","title":"Shortcut Bar 2.9.4 – Quickly Access Files & Folders [FIX]","content":"Shortcut Bar is an incredibly handy app that connects you to the files, folders and apps that you need lightning fast access to.   The app lives in your menubar and allows you to add in an unlimited number of shortcuts. Whenever you require access to these important files and folders, simply click on the […]"},{"link":"https://nmac.to/blog/voice-memo/","image":"https://nmac.to/wp-content/uploads/2014/02/Voice.Memo_.png","title":"Voice Memo 2.3.1 – Record voice memos","content":"Voice Memo allows you to record a message that you can send to yourself in the future using a built in alarm calendar. This is a very precise way of telling yourself in detail, what you want yourself to be doing at a specific time. Remind yourself of an important event or task using the […]"},{"link":"https://nmac.to/blog/resolutionator/","image":"https://nmac.to/wp-content/uploads/2016/12/Resolutionator1.png","title":"Resolutionator 2.2 – Allows users to quickly change the resolution of attached displays","content":"Resolutionator makes it simple to use any of your display’s available resolutions. Need more space for a project? A quick click of a menu bar icon or press of a keyboard shortcut lets you easily switch to any available resolution. No more time-consuming trips through System Preferences.   Version 2.2: Added support for the 14″/16″ […]"},{"link":"https://nmac.to/blog/agatha-christie/","image":"https://nmac.to/wp-content/uploads/2021/11/Agatha-Christie-Hercule-Poirot-The-First-Cases.png","title":"Agatha Christie – Hercule Poirot: The First Cases 1.0.5 – Mystery Story Rich Game","content":"In his early years as a detective, Hercule Poirot is invited to a reception by the influential Van den Bosch family, for the announcement of their daughter’s engagement. But tensions amongst the guests run high as a snowstorm descends on the town, trapping everyone inside the manor. The happy event is soon marred by the […]"},{"link":"https://nmac.to/blog/transport-fever-2/","image":"https://nmac.to/wp-content/uploads/2021/03/Transport-Fever-2.png","title":"Transport Fever 2 34983 – City Builder Simulation & Management Game","content":"The classic transport simulation genre has a new gold standard with Transport Fever 2. Discover a whole new world by navigating transport routes through land, water and air. May progress and prosperity find their way!   Provide the world with the transport infrastructure it needs and make a fortune with custom-made transport services. Watch your […]"},{"link":"https://nmac.to/blog/wasteland-3/","image":"https://nmac.to/wp-content/uploads/2020/12/Wasteland-3.png","title":"Wasteland 3 1.6.9.420 – Turn-Based RPG & Strategy Game","content":"In Wasteland 3 you take command of a squad of Desert Rangers, lawmen and women in a post-nuclear world, trying to rebuild society from the ashes. More than a century after the bombs fell, you’re fighting a losing battle to keep your beloved Arizona alive. Then the self-proclaimed Patriarch of Colorado radios, promising aid if […]"},{"link":"https://nmac.to/blog/macx-video-converter-pro/","image":"https://nmac.to/wp-content/uploads/2017/05/MacX-Video-Converter-6.png","title":"MacX Video Converter Pro 6.5.9 – High-speed converter for HD/SD videos","content":"MacX Video Converter Pro is an excellent all-in-one toolkit that works as an HD video converter, video editor, screen recorder, and slideshow maker. It lets you convert 4K HD/SD videos to MP4, AVI, MPEG, FLV, MOV, WMV, MKV, MP3, etc., for playback on QuickTime, iPhone, iPad, or Android flawlessly, and for editing with iMovie and […]"}]