[{"link":"https://nmac.to/blog/blogo-2-3-2/","image":"https://nmac.to/wp-content/uploads/2014/08/Blogo.png","title":"Blogo 2.3.2 – Write, publish and manage multiple blogs","content":"Blogo is the easiest and fastest way to write, publish and manage multiple blogs. Blogo gathered features for a powerful solution and helps users to publish and create content easily. It makes it possible to manage multiple blogs at the same time, edit pictures with a built-in image editor, preview your posts on real-time, manage […]"},{"link":"https://nmac.to/blog/napkin-1-5-2/","image":"https://nmac.to/wp-content/uploads/2015/09/Napkin.png","title":"Napkin 1.5.2 – Create visual notes and diagrams quickly and easily","content":"Napkin is the ultimate tool for concise visual communication. Painlessly create visual notes and diagrams and share the results quickly.   Use Napkin when you need to create an image that makes your point crystal clear. Designers, product managers, software developers, artists, photographers, bloggers, journalists, and anyone who needs to annotate images will find Napkin […]"},{"link":"https://nmac.to/blog/isonics-1-8-1/","image":"https://nmac.to/wp-content/uploads/2014/04/iSonics.png","title":"iSonics 1.8.1 – Convert audio files between formats","content":"iSonics makes it easy to convert any audio format and CDs to all popular audio formats: MP3, MP2, AAC, FLAC, ALAC, WMA, OGG Vorbis, AC3, and WAV.   It handles metadata with ease and even enables you to change metadata, including automatically downloading cover pictures.   As a bonus you can import CDs and convert […]"},{"link":"https://nmac.to/blog/comburet-2-3/","image":"https://nmac.to/wp-content/uploads/2015/09/Comburet.png","title":"Comburet 2.3 – Professional disc burning app","content":"Comburet is a professional burning App. You can use Comburet to burn music CD, data, iso and dmg image file,erase rewritable disc,make dmg and iso image file.   Comburet main features: Auto find burning device Supports CD,DVD,HD-DVD and BD Burn music CD with CD-Text:m4a,m4b,m4p,mp3,caf,aiff,au,sd2,wav,snd,amr Burn folder and image file(DMG and ISO) Erase rewritable disc Make […]"},{"link":"https://nmac.to/blog/cleanmyphone-3-8-2/","image":"https://nmac.to/wp-content/uploads/2014/01/CleanMyPhone.png","title":"CleanMyPhone 3.8.2 – Keep your iPhone, iPad, or iPod touch clean and well-organized","content":"CleanMyPhone is an ingeniously simple and powerful application that will help you keep your iPhone, iPad, or iPod touch clean and running smoothly. It includes useful tools such as Disk Manager, App Cleaner, Removal of Document and Data, Find Large Files, One-Click-Copy, and more.   Configure, Organize and Manage Files and Apps on Your iOS […]"},{"link":"https://nmac.to/blog/bleam-1-0-2/","image":"https://nmac.to/wp-content/uploads/2015/09/Bleam.png","title":"Bleam 1.0.2 – Browse Reddit natively","content":"Bleam is a native Mac client for Reddit Never ending Reddit Multi Reddit Markdown Support Imgur Album Support Trending Reddits Gold & Moderation Tools Integrated Video playing for watching while commenting Contextual information about Sub Reddits and Users Reddit Wikis Much more to come!!   Version 1.0.2: UI Improvements PM’s now send correctly New notifications […]"},{"link":"https://nmac.to/blog/subtools/","image":"https://nmac.to/wp-content/uploads/2015/09/SUBtools.png","title":"SUBtools 1.0.1 – light-weight standalone subtitle editor","content":"    SUBtools is primarily designed to be a helper-application for MP4tools, MKVtools, and AVItools. Subtitle files can be sent to it from any of these three applications for quck editing and then sent back for incorporation into a processed video. If desired, it can also be used as a light-weight standalone subtitle editor. SUBtools is a part […]"},{"link":"https://nmac.to/blog/xrevert-2-0-1/","image":"https://nmac.to/wp-content/uploads/2015/09/XRevert.png","title":"XRevert 2.0.1 – Reverts icons and UI elements to those of prior OS X versions","content":"XRevert (was YosemiteRevert) changes application icons, system icons (such as the folder icon), menu bar icons, and more, as well as the system font, in OS X 10.10 Yosemite and later back to the way they were in prior versions of OS X. It also makes changes to aesthetics, such as the “traffic light icons” […]"},{"link":"https://nmac.to/blog/winonx-1-6/","image":"https://nmac.to/wp-content/uploads/2015/09/WinOnX.png","title":"WinOnX 1.6 – Run Windows applications on OS X","content":"WinOnX lets you run your Windows applications on OS X without the need of buying a Windows license. Well, you even do not need to install Windows.   Just download WinOnX and you are ready to go within 2 minutes.   No need to install Windows or a virtual machine.   Please note: WinOnX should only […]"},{"link":"https://nmac.to/blog/paint-simple-plus-5-4/","image":"https://nmac.to/wp-content/uploads/2015/09/Paint.Simple.Plus_.png","title":"Paint Simple Plus 5.4 – Entertaining And Easy To Use Paint App","content":"Simply Paint With Paint Simple Plus , Amazing Graphics , Fireworks , Effects And Figures .   Play And Draw With Shapes , Create colorful Arts , Animated Graphics .   Entertaining And Easy To Use For Kids .   Version 5.4: Optimized For The New OS X Minor Bug Fixed Overall Improvements   OS […]"}]