[{"link":"https://nmac.to/blog/calendarmenu/","image":"https://nmac.to/wp-content/uploads/2015/12/CalendarMenu3.png","title":"CalendarMenu 3.3.2 – Convenient menu bar calendar","content":"CalendarMenu provides a small calendar in your menu bar showing all the information you need to keep track of all upcoming appointments, birthdays, and reminders in the blink of an eye.   Calendar Shows all iCal calendar events. Calendars and (on OS X 10.8 and newer) reminder lists can be selected individually. Highlights birthdays from […]"},{"link":"https://nmac.to/blog/core-animator/","image":"https://nmac.to/wp-content/uploads/2017/09/Core-Animator1.png","title":"Core Animator 1.5.2 – Simple visual tools to create stunning animations","content":"Core Animator gives you simple visual tools to create stunning animations. You focus on the best ways to bring your apps to life and we’ll take care of the Swift or Obj-C code for you. Your creations will run beautifully using Apple’s native frameworks. Every app deserves animation. Now, it’s simple to implement.   If […]"},{"link":"https://nmac.to/blog/camerabag-raw/","image":"https://nmac.to/wp-content/uploads/2017/12/CameraBag-RAW.png","title":"CameraBag RAW 3.0.210 – Advanced, unique, lossless photographic adjustments","content":"CameraBag RAW features a suite of original, advanced image tools and adjustments that let you play with light, tone, and color in your photos in completely new ways. It works great with any image and is especially designed to harness the extra data in RAW images (created by most DSLR cameras).   It’s simple, intuitive, […]"},{"link":"https://nmac.to/blog/mindnode/","image":"https://nmac.to/wp-content/uploads/2017/02/MindNode5.png","title":"MindNode 5.0.1 – Elegant mindmapping application","content":"MindNode helps you connect your thoughts and clarify your ideas.   A clean interface and focused feature set enable you to develop your project. Start with a thought, then take your project from first steps, to the next level, and into action.   LET MINDNODE WORK FOR YOU   Capture your thoughts Whether as words, […]"},{"link":"https://nmac.to/blog/whatsize/","image":"https://nmac.to/wp-content/uploads/2017/10/WhatSize6.png","title":"WhatSize 6.6.3 – Find out what files are taking up all your HD space","content":"WhatSize allows you to quickly measure the size in bytes of a given folder and all subfolders and files within it. You would be surprised at how many useless files might be laying around on your hard disks. The files and folders are automatically sorted by size, with the biggest sizes first. WhatSize helps find […]"},{"link":"https://nmac.to/blog/business-card-designer/","image":"https://nmac.to/wp-content/uploads/2017/08/Business-Card-Designer.png","title":"Business Card Designer 1.2.1 – Create effective business cards","content":"Business Card Designer is the easiest way to create effective business cards. In minutes, you’ll be making great-looking, professional cards — even if you have no previous design experience.   Simply drag and drop images, stylish text, 3D text, clip art, and shapes onto a card to get started. Quickly generate and insert QR codes […]"},{"link":"https://nmac.to/blog/black-mirror/","image":"https://nmac.to/wp-content/uploads/2017/12/Black-Mirror.png","title":"Black Mirror 1.0.0.1005 – Adventure, Violent & Horror Game","content":"Scotland, 1926. Following the suicide of his father, David Gordon visits his ancestral home for the first time in his life. A life that is soon threatened by the dark secrets that claimed the sanity of many Gordons before him.   Tormented by nightmares and waking dreams for all his life, David fears that it […]"},{"link":"https://nmac.to/blog/mindly/","image":"https://nmac.to/wp-content/uploads/2016/03/Mindly.png","title":"Mindly 1.6.1 – Organize Your Inner Universe","content":"Mindly helps to organize your inner universe. Give a structure to your thoughts, capture ideas, plan a speech, take notes. It is up to you. The universe is yours.   Try it for: Thought structuring Idea collection Brainstorming Planning a project Preparing a speech Preparing for a meeting Writing a quick summary   If you […]"},{"link":"https://nmac.to/blog/mac-app-blocker/","image":"https://nmac.to/wp-content/uploads/2016/12/Mac-App-Blocker3.png","title":"Mac App Blocker 3.2 – Password-protect apps","content":"With Mac App Blocker, you can password-protect every application on your Mac. Keep your apps and your Mac safe. Set a timeout value to automatically exit the protected application, so even when you leave your computer unattended, you’re still protected.   Keep it Secure. Kids, co-workers, family members, guests – no worries. You pick which […]"},{"link":"https://nmac.to/blog/ewallet/","image":"https://nmac.to/wp-content/uploads/2017/12/eWallet.png","title":"eWallet 8.3.8 – Securely store credit card, bank, health and insurance info, and more","content":"eWallet securely stores you confidential information like credit card numbers, bank info, health info, insurance and more.   Features include: Secure storage for passwords, usernames, PINs Strong 256-bit AES encryption Secure storage for bank and credit card info Time-out locks to keep your info safe Live URLs that launch the websites you know, without the […]"}]