[{"link":"https://nmac.to/blog/dato/","image":"https://nmac.to/wp-content/uploads/2020/12/Dato.png","title":"Dato 3.3.6 – Menu bar calendar & time zones","content":"Dato is a replacement for the system menu bar clock.   By default, it looks exactly the same, but when you click it, you get a small calendar, calendar events for the next week, the current time in various time zones (even with custom names), week number, and more. You can customize what to show […]"},{"link":"https://nmac.to/blog/tg-pro/","image":"https://nmac.to/wp-content/uploads/2020/09/TG_Pro_2.png","title":"TG Pro 2.69 – Control fan speeds, monitor temperatures, and find faulty sensors","content":"TG Pro will give you a look at what’s going on inside your Mac. No other app shows more temperature sensors or has as many options for notifications and fan speeds. Find out which components are getting hot (and potentially overheating), turn up the fan speeds to cool down your Mac, get notifications for temperature […]"},{"link":"https://nmac.to/blog/unfolder/","image":"https://nmac.to/wp-content/uploads/2019/12/Unfolder.png","title":"Unfolder 1.10.6 – 3D model unfolding tool","content":"Unfolder is a 3D model unfolding tool to help you create papercraft easily and quickly.   Workflow Create a 3D model in any 3D editor Unfold the 3D model into a 2D template in Unfolder Print the template out to make your papercraft by cutting, folding and gluing   Importing and Exporting Import 3D objects […]"},{"link":"https://nmac.to/blog/graphic-inspector/","image":"https://nmac.to/wp-content/uploads/2017/07/Graphic-Inspector.png","title":"Graphic Inspector 2.6 – Provides extensive info on images and vector graphic files","content":"Graphic Inspector provides extensive info on entire folders of images and vector graphic files and helps locate potential problems according to user-defined rules. Graphic Inspector is a professional checkup tool designed to help users of any trade, whether it’s print, web design, photography or publishing on mobile devices.   The program will go through batches […]"},{"link":"https://nmac.to/blog/rhinoceros/","image":"https://nmac.to/wp-content/uploads/2020/11/Rhino7.png","title":"Rhino 7.17.22102 – Design, model, present, analyze and realize software","content":"Rhino can create, edit, analyze, document, render, animate, and translate NURBS curves, surfaces, and solids, point clouds, and   Special features include: Uninhibited free-form 3-D modeling tools like those found only in products costing 20 to 50 times more. Model any shape you can imagine. Accuracy needed to design, prototype, engineer, analyze, and manufacture anything […]"},{"link":"https://nmac.to/blog/compressor/","image":"https://nmac.to/wp-content/uploads/2020/09/Compressor_4.png","title":"Compressor 4.6.1 – Adds power and flexibility to Final Cut Pro X encoding and exporting","content":"Compressor adds power and flexibility to Final Cut Pro X export. Customize output settings, work faster with distributed encoding, and tap into a comprehensive set of delivery features.   Powerful Encoding for Final Cut Pro Use Compressor to customize encoding settings available in Final Cut Pro. Choose from a wide array of codecs, sizes, frame […]"},{"link":"https://nmac.to/blog/export-for-itunes/","image":"https://nmac.to/wp-content/uploads/2020/12/Export_for_iTunes_2.png","title":"Export for iTunes 3.1.6 – Free your music from iTunes","content":"Export for iTunes lets you export your playlists and albums from iTunes to any local folder, external storage, SD card or USB drive! With Export for iTunes you can transfer easily your playlists to your car stereo or any other media player. Convert aac/m4a files to mp3 for best compatibility with most sound systems.   […]"},{"link":"https://nmac.to/blog/aiseesoft-mac-data-recovery/","image":"https://nmac.to/wp-content/uploads/2020/03/Aiseesoft-Mac-Data-Recovery.png","title":"Aiseesoft Mac Data Recovery 1.2.30 – Data Recovery Software","content":"It is true that there are various of data recovery for Mac software in the market. But Aiseesoft Data Recovery still stands out from other tools because of its ultimate data recovery features. All those features come together to make Data Recovery the best Apple recovery program. Furthermore, it’s clean, well-designed and intuitive interface is […]"},{"link":"https://nmac.to/blog/rightfont/","image":"https://nmac.to/wp-content/uploads/2022/03/RightFont_6.png","title":"RightFont 6.0.6 – Manage and find fonts quickly; integrates with Photoshop and Sketch","content":"RightFont is a lightweight font manager with a clean, beautiful interface. It offers many features which help you manage all your local fonts with ease. Font-Management Access Anytime Directly From Your Menubar Mark Any Font as Starred With a Click Create and Manage Font Lists Access Fonts Directly in Adobe Creative Cloud (Photoshop, Illustrator, InDesign, […]"},{"link":"https://nmac.to/blog/ammonite/","image":"https://nmac.to/wp-content/uploads/2022/01/Ammonite.png","title":"Ammonite 1.23.1 – Tag visualizer and search utility","content":"Ammonite provides an easy-to-use interface to find tagged files quickly using the tags introduced by OS X 10.9 Mavericks. It also works with OpenMeta tags and databases of DEVONtechnologies’ excellent product DEVONthink Pro.   The program takes a visual approach: tags applied to many documents will appear larger than tags applied to fewer documents. This […]"}]