[{"link":"https://nmac.to/blog/sets-design-expert/","image":"https://nmac.to/wp-content/uploads/2017/06/Sets-Design-Expert.png","title":"Sets Design Expert 2.0 – Templates for Pages","content":"The modern and polished Templates for Pages pack supplies a collection of 60 easy-to-use templates for creating business and personal content with Apple’s Pages.   The Sets for Pages set gives a large selection of templates from brochures and business cards to memo. Some templates consist of up to 6 different pages. Each and every […]"},{"link":"https://nmac.to/blog/docs-expert/","image":"https://nmac.to/wp-content/uploads/2017/06/Docs-Expert.png","title":"Docs Expert 3.0 – Templates for Google","content":"Full Docs – Templates for Google are the ideal support for those who want to create beautiful content on cloud-based productivity tools.   This Bundle for Google provides 65 templates for Google Docs, 65 for Google Sheets, and 60 for Google Slides.   Google Docs templates for: Books Certificates Faxes Invoices Letters Newsletters Posters Proposals […]"},{"link":"https://nmac.to/blog/expert-bundle-templates-for-ms-office/","image":"https://nmac.to/wp-content/uploads/2017/06/Expert-Bundle-Templates-for-MS-Office.png","title":"Expert Bundle 3.1 – Templates for MS Office","content":"Templates for MS Office – Alungu Designs is an impressive collection of 262 original templates for your Word documents, 30 spreadsheet templates for Excel, and 10 stylish presentation themes for PowerPoint. Make the best of what Mac OS X has to offer and bring off the top results with Suite for MS Office Templates!   […]"},{"link":"https://nmac.to/blog/lost-lands-3/","image":"https://nmac.to/wp-content/uploads/2017/06/Lost-Lands-3.png","title":"Lost Lands 3 – The Golden Curse – Collector’s Edition 1.0.1 – A hidden object game","content":"Lost Lands: the Golden Curse is an adventurous hidden object game-quest with puzzles and mini-games scattered through the boundless spaces of the fantasy world – from the volcano valleys to the Druid forest, from the deep caves to the floating islands.   One fine day an ordinary good-looking housewife, Susan, while visiting the museum of […]"},{"link":"https://nmac.to/blog/super-video-converter/","image":"https://nmac.to/wp-content/uploads/2016/12/Super-Video-Converter.png","title":"Super Video Converter 6.2.23 – Video to MP4/MP3 Converter","content":"Super Video Converter has the ability to convert any video format to popular video like MP4, MKV, DivX, RMVB, MOV, M4V, AVI, FLV, WebM, and WMV, etc. It can also help you extract the audio file from video and convert to audio format you need such as MP3, MP2, M4A, AAC, AIFF, WMA, WAV, and […]"},{"link":"https://nmac.to/blog/randall/","image":"https://nmac.to/wp-content/uploads/2017/06/Randall.png","title":"Randall 1.0 – Powerful Adventure & Action Game","content":"The world is now a totalitarian dictatorship ran by a mining corporation that grew too much. It controls the production of the only remaining fuel source and has enslaved the vast majority of the population using unknown mind control techniques. A few have escaped to the wilderness, some others got caught by the military police. […]"},{"link":"https://nmac.to/blog/books-expert/","image":"https://nmac.to/wp-content/uploads/2017/06/Books-Expert.png","title":"Books Expert 3.0 – Templates for iBooks Author","content":"With the new, revolutionary iBooks Author app, anyone can create and publish great Multi-Touch books for iPad, including you. Alungu swiftly offers you an enhanced experience in book creation with 35 beautiful templates for iBooks Author.   Features:   Wide choice Assortment of stylish and modern page layouts.   Create your own style You can […]"},{"link":"https://nmac.to/blog/lydia/","image":"https://nmac.to/wp-content/uploads/2017/06/Lydia.png","title":"Lydia 1.0 – Point & Click Adventure Game","content":"Lydia is a grim but atmospheric story-driven adventure game which deals adults substance abuse from the perspective of a small girl.   Lydia is a sweet little girl who loves her Teddy very much. Teddy has been with Lydia from the very beginning. Lydia can’t remember living or playing without him.. Lydia has never adventured […]"},{"link":"https://nmac.to/blog/flyer-expert/","image":"https://nmac.to/wp-content/uploads/2017/06/Flyer-Expert.png","title":"Flyer Expert 2.1 – Templates for MS Word","content":"Flyers Expert for MS Word by GN is an excellent collection of over 200 original templates, designed to give a unique look to your promo material. Whether you’re promoting a cool event, launching a new product, or announcing a mind-blowing sale, these flyers will help you do that with efficiency and style.   Every object […]"},{"link":"https://nmac.to/blog/call-of-duty-modern-warfare-3/","image":"https://nmac.to/wp-content/uploads/2017/06/Call-of-Duty-Modern-Warfare-3.png","title":"Call of Duty: Modern Warfare 3 1.9.461 – Save the world in its darkest hour","content":"Prepare yourself for a cinematic thrill-ride only Call of Duty can deliver. Modern Warfare 3 follows the series’ protagonists Captains John “Soap” MacTavish and John Price on the run, while the United States is under siege from Russian forces. Accompanied by the informant Nikolai, they must flee to safety in order to lick their wounds […]"}]