[{"link":"https://nmac.to/blog/vintage-photo-camera-1-0/","image":"https://nmac.to/wp-content/uploads/2017/02/Vintage-Photo-Camera.png","title":"Vintage Photo Camera 1.0 – Turn your new pictures into amazing looking retro pics","content":"Quickly turn your images into retro old school images with Sepia, Black & White, Brown, Chiffon and other color options.   Vintage Photo Camera will turn your new pictures into amazing looking retro pics. Choose from multiple one click filter effects to give your image the look of an old color photo, a black and […]"},{"link":"https://nmac.to/blog/appdelete-4-3-2/","image":"https://nmac.to/wp-content/uploads/2015/02/AppDelete.png","title":"AppDelete 4.3.2 – The speedy and efficient way to delete your unwanted apps","content":"AppDelete is an uninstaller for Macs that will remove not only applications but also widgets, preference panes, plugins, and screensavers along with their associated files. Without AppDelete these associated items will be left behind to take up space and potentially cause issues.   There are several ways to activate AppDelete: Drag items onto main window […]"},{"link":"https://nmac.to/blog/ssh-copy-17-02/","image":"https://nmac.to/wp-content/uploads/2017/01/SSH-Copy.png","title":"SSH Copy 17.02 – Secure File Transfer Client App","content":"SSH Copy is an intuitive SFTP (Secure File Transfer Protocol) client lets you manage remote files as in Finder.   Notable Features: Uploading / downloading your remote files or folders by drag and drop Holds multiple SFTP sessions for different servers Switch between SFTP sessions using swipe gestures with Trackpad or Magic Mouse Automatically reconnect […]"},{"link":"https://nmac.to/blog/maxel-2-3-3/","image":"https://nmac.to/wp-content/uploads/2016/12/Maxel.png","title":"Maxel 2.3.3 – Maxel is a native download manager and accelerator","content":"Maxel speeds up your downloads by splitting each file into parts and downloading them simultaneously, maximizing your bandwidth. Maxel also manages your downloads, starting the next download when bandwidth is available and re-trying ones that fail automatically. Partial downloads are no problem either: Maxel saves its progress and can resume your downloads even if your […]"},{"link":"https://nmac.to/blog/ifoto-denoise-2-5/","image":"https://nmac.to/wp-content/uploads/2016/10/iFoto-Denoise.png","title":"iFoto Denoise 2.5 – Photo/Image Noise Reduction","content":"Since noisy images are inevitable, what should you do to reduce noise for cameras or iPhone? Especially when you shooting in Lowlight environment or moving stuff. iFoto Denoise is the best Noise reduction software to minimize image grain and other imperfections.   iFoto Denoise is not only a noiseware for landscapes, but also photo beautifier […]"},{"link":"https://nmac.to/blog/dr-duplicate-cleaner-3-4/","image":"https://nmac.to/wp-content/uploads/2017/02/Dr.Duplicate-Cleaner.png","title":"Dr.Duplicate Cleaner 3.4 – Clean your hard drive","content":"Clean, optimize, and maintain your Mac. Just two click to scan your system and removes gigabytes of junk.   Main Feature Disk Clean (In App Purchase) Fast scan-engine and advanced junk detection technology safely cleans unnecessary junk files, caches and logs, etc that gorge over your hard drive space and rage your Mac seed down […]"},{"link":"https://nmac.to/blog/comburet-3-4/","image":"https://nmac.to/wp-content/uploads/2015/09/Comburet.png","title":"Comburet 3.4 – Professional disc burning app","content":"Comburet is a professional burning App. You can use Comburet to burn music CD, data, iso and dmg image file,erase rewritable disc,make dmg and iso image file.   Comburet main features: Auto find burning device Supports CD,DVD,HD-DVD and BD Burn music CD with CD-Text:m4a,m4b,m4p,mp3,caf,aiff,au,sd2,wav,snd,amr Burn folder and image file(DMG and ISO) Erase rewritable disc Make […]"},{"link":"https://nmac.to/blog/chamberlain-1-3/","image":"https://nmac.to/wp-content/uploads/2017/02/Chamberlain.png","title":"Chamberlain 1.3 – Manage your houses and apartments and items inside","content":"Chamberlain is clould-based application for managing your houses and apartments and items inside. You can create more than one houses or apartments, and there is no limitation. Under houses or apartments,you can create rooms such as: living room, dinning room etc.   You can manage every item inside your houses or apartments, managing model, maker,price […]"},{"link":"https://nmac.to/blog/templates-for-pages-2017-3-0/","image":"https://nmac.to/wp-content/uploads/2017/02/Templates-for-Pages-2017.png","title":"Templates for Pages 2017 3.0 – Assortment of Pages templates","content":"Templates for Pages 2017 (was Mix for Pages) provides you with beautiful and practical templates for Pages documents.   Itcovers a variety of template types, from business cards and brochures to letters and envelopes. It presents an attractive combination of stylish and professional print layouts with a great deal of creativity, adding a note of […]"},{"link":"https://nmac.to/blog/spillo-1-9-9/","image":"https://nmac.to/wp-content/uploads/2014/08/Spillo.png","title":"Spillo 1.9.9 – Take full control over your bookmarks on Pinboard","content":"Spillo is a powerful, beautiful and amazingly fast Pinboard client. Spillo lets you browse and organize your bookmarks in a stunning modern interface. Spillo also makes creating a bookmark from anywhere on your Mac as convenient as possible.   A beautiful interface Spillo has a beautiful modern interface that feels just right at home on […]"}]