[{"link":"https://nmac.to/blog/sqlpro-for-sqlite/","image":"https://nmac.to/wp-content/uploads/2021/03/SQLPro-for-SQLite-2021.png","title":"SQLPro for SQLite 2022.32 – Advanced SQL editor","content":"SQLPro for SQLite is the top SQLite editor for OS X.   Features Automatic data reloading when the database gets modified externally. Backwards compatibility with SQLite 2. Version integration. Mucked your database? Rollback to a previous version. Semiautomatic dependency resolution. Column reordering. Import or export your data in CSV, mySQL, XML, or JSON formats. Export […]"},{"link":"https://nmac.to/blog/file-list-export/","image":"https://nmac.to/wp-content/uploads/2020/12/File_List_Export2.png","title":"File List Export 2.7.4 – Export folder contents to a list (was File list to Excel)","content":"File List Export (was File list to Excel) is an easy to use application that will help you create list of files for any need. List all your photos, all your videos or all your files. If you need to create list of files this app is for you.   Just select a folder and […]"},{"link":"https://nmac.to/blog/yate/","image":"https://nmac.to/wp-content/uploads/2016/08/Yate3.png","title":"Yate 6.9.1.1 – Tag and organize your audio files","content":"Yate was developed for people who are serious about tagging and organizing their audio files. The application was designed from the ground up for Mac users. It is a 100% Cocoa-written application and uses its own tagging library. Yate will tag mp3, m4a, aiff, flac, wav and dsf files.   Yate has a long list […]"},{"link":"https://nmac.to/blog/tidy-up/","image":"https://nmac.to/wp-content/uploads/2017/12/Tidy-Up5.png","title":"Tidy Up 5.4.7 – Find duplicate files and tidy up your hard drive","content":"Tidy Up is a complete duplicate finder and disk-tidiness utility. With Tidy Up you can search for duplicate files and packages by the owner application, content, type, creator, extension, time modified, time created, name, label, visibility, and date/age. You can also search by the tag, duration, and bit installments of MP3 and AAC sound files and […]"},{"link":"https://nmac.to/blog/sparkfx/","image":"https://nmac.to/wp-content/uploads/2022/04/SparkFX.png","title":"SparkFX 1.2.0 – Organize and play sound effects","content":"SparkFX is a powerful soundboard application designed to make simple and complicated tasks easy. Use it to add some sound effects to a podcast or any other live performance. It is document based so you’re no longer stuck with a single shoebox full of all of your sounds. Organize your sounds into as many different […]"},{"link":"https://nmac.to/blog/iris/","image":"https://nmac.to/wp-content/uploads/2022/04/Iris.png","title":"Iris 1.5.1 – Screen-recording software","content":"Iris is a high-performance screen recorder that records to h.264. Iris leverages on-board GPU acceleration when available. It can optionally include video from a camera and up to two microphones. Iris is free to try with a watermark embedded in recordings. Use the in-app purchase to remove watermark from new recordings.   Features High performance recording […]"},{"link":"https://nmac.to/blog/fsnotes/","image":"https://nmac.to/wp-content/uploads/2020/11/FSNotes_4.png","title":"FSNotes 5.4.1 – Note manager","content":"FSNotes is a plain-text note manager for macOS, and is modern reinvention of notational velocity (nvALT) on steroids. Our application respects the following open formats: plain/text, Markdown, and RTF, and stores data in the file system. You can view, edit, and copy data in your favourite external editor, and see live results in FSNotes.   […]"},{"link":"https://nmac.to/blog/sound-siphon/","image":"https://nmac.to/wp-content/uploads/2022/04/Sound-Siphon.png","title":"Sound Siphon 3.3.6 – Capture your Mac’s audio in any app","content":"Sound Siphon makes your Mac’s audio output available as an audio input device. It allows you to send audio from one application to another, where it can be processed, streamed, or recorded. It’s as simple as selecting a microphone in your favorite app. Sound Siphon works with Core Audio to provide this capability to all of […]"},{"link":"https://nmac.to/blog/paste-queue/","image":"https://nmac.to/wp-content/uploads/2020/08/Paste-Queue.png","title":"Paste Queue 1.4.4 – Copy and paste multiple items","content":"Paste Queue is a time saver for copying and pasting multiple items from one place to another. It lets you copy all needed items first, and paste them afterwards, so you don’t need to switch back and forth between your source and destination. For example, you can copy a name, photo, phone number, and address […]"},{"link":"https://nmac.to/blog/daisydisk/","image":"https://nmac.to/wp-content/uploads/2017/02/DaisyDisk4.png","title":"DaisyDisk 4.22 – Free up disk space by quickly finding and deleting big, useless files","content":"DaisyDisk allows you to visualize your disk usage and free up disk space by quickly finding and deleting big unused files.   The program scans your disk and displays its content as a sector diagram where the biggest files and folders at once become obvious. To drill down to a folder, just click on a […]"}]