[{"link":"https://nmac.to/blog/space-pirates-and-zombies-2/","image":"https://nmac.to/wp-content/uploads/2017/11/Space-Pirates-And-Zombies-2.png","title":"Space Pirates And Zombies 2 1.0 – Survive the zombie infection and then fight them back","content":"In SPAZ 2 you must survive in an evolving post apocalyptic Galaxy. The zombie threat is defeated, infrastructure has collapsed, fuel is scarce, and scavenging means survival.   Initially the Galaxy contains hundreds of fleets, each trying to survive. AI captains do everything the player can. The player is not special and is not the […]"},{"link":"https://nmac.to/blog/net-monitor/","image":"https://nmac.to/wp-content/uploads/2015/11/Net-Monitor.png","title":"Net Monitor 4.9.3 – Network throughput monitor and much more","content":"NetMonitor is a network utility for the rest of us. Graphs network activity of local and remote computers. Records traffic activity. Calculate total traffic between dates. Measures traffic speed. Highly customizable.   Features: Traffic Log. Traffic Calculator. Traffic Reports (html & xml). Stopwatch. 7 Graph types, 5 Scaling options, Auto Scaling mode, 4 Scrolling directions, […]"},{"link":"https://nmac.to/blog/menstrual-period-tracker/","image":"https://nmac.to/wp-content/uploads/2017/11/Menstrual-Period-Tracker.png","title":"Menstrual Period Tracker 5.9.1 – Menstrual period tracker with pregnancy mode","content":"Menstrual Period Tracker (was Menstruation and Ovulation Calendar, then was Menstrual Period Tracker and Ovulation Calendar) is a menstrual-period tracker with pregnancy mode.   Features Smart calculation: if you enter period dates that are different from predicted days, the app recalculates its predictions. iCloud support (synchronizes data between all your devices). Today widget (extension). Keeps […]"},{"link":"https://nmac.to/blog/web2app/","image":"https://nmac.to/wp-content/uploads/2016/09/Web2App.png","title":"Web2App 2.1.0 – Turn any website into a desktop application","content":"With Web2App you can turn your favorite websites and internet services into real desktop apps.   Just type the URL, the app name and your website will become a real desktop app that appears in your Dock or your Menu Bar. You can choose to use the desktop or mobile version of the site.   […]"},{"link":"https://nmac.to/blog/duplicate-files-cleaner/","image":"https://nmac.to/wp-content/uploads/2017/11/Duplicate-Files-Cleaner.png","title":"Duplicate Files Cleaner 4.7.7 – Detect and remove duplicate files","content":"A very easy-to-use duplicate file cleaner. Simple UI, super fast scan&clean Support batch clean and manual clean Support accurate scan and fast fuzzy scan   How to use it: Drag folders/files to the left panel, it will start to scan automatically, and show the scanning result in the right panel. You can check the scanning […]"},{"link":"https://nmac.to/blog/dr-fone-toolkit-for-ios/","image":"https://nmac.to/wp-content/uploads/2017/09/dr.fone-toolkit-for-iOS.png","title":"dr.fone toolkit for iOS 8.6.1 – iOS System Recovery","content":"When your iPhone or iPad stuck in recovery mode or white Apple logo, things like that, the general method of recovery for your iPhone/iPad is an iTunes restore. Great if you have performed a backup and tragic if you don’t. This is why dr.fone toolkit – iOS System Recovery comes out. It can easily fix […]"},{"link":"https://nmac.to/blog/mag2go/","image":"https://nmac.to/wp-content/uploads/2016/03/Mag2GO.png","title":"Mag2GO 2.0.14416 – Convert your magazine into a Newsstand app for mobile devices","content":"Mag2GO is a digital-publishing application that repurposes magazines, periodicals, and other publications to formats for mobile devices. It creates iOS and Android apps, and publishes your magazine into the app. You are able to create Newsstand magazine apps and standard apps for Apple App Store and Google Play.   Both online and offline reading are […]"},{"link":"https://nmac.to/blog/manuscripts/","image":"https://nmac.to/wp-content/uploads/2016/09/Manuscripts.png","title":"Manuscripts 1.2.7 – Writing tool for complex documents","content":"Manuscripts is a writing tool for complex documents: it helps with the entire process of writing up complex work, from outlining the paper to the editing, proofreading and publishing stages, all from within one beautiful experience. Manuscripts is a word processor re-imagined to take a lot of mechanical formatting work off the author’s shoulders, so […]"},{"link":"https://nmac.to/blog/email-archiver-enterprise/","image":"https://nmac.to/wp-content/uploads/2016/04/Email.Archiver.Enterprise.png","title":"Email Archiver Enterprise 3.8.4 – Save your Apple Mail messages as PDFs","content":"Email Archiver Enterprise creates a future-proof, accessible, searchable, archive of all your emails in unlimited email accounts. Preserve and protect all inbound and outbound email messages (as well as attachments and metadata) with Email Archiver Pro Enterprise today.   Archiving made simple. Archive unlimited email accounts and folders with the press of a button.   […]"},{"link":"https://nmac.to/blog/yu/","image":"https://nmac.to/wp-content/uploads/2017/11/Yu.png","title":"Yu 1.0 – Simple background sounds","content":"Yu provides you with simple background sounds as simple as they should be.   Version 1.0: Initial release   Intel, 64-bit processor OS X 10.9 or later    "}]