[{"link":"https://nmac.to/blog/themes-for-ibooks-author-4-6/","image":"https://nmac.to/wp-content/uploads/2016/09/Themes-for-iBooks-Author4.png","title":"Themes for iBooks Author 4.6 – Professionally developed templates for iBooks Author","content":"Themes for iBooks Author is a collection of compelling templates for Apple’s new application for book creation and publishing. Browse the wide range of designs to find the perfect look, add your text and images, and publish your own book to iBookstore!   The available templates cover various book categories, from business and travel, to […]"},{"link":"https://nmac.to/blog/switch-1-4-0/","image":"https://nmac.to/wp-content/uploads/2016/12/Switch.png","title":"Switch 1.4.0 – Enhanced Alt-Tab & App Switching with Windows Previews","content":"Switch makes navigation between desktop apps more clever and exciting. You can use the Alt-Tab keyboard combination to move around applications displayed as previews.   With Switch besides the classic app icons, you can see the windows screens – not a boring alignment, but with many customisable effects. You can also move around apps with […]"},{"link":"https://nmac.to/blog/pdf-to-image-pro-3-3-7/","image":"https://nmac.to/wp-content/uploads/2016/12/PDF.to_.Image_.Pro_.png","title":"PDF to Image Pro 3.3.7 – PDF to JPG/PNG and more","content":"Convert PDF to almost any image formats quickly and stay or improve original quality.   PDF to Image Pro can convert PDF to JPEG, PNG, GIF, BMP, TGA, PPM, TIFF and JPEG2000 with high quality. Also, it allows you to finish batch PDF conversion and convert one page PDF. And before you convert PDF to […]"},{"link":"https://nmac.to/blog/home-scan-1-10/","image":"https://nmac.to/wp-content/uploads/2016/07/Home-Scan.png","title":"Home Scan 1.10 – Connected Home Security Scanner","content":"Are your home network and connected devices secure? Use Home Scan to find your network security risks and monitor what is connected to your network. This simple to use app includes professional features but allows even the inexperienced user to get an understandable overview of the network and running services. A simple and intuitive interface […]"},{"link":"https://nmac.to/blog/foxtrot-professional-search-5-7/","image":"https://nmac.to/wp-content/uploads/2016/12/FoxTrot-Professional-Search.png","title":"FoxTrot Professional Search 5.7 – Networkable search for legal, media, mobile professionals","content":"FoxTrot Professional Search extends far beyond OS X’s buit-in Spotlight, building on years of experience in search functionality refined within CTM’s PowerMail and FoxTrot Personal Search products; it includes: Multiple categorizations of search results, relevance-ranked Document preview and full view, with secondary document-level search Multiple indexed collections and timed updates without the application launched Client-server […]"},{"link":"https://nmac.to/blog/blu-ray-player/","image":"https://nmac.to/wp-content/uploads/2013/12/40390.png","title":"Blu-ray Player 2.17.1 – Blu-ray media player","content":"Blu-ray Player is the first universal media player for Mac and PC in the world. It can play Blu-ray discs or its ISO files not only on Mac or PC, but also on iPhone/iPad/iPod touch. It supports all media formats for movies, videos, audio, music, and photos. It has multi-language support, and has a user-friendly […]"},{"link":"https://nmac.to/blog/autopano-video-pro-2-5-3/","image":"https://nmac.to/wp-content/uploads/2014/07/Autopano-Video-Pro.png","title":"Autopano Video Pro 2.5.3 – Stitch multiple videos together to create 360º videos","content":"Autopano Video Pro allows users to create immersive 360º video with a simple, accessible workflow while taking advantage of GPU processing for faster rendering times. Simply drag-and-drop source videos for your panorama and let Autopano Video, with the help of Autopano Pro or Autopano Giga, produce a polished video project.   Version 2.5.3: Main changes: […]"},{"link":"https://nmac.to/blog/synthesia-10-1/","image":"https://nmac.to/wp-content/uploads/2016/12/Synthesia.png","title":"Synthesia 10.1 – Learn to play the piano","content":"Synthesia is a game that teaches you to play the piano using falling notes.   With it, you can: Learn to play songs using a musical keyboard connected to your computer. Keep track of your progress in every song with per-song scoreboards. Slow, fast-forward, and rewind songs while learning new parts. Practice left and right […]"},{"link":"https://nmac.to/blog/altunenator-3-1/","image":"https://nmac.to/wp-content/uploads/2016/12/Altunenator.png","title":"Altunenator 3.1 – Prevent iTunes from playing the same tracks repeatedly","content":"Altunenator ensures that when you’re playing media in iTunes, you don’t hear the same tracks over and over again, day after day. Altunenator can automatically, and dynamically, adjust its skip threshold based on the total run time of the playlist you’re listening to – whether you’ve got a month’s worth of music in each of […]"},{"link":"https://nmac.to/blog/spillo-1-9-3/","image":"https://nmac.to/wp-content/uploads/2014/08/Spillo.png","title":"Spillo 1.9.3 – Take full control over your bookmarks on Pinboard","content":"Spillo is a powerful, beautiful and amazingly fast Pinboard client. Spillo lets you browse and organize your bookmarks in a stunning modern interface. Spillo also makes creating a bookmark from anywhere on your Mac as convenient as possible.   A beautiful interface Spillo has a beautiful modern interface that feels just right at home on […]"}]