[{"link":"https://nmac.to/blog/ifoto-stitcher-2-13-1019/","image":"https://nmac.to/wp-content/uploads/2016/10/iFoto-Stitcher.png","title":"iFoto Stitcher 2.13.1019 – Make Panorama Photo with Ease","content":"Make stunning panoramas with high-resolution images taken by camera, scanner or smartphone, the automatic panorama maker for Mac should be the initial choice.   Auto-Select by Group and auto-stitch make it easy to align images without manually messing around moving photos, automatic exposure leveling and lens shading correction, automatic cropping algorithm to create a stunning […]"},{"link":"https://nmac.to/blog/delineato-pro-1-2-7/","image":"https://nmac.to/wp-content/uploads/2015/05/Delineato.Pro_.png","title":"Delineato Pro 1.2.7 – Stylish outliner","content":"Delineato Pro is the professional edition of Delineato – the italian word for “outline”. Designed using the WYSIWYN paradigm – What You See Is What You Need – this carefully crafted application is targeted at creating simple diagrams, mind maps, brainstorming, to-do lists, architectural diagrams.   A clutter-free interface allows you to concentrate and focus […]"},{"link":"https://nmac.to/blog/video-converter-2-1-0/","image":"https://nmac.to/wp-content/uploads/2016/11/Video-Converter.png","title":"Video Converter 2.1.0 – All-in-one video converter software","content":"Tenorshare Video Converter is the all-in-one video converter software. It will help you solve all video formats issues. With this wonderful tool, you have no need to worry about incompatible video formats on Mac QuickTime, iMovie, PSP, MP4, iPhone, etc. It solves video formats issues and much more.   Here are key features of Tenorshare […]"},{"link":"https://nmac.to/blog/picframe-2-8-1/","image":"https://nmac.to/wp-content/uploads/2014/09/PicFrame.png","title":"PicFrame 2.8.1 – Combine multiple photos into frames","content":"PicFrame helps you combine multiple photos into amazing looking frames that you can save to your computer or share to Facebook. With 67 adjustable frames, rounded corners and plenty of patterns, you will always have a unique look.   Since PicFrame was released on the iPhone and iPad we have often been requested to create […]"},{"link":"https://nmac.to/blog/later-1-0-2/","image":"https://nmac.to/wp-content/uploads/2016/11/Later.png","title":"Later 1.0.2 – Schedule reminders using natural language","content":"Later lets you schedule reminders in natural way by choosing times like this evening, tomorrow morning or next week.   Features Reminders that appear when you’re back at your Mac Free iOS app that syncs with your Mac app via iCloud Customizable presets that save you time Ready for macOS Sierra If you send an […]"},{"link":"https://nmac.to/blog/jumsoft-themes-for-keynote-5-0-6/","image":"https://nmac.to/wp-content/uploads/2016/11/Jumsoft-Themes-for-Keynote.png","title":"Jumsoft Themes for Keynote 5.0.6 – Professional themes for Apple Keynote","content":"A new look for your Keynote presentations! The variety of 100 smartly structured, elegant Jumsoft Themes for Keynote gives you vast freedom to turn your presentation into a winner.   Each theme includes at least 32 master slides – a mix of bullet text and photo-oriented layouts. The layouts are polished and modern, with custom […]"},{"link":"https://nmac.to/blog/epubor-ultimate-3-0-8-27/","image":"https://nmac.to/wp-content/uploads/2016/03/Epubor.Ultimate.png","title":"Epubor Ultimate 3.0.8.27 – Convert eBook formats and remove DRM","content":"Epubor Ultimate lets you convert and remove DRM from eBooks. The software can decrypt and convert eBooks purchased from: Amazon Kindle, Kobo, Sony, Google Play, Barnes, Noble Nook, Smashwords, and even public libraries.   What’s Unique New eBook conversion core developed by Epubor, 5x faster than others Now supports the Kobo DRM version 3.19, which […]"},{"link":"https://nmac.to/blog/all-docs-1-5/","image":"https://nmac.to/wp-content/uploads/2016/11/All-Docs1.png","title":"All Docs 1.5 – Microsoft Office Edition in OneDrive","content":"All Docs is magic and easy-to-use app help you easier to create Microsoft office 365 documents in OneDrive on your Mac.   Features: Create Word, Excel and PowerPoint documents. Sync documents in OneDrive’s Documents folder to local. Keep track all changes of online documents and automatic update on local. Calendar and manage email with Outlook. […]"},{"link":"https://nmac.to/blog/candle-1-1/","image":"https://nmac.to/wp-content/uploads/2016/11/Candle.png","title":"Candle 1.1 – An adventure with challenging puzzles game","content":"Candle is an adventure with challenging puzzles. Play as Teku, a young novice on a dangerous journey to rescue his tribe’s shaman from the evil tribe of the Wakcha. But the way is littered with sinister traps and difficult obstacles. To master these challenges, you need to have keen eyes and a good sense for […]"},{"link":"https://nmac.to/blog/onedocs-1-8/","image":"https://nmac.to/wp-content/uploads/2016/11/OneDocs.png","title":"OneDocs 1.8 – Create Microsoft Office 365 documents in OneDrive","content":"OneDocs is magic and easy-to-use app help you easier to create Microsoft office 365 documents in OneDrive on your Mac.   Features Create Word, Excel and PowerPoint documents Sync documents in OneDrive’s Documents folder to local Keep track all changes of online documents and automatic update on local Calendar and manage email with Outlook Browse […]"}]