[{"link":"https://nmac.to/blog/xpressive/","image":"https://nmac.to/wp-content/uploads/2013/12/Xpressive.175x175-75.jpg","title":"Xpressive 1.0.9 – CSS3 live authoring tool","content":"XPressive is a CSS3 live authoring tool. You can rapidly and easily create Web content. XPressive has many intuitive editing features for HTML5 and CSS3. Edit, tweak, and save coding changes directly while you preview your Web content. Your ideas will become reality as soon as you think of them. In the past, it was […]"},{"link":"https://nmac.to/blog/skyorb-3d/","image":"https://nmac.to/wp-content/themes/nmac/images/placeholder-320.png","title":"SkyORB 3D 4.6.1 – 3D planetarium featuring star-gazing and epheremis","content":"SkyORB is a 3D planetarium, including star-gazing and epheremis, based from V3X.net engine. It features a modern 3D interface, search engine, a large catalog of stars, planets, moons and updatable comets and asteroids database, and lets you choose see the actual sky from any point on Earth or from any planet from the solar system. […]"},{"link":"https://nmac.to/blog/zepheer/","image":"https://nmac.to/wp-content/uploads/2013/12/Zepheer.175x175-75.jpg","title":"Zepheer 2.1 – Add beautiful filters and styles to your photos","content":"Zepheer is designed to be a best friend of every photography enthusiasts on Mac OS. This small app delivers dozens built-in photo styles and allows to make your photos warm, charming, beautiful, impressing, to give them the soul – even when the photos were taken with a low-end camera and bad conditions.   The application […]"},{"link":"https://nmac.to/blog/merlin/","image":"https://nmac.to/wp-content/uploads/2013/12/16447.jpg","title":"Merlin 2.9.2 – Project management software","content":"Merlin is the only native network-based collaborative Project Management solution for Mac OS X. This version offers many features propelling Merlin to the top of Mac OS X professional project management software. Here are some of the main highlights in Merlin 2: Merlin has now a Web module which is included in this version of […]"},{"link":"https://nmac.to/blog/photomagic-pro/","image":"https://nmac.to/wp-content/uploads/2013/10/PhotoMagic-Pro.png","title":"PhotoMagic Pro 1.7 – Enhance your photos with filters and effects","content":"PhotoMagic lets you enhance your favorite pictures with eye-catching filters and effects.   Your memories, rendered beautifully    Add style and personality to your images: Borders: Attention-grabbing frames for your photos. Filters: From blurs to lens flares to retro-style masks. Effects: Elegant lighting, enhancement, and more. Yours to share Post directly to your Facebook timeline. […]"},{"link":"https://nmac.to/blog/taco-html-edit/","image":"https://nmac.to/wp-content/uploads/2013/12/tacohtmlediticon.175x175-75.jpg","title":"Taco HTML Edit 3.0.7 – Full-featured HTML and PHP editor","content":"Taco HTML Edit is a full-featured HTML editor and PHP editor. As an HTML editor, Taco HTML Edit empowers its users to rapidly create their own Web sites. It is designed exclusively for OS X and has many advanced features, including spell checking, live browser previewing, PHP previewing, syntax checking, and much more. For OS […]"},{"link":"https://nmac.to/blog/picsketch/","image":"https://nmac.to/wp-content/uploads/2013/12/sketch1.175x175-75.jpg","title":"PicSketch 1.1 – Powerful photo sketcher with helpful presets","content":"PicSketch is powerful photo-sketch software which can easily turn a photo into a sketch with just a few mouse clicks. Not much of an artist? That’s OK. PicSketch will amaze you with its results. As you would expect of professional sketching software, it offers basic editing tools such as rotation, contrast and brightness adjustment, and […]"},{"link":"https://nmac.to/blog/procssor/","image":"https://nmac.to/wp-content/uploads/2013/12/mzi.nxcmyrzr.175x175-75.jpg","title":"ProCSSor 1.0 – CSS formatter and compressor","content":"ProCSSor is an essential tool for seasoned professionals and hobbyist web designers alike. Let’s face it – we’ve all come across badly written CSS with no style, mixed styles, or even machine generated CSS. Then, there’s our own lazy, late-night CSS which makes no sense in the morning. Now with ProCSSor you have no more […]"},{"link":"https://nmac.to/blog/idocument-2/","image":"https://nmac.to/wp-content/uploads/2013/12/33443.png","title":"iDocument 2.0.5 – Organize, tag and search your documents","content":"iDocument makes documents managing as easy as creating them. It helps you to organize and manage documents on Mac; it puts all of your documents in order in its library. With Tag, search, smart folder and flag features, iDocument not only gives you full range of the managing function for you to manage documents on Mac, […]"},{"link":"https://nmac.to/blog/lensflares/","image":"https://nmac.to/wp-content/uploads/2013/12/LensFlaresIcon.175x175-75.jpg","title":"LensFlares 1.0 – Bring your photos to life","content":"LensFlares is a brand new photo editor for adding optical effects on your Mac. You can choose from anamorphic lens flares, lighting effects, sci-fi flares, sunlight glare, and more. Great For: Enhancing Photos Graphics Design Logos and Titles Special Effects LensFlares has over 70 high resolution optical effects: Anamorphic Flares Natural Sunlight Sci-fi Flares Edge […]"}]