[{"link":"https://nmac.to/blog/mark-of-ninja/","image":"https://nmac.to/wp-content/uploads/2013/09/Mark.of_.the_.Ninja_.Remastered.png","title":"Mark of the Ninja: Remastered 1.0 – You are a ninja who bears the mark","content":"In Mark of the Ninja, you’ll know what it is to truly be a ninja. You must be silent, agile and clever to outwit your opponents in a world of gorgeous scenery and flowing animation. Marked with cursed tattoos giving you heightened senses, every situation presents you with options. Will you be an unknown, invisible […]"},{"link":"https://nmac.to/blog/sudden-strike/","image":"https://nmac.to/wp-content/uploads/2017/08/Sudden.Strike.4.png","title":"Sudden Strike 4 1.15 – Real-Time World War II Strategy Game","content":"Sudden Strike 4 sends you off on three extensive campaigns set amongst the battlefields of World War II.   Commanding the Allied, German or Soviet troops, you will lead over 100 different units into battle; like the German bomber Heinkel He111, the Russian T-34 tank, the British Hawker Typhoon fighter plane and the notorious German […]"},{"link":"https://nmac.to/blog/skylab-studio/","image":"https://nmac.to/wp-content/uploads/2016/08/SkyLab-Studio.png","title":"SkyLab Studio 2.5 – Easy, powerful sky replacement","content":"SkyLab Studio is a sky-replacement app. Imagine dropping stunning skies on your photos with this innovative new app. You’ll love the huge collection of curated skies from sunny, cloudy, stormy, and night shots.   Features Included Skies – Easily replace skies on your photos with the innovative controls. Choose from a huge collection of curated […]"},{"link":"https://nmac.to/blog/lossless-converter-for-itunes/","image":"https://nmac.to/wp-content/uploads/2018/12/Lossless-Converter-for-iTunes.png","title":"Lossless Converter for iTunes 1.7.0 – Convert music into lossless formats supported by iTunes","content":"Lossless Converter for iTunes is a conversion tool that can convert many kinds of music formats into lossless formats supported by iTunes. It uses Apple Lossless encoding to convert into M4A format that can be played on iPhone, iPad and other Apple devices.Different from the other converter, it uses a lossless encoder, the conversion process […]"},{"link":"https://nmac.to/blog/vitamin-r/","image":"https://nmac.to/wp-content/uploads/2017/09/Vitamin-R2.png","title":"Vitamin-R 2.58 – Personal productivity tool","content":"Vitamin-R creates the optimal conditions for your brain to work at its best by structuring your work into short bursts of distraction-free, highly focused activity alternating with opportunities for renewal, reflection and intuition.   The built-in task logging and statistics features create a positive momentum towards productivity by providing visible feedback on your progress and […]"},{"link":"https://nmac.to/blog/life-is-strange-before-the-storm/","image":"https://nmac.to/wp-content/uploads/2018/12/Life.is_.Strange.Before.the_.Storm_.png","title":"Life is Strange Before the Storm 13.09.2018 – Story Rich Adventure Game","content":"Life is Strange: Before the Storm is a three-part standalone adventure set before the first game in the BAFTA award-winning series.    You play as Chloe Price, a rebellious sixteen-year-old who forms an unlikely friendship with Rachel Amber, a popular student destined for success.   When Rachel learns a family secret that threatens to destroy […]"},{"link":"https://nmac.to/blog/carrot-weather/","image":"https://nmac.to/wp-content/uploads/2017/05/CARROT-Weather1.png","title":"CARROT Weather 1.3.4 – Talking Forecast Robot","content":"CARROT Weather is an eerily accurate weather app that delivers hilariously twisted forecasts. There are secret locations to unlock. A time machine. And also evil penguins. From spooky fog to torrential downpours, CARROT’s dialogue, characters, and scenery change in… “unexpected” ways. You’ll actually be looking forward to a blizzard just to see what CARROT has […]"},{"link":"https://nmac.to/blog/tesla-vs-lovecraft/","image":"https://nmac.to/wp-content/uploads/2019/02/Tesla-vs-Lovecraft.png","title":"Tesla vs Lovecraft 1.0.7 – Sci-fi Co-Op Action Game","content":"Tesla vs Lovecraft is an intense top-down twin stick arena shooter from the creators of Crimsonland and Neon Chrome. Play as the enigmatic inventor Nikola Tesla harnessing the static energy to power up Tesla-Mech and give the lovecraftian nightmares a lesson in horror!   You are Nikola Tesla, world-famous inventor and genius extraordinaire. At the […]"},{"link":"https://nmac.to/blog/trine-3/","image":"https://nmac.to/wp-content/uploads/2015/11/Trine.3.TAOP_.png","title":"Trine 3: The Artifacts of Power 1.1.1 – Side-scrolling game of action, puzzles and platforming","content":"Trine 3: The Artifacts of Power is a platforming game of action, puzzles and adventure, and the sequel to the award winning Trine and Trine 2. Reunite with the familiar heroes – Pontius the Knight, Amadeus the Wizard and Zoya the Thief in an all-new adventure, now for the first time in full 3D!   […]"},{"link":"https://nmac.to/blog/trine-2/","image":"https://nmac.to/wp-content/uploads/2013/03/Trine-2cs.png","title":"Trine 2 Complete Story 2.01 – Side-scrolling game of action, puzzles and platforming","content":"Trine 2 is a sidescrolling game of action, puzzles and platforming.You play as one of the Three Heroes who make their way through dangers untold in a fantastical fairytale world.Physics-based puzzles with fire, water, gravity and magic; Wicked Goblins; Climb the tallest trees and towers in the enchanted forest!   Join your friends in the […]"}]