[{"link":"https://nmac.to/blog/megapack-for-iwork-2015-2-3/","image":"https://nmac.to/wp-content/uploads/2016/09/Megapack-for-iWork-2015.png","title":"Megapack for iWork 2015 2.3 – Ultimate package templates for Pages Numbers Keynote","content":"Megapack for iWork 2015 is the ultimate home and office package providing creative designs, themes, and templates for the latest edition of Pages, Numbers, and Keynote.   PAGES  From simple letters and invites, to media-rich newsletters, brochures, and reports, Megapack for iWork 2015 will have you building full documents in minutes.   Tables and charts […]"},{"link":"https://nmac.to/blog/infographics-2-7/","image":"https://nmac.to/wp-content/uploads/2015/06/Infographics.png","title":"Infographics 2.7 – Visualization graphics for Keynote","content":"The Infographics collection contains a wide range of high-quality designs for illustrating your Keynote presentations. Whether your slideshow is focused on a specific country, explains intricacies of an industry, or presents annual financial results Infographics is a go-to selection of quality visualization tools.   All images include transparent backgrounds that allow placing them on various […]"},{"link":"https://nmac.to/blog/videocompressor-2017-1-1/","image":"https://nmac.to/wp-content/uploads/2016/09/VideoCompressor.png","title":"VideoCompressor 2017 1.1 – Video compression for all formats","content":"VideoCompressor supports almost all currently used video formats and keeps the same format as the input file.   Users of VideoCompressor don’t need to read any manuals or to have any previous knowledge. Simply download it and let’s get started.   In comparison to software VideoCompressor can process even big video files within record times. […]"},{"link":"https://nmac.to/blog/universal-type-server-6-1-0/","image":"https://nmac.to/wp-content/uploads/2016/09/Universal-Type-Server.png","title":"Universal Type Server 6.1.0 – Large-scale font management","content":"Universal Type Server is a tool that comes in handy for users which need to organize, centralize and distribute their font library.   Moreover, Extensis Universal Type Server is suitable for even the most difficult font management tasks, allowing you to keep all your fonts in sync.   The Extensis Universal Type Server application allows […]"},{"link":"https://nmac.to/blog/daylife-1-0-3/","image":"https://nmac.to/wp-content/uploads/2016/06/Daylife.png","title":"Daylife 1.0.3 – Tell your story, capture your thoughts and rediscover your dreams","content":"Daylife welcomes you with its simple and distraction-free interface so you can focus on your thoughts. Its elegant design makes powerful features unobtrusive so you can zero in on your story.   Quickly add entries at anytime. Click the Quicky Entry icon in the menu bar to quickly and easily add an entry to your […]"},{"link":"https://nmac.to/blog/photo-size-optimizer-1-70/","image":"https://nmac.to/wp-content/uploads/2016/09/Photo-Size-Optimizer.png","title":"Photo Size Optimizer 1.70 – Powerful photo resizer and optimizer app","content":"Photo Size Optimizer is a powerful photo resizer and optimizer. It optimizes all photos by 80% ~ 20% comparing to originals while keeping original resolution, quality and png, jpg, gif formats. With Photo Size Optimizer, you can save huge space and share full-resolution photos with your friends much faster.   Photo Size Optimizer also supports […]"},{"link":"https://nmac.to/blog/pdf-reader-1-57/","image":"https://nmac.to/wp-content/uploads/2016/09/PDF-Reader.png","title":"PDF Reader++ 1.57 – PDF reader, note-taker, Splitter, merger and converter","content":"PDF Reader++ is a PDF reader, note-taker, PDF Splitter, PDF merger and PDF converter for OS X. It is designed to help you viewing any PDF file, adding and editing notes, split pdf, merge pdf, convert pdf to image format such as jpg, png, tiff, gif, bmp, convert pdf to html, extract text from PDF. […]"},{"link":"https://nmac.to/blog/mp3converter-pro/","image":"https://nmac.to/wp-content/uploads/2016/09/MP3.Converter.Pro_.png","title":"MP3 Converter Pro 6.3.57 – Convert YouTube to MP3","content":"Want to enjoy music downloaded from YouTube on your iPhone/iPod/iPad? Try this MP3 Converter Pro! Aiseesoft MP3 Converter Pro can convert any video/audio to MP3, including converting audio/video downloaded from YouTube to MP3. For music lovers, you can convert MP4 to MP3, convert FLV to MP3, and change WMA/M4A/FLAC and other video/audio to MP3. Also, […]"},{"link":"https://nmac.to/blog/map-for-pokemon-go-1-0/","image":"https://nmac.to/wp-content/uploads/2016/09/Map-for-Pokemon-Go.png","title":"Map for Pokemon Go 1.0 – Best Places To Hunt Pokemon Worldwide","content":"Maps for Pokemon Go is your secret weapon. We have researched and compiled the BEST PLACES TO HUNT worldwide! Level up quickly by knowing about the top places in your city.   We show you the top 10-20 places in your area, where the most Pokemon, Pokestops, and Gyms are likely to be located.   […]"},{"link":"https://nmac.to/blog/ifoto-montage-2-5-1061/","image":"https://nmac.to/wp-content/uploads/2016/09/iFoto-Montage.png","title":"iFoto Montage 2.5.1061 – Easy Mosaic Photo Maker","content":"iFoto Montage is a special photomontage maker to create stunning mosaic photo with many tile-images. The advanced tiling techniques and special effects empower you to create photo collage in shape with ease. And you can also perfect the montage photo with micro-image pattern, repetition, grid and border options and other splendid features.   As a […]"}]