[{"link":"https://nmac.to/blog/ismarttrain/","image":"https://nmac.to/wp-content/uploads/2018/01/iSMARTtrain.png","title":"iSMARTtrain 4.2.2 – Athletic training log","content":"iSMARTtrain (formerly TrainingLog) is for storing and reviewing your athletic training. It is designed for use by multi-sport athletes, such as triathletes, but can be used equally well by single-sport athletes, such as cyclists and runners.   Version 4.2.2: Release notes were unavailable when this listing was updated.   Intel, 64-bit processor macOS 10.12 or […]"},{"link":"https://nmac.to/blog/delicious-library/","image":"https://nmac.to/wp-content/uploads/2016/09/Delicious-Library3.png","title":"Delicious Library 3.9.2 – Import, browse and share your media","content":"Delicious Library allows you to import, browse, and share all your books, movies, music, and video games with Delicious Library. Run your very own library from your home or office using our impossibly simple interface. Delicious Library’s digital shelves act as a visual card-catalog.   A scan of a barcode is all Delicious Library needs […]"},{"link":"https://nmac.to/blog/receiver-2/","image":"https://nmac.to/wp-content/uploads/2020/05/Receiver-2.png","title":"Receiver 2 29.04.2020 – Realistic Action & Simulation Game","content":"Receiver 2 simulates every internal part of each firearm based on manufacturer schematics and gunsmithing resources. Learn exactly how each sidearm works, including how to load and unload them, clear malfunctions, and operate their safety features.   NOT YOUR ORDINARY FPS You won’t find any loot crates or bullet sponges here. Every enemy can be […]"},{"link":"https://nmac.to/blog/awecleaner/","image":"https://nmac.to/wp-content/uploads/2019/11/AweCleaner.png","title":"AweCleaner 4.4 – All-in-one system cleaner","content":"AweCleaner is an all-in-one Mac cleaner which not only can help Mac users to easily and quickly clean up all junk files, but it also can uninstall applications, find/remove large files, find/remove duplicate files, free up memory, manage hard disks, etc. This comprehensive cleaning software also can help in cleaning up internet traces by permanently […]"},{"link":"https://nmac.to/blog/skip-tunes/","image":"https://nmac.to/wp-content/uploads/2016/12/Skip-Tunes.png","title":"Skip Tunes 3.3.1 – Control iTunes and Spotify from the menu bar","content":"Skip Tunes is a beautifully simple way to control music from your OS X menu bar. This small, unobtrusive menu-bar application is simple, compatible, and easy to control.   Features: Control iTunes and Spotify from your menu bar Display OS X Notifications Adjust Volume Controls Share to Facebook & Twitter Show or Hide Controls in […]"},{"link":"https://nmac.to/blog/macclean360/","image":"https://nmac.to/wp-content/uploads/2019/11/MacClean360.png","title":"MacClean360 4.6 – Clean up junk on your Mac","content":"MacClean360 is all-in-one Mac cleaner & manager. It not only can find and remove all junk files in your Mac, but it also can help you optimize, speed up and manage your Mac computer   MacClean360 offers 9 excellent tools to help you clean up, manage and optimize your Mac: Junk Cleaner: Junk cleaner can […]"},{"link":"https://nmac.to/blog/folder-icons/","image":"https://nmac.to/wp-content/uploads/2016/12/Folder-Icons.png","title":"Folder Icons 1.3 – Use your own image to be the icon for the folder","content":"Folder Icons brings a fresh look to your folders. Add your favourite customised icons to your folders, Add your choices, feel happy and be more productive!   Features: Add cool icon to your files/folders in 3 Steps! Folder Icons brings a fresh look to your folders/files. Add your favourite customised icons to your folders, Add […]"},{"link":"https://nmac.to/blog/planetbase/","image":"https://nmac.to/wp-content/uploads/2016/06/Planetbase.png","title":"Planetbase 1.3.7 – Establish a base on a remote planet","content":"Planetbase is a strategy game where you guide a group of space settlers trying to establish an outpost on a remote planet.   In the game you play the role of the base architect and manager, telling your colonists where to build the structures they will need to survive. You will have to ensure that […]"},{"link":"https://nmac.to/blog/tacoma/","image":"https://nmac.to/wp-content/uploads/2017/08/Tacoma.png","title":"Tacoma 1.3.0 – Sci-fi Walking Simulator & Adventure Game","content":"Tacoma is a narrative adventure set aboard a high-tech space station in the year 2088. As you go about your mission, you’ll explore every detail of how the station’s crew lived and worked, finding the clues that add up to a gripping story of trust, fear, and resolve in the face of disaster.   At […]"},{"link":"https://nmac.to/blog/top-contacts/","image":"https://nmac.to/wp-content/uploads/2020/05/Top-Contacts.png","title":"Top Contacts 1.3.3 – Contact and Task Manager","content":"Top Contacts – an advanced contact manager that adds powerful CRM features to the familiar list of contacts. You no longer need to synchronize across multiple apps. Log all relevant information, events, tasks and files for each contact direct in the app. With built-in calendar and to-do list you can plan and track all activities […]"}]