[{"link":"https://nmac.to/blog/personal-workout-2-1/","image":"https://nmac.to/wp-content/uploads/2017/02/Personal-Workout.png","title":"Personal Workout 2.1 – 12 to 45 minute daily workout routines","content":"Want to lose weight, tone muscles or simply stay fit? – then you’re right here with this amazing app. Just follow your personal instructor along real-time video workouts embedded in specifically designed programs lasting from 12 up to 45 minutes.   It’s the perfect way to lose weight, tone muscles or stay fit whenever and […]"},{"link":"https://nmac.to/blog/diskzilla-1-0/","image":"https://nmac.to/wp-content/uploads/2017/02/DiskZilla.png","title":"DiskZilla 1.0 – Disk, Memory, and Adware Cleaner","content":"8 essential power tools to optimize the performance of your Mac. Get the most out of your Mac.   We are giving this app away for free for a limited time! Are we crazy? Yes! But we’re celebrating reaching 2,000,000 downloads across all of our apps. We love our users. Please support us if you […]"},{"link":"https://nmac.to/blog/super-resize-1-2-3/","image":"https://nmac.to/wp-content/uploads/2016/03/Super-Resize.png","title":"Super Resize 1.2.3 – The professional tool to resize images","content":"Super Resize Quickly allows you to resize your images, add thumbnails automatically, and create the code for a web gallery alongside. With an emphasis on image quality. Because you don’t want your resized images to be blurry and lose all detail. Preview everything before you export. File sizes, compression, thumbnails. Highest quality output. Highest level […]"},{"link":"https://nmac.to/blog/menucar-2-1/","image":"https://nmac.to/wp-content/uploads/2017/02/MenuCar.png","title":"MenuCar 2.1 – Book Uber rides directly from your Menubar","content":"With the estimated time of the closest Uber always available on your Menubar without opening the app.   You can book an Uber from all your devices, now riding with Uber is even more seamless!   Key features: Time to get an Uber is always displayed in the Menubar Complete Uber experience with Login/Sign Up, […]"},{"link":"https://nmac.to/blog/bee-2-4-7/","image":"https://nmac.to/wp-content/uploads/2015/03/Bee.png","title":"Bee 2.4.7 – Client for tracking in FogBugz, GitHub, and JIRA","content":"Bee syncs with GitHub Issues, JIRA, and FogBugz. You can also use Bee to keep track of your plain text notes.   Features: Flight Path. Flight Path lives in your menu bar and helps you by intelligently selecting the task you should be working on next. Notifications. Bee uses Notification Center to inform you of […]"},{"link":"https://nmac.to/blog/launcher-1-0/","image":"https://nmac.to/wp-content/uploads/2017/02/Lаuncher.png","title":"Launcher 1.0 – Super fast way to find & start apps on your Mac","content":"Launcher – super fast way to find & start apps on your Mac.   It’s simple & fast: Press keyboard shortcut (Shift+Cmd+L by default), Type some letters, Select app from the list and hit enter.   Launcher also able to search for apps in the Mac App Store: just click on the toggle and search results […]"},{"link":"https://nmac.to/blog/home-design-3d-4-0-7/","image":"https://nmac.to/wp-content/uploads/2016/11/Home-Design-3D.png","title":"Home Design 3D 4.0.7 – Design and change your home","content":"With Home Design 3D, designing and remodeling your house in 3D has never been so quick and intuitive!   Accessible to everyone, Home Design 3D is the reference interior design application for a professional result at your fingertips!   CREATE, DESIGN, FURNISH AND DECORATE EASILY YOUR HOME AND SHARE IT WITH A COMMUNITY OF MORE […]"},{"link":"https://nmac.to/blog/phototangler-2-1/","image":"https://nmac.to/wp-content/uploads/2016/12/PhotoTangler2.png","title":"PhotoTangler 2.1 – Best Collage Maker To Blend Photos","content":"PhotoTangler Collage Maker is a powerful image app that instantly turns your favorite photos into beautiful collages. It allows you to blend them together in unique and creative ways. It’s easy, fun, and the results look like magic! Just drop photos on the canvas, and watch PhotoTangler seamlessly blend them together with any other photos […]"},{"link":"https://nmac.to/blog/themes-fx-for-ms-powerpoint-2-0/","image":"https://nmac.to/wp-content/uploads/2017/02/Themes-FX-for-MS-PowerPoint.png","title":"Themes FX for MS PowerPoint 2.0 – Exclusive themes for MS PowerPoint","content":"Themes FX for MS PowerPoint is created for exclusive PowerPoint presentations. The pack includes 20 themes, each providing 14 master slides, which allow you to choose the ideal layout for your ideas, proposals, and solutions. Use the matching motion backgrounds, fonts, frames, and bullet styles to drive your point home.   Version 2.0: Bug fixes […]"},{"link":"https://nmac.to/blog/decloner-1-6-3/","image":"https://nmac.to/wp-content/uploads/2014/12/Decloner.png","title":"Decloner 1.6.3 – Find and eliminate duplicate files on your Mac","content":"Decloner helps you find and eliminate duplicate files on your Mac. It uses SHA-1 algorithm to reliably determine if files are identical. Decloner has a simple straightforward user interface where you only need to choose where to scan, and Decloner will find duplicate files in those locations and all the subdirectories. You can scan multiple […]"}]