[{"link":"https://nmac.to/blog/disk-space-analyzer/","image":"https://nmac.to/wp-content/uploads/2016/10/Disk-Space-Analyzer.png","title":"Disk Space Analyzer 2.4 – Disk scan utility (was Disk Inspector)","content":"Disk Space Analyzer (was Disk Inspector) is a disk scanning utility for Mac OS X. It scans any supported drive and generates a chart representing the file system usage.   Disk Space Analyzer is addressed to those who want to keep track of what, where and how large files are stored in his Mac disk. […]"},{"link":"https://nmac.to/blog/day-one/","image":"https://nmac.to/wp-content/uploads/2016/02/Day-One-2.png","title":"Day One 2.5.6 – Maintain a daily journal","content":"Capture life as you live it. From once-in-a-lifetime events to everyday moments, Day One‘s elegant interface makes journaling about your life a simple pleasure.   We are pleased to introduce the next generation of the Day One journaling app. Version 2 is a new app built from the ground up for an excellent writing and […]"},{"link":"https://nmac.to/blog/iskysoft-toolbox-for-ios/","image":"https://nmac.to/wp-content/uploads/2016/11/iSkysoft.Toolbox.for_.iOS_.png","title":"iSkysoft Toolbox for iOS 5.3.1 – Recover iPhone Data in a Few Clicks","content":"iSkysoft Toolbox for iOS software helps you recover lost contacts, SMS, photos, notes and more files from iPhone/iPad/iPod touch or iTunes/iCloud backup data with three simple steps.   As easy as ABC, no skill required One program with 3 recovery solutions and you can finish the recovery in 3 steps at most: connect your device […]"},{"link":"https://nmac.to/blog/cal-cat/","image":"https://nmac.to/wp-content/uploads/2017/12/Cal-Cat.png","title":"Cal Cat 1.9 – A desktop-integrated calendar","content":"Cal Cat is a desktop-integrated calendar giving you a super cute cat, or kitten each day. We hand-picked all those dolls, to bring you the best ever cat experience right to your Mac desktop.   Impress your friends and followers by sharing your favorite picture on Facebook, Google+ or Twitter.   And the best thing: […]"},{"link":"https://nmac.to/blog/aiseesoft-mp4-converter/","image":"https://nmac.to/wp-content/uploads/2014/12/Aiseesoft-MP4-Converter.png","title":"Aiseesoft MP4 Converter 9.1.18 – Convert MP4 to other formats for portable devices","content":"Convert any video to MP4 and convert MP4 to other formats for portable devices on Mac.   Convert any video format such as AVI, MTS, MXF, M4V, MOV, WMV, FLV and WebM to MP4 for portable devices on Mac Various editing functions to personalize video files on Mac Make the output MP4 videos playable on […]"},{"link":"https://nmac.to/blog/deepstyle/","image":"https://nmac.to/wp-content/uploads/2017/12/DeepStyle.png","title":"DeepStyle 1.0.2 – A cool revolutionary photo editor","content":"DeepStyle is a cool revolutionary photo editor that combines neural networks and AI to make your digital art awesome! It transforms your photos into impressive works of art using diversified filters & styles, including Picasso, anime, comic, cartoon, sketches etc as well as your OWN styles.   Unique Features:   Diversified Filters & Styles: Cartoon, […]"},{"link":"https://nmac.to/blog/visualdesigner/","image":"https://nmac.to/wp-content/uploads/2017/12/VisualDesigner.png","title":"VisualDesigner 4.4 – A multi-purpose design application","content":"VisualDesigner is a multi-purpose design application. The application help you make diagrams. flow-charts, UML design, floor plan quickly.   Functions: Import/Export VSDX, VSDM (Microsoft Visio Format) Import only with VSD, VSS (Microsoft Visio old binary Format) Import/Export to svg, png, jpeg, multi-pages tiff, pdf image file Unlimited Undo/Redo (shortcut key: Cmd-Z / Shift-Cmd-Z) Copy / […]"},{"link":"https://nmac.to/blog/templates-for-pixelmator-by-gn/","image":"https://nmac.to/wp-content/uploads/2017/10/Templates-for-Pixelmator-by-GN.png","title":"Templates for Pixelmator by GN 1.4 – High-quality Pixelmator Templates","content":"Templates for Pixelmator by GN is the perfect tool for users of Pixelmator who desires quickly and easy create high-quality Banners, Headers, Infographics or Twitter and Facebook covers. This set offers over 400 templates and textures.   Focus on content – leave design for us. Just in minutes create professional looking works!   FEATURES:   […]"},{"link":"https://nmac.to/blog/viewit/","image":"https://nmac.to/wp-content/uploads/2015/01/ViewIt2.png","title":"ViewIt 2.66 – Image viewer","content":"ViewIt is an image viewer that supports most popular image formats: JPEG, TIFF, PNG, PSD and more. Images can be viewed in a window or in full screen mode. ViewIt has also tools for: quick image sorting, printing, digital cameras and EXIF tags. Anybody interested in adding his own features to ViewIt can easily do […]"},{"link":"https://nmac.to/blog/itext/","image":"https://nmac.to/wp-content/uploads/2017/12/iText.png","title":"iText 1.2.8 – OCR Tool","content":"iText could recognize text from any image.   You can use iText to extract text from PDF, document in paper, page in a book and any other images.   It’s so easy to take image. Use iText’s built-in tool to capture any screen. Drag an image to iText’s icon in menu bar. Select an image […]"}]