[{"link":"https://nmac.to/blog/friendly-for-netflix-2-1/","image":"https://nmac.to/wp-content/uploads/2016/04/Friendly.for_.Netflix.png","title":"Friendly for Netflix 2.1 – Watch your favorite movies and TV shows on your Mac","content":"Friendly for Netflix is a simple yet powerful app to watch your favorite movies and TV shows on your Mac.   With Friendly, you can also play trailers for any movie, check Rotten Tomatoes ratings, and even multi-task with our unique Picture in Picture mode.   PLAY TRAILERS Play trailers for every movie on Netflix […]"},{"link":"https://nmac.to/blog/better-late-than-dead-1-0-2/","image":"https://nmac.to/wp-content/uploads/2016/04/Better.Late_.Than_.DEAD_.png","title":"Better Late Than DEAD 1.0.2 – Featured Survival, Crafting And Open World Game","content":"Explore an open sandbox environment which, depending on your intention, could have or could not have a foreseeable end. But as you investigate further, you may notice some suspicious activity including animals that would not normally be found in an area like this and some inconsistencies that lead to more questions. It is up to […]"},{"link":"https://nmac.to/blog/babel-choice-1-0/","image":"https://nmac.to/wp-content/uploads/2016/04/Babel.Choice.png","title":"Babel: Choice 1.0 – A 2D action-adventure game","content":"Babel: Choice is a 2D action-adventure Roguelike game which combines with the elements of RPG and shooting games. In the game, the player will play the part of Alexander, the son of the evil duke, aiming to break through the perilous and capricious Tower of Evil.   The female human Lena was brought to justice […]"},{"link":"https://nmac.to/blog/tagnotate-1-3-1/","image":"https://nmac.to/wp-content/uploads/2016/04/TagNotate.png","title":"TagNotate 1.3.1 – PDF viewer with the unique ability to assign tags to annotations","content":"TagNotate is a PDF viewer and annotator with the unique ability to assign tags to annotations – you can create as many different tags as you want, allowing you to associate with each annotation whatever kinds of information are important for you. By selecting one or more tags, you can collect together all the annotations […]"},{"link":"https://nmac.to/blog/notepad-1-0/","image":"https://nmac.to/wp-content/uploads/2016/04/Notepad.png","title":"Notepad 1.0 – Plain Text Editor","content":"Notepad is a simple and clean text editor. You can use it for simple documents or notes – without any formatting, paragraph styles or tables. And zoom window gives you a distraction free text writer.   Do you want to get rid of the text style? Do you want to use copied text without it’s […]"},{"link":"https://nmac.to/blog/helicon-focus-6-0-18/","image":"https://nmac.to/wp-content/uploads/2016/04/Helicon-Focus.png","title":"Helicon Focus 6.0.18 – Software for focus stacking","content":"Helicon Focus is designed to blend the focused areas of several partially focused digital photographs to increase the depth of field. In other words, it creates one focused image from the set of several partially focused photographs by combining the focused areas.   The program is designed for macrophotography, microphotography and hyperfocal landscape photography to […]"},{"link":"https://nmac.to/blog/desktopr-1-0-5/","image":"https://nmac.to/wp-content/uploads/2016/04/Desktopr.png","title":"Desktopr 1.0.5 – Create dynamic desktops","content":"Desktopr is simple way to extend your desktop with any content you can even imagine.   With Desktopr you can set any website, quartz composition, flash movie or other content as your desktop background.   Imagine your Facebook, Gmail, Twitter or favorite blog or magazine as a background of your desktop. You can switch currently […]"},{"link":"https://nmac.to/blog/comic-collector-16-0-4/","image":"https://nmac.to/wp-content/uploads/2013/07/Comic-Collector.png","title":"Comic Collector 16.0.4 – Catalog and organize comics","content":"Comic Collector catalogs your comics automatically, no typing. Just type the series name and select the issues you own to download all data from our online Collectorz.com Comic Database, including publisher, publication date, creators, character, genre and the cover. Browse your collection by series, publisher, artist, etc., or use the Image View to view your […]"},{"link":"https://nmac.to/blog/super-resize-1-0-1/","image":"https://nmac.to/wp-content/uploads/2016/03/Super-Resize.png","title":"Super Resize 1.0.1 – The professional tool to resize images","content":"Super Resize Quickly allows you to resize your images, add thumbnails automatically, and create the code for a web gallery alongside. With an emphasis on image quality. Because you don’t want your resized images to be blurry and lose all detail. Preview everything before you export. File sizes, compression, thumbnails. Highest quality output. Highest level […]"},{"link":"https://nmac.to/blog/sound-normalizer-2-1/","image":"https://nmac.to/wp-content/uploads/2016/03/Sound-Normalizer.png","title":"Sound Normalizer 2.1 – Analyzes and adjusts media files volume","content":"Sound Normalizer analyzes and adjusts media files so that they have the same volume. support all popular video formats and audio formats.   This is useful when you have a lot of video/audio at different volumes, you can use this tool to make everything the same volume so that you don’t need to adjust the […]"}]