[{"link":"https://nmac.to/blog/teacode/","image":"https://nmac.to/wp-content/uploads/2018/07/TeaCode.png","title":"TeaCode 1.0.1 – Write your code super fast","content":"TeaCode speeds up your code writing with a powerful variable-based language. The app comes with over 80 built-in expanders. Creating new ones is extremely easy, and it works with almost any editor. No matter what programming language do we use, we always write lots of code. TeaCode writes it with you. Quickly. Focus on your […]"},{"link":"https://nmac.to/blog/screenfocus/","image":"https://nmac.to/wp-content/uploads/2018/07/ScreenFocus.png","title":"ScreenFocus 1.0.1 – Focus on your current work","content":"ScreenFocus dims your screens. You don’t have to click any button to dim a screen. It’s dimmed automatically when you move the cursor away. By default, only the side screens are dimmed. Of course, you can change it within the app menu.   Customizations: Dim level (how dark a screen gets) Which monitors are dimmed […]"},{"link":"https://nmac.to/blog/promt-offline-translator-english-pack/","image":"https://nmac.to/wp-content/uploads/2020/01/PROMT-Offline-Translator-English.png","title":"PROMT Offline Translator English Pack 2.2 – Translate Without Internet","content":"The PROMT Offline English Pack translates texts of any size from English into German, French, Spanish, Italian, Portuguese and Russian and vice versa. Special mode “PROMT Agent” let you easily translate texts in apps and browsers on your Mac.   FEATURES Translation in two modes: Classic two-window interface for translation of typed or pasted text; […]"},{"link":"https://nmac.to/blog/tv-pilot/","image":"https://nmac.to/wp-content/uploads/2015/09/TV-Pilot2.png","title":"TV Pilot 2.1.0 – Discover new TV series","content":"TV Pilot helps you discover new TV series by browsing popular and trending lists. Choose between a poster or list view. Display general informations, actors and episodes. Maintain a list of your favorite Series. Check the episodes you have seen to follow-up. A “Seasons” view shows the whole series and your watch progress at a […]"},{"link":"https://nmac.to/blog/viking-brothers-vi/","image":"https://nmac.to/wp-content/uploads/2020/01/viking-brothers-vi.png","title":"Viking Brothers VI 1.01 – Casual Time Management & Adventure Game","content":"If there’s one thing the Viking Brothers crave more than roasted meats and ale, it’s adventure! And Everand and Boromere are going to get their fill as they join together to save the Tree of Life from the effects of a mysterious poison!   Enter the realm of gods and legends to guide the brothers […]"},{"link":"https://nmac.to/blog/canvas-draw/","image":"https://nmac.to/wp-content/uploads/2019/01/Canvas-Draw6.png","title":"Canvas Draw 6.0.3 – Loaded with tools and techniques to create creative content","content":"Canvas Draw is a powerful software specifically designed to make it possible for small business owners, designers, illustrators, and professionals to advertise and communicate with confidence.   Canvas Draw comes loaded with tools and techniques that allow you to easily create marketing or business materials, as well as creative content, printable drawings, and shareable PDFs. […]"},{"link":"https://nmac.to/blog/roads-of-rome-new-generation/","image":"https://nmac.to/wp-content/uploads/2020/01/Roads.of_.Rome_.New_.Generation.png","title":"Roads of Rome New Generation 1.0 – Casual Strategy & Simulation Game","content":"The Roman Empire was wealthy and powerful. It seemed nothing could threaten its peace and prosperity. Until, one day, a sudden misfortune came upon the land, and the Romans had to face earthquakes of unseen power with drastic consequences. Young Marcus Victorious now must save its citizens and bring back life to its previous glory. […]"},{"link":"https://nmac.to/blog/expressions/","image":"https://nmac.to/wp-content/uploads/2016/12/Expressions.png","title":"Expressions 1.3.3 – Regular expression tool","content":"Expressions is an app to play with regular expressions. Easily and nicely.   Totally minimalistic, non–distractive user interface. Dark and light mode. Pattern syntax highlighting. Beautiful full screen view. Pattern and text group highlighting.   Expressions supports switching between pattern groups by pressing cmd+shift { and cmd+shift+}. Copying pattern can be escaped, so you can […]"},{"link":"https://nmac.to/blog/mail-pilot/","image":"https://nmac.to/wp-content/uploads/2015/12/Mail-Pilot3.png","title":"Mail Pilot 3.39.0 – Task-oriented email client","content":"Mail Pilot users can quickly manage and productively organize their inboxes with a simple, task-oriented approach, tailored for the desktop.   INTUITIVE EMAIL Finally, you can interact with email the way you already think about it. Mail Pilot simplifies email with a task-oriented approach. From deleting an advertisement to remembering to pay your cell phone […]"},{"link":"https://nmac.to/blog/kpvid-music-tag-editor/","image":"https://nmac.to/wp-content/uploads/2018/04/KeepVid-music-tag-editor.png","title":"KeepVid music tag editor 3.0.1 – Release You from Massive Music Collections","content":"KeepVid Music Tag Editor helps you to add or modify ID3 tags, album artworks for your music collection automatically with Gracenote Media Database, and removes duplicates in iTunes/music library.   ID3 Tag Editor,Fix Missing and Mislabeled Music Info Correct ID3 tags like song title, artist, and more that are originally wrong or missing. Add song title, […]"}]