[{"link":"https://nmac.to/blog/foldingtext-2-1-1/","image":"https://nmac.to/wp-content/uploads/2016/02/FoldingText.png","title":"FoldingText 2.1.1 – Markdown text editor with productivity features","content":"For Mac users who love plain text. FoldingText is the markdown text editor with productivity features. Unlike other editors, FoldingText does outlining, todo lists, and more.   Simple Plain text Outline formatting Fold and Focus to see   Surprisingly Adept Live formatting Scripts, themes, and plugins Plain text productivity platform   Version 2.1.1: Updated for […]"},{"link":"https://nmac.to/blog/beziercode-1-26/","image":"https://nmac.to/wp-content/uploads/2016/02/BezierCode.png","title":"BezierCode 1.26 – Vector Drawing to Objective C Code","content":"Drawing manually using Xcode is tedious, if not hard. BezierCode is a full vector drawing application that will automatically translate your drawing into Objective C code. Its user friendly intuitive interface can help almost anyone to design beautiful UI elements. A must have tool for iOS/OSX developer.   The vector drawing can be exported to […]"},{"link":"https://nmac.to/blog/anytune-1-4-4/","image":"https://nmac.to/wp-content/uploads/2016/02/Anytune.png","title":"Anytune 1.4.4 – Slow down music for practice","content":"Anytune lets you slow down music, choose the perfect pitch, and learn to play by ear. The top rated music practice app for iPhone and iPad is finally available on the Mac!   Anytune is the ultimate music-practice app for singers, dancers, and musicians of all kinds. Artists worldwide use Anytune to learn to play, […]"},{"link":"https://nmac.to/blog/appdelete-4-2-4/","image":"https://nmac.to/wp-content/uploads/2015/02/AppDelete.png","title":"AppDelete 4.2.4 – The speedy and efficient way to delete your unwanted apps","content":"AppDelete is an uninstaller for Macs that will remove not only applications but also widgets, preference panes, plugins, and screensavers along with their associated files. Without AppDelete these associated items will be left behind to take up space and potentially cause issues.   There are several ways to activate AppDelete: Drag items onto main window […]"},{"link":"https://nmac.to/blog/veertu-1-0-5/","image":"https://nmac.to/wp-content/uploads/2016/02/Veertu.png","title":"Veertu 1.0.5 – Native Virtualization for OS X","content":"Run Windows and Linux on your Mac alongside OS X   Veertu is simple, light, secure virtualization software designed for Mac.   With Veertu you can run your favorite Window or Linux distribution directly on OS X. Veertu is powered by Hypervisor framework and runs entirely in sandbox,eliminating the need for root permissions and kernel […]"},{"link":"https://nmac.to/blog/stocktab-1-3/","image":"https://nmac.to/wp-content/uploads/2015/07/StockTab.png","title":"StockTab 1.3 – Keep an eye on the markets from your menu bar","content":"StockTab is the slickest and simplest way to keep an eye on the markets, right from your menu bar. We’ve beautifully crafted this app to ensure you are at the forefront of the financial markets, be it following individual stock prices or checking out fluctuations in global exchange rates. The app has been designed from […]"},{"link":"https://nmac.to/blog/rapidlist-1-0-2/","image":"https://nmac.to/wp-content/uploads/2016/02/RapidList.png","title":"RapidList 1.0.2 – Simple file listing software","content":"RapidList is simple file listing software.   RapidList possible hash generation, convenient to delivery work and archive list.   Features of RapidList:   High speed output RapidList does not open any file. list creation process is fast. Ideal for listing the contents of LTFS.   Simple format simple output with whitespace format txt or csv […]"},{"link":"https://nmac.to/blog/business-card-composer-5-2-1/","image":"https://nmac.to/wp-content/uploads/2016/02/Business.Card_.Composer.png","title":"Business Card Composer 5.2.1 – Create and print business cards","content":"Business Card Composer is a complete kit to create and print business cards, calling cards, and badges. The package contains more than 1,000 high-quality clipart images (more than 40,000 with the Extras Pack), 740 ready-made designs and advanced editing tools.   The program conveniently uses personal data from Apple Address Book, and images from iPhoto […]"},{"link":"https://nmac.to/blog/anytune-1-4-3/","image":"https://nmac.to/wp-content/uploads/2016/02/Anytune.png","title":"Anytune 1.4.3 – Slow down music for practice","content":"Anytune lets you slow down music, choose the perfect pitch, and learn to play by ear. The top rated music practice app for iPhone and iPad is finally available on the Mac!   Anytune is the ultimate music-practice app for singers, dancers, and musicians of all kinds. Artists worldwide use Anytune to learn to play, […]"},{"link":"https://nmac.to/blog/tempo-1-51/","image":"https://nmac.to/wp-content/uploads/2016/02/tempo.png","title":"tempo 1.51 – Play your multimedia faster or slower without changing the pitch","content":"Play your movies, videos, podcasts, and even music faster or slower without changing the pitch!   Have you ever tried to fast forward through a movie or a song? If you have, you might recall, say, Nick Cage or Adele, end up sounding like Mickey Mouse. Or, if you tried to slow the media down, […]"}]