[{"link":"https://nmac.to/blog/seo-checker/","image":"https://nmac.to/wp-content/uploads/2017/03/SEO-Checker.png","title":"SEO Checker 2.0 – SEO tools to help you analyse your web sites","content":"SEO Checker is an effective app that offers seo tools to help you analyse your web sites, everything you need to increase ranking and speed up your web sites.   Features SEO metrics (alexa ranking, semrush, backlinks, pagespeed score, and more ) PageSpeed insights Links extractor Content analysis Website speed tips Advice system Meta-tags crawler […]"},{"link":"https://nmac.to/blog/peep/","image":"https://nmac.to/wp-content/uploads/2018/09/Peep.png","title":"Peep 2.3.2 – File viewer and text encoding conversion utility","content":"Peep is a file-viewing and text-encoding utility which is useful when programming, when experiencing text encoding problems, or when you need to extract information from a file that you can’t open otherwise. Its data-extraction functionality allows you to view files in a ‘hexeditor’ style; it’s not intended to be an editor, but rather to inspect, […]"},{"link":"https://nmac.to/blog/stellar-phoenix-entourage-repair/","image":"https://nmac.to/wp-content/uploads/2018/09/Stellar-Phoenix-Entourage-Repair.png","title":"Stellar Phoenix Entourage Repair 2.0.0.0 – Repair and restore MS Entourage database files","content":"Stellar Phoenix Entourage Repair is a smart and user-friendly Entourage database repair solution. Its interactive interface allows you to scan and repair corrupt Entourage databases files along with preview of the scanned database items (i.e. emails, notes, address book, scheduled tasks, and personalized calendar) prior to recovery. You can even filter the scanned result for […]"},{"link":"https://nmac.to/blog/iramdisk/","image":"https://nmac.to/wp-content/uploads/2017/10/iRamDisk3.png","title":"iRamDisk 3.6.12 – Create a RAM disk","content":"iRamDisk uses a part of your RAM to create a new volume shown as an ordinary drive that can be mounted and used independently in your Finder.   Since the access time to these datas is way more faster than usual (it can reach over 10 times of the normal speed for some configuration), it […]"},{"link":"https://nmac.to/blog/writer/","image":"https://nmac.to/wp-content/uploads/2018/01/Document-Writer1.png","title":"Writer 1.6.3 – Useful Word Processor","content":"Writer is a beautiful, easy-to-use text editor that is designed to make writing convenient, efficient and comfortable. Document Writer is ease, fast and uncluttered. It starts up quickly, has a live word count, easy on the eyes and you can export all the common formats: .pdf, .rtf, .doc, .txt and more .   Features Automatically […]"},{"link":"https://nmac.to/blog/new-paint-x/","image":"https://nmac.to/wp-content/uploads/2017/10/New-Paint-X.png","title":"New Paint X 1.2.1 – A classic painting application","content":"New Paint X is a classic painting application to draw, color, or edit pictures. You can use New Paint X like a digital sketchpad to make simple pictures, creative projects, or to add text and designs to other pictures, such as those taken with your digital camera.   This tried-and-true program is easier to use—and […]"},{"link":"https://nmac.to/blog/oxygen-xml-editor/","image":"https://nmac.to/wp-content/uploads/2016/11/Oxygen-XML-Editor.png","title":"oXygen XML Editor 20.1 – Java XML editor","content":"Oxygen is an XML Editor, XSLT/XQuery debugger and profiler with full Unicode support. It supports visual XML editing driven by CSS stylesheets. It offers a powerful code insight that can follow a DTD, Relax NG, or an XML schema, or even can learn the structure from a partially edited document. XML and XSL documents can […]"},{"link":"https://nmac.to/blog/memory-clean/","image":"https://nmac.to/wp-content/uploads/2016/09/Memory-Clean-2.png","title":"Memory Clean 6.6 – Monitor and Free Up Memory","content":"Memory Clean 2 is the ultimate app for optimizing your Mac’s memory and is best used after you have finished using a memory (RAM) intensive app or game.   With the slickest interface and user experience, Memory Clean 2 stands head and shoulders above the rest.   Our users have experienced a smoother and faster […]"},{"link":"https://nmac.to/blog/money-with-sync/","image":"https://nmac.to/wp-content/uploads/2017/08/Money-with-sync6.png","title":"Money (with sync) 6.6.15 – Personal accounting app","content":"Manage your personal finances in the most comprehensive manner with Money. Track all your accounts, organize bills, budget your income and expenses, and keep full control over your personal finances.   Featured by Apple  Over 1.5 million people all over the world manage personal finances with Money.   With Money you will: 1. BUDGET INCOME […]"},{"link":"https://nmac.to/blog/1doc/","image":"https://nmac.to/wp-content/uploads/2018/07/1Doc1.png","title":"1Doc 1.1.2 – Word Processor for Writer","content":"1Doc is a lightweight, quick and fully functional word app. You can easily view and edit many kinds of documents. Support DOC, DOCX, RTF, RTFD, TXT, ODT format Format bulleted or numbered lists automatically Word & page count Simple find & replace Insert table Insert picture (Upgrade to Pro) Print (Upgrade to Pro) Export files […]"}]