[{"link":"https://nmac.to/blog/cleanapp/","image":"https://nmac.to/wp-content/uploads/2014/09/CleanApp.png","title":"CleanApp 5.1.3 – Application deinstaller and archiver","content":"CleanApp is an application deinstaller and archiver.   Your hard drive gets fuller day by day, but do you know why? CleanApp 5 provides you with insights how to reclaim disk space. There are definitely tons of unused files on your hard drive – CleanApp will help you to find and delete them. CleanApp 5 […]"},{"link":"https://nmac.to/blog/clip-studio-paint-ex/","image":"https://nmac.to/wp-content/uploads/2016/10/Clip-Studio-Paint-EX.png","title":"Clip Studio Paint EX 1.6.2 – All-in-one solution for ready-to-publish comics and manga","content":"Clip Studio Paint EX (was Manga Studio EX) is the world’s leading comic and manga creation software. It delivers powerful cutting edge drawing and coloring tools, making it essential for professional comic and manga artists.   Choose from over 3,000 screen tones or create your own. Resize with no loss in quality by converting your […]"},{"link":"https://nmac.to/blog/suicide-guy/","image":"https://nmac.to/wp-content/uploads/2017/07/Suicide-Guy.png","title":"Suicide Guy 1.0 – A first person action-puzzle game set in a world of dreams","content":"Suicide Guy is set in the incredibile and extraordinary dreams of its protagonist. What would you do in order to save the thing you love most? Immerse yourself into his weird dreams and help him to wake up before it’s too late.   Features 25 levels set inside Suicide Guy’s mind Story-driven game Physics based […]"},{"link":"https://nmac.to/blog/smaller/","image":"https://nmac.to/wp-content/uploads/2017/07/Smaller.png","title":"Smaller 1.4 – Make your website load faster","content":"Smaller is a powerful HTML, CSS, and JavaScript compressor on OS X which also has the ability to combine several files into one. Compress your files and make your website load faster.   Version 1.4: Added support for .htm extension   Intel, 64-bit processor OS X 10.7 or later Apple Java for OS X 10.7 […]"},{"link":"https://nmac.to/blog/mp3-music-converter/","image":"https://nmac.to/wp-content/uploads/2016/11/MP3-Music-Converter.png","title":"MP3 Music Converter 1.0.39 – Audio Converter to andfrom MP3","content":"Now, you won’t miss this MP3 Music Converter! Because you can convert MP3 and any other music formats as you need, also there are many general/lossless audio provided for you!   You should check these paragraphs below, and there maybe some surprise waiting for you. You got MP3 music files, or whatever audio files, like […]"},{"link":"https://nmac.to/blog/suitcase-fusion/","image":"https://nmac.to/wp-content/uploads/2017/03/Suitcase-Fusion18.png","title":"Suitcase Fusion 7 18.2.4 – Font management solution combines Suitcase and Font Reserve","content":"Suitcase Fusion 7 is the creative professional’s font manager.   Every professional font manager should deliver the basics: spectacular previews, powerful search tools, and efficient font organization. You have those basics covered. But there is a lot more you actually DO with fonts – namely traditional and web design. We can help with that too!   […]"},{"link":"https://nmac.to/blog/fontagent/","image":"https://nmac.to/wp-content/uploads/2013/09/FontAgent.png","title":"FontAgent Pro 7.2.2 – Font management and repair utility","content":"FontAgent is a revolutionary release of the one of the world’s smartest font managers. The first thing you’ll notice is its all-new, stunning interface that features crisp font previews, simple controls, and powerful set management. Activate, deactivate, find fonts, change colors, customize text, and resize UI panes in seconds. It’s font management done right–your way. […]"},{"link":"https://nmac.to/blog/iorgsoft-pdf-converter/","image":"https://nmac.to/wp-content/uploads/2017/07/iOrgsoft-PDF-Converter.png","title":"iOrgsoft PDF Converter 3.2.2 – Convert PDF files to Word, Image, Text, Html etc.","content":"iOrgsoft PDF Converter for Mac is specially designed for mac users to convert PDF files to Word, Image, Text, Html & Epub with original layouts, images and tables retained in the created files. Convert PDF to Word, Text , Image, Epub & HTML on mac Preserves the original layout of text, columns, tables, graphics, images […]"},{"link":"https://nmac.to/blog/hyposphere/","image":"https://nmac.to/wp-content/uploads/2017/07/Hyposphere.png","title":"Hyposphere 1.1 – The most beautiful “marble” platformer game","content":"Hyposphere is not simply a classic “marble” platformer, it may also be the most beautiful, thanks to the power of the Unreal Engine 4, as well as the most difficult.   A cunning artificial intelligence, along with the help of a clever virus, has taken over every computer in the world! There is only one […]"},{"link":"https://nmac.to/blog/passenger-for-uber/","image":"https://nmac.to/wp-content/uploads/2017/07/Passenger-for-Uber.png","title":"Passenger for Uber 1.0.7 – Call an Uber from your Mac","content":"Passenger for Uber allows you to get a ride from your Mac, without needing your phone at all! Passenger stays in your menu bar, and can quickly be brought up with a keyboard shortcut, keeping ride estimates just a tap away.   Passenger supports the full Uber experience, and is powered by the official Uber […]"}]