[{"link":"https://nmac.to/blog/corporate-style-packs-11/","image":"https://nmac.to/wp-content/uploads/2013/12/Corporate_Style.175x175-75.jpg","title":"Corporate Style Packs 1.1 – Stylish templates for your Pages documents","content":"A new look for your Pages documents! Jumsoft’s Corporate Style Packs set features six packs with different designs: Color Fest, Elementary, Enterprise, Living Space, Subtle Mind, and Sugar Hues. Each of them contains more than 80 layouts for virtually any type of documents you may need in your office. Give your clients and partners a […]"},{"link":"https://nmac.to/blog/radium-302/","image":"https://nmac.to/wp-content/uploads/2013/12/radium.175x175-751.png","title":"Radium 3.0.2 – Multi-network radio player; supports XM Online, AOL Radio, and more","content":"Radium is an Internet radio player that’s designed from the ground up to be simple, intuitive, and lightweight. With its powerful search, thousands of supported stations (including Sirius/XM and DI.fm/Sky.fm Premium), and the ability to add your own streams, Radium will change the way you listen to Internet radio.   Version 3.0.2: Additional global shortcuts. […]"},{"link":"https://nmac.to/blog/pin-pro-for-pinterest-13/","image":"https://nmac.to/wp-content/uploads/2013/12/APPL-PRO.175x175-75.png","title":"Pin Pro for Pinterest 1.3 – Browse Pinterest from your menu bar","content":"Pin Pro takes your Pinterest addiction to a whole new level. It is the best app for instantly browsing and uploading to your Pinterest account without ever having to open your web browser! Browse through the latest pinned images from your friends and the wider Pinterest community. With Pin Pro, you can also upload images to […]"},{"link":"https://nmac.to/blog/iclipboard-420/","image":"https://nmac.to/wp-content/uploads/2013/12/iClipboard.175x175-75.png","title":"iClipboard 4.2.0 – A flexible clipboard manager","content":"iClipboard automatically keeps a history of everything you copy to the clipboard from any application. You can then paste any clipping from the history five different ways:   1) the Shelf on the side of the screen. 2) the special menu in the menu bar. 3) the Rapid-Fire hot key. 4) the Services menu. 5) […]"},{"link":"https://nmac.to/blog/bonzai3d/","image":"https://nmac.to/wp-content/uploads/2013/12/30422.jpg","title":"bonzai3d 3.0 – 3D modeler based on design industry essentials and designer requests","content":"bonzai3d is a 3D modeler developed to fill in the demand for a quick, easy, simple but, most importantly, geometrically robust approach to 3D, based on design industry essentials and designer requests. In many ways, bonzai3d is an offspring of the form·Z experience of the past 20 years. At the same time, it is a […]"},{"link":"https://nmac.to/blog/touchdraw/","image":"https://nmac.to/wp-content/uploads/2013/12/Icon.175x175-759.jpg","title":"TouchDraw 1.5.2 – Create structured 2D vector graphics","content":"TouchDraw is a vector drawing application for the Mac. Just as with our iPad version, TouchDraw for Mac gives you everything you need to create structured 2D vector graphics such as flow charts, graphs, diagrams, illustrations, logos, and floor plans just to name a few. TouchDraw for Mac is fully compatible with TouchDraw for iPad, […]"},{"link":"https://nmac.to/blog/pdf-to-image-pdf-converter-3-0/","image":"https://nmac.to/wp-content/uploads/2013/12/Product_logo.175x175-75.jpg","title":"PDF to Image-PDF Converter 3.0 – PDF Converter For Mac","content":"A powerful yet easy-to use app that enables you to convert PDF to images such as JPEG, GIF, PNG, BMP, TIFF. It also enables you to extract images from PDF document. After conversion, you can easily edit or reuse the PDF content in other applications. Key Features Convert PDF to Various Image Formats•Convert PDF to […]"},{"link":"https://nmac.to/blog/coucou-1-0-1/","image":"https://nmac.to/wp-content/uploads/2013/12/coucou_logo.175x175-75.jpg","title":"coucou 1.0.1 – Discover every device on your network","content":"Need to share some files, or a screen? Want to manage a printer via its web interface? Maybe even check out that website your colleague is working on. Coucou makes it super easy to perform these tasks. It also gives you a nice overview of which devices (and their owners) are currently present. If you’re […]"},{"link":"https://nmac.to/blog/the-lost-watch-3d-1-2-0/","image":"https://nmac.to/wp-content/uploads/2013/12/mzi.vkrkgnon.175x175-75.jpg","title":"The Lost Watch 3D 1.2.0 – Antique timepiece animated screensaver","content":"The Lost Watch 3D is probably the most unusual animated wallpaper you’ll ever see. An absent-minded traveler dropped his golden pocket watch while crossing a river. A few coins fell out as well. Years went by, but the timepiece is still working just fine even though there is no one to wind it up. Features:– […]"},{"link":"https://nmac.to/blog/stills-2-5/","image":"https://nmac.to/wp-content/uploads/2013/12/34203.jpg","title":"Stills 2.5 – Set of 1200 clip art images for presentations","content":"Stills is an ultimate set of 1633 illustrations, appropriate for any Pages or Keynote document that requires color, texture, and authenticity. It contains 100 high-quality clipart images, 417 high-quality photos (1024 x 768 pixels), 200 photo items with transparent backgrounds, 300 People Clipart, 399 realistic objects rendered in 3D and 217 high-quality traffic signs images. […]"}]