[{"link":"https://nmac.to/blog/mirror-for-chromecast/","image":"https://nmac.to/wp-content/uploads/2018/10/Mirror-for-Chromecast.png","title":"Mirror for Chromecast 2.9.3 – Mirror your Mac to a Chromecast","content":"Mirror for Chromecast allows you to mirror the screen and audio of your Mac to a Chromecast 1, 2 or Ultra. When using this app with a Chromecast 1, the Screen Mirroring will start about 30 seconds after you start mirroring, please wait during this startup time. Chromecast 2 and Ultra are much faster to […]"},{"link":"https://nmac.to/blog/mirror-panasonic-tv/","image":"https://nmac.to/wp-content/uploads/2018/12/Mirror-for-Panasonic-TV-3.png","title":"Mirror for Panasonic TV 3.7.3 – Mirror your Mac to any Panasonic TV","content":"Mirror for Panasonic TV allows you to mirror the screen of your Mac to any Panasonic Smart TV. No wires and no additional hardware needed! You can also stream individual video files from your Mac to your TV. Also, we included the option to watch one window on your Mac, and another window on your […]"},{"link":"https://nmac.to/blog/voodoopad/","image":"https://nmac.to/wp-content/uploads/2018/04/VoodooPad.png","title":"VoodooPad 5.4.0 – Notepad with many advanced features","content":"VoodooPad is a garden for your thoughts. Plant ideas, images, lists and anything else you need to keep track of. VoodooPad grows with you, without getting in the way — no fences to box you in! Type in notes, highlight important words or phrases and create new pages. Drag and drop folders, images, applications, or […]"},{"link":"https://nmac.to/blog/itoolab-imute/","image":"https://nmac.to/wp-content/uploads/2022/01/iMute.png","title":"iToolab iMute 1.5.0 – Turn off Camera Sound on iPhone to Keep Silent","content":"Turn off iPhone Camera Sound with Hard Code   Wanna Get Rid of the Shutter Sound? Muting the camera is necessary both in the classroom and in meetings. Taking selfies in a quiet environment, the loudly shutter sound means you’ll get a lot of awkward glances. Anyone who has bought an iPhone in Japan or […]"},{"link":"https://nmac.to/blog/launchcontrol/","image":"https://nmac.to/wp-content/uploads/2017/10/LaunchControl.png","title":"LaunchControl 1.52.4 – Create, manage, and debug launchd(8) services","content":"LaunchControl is a launchd(8) frontend allowing you to manage and debug system and user services on your Mac. All documented features of launchd(8) are supported. It reports potential problems even before a job is started and makes sure you always create valid configurations.   Features Sophisticated interface – With LaunchControl you see all services and […]"},{"link":"https://nmac.to/blog/anydrop/","image":"https://nmac.to/wp-content/uploads/2019/09/AnyDrop.png","title":"AnyDrop 1.4 – Easily translate, convert text, process images and files","content":"AnyDrop was designed to simplify your workflow by assembling as many of these features as possible within a tiny menu bar app, which can be used entirely with hotkeys and drag&drop. It is highly versatile and customizable, and it is especially suitable for processing text and images.   Easily accessible menu bar app Of course, […]"},{"link":"https://nmac.to/blog/brigador/","image":"https://nmac.to/wp-content/uploads/2017/11/Brigador-Up-Armored-Edition.png","title":"Brigador: Up-Armored Edition 1.64 – An isometric roguelite of intense tactical combat","content":"Brigador relaunches in 2017 with expanded introductory missions, localization, easier difficulty and revised controls, plus improved lighting effects, mechanics, and more.   Here is your contract Brigador is an isometric roguelite of intense tactical combat. Play as mercenary pilots betraying their planet, looking for the big payout and a ticket off this planet. Everything you […]"},{"link":"https://nmac.to/blog/mamp-pro/","image":"https://nmac.to/wp-content/uploads/2017/03/MAMP-PRO4.png","title":"MAMP PRO 6.6.1 – Create a local server environment for Web development and more","content":"MAMP PRO is the commercial, professional grade version of the classic local server environment for OS X: MAMP. Designed for professional Web developers and programmers, MAMP Pro allows easy installation and administration of their development environment under OS X.   As a professional Web developer you have to test your programs in detail. In addition, […]"},{"link":"https://nmac.to/blog/planner-5d/","image":"https://nmac.to/wp-content/uploads/2019/04/Planner-5D.png","title":"Planner 5D 4.8.3 – Creates interior and landscape in 2D and 3D","content":"Whether you’re remodeling, renovating, or designing your dream home, Planner 5D has you covered! Create detailed 2D & 3D floor plans, browse a 3000+ item catalog, and create photo-realistic images of your projects.   Features: Drag and drop design in both 2D & 3D modes User-friendly features that do not require special skills Create a […]"},{"link":"https://nmac.to/blog/fonelab-android-data-recovery/","image":"https://nmac.to/wp-content/uploads/2022/01/FoneLab-Android-Data-Recovery.png","title":"FoneLab Android Data Recovery 3.1.20 – Recover Deleted Files on Android Phones","content":"Get your files on Android phone lost? Try this fast, powerful and easy-to-use Android files recovery. It enables you to recover the lost deleted contacts, messages, messaging attachment, call history, gallery, picture library, music, video and document on Android phones.   The software can get the lost data back whether your Android device is water […]"}]