[{"link":"https://nmac.to/blog/untouch/","image":"https://nmac.to/wp-content/uploads/2021/12/Untouch.png","title":"Untouch 1.2.4 – Touch Bar Deactivation","content":"We’ve all been there, placing hands on MacBook’s keyboard and unintentionally touching the Touch Bar. This may be very annoying, not to say destructive.   Untouch is here to the rescue. When launched and enabled, it makes sure that the Touch Bar is not active.   Additionally you can use selected modifier keys to temporary […]"},{"link":"https://nmac.to/blog/scrollow/","image":"https://nmac.to/wp-content/uploads/2021/12/Scrollow.png","title":"Scrollow 1.7.1 – Control Media Via Scrolling","content":"Scrollow lets you control various system parameters (system volume, screen brightness, keyboard illumination) and issue control events (switch tracks, play and pause) without touching function keys or using Touch Bar. Just use scroll gestures at the top of the screen or at app’s menu bar icon.   Version 1.7.1: Bug fixes and improvements German localization […]"},{"link":"https://nmac.to/blog/photoscollage/","image":"https://nmac.to/wp-content/uploads/2017/06/PhotosCollage.png","title":"PhotosCollage 1.4 – Justified Photo Layouts","content":"Creates justified collages of photos as well as blends of photos horizontally, vertically or square. Create tile images from one using the photo tiling feature.   The automatic justified layout of your photos is ideal for a sequence of photos that are naturally ordered in time.   Photos are placed within a rectangular column, row […]"},{"link":"https://nmac.to/blog/24h-wallpaper/","image":"https://nmac.to/wp-content/uploads/2019/11/24_Hour_Wallpaper_4.png","title":"24 Hour Wallpaper 5.0.1 – A beautiful dynamic desktop wallpapers","content":"Enjoy beautiful desktop wallpapers that change dynamically to match the time of day. Includes 58 total wallpaper sequences all professionally captured and mastered at 5K resolution. Each sequence is made of 30+ images which cover a complete 24 hour period.   Enjoy wallpaper that reflects the time of day where you are or adjust time […]"},{"link":"https://nmac.to/blog/apeaksoft-iphone-transfer/","image":"https://nmac.to/wp-content/uploads/2018/06/Apeaksoft-iPhone-Transfer.png","title":"Apeaksoft iPhone Transfer 2.0.32 – iTunes alternative to transfer data for iPhone/iPad/iPod","content":"Apeaksoft iPhone Transfer is able to backup text messages, contacts, pictures, music, videos, books, PDF and more between iOS device and computer or from iOS to iTunes.   TRANSFER FILES FLEXIBLY Apeaksoft iPhone Transfer is the flexible file transfer software. It does not transfer photo from Phone to computer, but also transfer contacts from iPhone […]"},{"link":"https://nmac.to/blog/gifted/","image":"https://nmac.to/wp-content/uploads/2021/12/GIF.ted_2.png","title":"GIF’ted 2.0.1 – Convert MPEG-4 to animated GIF","content":"Gif’ted lets you turn your MPEG-4 movies into sleek animated GIF’s in no time. It will analyze your source movie’s colours to make the best looking GIF’s ever. Or use a classic palette, for example from Gameboy or SNES, for wacky and fun results. You can also trim and crop the output GIF to fit […]"},{"link":"https://nmac.to/blog/quartzcode/","image":"https://nmac.to/wp-content/uploads/2017/10/QuartzCode1.png","title":"QuartzCode 1.66.7 – Turn vector drawing and animation into Objective-C and Swift code","content":"QuartzCode is a fast, lightweight and powerful animation tool that turn vector drawing and animation to Objective C and Swift code.   Creating animation for your iOS/OSX project now is easier than ever. Just change any properties; you will see animation changes in real time. Using QuartzCode, you can iterate any animation within seconds, at […]"},{"link":"https://nmac.to/blog/tooth-fairy/","image":"https://nmac.to/wp-content/uploads/2020/06/ToothFairy2.png","title":"Tooth Fairy 2.7.8 – Single click away from your favorite bluetooth device","content":"Tooth Fairy helps you to switch connection of a selected bluetooth device, for example, AirPods, directly from menu bar or even global hotkey. You can do it with the system bluetooth menu bar but Tooth Fairy can save you a few clicks.   Version 2.7.8: Worked around an issue with macOS 12 where it was […]"},{"link":"https://nmac.to/blog/widsmob-viewer-pro/","image":"https://nmac.to/wp-content/uploads/2019/04/WidsMob-Viewer-Pro.png","title":"WidsMob Viewer Pro 2.15 – Fast photo viewing application","content":"How to view photos and videos taken with camcorder or smartphone with ease? When you view the multimedia files of camcorder on Mac, you have to use different programs to view files in different formats. Moreover you might need file converter to transcode the files beforehand. WidsMob Viewer Pro is the easy and professional method […]"},{"link":"https://nmac.to/blog/highlight/","image":"https://nmac.to/wp-content/uploads/2013/02/Highlight2.png","title":"Highlight 2.7.20201002 – Virtually draw on your screen","content":"Highlight is a tool designed with teachers and demos in mind: it helps you attracting the attention of your audience on what happens on the screen. It is designed to be as unobtrusive and simple as possible, while letting you express your communicating skills efficiently.   Version 2.7.20201002: compatibility updates for newer systems (10.10 and […]"}]