[{"link":"https://nmac.to/blog/roadmovie-2-7-4/","image":"https://nmac.to/wp-content/uploads/2014/12/RoadMovie.png","title":"RoadMovie 2.7.4 – Subtitle, batch-encode and upload your movies","content":"RoadMovie helps get your videos subtitled, metadata tagged, chapterized, encoded and uploaded to your portable device or website. RoadMovie 2 brings you “video-encoding-super-powers” in a friendly and easy to use interface. Now you can finally create professionally encoded videos without using several apps for each task. All you need comes in this one app. Easy […]"},{"link":"https://nmac.to/blog/cleanusbdrive-1-0-2/","image":"https://nmac.to/wp-content/uploads/2016/09/CleanUSBDrive.png","title":"CleanUSBDrive 1.0.2 – The fastest DS_Store remover for external drives","content":"CleanUSBDrive is an utility to eject any external drive removing those files that you don’t want to see in your smartTV multimedia-browser, for example. It cleans all drives from system junk before ejecting, with a very high performance.   Features Simple and fast Very minimalist design Status bar App Remove .DS_Store, ._AppleDouble, Thumbs.db, .Trashes, .Spotlight, […]"},{"link":"https://nmac.to/blog/project-highrise-1-0-1-2/","image":"https://nmac.to/wp-content/uploads/2016/09/Project.Highrise.png","title":"Project Highrise 1.0.1.2 – A skyscraper construction and management sim","content":"Your job as the architect and developer is to build world-famous skyscrapers that will be the envy of the entire city, masterpieces of art and engineering. But a skyscraper is more than just steel and glass, it’s an intricate ecosystem, full of people that live and work in the building. They become a complex machine […]"},{"link":"https://nmac.to/blog/ifoto-hdr-2-2-195/","image":"https://nmac.to/wp-content/uploads/2016/09/iFoto-HDR.png","title":"iFoto HDR 2.2.195 – Make HDR Photo Effects with Ease","content":"HDR should be a tricky subject to master for photographers. When you merge the images with different exposure to HDR photographs, how to ensure a creative and natural look? iFoto HDR should be the best answer for you to merge HDR photos. It is a super easy HDR program to make awesome results.   When […]"},{"link":"https://nmac.to/blog/picgif-2-0-8/","image":"https://nmac.to/wp-content/uploads/2014/03/PicGIF.png","title":"PicGIF 2.0.8 – Convert photos and videos into incredible GIFs quickly","content":"PicGIF enables you to quickly create incredible animated GIFs from photos or short videos. It’s easy to customize GIF Size, Sequence, Frame Delay, and to add text and stickers, etc. After a satisfying GIF is done, you can share the GIF with your friends via E-Mail, iMessage, Tumblr or simply save it in Finder on […]"},{"link":"https://nmac.to/blog/org-chart-designer-pro-4-0/","image":"https://nmac.to/wp-content/uploads/2016/06/Org-Chart-Designer-Pro.png","title":"Org Chart Designer Pro 4.0 – Drag-and-drop designer for org charts and network diagrams","content":"Org Chart Designer Pro makes it simple to create and publish professional org charts and network diagrams.   Features Intuitive drag and drop designer Supports shapes, textboxes, photos, image slideshows and table grids Supports multiple layerings with full layer arrangement and grouping features Supports advanced “Auto Branch Generation”, allows you to quickly add new levels […]"},{"link":"https://nmac.to/blog/mytuner-radio-1-7-1/","image":"https://nmac.to/wp-content/uploads/2016/09/myTuner-Radio.png","title":"myTuner Radio 1.7.1 – Listen to the radio from your menu bar","content":"myTuner Radio is the best way to listen to the radio on your Mac. More than 120 countries and 30,000 radio stations available in our application, from sports to news and music and many others to choose from.   With myTuner Radio you can: Listen to the best radios stations Radios from more than 120 […]"},{"link":"https://nmac.to/blog/folder-icon-designer-3/","image":"https://nmac.to/wp-content/uploads/2016/09/Folder-icon-designer.png","title":"Folder icon designer 3 – Icons for folder customization","content":"Folder Icon Designer is great if you are bored with your old icons, or if you get confused by folder icons which look alike, but which hold different content. Folder Icon Designer brings you beautiful, vibrant icons, bringing beauty and personalization to your system. There are many from which to choose, and all are free! […]"},{"link":"https://nmac.to/blog/browserism-2-3/","image":"https://nmac.to/wp-content/uploads/2016/08/Browserism.png","title":"Browserism 2.3 – Easily switch your default browser","content":"Browserism is a little app that helps you quickly switch your Mac’s default web browser. Out of the box it supports Safari, Chrome, Firefox, and Opera. You can add up to 4 additional browsers as well.   Use a different browser at work than you do at home? Browserism can schedule your work browser to […]"},{"link":"https://nmac.to/blog/keyboard-pilot-1-8-1/","image":"https://nmac.to/wp-content/uploads/2016/09/Keyboard-Pilot.png","title":"Keyboard Pilot 1.8.1 – Switch keyboard layout for different applications","content":"Let Keyboard Pilot take over switching keyboard layouts for different apps. If you’re using a non-English keyboard layout, you might have noticed that some applications work better with an English layout. Things like key shortcuts in Photoshop, or typing symbols like [ ] { } in Xcode.   By letting Keyboard Pilot take over switching […]"}]