[{"link":"https://nmac.to/blog/enhance-images-2-1/","image":"https://nmac.to/wp-content/uploads/2016/08/Enhance-Images.png","title":"Enhance Images 2.1 – Great app to enhance your photos/images","content":"Enhance Images – You don’t have to be an expert, the app tries to find the best configurations for your image.   The following filters are applied to your photo/image: Repairs red/amber/white eye due to camera flash Adjusts the color of a face to give pleasing skin tones Increases the saturation of an image without […]"},{"link":"https://nmac.to/blog/video-converter-2-2-0/","image":"https://nmac.to/wp-content/uploads/2016/08/Video.Converter.Plus_.png","title":"Video Converter + 2.2.0 – Convert videos to iOS-compatible formats","content":"Want to convert your videos to Apple devices in several minutes? Want to trim your favorite chapters, resize the videos to fix your devices, select the language to export and keep the high quality? Yes, Video Converter + can do it for you!   Feature: It has Batch Conversions and convert multiple videos at the […]"},{"link":"https://nmac.to/blog/tharsis-1-0/","image":"https://nmac.to/wp-content/uploads/2016/08/Tharsis.png","title":"Tharsis 1.0 – A turn-based space strategy game","content":"A mysterious signal originating from the Tharsis region of Mars set us on a frantic mission. Who sent it? And why? Impossible questions, but in them lie the key to humanity’s survival.   Now, millions of miles away from home, a micrometeoroid storm has left us with a severely damaged ship, two deceased crew, and […]"},{"link":"https://nmac.to/blog/roadmap-planner-1-8/","image":"https://nmac.to/wp-content/uploads/2016/05/Roadmap.Planner1.png","title":"Roadmap Planner 1.8 – Strategic Planner, Product Ideas Accounting","content":"Roadmap Planner is your strategic communication tool to build your marketing, business development and product vision roadmap, and show off it to your team and stakeholders at a glance. It will take you where you want to be in one, five, or 10 years.   In our busy environment, every minute counts. You can continue […]"},{"link":"https://nmac.to/blog/movie-maker-3-2-1/","image":"https://nmac.to/wp-content/uploads/2016/08/Movie-Maker.png","title":"Movie Maker 3.2.1 – Time-lapse movie maker","content":"Movie Maker puts everything you need to tell your story in a movie, with a streamlined interface and intuitive workflow that let you enjoy your photos/videos like never before. Browse your image/video library, add background music & subtitle, use stunning Ken Burns & transition effects, create Hollywood-style movies, and quickly share your favorite moments online. […]"},{"link":"https://nmac.to/blog/heartslash-1-0/","image":"https://nmac.to/wp-content/uploads/2016/08/Heart..Slash_.png","title":"Heart&Slash 1.0 – Indie, Action & Adventure Game","content":"Heart&Slash is a 3D brawler that is set in a world where machines are all that remains from the Human civilization.   You play as Heart, an innocent robot fighting to escape the grip of the evil and all seeing machine QuAsSy (Quality Assurance Systems).   But make no mistake Heart&Slash is a hard game. […]"},{"link":"https://nmac.to/blog/disk-cleaner-1-6/","image":"https://nmac.to/wp-content/uploads/2016/08/Disk-Cleaner.png","title":"Disk Cleaner 1.6 – Monitor and clean disk regularly","content":"Disk Cleaner – Clean disk regularly, move folders regularly, free disk space.   How to use it: Drag or add folders to app. Setting folder task from menu.   Key features: Empty folder content regularly, save disk space. Copy folder content to target location regularly. Move folder content to target location regularly. Calculate folder size […]"},{"link":"https://nmac.to/blog/case-animatronics-1-0/","image":"https://nmac.to/wp-content/uploads/2016/08/CASE-Animatronics.png","title":"CASE: Animatronics 1.0 – A scary and challenging first-person stealth horror game","content":"Welcome to the police department, where late work can lead to tragic consequences. You’re a swamped with work detective – John Bishop who carries out his investigation till the late night. After a strange dream he gets awaken up by a mysterious call from an old “friend” and everything goes sideways.   The police department […]"},{"link":"https://nmac.to/blog/onlyoffice-4-0/","image":"https://nmac.to/wp-content/uploads/2016/08/ONLYOFFICE.png","title":"ONLYOFFICE 4.0 – Documents, spreadsheets and presentations editor","content":"ONLYOFFICE is an office suite that combines text, spreadsheet, and presentation editors which allow you to create, view, and edit documents stored on your Mac without an Internet connection.   Features One Pack – Three Editors – Multiple Features: Create, view and edit text documents, spreadsheets and presentations of any size and complexity. Compatibility with […]"},{"link":"https://nmac.to/blog/clip-1-2-3/","image":"https://nmac.to/wp-content/uploads/2016/08/Clip.png","title":"Clip 1.2.3 – Snippet Management","content":"Clip is designed for organizing your code snippets. Easy to learn and use. No complex configuration. Well design.   Integrated features You can create snippets, add tag and reference(any file or internet address related to the snippet) for the snippets. Quick access of all snippets. Smart code editor. Flexible size and beautiful themes.   Easy-To-Use […]"}]