[{"link":"https://nmac.to/blog/color-projects-professional/","image":"https://nmac.to/wp-content/uploads/2018/10/COLOR-projects-professional.png","title":"COLOR projects professional 6.63 – High-end colour filters for creative photographers","content":"COLOR projects professional offers unique and new possibilities to transform digital colour photographs into amazing works of art – with intelligent tools and an efficient and crystal clear workflow.   With 84 fine-tuned presets, 85 high-quality expert filters, 35 professional film emulations with Grain Engine and a perfectly tuned tonal value transformation, you can now create unique high-end results […]"},{"link":"https://nmac.to/blog/spectre/","image":"https://nmac.to/wp-content/uploads/2016/10/Spectre.png","title":"Spectre 1.9.6 – 20-tool real-time audio analyzer","content":"Spectre is the leading multi-instrument, real-time audio analyzer for OS X, packed with 20 different multi-channel and multi-trace meters including Level, VU, Spectrograph, Oscilloscope and Spectrogram.   Spectre makes metering as beautiful as it is useful. Design, speed, accuracy, and dependability are all central to Spectre’s design, placing it among the most powerful real-time analyzers […]"},{"link":"https://nmac.to/blog/akvis-enhancer/","image":"https://nmac.to/wp-content/uploads/2018/10/AKVIS-Enhancer.png","title":"AKVIS Enhancer 16.0 – Standalone app and Photoshop plug-in reveal image detail info","content":"AKVIS Enhancer is image enhancement software that improves detail on an image, no matter what was the cause of the unsharpness. It works in three modes: Improve Detail, Prepress, and Tone Correction. The main goal for these modes is the same – correction, but the methods and the results are quite different. Different photos require […]"},{"link":"https://nmac.to/blog/screen-recorder-hd/","image":"https://nmac.to/wp-content/uploads/2018/06/Easy-Screen-Recorder-HD.png","title":"Screen Recorder HD – 4K & 5K 2.1.2 – Record any kind of screen video","content":"Easy-to-Use Mac App for Recording Your Screen.   To get started, please follow the steps shown below:    1. Launch the app and a setting window will open.    2. Change the settings as you want:  Select a recording area. Change the output video resolution and frame rate. Choose a save path.  Check “Prevent computer […]"},{"link":"https://nmac.to/blog/daemon-tools/","image":"https://nmac.to/wp-content/uploads/2017/06/DAEMON-Tools6.png","title":"DAEMON Tools 6.3.419 – Create and mount disc images","content":"DAEMON Tools is a solution for mounting and creating CD/DVD/HDD disc images.   Access Options: Mount images in the following supported formats: *.b5t, *.b6t, *.bwt, *.ccd, *.cdi, *.bin/*.cue, *.ape/*.cue, *.flac/*.cue, *.iso, *.isz, *.mds/*.mdf, *.mdx, *.nrg, *.pdi, *.dmg, *.vhd. Use the list of mounted devices with images of all formats in Finder under Devices category View […]"},{"link":"https://nmac.to/blog/spotfiles/","image":"https://nmac.to/wp-content/uploads/2016/08/SpotFiles.png","title":"SpotFiles 3.0.19 – Find files without Spotlight","content":"SpotFiles is an advanced tool for files searching.   Does not use Spotlight engine. Saved Searches. File Attributes Viewer. Directory Snapshot and Comparison.   Version 3.0.19: Contact information Minor corrections   Intel, 64-bit processor OS X 10.9 or later    "},{"link":"https://nmac.to/blog/aiseesoft-pdf-converter/","image":"https://nmac.to/wp-content/uploads/2017/05/Aiseesoft-PDF-Converter-Pro.png","title":"Aiseesoft PDF Converter Pro 3.3.57 – PDF to TEXT/EPUB and more","content":"How to convert PDF to .jpg/.doc/.epub/.ppt/.png/.txt and more document or image formats? Use this all-in-one PDF converter!   With it, you can convert DPF to Word/Excel/Powerpoint/Image/Text/EPUB freely. Also, you can use it as a PDF reader to preview PDF files before converting.   Aiseesoft PDF Converter is powerful PDF converter software for Mac. It helps […]"},{"link":"https://nmac.to/blog/popcalendar/","image":"https://nmac.to/wp-content/uploads/2016/09/popCalendar.png","title":"popCalendar 1.8.7 – Calendar for the menu bar","content":"popCalendar is a tiny calendar that fits in your menu bar, giving you faster access to your timetable. A month-view lets you find the day or the date you need, while a click on a day lets you see all of its events. All of that without having to launch iCal!   Version 1.8.7: Minor […]"},{"link":"https://nmac.to/blog/stars/","image":"https://nmac.to/wp-content/uploads/2015/11/Stars.png","title":"Stars 5.1.2 – iTunes song rating app","content":"Rate the currently playing song in iTunes from your menu bar with a single click of the mouse. After enough songs are rated, you can use the data to create smart playlists that contains your most favorite music in iTunes.   Features: You can see the current song’s rating with a quick glance at the […]"},{"link":"https://nmac.to/blog/priime-styles/","image":"https://nmac.to/wp-content/uploads/2016/04/Priime.Styles.png","title":"Priime Styles 1.5.1 – Apply professional photo presets","content":"Priime Styles lets you apply professional photo presets created and used by the world’s best modern day photographers.   Features Featuring over 100 photo styles: Apply professional-grade photo styles (also known as presets or filters), which are created in collaboration with the world’s top photographers in the form of their photographic styles. All styles are […]"}]