[{"link":"https://nmac.to/blog/macaw-1-0-6/","image":"https://nmac.to/wp-content/uploads/2014/04/Macaw1.png","title":"Macaw 1.0.6 – The code-savvy web design tool","content":"Stop writing code. Start drawing it.   Macaw provides the same flexibility as your favorite image editor but also writes semantic HTML and remarkably succinct CSS. It’s time to expect more from a web design tool.   Fluid canvas and grid Macaw is engineered for fluid widths. Resize the canvas and your grids and elements […]"},{"link":"https://nmac.to/blog/diskaid-6-6-5/","image":"https://nmac.to/wp-content/uploads/2014/01/DiskAid.png","title":"DiskAid 6.6.5 – Use your iOS device as an external disk and more","content":"DiskAid is the ultimate transfer tool for accessing the iPod, iPhone or iPad directly from the desktop. Access data such as: music, video, photos, contacts, notes, call history, text messages (SMS), voicemail, and voice memos. With DiskAid you can also transfer files and folders betwen your iPhone, iPad or iPod touch and your computer and […]"},{"link":"https://nmac.to/blog/snipcode-1-1-1/","image":"https://nmac.to/wp-content/uploads/2014/04/SnipCode.png","title":"SnipCode 1.1.1 – Quickly tag, save, and access your snippets","content":"SnipCode is a productivity app that helps to organize, tag, and search snippets. It makes the developement process faster and more productive, reusing already developed code and keeping it always ready. Ease-of-use, speed, and a minimalist interface make SnipCode an app that you’ll love and use every day. It will be definitely your best development […]"},{"link":"https://nmac.to/blog/connect-2-0-2/","image":"https://nmac.to/wp-content/uploads/2014/03/Connect2.png","title":"Connect 2.0.2 – Phone calls using Bluetooth connection","content":"Connect App lets you make and receive phone calls from your Mac using a Bluetooth hands-free connection to your phone. You can access Connect through the OS X menu bar. Connect works with any modern smartphone and has the following great features: Type a name or number in the search bar and you will see […]"},{"link":"https://nmac.to/blog/isplash-color-photo-editor-3-4/","image":"https://nmac.to/wp-content/uploads/2014/04/iSplash.Color_.Photo_.Editor.png","title":"iSplash Color Photo Editor 3.4 – Adding focused color to grayscale images","content":"Get creative with the iSplash app! Choose any image and iSplash will turn it to grayscale. Then, choose any part of the image to restore the original color. Beautifully modify your pictures and create bold images that pack a punch!   iSplash supports PNG, JPEG, GIF, TIFF and BMP files.   Version 3.4: Loads of […]"},{"link":"https://nmac.to/blog/archive-expert-5-02/","image":"https://nmac.to/wp-content/uploads/2014/03/Archive.Expert.png","title":"Archive Expert 5.02 – File archive manager tool","content":"Archive Expert is a professional, full-featured file archive manager tool. It help you to Browse, Extract, Create, Modify, Split multiple file archives. View, preview files, show advanced file information inside archives.   EXTRACTION FORMATS zip, rar, 7z, lha, zipx, stufflt, hqx, bin, gzip, gz, tgz, tar-gz, bz2, bzip2, bz, txz, tar, iso, cdi, nrg, mdf, […]"},{"link":"https://nmac.to/blog/playback-1-8-17/","image":"https://nmac.to/wp-content/uploads/2014/04/Playback.png","title":"Playback 1.8.17 – Stream media to PS3, Xbox 360, and more","content":"Playback allows you to share your media with any Playstation 3, Xbox 360, or other UPnP compatible device. It automatically integrates with iTunes, iPhoto, Aperture, Adobe Lightroom 2 and 3, Photobooth, EyeTV, and more. You can share all content from these applications or choose specific playlists and albums.   Playback can also share media stored […]"},{"link":"https://nmac.to/blog/menupop-1-5/","image":"https://nmac.to/wp-content/uploads/2014/04/MenuPop.png","title":"MenuPop 1.5 – Access the menubar at current mouse location","content":"MenuPop enables you to pop up the main menu using a hot key or mouse button.   Features: Pop up menu at the current mouse location using a hot key or mouse button Selectable font size (small to super large) menu items Selectable menus to show: Apple menu and current application’s menu   Version 1.5: […]"},{"link":"https://nmac.to/blog/cloudpull-2-5-3/","image":"https://nmac.to/wp-content/uploads/2014/04/CloudPull.png","title":"CloudPull 2.5.3 – Seamlessly backup your Google account on your Mac","content":"CloudPull seamlessly backs up your Google account to your Mac. It supports Gmail, Google Contacts, Google Calendar, and Google Drive (formerly Google Docs). By default, the app performs backups every hour, and maintains old point-in-time snapshots of your accounts for 90 days.   CloudPull allows you to back up a single account for free. For […]"},{"link":"https://nmac.to/blog/code-collector-pro-1-7-1/","image":"https://nmac.to/wp-content/uploads/2014/04/Code.Collector.Pro_.png","title":"Code Collector Pro 1.7.1 – Store code snippets with ease","content":"Code Collector Pro is a storage app for code snippets. From HTML to Cocoa, C++ to Ruby, Code Collector Pro looks after all your code snippets, letting you quickly reference them whenever you want. With support for Smart Groups, Tagging, TextMate Bundles, integration with codecollector.net and more. Code Collector Pro is the best way to […]"}]