[{"link":"https://nmac.to/blog/secret-government/","image":"https://nmac.to/wp-content/uploads/2020/08/Secret-Government.png","title":"Secret Government 1.0.3.65 – Grand Strategy Political Game","content":"Secret Government is a grand strategy game about a secret society. Remaining unseen, they have been ruling mankind for hundreds of years. Your role will be not to just lead any particular country or region, but the Brotherhood: a centuries-old organization that works in the shadows and manipulates the entire world. Pull the strings of […]"},{"link":"https://nmac.to/blog/isubtitle/","image":"https://nmac.to/wp-content/uploads/2020/02/iSubtitle_3.png","title":"iSubtitle 3.4.6 – Soft subtitled movies for your Apple gear","content":"iSubtitle lets you create soft-subtitled movies for iPod, iPhone, iPad, Apple TV, iTunes or any AVFoundation/QuickTime-based player or app. It’s the first and only application to take full advantage of Apple’s soft-subtitle technology. The subtitle tracks are resolution-independent and rendered in real-time as you watch the movie. Subtitles are always displayed at the best quality […]"},{"link":"https://nmac.to/blog/fireplace-live-hd/","image":"https://nmac.to/wp-content/uploads/2013/11/Fireplace-Live-HD.png","title":"Fireplace Live HD 4.3.1 – High-quality fireplace videos","content":"Fireplace Live HD lets you turn your screen into a beautiful fireplace!Very relaxing to have running in the background while you work or rest.   We don’t all have the luxury of our own fireplace at home, but with Fireplace Live HD you can enjoy the visuals and sounds of a real fire anytime, at […]"},{"link":"https://nmac.to/blog/doubletake/","image":"https://nmac.to/wp-content/uploads/2017/08/DoubleTake2.png","title":"DoubleTake 2.6.8 – Stitch photos perfectly, with simple drag and drop","content":"DoubleTake is for Mac users who like compact cameras, but sometimes wish they could magically pull out a wide angle lens of their pocket, or plug in a sensor with a few extra megapixels for that large print.   DoubleTake handles this by giving you both automatic and manual control of how to stitch photos […]"},{"link":"https://nmac.to/blog/danger-scavenger/","image":"https://nmac.to/wp-content/uploads/2021/04/Danger-Scavenger.png","title":"Danger Scavenger 2.0.7.1 – Blow up, cut, shoot enemy robots on the roofs of skyscrapers","content":"Deadly efficient. Highly skillful. Invisible to indifferent citizens. They fight the greedy corporations that have entire nations under their thumb. Suits scornfully called them Scavengers.   It was they who first noticed that the situation turned around. And it’s an artificial intelligence A.I.O.N.E., who took over the control causing the machines to revolt against their […]"},{"link":"https://nmac.to/blog/trailblazers/","image":"https://nmac.to/wp-content/uploads/2021/08/Trailblazers.png","title":"Trailblazers 1.20577 – Co-op Action Racing Game","content":"Welcome to the Trailblaze Tournament! Get ready for high-speed thrills with an explosion of colour in Trailblazers, the first-ever second-to-second co-operative arcade racer. Paint the track as you go to dynamically change the racing line, boost on your team’s colour and outwit the opposition in a sprint for the finish. The more you paint, the […]"},{"link":"https://nmac.to/blog/behind-the-frame/","image":"https://nmac.to/wp-content/uploads/2021/08/Behind-the-Frame.png","title":"Behind the Frame 1.1.0.22 – Story Rich Casual Adventure Game","content":"Behind the Frame is a vivid, interactive fiction about an aspiring artist on the cusp of finishing the final piece of her gallery submission.   A relaxing, eloquent experience that can be played at any pace. Become immersed in a panoramic world filled with resplendent colors, beautiful hand-animated visuals, and a smooth, easy-listening soundtrack.    […]"},{"link":"https://nmac.to/blog/scythe/","image":"https://nmac.to/wp-content/uploads/2019/04/Scythe.png","title":"Scythe 1.7.14 – Alternate History & Strategy Board Game","content":"In an alternate reality in 1920s Europa, it’s been several years since the “Great War”, but the ashes of the conflict are still hot and the war is entering a new phase. The first conflict saw the emergence of some incredible engines of war known as Mechs. Built by “The Factory”, an independent city-state which […]"},{"link":"https://nmac.to/blog/townscaper/","image":"https://nmac.to/wp-content/uploads/2020/08/Townscaper.png","title":"Townscaper 1.0 – Sandbox Building & Simulation Game","content":"Build quaint island towns with curvy streets. Build small hamlets, soaring cathedrals, canal networks, or sky cities on stilts. Block by block.   No goal. No real gameplay. Just plenty of building and plenty of beauty. That’s it.   Townscaper is an experimental passion project. More of a toy than a game. Pick colors from […]"},{"link":"https://nmac.to/blog/colocalizer-pro/","image":"https://nmac.to/wp-content/uploads/2018/02/CoLocalizer-Pro.png","title":"CoLocalizer Pro 7.0.2 – Scientific calculator of colocalization coefficients","content":"CoLocalizer Pro is a pixel-based quantitative colocalization analysis software. It combines the power of its unique background correction tools with implementation of the already established algorithms to estimate colocalization quantitatively. CoLocalizer Pro software is leveraged by the leading scientific laboratories worldwide and is a de facto standard in this field of research.   Features Quantify […]"}]