[{"link":"https://nmac.to/blog/tuneskit-audio-capture/","image":"https://nmac.to/wp-content/uploads/2017/12/TunesKit-Audio-Capture.png","title":"TunesKit Audio Capture 2.5.0 – Capture any audio played on your Mac","content":"TunesKit Audio Capture is a smart audio grabber that can capture any sound you want on your Mac with one click only. It’s able to record streaming music, such as Apple Music, Spotify, etc., as well as other audio types, including radio stations, broadcasts, game music, etc., played online or from VLC, iTunes, QuickTime Player, […]"},{"link":"https://nmac.to/blog/audfree-audio-capture/","image":"https://nmac.to/wp-content/uploads/2018/07/AudFree-Audio-Capture.png","title":"AudFree Audio Capture 2.5.0 – Capture any audio played on your Mac","content":"AudFree Audio Capture is an audio recorder with the ability to capture any sound playing through all Mac apps, including Safari, Chrome, iTunes, QT, VLC and other local or web media players.    It is a good solution to record streaming music like Spotify, Pandora, Apple Music, YouTube, and live broadcasts, game music, online radios, […]"},{"link":"https://nmac.to/blog/anymp4-data-recovery/","image":"https://nmac.to/wp-content/uploads/2020/01/AnyMP4-Data-Recovery.png","title":"AnyMP4 Data Recovery 1.1.26 – Recover various data from computer and flash media drive/card","content":"AnyMP4 Data Recovery is the professional and safe data recovery software. It can help you restores almost all lost files like photos, documents, emails, audio, videos and more from computer drive, flash drive, memory card/stick on mobile phone or camera easily. Whether you lost files for deletion, format, etc., or your data are gone for […]"},{"link":"https://nmac.to/blog/tipard-dvd-cloner/","image":"https://nmac.to/wp-content/uploads/2020/01/Tipard-DVD-Cloner.png","title":"Tipard DVD Cloner 6.2.32 – Copy or compress DVD disc to DVD disc","content":"Tipard DVD Cloner for Mac is the fastest and easiest Mac DVD Copy software, which is capable of backup DVD disc to DVD disc, copy DVD disc to DVD folder/iso file and vice versa. It can compress DVD-9 to DVD-5 preserving the original quality with three copy modes – Full Copy, Main Movie and Customized. […]"},{"link":"https://nmac.to/blog/magical/","image":"https://nmac.to/wp-content/uploads/2022/01/MagiCal.png","title":"MagiCal 1.0.1 – Calendar with events e todos","content":"MagiCal, a single place to keep track both calendar events and time-based reminders, a beautiful calendar always accessible from your menu bar and an handy widget into your notification center.   Customizable calendar Thanks to many options, you can customize the calendar according to your needs, for example, you can choose whether to show the […]"},{"link":"https://nmac.to/blog/rh-timer/","image":"https://nmac.to/wp-content/uploads/2021/01/RH-Timer-PRO.png","title":"Timer RH PRO 2.10.2 – Take Control of Your Time","content":"Set the timer in one touch from status bar, just tap and drag.   If you play games or watch a serials, you will have to escape in any case, because the timer is displayed on top of other windows, even if you’re in full-screen mode.   You can choose a suitable sound for you […]"},{"link":"https://nmac.to/blog/transfer/","image":"https://nmac.to/wp-content/uploads/2020/07/Transfer_1.png","title":"Transfer 2.0.2 – Reliable and fully RFC-compliant TFTP server","content":"Transfer is a reliable and fully RFC-compliant TFTP server application. The perfect alternative to the built-in TFTP server on your Mac. It’s got everything you expect: real-time updates of current transfers in progress, support for broadcast requests, transfer history and basic root directory access control and file management. A feature rich TFTP server with a […]"},{"link":"https://nmac.to/blog/clicker-for-prime-video/","image":"https://nmac.to/wp-content/uploads/2021/09/Clicker-for-Prime-Video.png","title":"Clicker for Prime Video 1.7.0 – The best standalone Prime Video player","content":"No more switching between browser tabs. Simply launch Clicker for Prime Video straight from your dock and get your binge on.   Plus, with InstantStart technology, you will pick up right where you left off the last time you were watching. Hunting to find your show again is so early 2000s.   Picture-in-Picture Support With […]"},{"link":"https://nmac.to/blog/clicker-for-netflix/","image":"https://nmac.to/wp-content/uploads/2020/12/Clicker-for-Netflix.png","title":"Clicker for Netflix 2.13.0 – The best standalone Netflix player for Mac","content":"No more switching between browser tabs. Simply launch Clicker for Netflix straight from your dock and get your binge on.   Plus, with InstantStart technology, you will pick up right where you left off the last time you were watching. Hunting to find your show again is so early 2000s.   Features  Launch Netflix right […]"},{"link":"https://nmac.to/blog/magiplayer/","image":"https://nmac.to/wp-content/uploads/2022/01/MagiPlayer.png","title":"MagiPlayer 1.0.1 – An icon to rule them all","content":"A status bar icon that will revolutionize the way you control the playback of your preferred music player*   Single click to play/pause Double click to skip to next track Right click to open mini player   From the application preferences you can also enable a different operation mode to simple open the mini player […]"}]