[{"link":"https://nmac.to/blog/alarmey/","image":"https://nmac.to/wp-content/uploads/2018/11/Alarmey2.png","title":"Alarmey 2.0.3d – Convenient alarm manager","content":"Alarmey is a lighting fast alarm manager that is always one click away, in your menu bar.   You can use it in 3 quick and easy steps: Click on the + (or use hotkey) once – add a quick alarm. Click on the + (or use hotkey) twice – schedule an alarm. Click on […]"},{"link":"https://nmac.to/blog/barotrauma/","image":"https://nmac.to/wp-content/uploads/2020/06/Barotrauma.png","title":"Barotrauma Early Access 0.10.4.0 – 2D co-op submarine simulator","content":"Barotrauma is a 2D co-op survival horror submarine simulator, inspired by games like FTL: Faster Than Light, Rimworld, Dwarf Fortress and Space Station 13. It’s a Sci-Fi game that combines ragdoll physics and alien sea monsters with teamwork and existential fear.   EMBRACE THE ABYSS In the not too distant future, humanity has fled to […]"},{"link":"https://nmac.to/blog/into-a-dream/","image":"https://nmac.to/wp-content/uploads/2020/08/Into-A-Dream.png","title":"Into A Dream 1.0 – Story Rich 2D Adventure Game","content":"In Into A Dream you wake up in a mysterious place devoid of all your memories and come upon a recording addressed to you. As you listen to it, you realize that your mind has been linked to the dreams of a Luke Williams, a man diagnosed with severe depression. You are Luke’s last hope […]"},{"link":"https://nmac.to/blog/tab-voice-recorder-pro/","image":"https://nmac.to/wp-content/uploads/2020/08/Tab-Voice-Recorder-Pro.png","title":"Tab Voice Recorder Pro 1.4 – Record memos and notes","content":"Tab Voice Recorder is a brand new voice recorder with innovative graphics.   It has excellent sound quality and is very simple to use.   In just a few moments you will be ready to use it for work, school or fun.   Managing the audio tracks has been optimized in order to give users […]"},{"link":"https://nmac.to/blog/worms-w-m-d/","image":"https://nmac.to/wp-content/uploads/2016/08/Worms.W.M.D.png","title":"Worms W.M.D 1.0.0.193 – Classic turn-based strategy game","content":"The worms are back in their most destructive game yet. With a gorgeous, hand-drawn 2D look, brand new weapons, the introduction of crafting, vehicles and buildings plus the return of some much-loved classic weapons and gameplay, Worms W.M.D is the best worms experience ever.   Work your way through 30 campaign levels of increasing difficulty […]"},{"link":"https://nmac.to/blog/nice-timer/","image":"https://nmac.to/wp-content/uploads/2020/08/Nice-Timer.png","title":"Nice Timer 3.2.0d – Simple timer and stopwatch utility","content":"Nice Timer is the only app you really need when you need… a timer! You can use this beautiful app as a timer or as a stopwatch in one of 10 built-in styles and take advantage of many great features like infinitely resizable display, quick timers or customizable global hotkeys.   Features Customizable hotkeys Simple […]"},{"link":"https://nmac.to/blog/note-c/","image":"https://nmac.to/wp-content/uploads/2020/08/Note-C.png","title":"Note-C 2.0.7 – Versatile word processor with document-organization","content":"Note-C is a very simple application for collecting your notes, snippets, and any other pieces of text without limiting access to your entries, yet offering extensive export features. Saving your entries. Every single entry will be stored in a separate file and you can freely choose where your entries should be saved. All entries are […]"},{"link":"https://nmac.to/blog/clockey/","image":"https://nmac.to/wp-content/uploads/2020/08/Clockey.png","title":"Clockey 2.0.2d – World clock in the menu bar","content":"Clockey 2 is a world clock manager that lets you add time from as many time zones as you want to your menu bar. It has a clean and elegant design that makes managing and customizing your clocks a breeze.   Features: Quickly access any time zone at any time Add clocks to your favorites […]"},{"link":"https://nmac.to/blog/timey/","image":"https://nmac.to/wp-content/uploads/2019/03/Timey3.png","title":"Timey 3.3.5d – Simple, lightweight timer for your menu bar","content":"Timey 3 is a timer and stopwatch for your menubar. Click to start or pause, right-click to reset. Click on the settings button to change time, load a preset, customize global keyboard shortcuts and more   Features: Stopwatch and timer Full screen display Customizable timer presets Customizable global keyboard shortcuts Today View widget Ticking sound […]"},{"link":"https://nmac.to/blog/synergia/","image":"https://nmac.to/wp-content/uploads/2020/08/Synergia.png","title":"Synergia 1.01a – A Yuri Thriller Visual Novel Game","content":"Synergia is a yuri thriller visual novel that takes place in a cyberpunk future, wrapped up in a beautifully unique, vibrant neon aesthetic. At the end of the world, sometimes love is the ultimate crime.   Story Cila, a veteran cop with a sour outlook and anger issues expects nothing more from life besides the […]"}]