[{"link":"https://nmac.to/blog/photo-focus-movavi-1-0/","image":"https://nmac.to/wp-content/uploads/2016/08/Photo-Focus-Movavi.png","title":"Photo Focus Movavi 1.0 – Quick & Easy Image Blur","content":"Photo Focus Movavi is the perfect app for experimenting with creative blur. Inject mood and emotion into your photographs, add a tilt-shift effect, or put extra emphasis on the important elements.   Blur out the background or focus on large objects with the help of Portrait mode by moving the key points of the crosshair […]"},{"link":"https://nmac.to/blog/pdf-splitter-expert-2-2-2/","image":"https://nmac.to/wp-content/uploads/2016/08/PDF-Splitter-Expert.png","title":"PDF Splitter Expert 2.2.2 – An easy-to-use PDF splitting tool","content":"PDF Splitter Expert is an easy-to-use PDF splitting tool to help you quickly extract special pages or page ranges from large PDF files by splitting. It provides complete flexibility and user control in terms of how files are split.You can split multi-page PDF files flexibly by every n page(s), odd/even page,page ranges or split one […]"},{"link":"https://nmac.to/blog/ismartphoto-1-7-8/","image":"https://nmac.to/wp-content/uploads/2014/12/iSmartPhoto.png","title":"iSmartPhoto 1.7.8 – Image browser and powerful image organizer","content":"iSmartPhoto is a fast image browser and powerful image organizer. Unlike iPhoto, iSmartPhoto doesn’t require you to manually import photos – it automatically pulls your photos from any folder or drive. By just double clicking a single image in Finder or dragging a folder, iSmartPhoto automatically displays every image from the selected folder and its […]"},{"link":"https://nmac.to/blog/face4pass-1-17/","image":"https://nmac.to/wp-content/uploads/2016/08/Face4Pass.png","title":"Face4Pass 1.17 – Create photos for your documents","content":"Face4Pass is an application that allows you to easily create photos for your documents (i.e passport). Drag and drop or import an existing photo. Take a photo with the built-in iSight camera. Automatically improve the quality of the image. Edit many parameters of the image (exposure, contrast, saturation, temperature, tint, sharpness). For optimum sizing of […]"},{"link":"https://nmac.to/blog/word-air-1-6-1/","image":"https://nmac.to/wp-content/uploads/2016/08/Word-Air.png","title":"Word Air 1.6.1 – for Microsoft Word Edition & Open Office Format","content":"Word Air is a beautiful, easy-to-use text editor that is designed to make writing convenient, efficient and comfortable. Word Air is ease, fast and uncluttered. It starts up quickly, has a live word count, easy on the eyes and you can export all the common formats: .pdf, .rtf, .doc, .txt and more .   Features […]"},{"link":"https://nmac.to/blog/videoget-7-0-3-91/","image":"https://nmac.to/wp-content/uploads/2014/06/VideoGet.png","title":"VideoGet 7.0.3.91 – Download video clips from YouTube and similar sites","content":"VideoGet for Mac is a tool for OS for downloading your favorite video clips from more than 900+ video (YouTube-alike) websites. It supports such websites like YouTube, Vimeo, Google Video, Yahoo Video, VSocial and a lot more. Most of these video websites are keeping video in FLV format, and a lot of people don’t know […]"},{"link":"https://nmac.to/blog/tomatoes-2-3/","image":"https://nmac.to/wp-content/uploads/2016/08/Tomatoes.png","title":"Tomatoes 2.3 – Organize and improve your tasks to make your time more productive","content":"With Tomatoes you can organize your tasks, improve your efficiency and make your time more productive.   Tomatoes uses iCloud to sync beetwen your Macs and Tomatoes for iPhone.   Inspired by The Pomodoro Technique®, Tomatoes allows you to subdivide your tasks in activities, providing as many units of time are necessary for their realization. […]"},{"link":"https://nmac.to/blog/housekeeper-1-0/","image":"https://nmac.to/wp-content/uploads/2016/08/housekeeper.png","title":"Housekeeper 1.0 – Manage houses and the items inside","content":"Housekeeper is an application for managing your houses and apartments and items inside. You can create more than one houses or apartments, and there is no limitation. Under houses or apartments,you can create rooms such as: living room, dinning room etc.   You can manage every item inside your houses or apartments, managing model, maker,price […]"},{"link":"https://nmac.to/blog/fast-motion-clipper-1-0/","image":"https://nmac.to/wp-content/uploads/2016/08/Fast-Motion-Clipper.png","title":"Fast Motion Clipper 1.0 – Make your video files faster","content":"Fast Motion Clipper allows you to make your video files faster. This app supports files .Mov, .Mp4 and .3gp.   This app has three options for your video files: 1) Make a full video faster.   2) Clip a section of video that you want to make faster and save just that clip. For example, […]"},{"link":"https://nmac.to/blog/exporter-for-address-book-1-3/","image":"https://nmac.to/wp-content/uploads/2016/08/Exporter-for-Address-Book.png","title":"Exporter for Address Book 1.3 – Convert to Excel, CSV, XML and More","content":"Exporter for Address Book is the perfect tool for exporting your local address book stored on your Mac to formats such as Excel, CSV, Tab-delimited text, HTML and XML.   The app lets you choose which properties your export from your address book, allowing you to select only the information you want to export into […]"}]