[{"link":"https://nmac.to/blog/ink2go/","image":"https://nmac.to/wp-content/uploads/2017/01/Ink2Go.png","title":"Ink2Go 1.9.1 – Screen annotation and recording solution for presentations [FIX]","content":"Ink2Go is a screen annotation and recording solution that lets you write on top of your active desktop applications in real time. Save your annotations as image files or even record the entire annotation process as a sharable video!   Features Stylish and Precise Presentations Illustrate your ideas during live sessions Create informative video tutorials […]"},{"link":"https://nmac.to/blog/hasher/","image":"https://nmac.to/wp-content/uploads/2021/12/Hasher.png","title":"Hasher 1.4 – MD5, SHA1, SHA2, and more","content":"Hasher is easy to use file hash generation and comparison utility.   It supports wide range of hash functions including MD5, SHA1, SHA2, etc.   Version 1.4: Native support for Apple Silicon architecture   Intel, 64-bit processor OS X 10.9 or later    "},{"link":"https://nmac.to/blog/murasaki/","image":"https://nmac.to/wp-content/uploads/2021/11/Murasaki.png","title":"Murasaki 2.4.1 – EPUB Reader","content":"Murasaki is an EPUB reader application that has simple user interfaces and various features (CANNOT open DRM-encrypted EPUBs)   Key Features:   Scrolling Murasaki is a scroll-based reader like usual web browers, not a page flip-based reader like iBooks.   Pagination View Mode (horizontal writing mode only) Murasaki supports the pagination view mode. This is […]"},{"link":"https://nmac.to/blog/lens-island/","image":"https://nmac.to/wp-content/uploads/2021/12/Lens-Island.png","title":"Len’s Island 1.0 – Build, fight, farm and explore","content":"You’re new to town, with only the tools in your backpack and a can-do attitude you build a new life for yourself on the beautiful island nearby.    Unravel the dark secrets the island holds as you venture deeper into the caves to search for what past travellers have sought after.   Len’s Island is […]"},{"link":"https://nmac.to/blog/lego-builders-journey/","image":"https://nmac.to/wp-content/uploads/2020/12/Lego_Builders_Journey_2.png","title":"Lego Builders Journey 2.0.1 – Create your own lego path","content":"Step through levels brick by brick with puzzles that ask us to sometimes follow the instructions… and sometimes to be creative and break the rules.   Builder’s Journey is a poetic puzzle that takes place in a LEGO brick world, brought to life with the most accurately rendered LEGO elements yet to feature on screens. […]"},{"link":"https://nmac.to/blog/jars/","image":"https://nmac.to/wp-content/uploads/2021/12/Jars.png","title":"Jars 1.0.1110 – Tower Defense Puzzle Game","content":"There are more things in that book, Victor, than are dreamt of in your philosophy.   Join Victor’s bizarre adventure in the family basement. Discover enormous minions and dangerous nasties hidden in the shadows of the cellar. What shady secrets are buried under the house? Why are some pages in this mysterious book missing? And […]"},{"link":"https://nmac.to/blog/movavi-academic/","image":"https://nmac.to/wp-content/uploads/2020/04/Movavi-Academic-2021.png","title":"Movavi Academic 2022 22.0.0 – Craft educational videos in minutes","content":"Movavi Academic provides teachers and students with a powerful tool for making comprehensive educational videos. Enrich the entire learning experience and take your classroom to the next level with our video-editing software for schools.   Teacher Provide Visual Instruction  Explain new topics and different concepts through videos for teaching. Use visuals to grab students’ attention […]"},{"link":"https://nmac.to/blog/megaquarium/","image":"https://nmac.to/wp-content/uploads/2019/01/Megaquarium.png","title":"Megaquarium 3.0.5g – A theme park management tycoon game","content":"From the creator of Big Pharma comes a brand new economic simulation game. Megaquarium follows in the footsteps of classic theme park management tycoon games and adds an aquatic spin!   A living simulation Starting with just a few tanks and the most basic of livestock, you’ll grow your aquarium to a thronging metropolis filled […]"},{"link":"https://nmac.to/blog/undead-horde/","image":"https://nmac.to/wp-content/uploads/2019/06/Undead-Horde.png","title":"Undead Horde 1.2.0 – A necromantic action & adventure game","content":"Become a necromancer and raise the dead – Undead Horde is a necromantic action game with elements from RPG, strategy and hack’n’slash. You’ll battle against the living who’ve driven the necromancers and their undead minions into exile. You’ll re-animate all kinds of creatures and build an army of up to 100 undead. Your army follows […]"},{"link":"https://nmac.to/blog/terraforming-mars/","image":"https://nmac.to/wp-content/uploads/2021/12/Terraforming-Mars.png","title":"Terraforming Mars 1.3000 – Strategy Board Game","content":"Corporations are competing to transform Mars into a habitable planet by spending vast resources and using innovative technology to raise temperature, create a breathable atmosphere, and make oceans of water. As terraforming progresses, more and more people will immigrate from Earth to live on the Red Planet.    In Terraforming Mars, you control a corporation […]"}]