[{"link":"https://nmac.to/blog/excel2plist-3-1-0/","image":"https://nmac.to/wp-content/uploads/2016/07/Excel2Plist.png","title":"Excel2Plist 3.1.0 – Convert (.xls and .xlsx) documents into .plist files","content":"Excel2Plist is a lightweight conversion tool to help developers to improve development efficiency. You can convert your datas or configuration from excel(.xls and .xlsx) document into .plist file or .sqlite database quickly when you develop iOS or Android Apps. And also it will generate corresponding access codes by Objective-C and Java. You just need to […]"},{"link":"https://nmac.to/blog/watts-2-0-2/","image":"https://nmac.to/wp-content/uploads/2016/09/Watts.png","title":"Watts 2.0.2 – Recalibration tool for laptop batteries","content":"Watts is a MacBook® battery management and calibration assistant tool. It’s a menu bar app that, apart from the usual battery information (power source used, current battery charge and remaining time), provides advanced data to obtain the maximum performance of your MacBook® battery.   Your battery needs to be calibrated from time to time to […]"},{"link":"https://nmac.to/blog/videotoolbox-1-0-19/","image":"https://nmac.to/wp-content/uploads/2015/09/VideoToolbox.png","title":"VideoToolbox 1.0.19 – Set of video tools for both novices and professionals","content":"VideoToolbox is a set of MP4 an d M4V tools made for both novices and professionals. This app allows you to easily access all your tools in a beautiful and clear interface. You no longer need to launch Quicktime X or Final Cut Pro to simply extract a picture or change the resolution. VideoToolbox will […]"},{"link":"https://nmac.to/blog/photo-size-optimizer-1-71/","image":"https://nmac.to/wp-content/uploads/2016/09/Photo-Size-Optimizer.png","title":"Photo Size Optimizer 1.71 – Powerful photo resizer and optimizer app","content":"Photo Size Optimizer is a powerful photo resizer and optimizer. It optimizes all photos by 80% ~ 20% comparing to originals while keeping original resolution, quality and png, jpg, gif formats. With Photo Size Optimizer, you can save huge space and share full-resolution photos with your friends much faster.   Photo Size Optimizer also supports […]"},{"link":"https://nmac.to/blog/command-center-1-2/","image":"https://nmac.to/wp-content/uploads/2016/07/Command.Center.png","title":"Command Center 1.2 – Minimalist multi-utility app","content":"Command Center (was Control Center) is a new utility app for macOS, inspired by Control Center. We’ve created a beautiful tool designed to let you control and monitor most aspects of your Mac. It is a panel that auto-hides on the side of the screen, and is activated by mouse (like the Dock). The panel […]"},{"link":"https://nmac.to/blog/wireless-signal-2-1/","image":"https://nmac.to/wp-content/uploads/2016/03/Wireless.Signal.png","title":"Wireless Signal 2.1 – Get fast and precise info about your system Wi-Fi connection","content":"Wireless Signal is a system status bar application that allows easily identify all WiFi-related connectivity and poor performance issues.   Provides easy access to all Wi-Fi connection details as: wi-fi network name (SSID) wi-fi router mac address (BSSID) occupied channel transmit rase (RSSI) noise level signal-to-noise ratio (SNR) network security level user ip address   […]"},{"link":"https://nmac.to/blog/wondershare-pdf-creator-1-1-0/","image":"https://nmac.to/wp-content/uploads/2016/11/Wondershare-PDF-Creator.png","title":"Wondershare PDF Creator 1.1.0 – Create PDF files from MS Office docs","content":"Wondershare PDF Creator is a professional PDF tool for the creation of high-quality PDF files.   Features Comprehensive Support for Office Documents – Support creating PDFs from both old and new office formats, such as DOCX, DOC, XLSX, XLS,PPTX, and PPT. High-Efficienct Batch PDF Creation – Faster service that saves your time when doing PDF […]"},{"link":"https://nmac.to/blog/tab-launcher-2-9-4/","image":"https://nmac.to/wp-content/uploads/2013/12/Tab-Launcher.png","title":"Tab Launcher 2.9.4 – Clean up and organize the Dock","content":"The idea of Tab Launcher is not to replace the system’s dock, but to help keep it clean, with only the applications that are currently running.   By removing all the application from the dock and organizing them on tabs, you can quickly find and run any application you want.   Apart from that, you […]"},{"link":"https://nmac.to/blog/bundle-for-iwork-5-1/","image":"https://nmac.to/wp-content/uploads/2016/09/Bundle-for-iWork.png","title":"Bundle for iWork 5.1 – Pages, Numbers, and Keynote templates","content":"Bundle for iWork provides you with unique designs for Pages documents, spreadsheet templates for Numbers, first-class slideshow themes for Keynote, and images for illustrating your content. All templates are available in the US and international paper sizes.   Version 5.1: New 90 Pages, 5 Numbers templates.   Intel, 64-bit processor OS X 10.12 or later […]"},{"link":"https://nmac.to/blog/radioapp-1-1-2/","image":"https://nmac.to/wp-content/uploads/2016/10/RadioApp.png","title":"RadioApp 1.1.2 – Listen to radio stations from all over the world","content":"RadioApp – Listen to radio stations from all over the world. Choose your favorites from our selection of over 28,000 stations and even more to come.   You have an iOS device? Excellent! RadioApp synchronizes your favorite stations via iCloud and supports Apples Handoff technology. The same is true if you use RadioApp on multiple […]"}]