[{"link":"https://nmac.to/blog/text-extractor/","image":"https://nmac.to/wp-content/uploads/2019/05/Text-Extractor.png","title":"Text Extractor 1.6.0 – Extract text contents from image or scanned PDF with OCR","content":"Text Extractor helps you turn scanned PDF documents and images into searchable and editable text content. It can eliminate your retyping effort by the advanced OCR (optical character recognition) technology, which can recognize text from images accurately and extract text content efficiently.   Why you need Text Extractor  When you scan a paper document using […]"},{"link":"https://nmac.to/blog/nite-team-4/","image":"https://nmac.to/wp-content/uploads/2019/05/Nite-Team-4.png","title":"Nite Team 4 1.0.7 – Simulation Strategy & Adventure Hacking Game","content":"Discover the universe of hacking and cyber warfare with NITE Team 4. Version 1.0 of the games includes more than 70 missions and operations broken down into various categories for every level of player   Training Boot Camp The academy will help you learn all the basics you need to become a proficient hacker in […]"},{"link":"https://nmac.to/blog/aer-memories-of-old/","image":"https://nmac.to/wp-content/uploads/2017/10/AER.Memories.of_.Old_.png","title":"AER Memories of Old 1.0.4 – An adventure game in the truest sense","content":"The gods of old are forgotten, lost in the events that shattered the world, leaving only fragments of islands in the sky. This mystic world of endless skies, colorful islands and ancient ruins is in danger of falling into darkness. As one of the last few shapeshifters, you are sent on a pilgrimage to the […]"},{"link":"https://nmac.to/blog/sundered/","image":"https://nmac.to/wp-content/uploads/2017/07/Sundered.png","title":"Sundered: Eldritch Edition 29.04.2019 – A horrifying fight for survival game","content":"Sundered is a horrifying fight for survival and sanity, a hand­-drawn epic from the creators of Jotun. It is a replayable metroidvania where you resist or embrace ancient eldritch powers. You play Eshe, a wanderer in a ruined world, trapped in ever-­changing caverns filled with hordes of terrifying enemies. Harness the power of corrupted relics […]"},{"link":"https://nmac.to/blog/nippon-marathon/","image":"https://nmac.to/wp-content/uploads/2019/05/Nippon-Marathon.png","title":"Nippon Marathon 1.02 – A crazy, physics-driven, four-player party racing game","content":"San! Ni! Ichi! Hajime!!! Stretch your muscles and embark upon the ultimate marathon of Japan in a raucous ragdoll party multiplayer racer where anything can happen. Hurdle barrels, outrun Shiba Inu and dive out of the paths of bicycles – all while chucking fruit at your opponents and dashing across planks precariously balanced over waterfalls […]"},{"link":"https://nmac.to/blog/jotun/","image":"https://nmac.to/wp-content/uploads/2015/10/Jotun.Valhalla.Edition.png","title":"Jotun: Valhalla Edition 29.04.2019 – A hand-drawn exploration game set in Norse mythology","content":"In Jotun, you play Thora, a Viking warrior who died an inglorious death and must prove herself to the Gods to enter Valhalla.   Explore vast regions of Norse Purgatory to find runes to unleash the jotun, giant Norse elementals. Fight them using only your massive two-handed axe, the blessings of the Gods and your […]"},{"link":"https://nmac.to/blog/door-kicker/","image":"https://nmac.to/wp-content/uploads/2014/11/Door-Kickers.png","title":"Door Kicker 1.1.5 v2 – Tactical analysis strategy game","content":"Door Kickers is an innovative realtime strategy game that puts you in charge of a SWAT team and lets you command them during a tactical intervention.   Analyze the situation, plan team routes, choose equipment and breach points and coordinate multiple troopers to reach the hostage room before the bad guys get to press that […]"},{"link":"https://nmac.to/blog/empires-of-the-undergrowth/","image":"https://nmac.to/wp-content/uploads/2019/05/Empires-of-the-Undergrowth.png","title":"Empires of the Undergrowth 0.202 – Ant colony management game","content":"“Your queen has set up home beneath a rotting log. She is fat, and vulnerable. Her first brood will need to move quickly if the colony is to survive. Their priority now is to find food, and there is plenty around; but there are other hungry creatures in the undergrowth. The workers will need to […]"},{"link":"https://nmac.to/blog/duke-nukem-forever/","image":"https://nmac.to/wp-content/uploads/2019/05/Duke-Nukem-Forever.png","title":"Duke Nukem Forever 1.01 – Sci-fi Aliens Action & Shooter Game","content":"Duke Nukem arrives with an arsenal of over-the-top weapons, non-stop action, and unprecedented levels of interactivity. With hours and hours of action, and a range of bodacious multiplayer modes, rest assured knowing the fun goes on and on.   Story Did the Aliens not learn their lesson the first time? Duke has been on hiatus […]"},{"link":"https://nmac.to/blog/sunless-sea/","image":"https://nmac.to/wp-content/uploads/2018/03/Sunless-Sea.png","title":"Sunless Sea 2.2.7.3165 – Exploration & Survival Game","content":"Take the helm of your steamship and set sail for the unknown! Sunless Sea is a game of discovery, loneliness and frequent death, set in the award-winning Victorian Gothic universe of Fallen London.   If the giant crabs, sentient icebergs and swarms of bats don’t get you, madness and cannibalism certainly will. But that old […]"}]