[{"link":"https://nmac.to/blog/cloudmagic-email-7-7-33/","image":"https://nmac.to/wp-content/uploads/2016/01/CloudMagic.png","title":"CloudMagic Email 7.7.33 – One app for all of your email accounts","content":"CloudMagic is the perfect app to handle your email accounts.   Instant push notifications for ALL types of email accounts: Gmail, Exchange, Yahoo, Outlook, iCloud, Google Apps, Office 365, IMAP – you name it! Supports all versions of Exchange: ActiveSync (EAS), EWS and IMAP. Handoff: Effortlessly hand off what you’re doing on iPhone, iPad or […]"},{"link":"https://nmac.to/blog/cisdem-contactmanger-2-0-0/","image":"https://nmac.to/wp-content/uploads/2016/02/ContactManager.png","title":"Cisdem ContactManger 2.0.0 – Manage and backup contacts in one place","content":"Cisdem ContactManger is a fresh start for your contacts. Unlike Apple’s Contacts application, you can easily backup all of the Contacts, edit the Contacts fields, find, conduct analyses, and create reports. It fixes dozens of problems with OS X’s Contacts and lets you export to CSV, vCard, TXT, Docx, HTML, Excel, Numbers, and Pages format […]"},{"link":"https://nmac.to/blog/watch-this-1-2/","image":"https://nmac.to/wp-content/uploads/2016/01/Watch-This.png","title":"Watch This 1.2 – The new way to watch your movies and TV shows","content":"Because a video player should do more than just play videos. Watch This automatically organizes your movies and TV shows, tracks what you’ve watched and notifies you when new episodes from your favorite shows are available.   Nothing to watch right now? Watch This also has support for streaming sites like Twitch.tv as well as […]"},{"link":"https://nmac.to/blog/imposition-wizard-2-6-2/","image":"https://nmac.to/wp-content/uploads/2016/02/Imposition-Wizard.png","title":"Imposition Wizard 2.6.2 – Create books, booklets and brochures; standalone app","content":"Imposition Wizard is imposition software for Mac OS X. It reads PDF files, applies transformations to pages and saves the results to another PDF file. You can create booklets and books, prepare business cards for print and much, much more. All the power is packed into a simple user interface that allows you to see […]"},{"link":"https://nmac.to/blog/foldingtext-2-1-2/","image":"https://nmac.to/wp-content/uploads/2016/02/FoldingText.png","title":"FoldingText 2.1.2 – Markdown text editor with productivity features","content":"For Mac users who love plain text. FoldingText is the markdown text editor with productivity features. Unlike other editors, FoldingText does outlining, todo lists, and more.   Simple Plain text Outline formatting Fold and Focus to see   Surprisingly Adept Live formatting Scripts, themes, and plugins Plain text productivity platform   Version 2.1.2: Fixed drag-and-drop […]"},{"link":"https://nmac.to/blog/emulsion-1-3-4/","image":"https://nmac.to/wp-content/uploads/2015/06/Emulsion.png","title":"Emulsion 1.3.4 – Photo library catalog","content":"Emulsion is a new photo catalog app. Emulsion can adjust exposure, colors, and almost everything else. You can also add gradients to your images to darken skies, or even add dust and scratches for a cool retro look. Emulsion can apply adjustments, effects, and metadata changes to one or hundreds of images at once. Want […]"},{"link":"https://nmac.to/blog/basejump-1-3-2/","image":"https://nmac.to/wp-content/uploads/2016/02/Basejump.png","title":"Basejump 1.3.2 – A base64 encoding tool","content":"Basejump is a base64 encoding tool which will help you to manage your css,html… files and the associated images.   Drag & Drop your images Easy Access the base64 string ( Raw or as Data Uri) by clicking on the table cell Combine the images as base64 string with css,html … files including the @BaseJump{YOUR_KEY}. […]"},{"link":"https://nmac.to/blog/statscenter-1-3/","image":"https://nmac.to/wp-content/uploads/2016/02/StatsCenter.png","title":"StatsCenter 1.3 – Monitor system statistics","content":"StatsCenter is a fantastic and comprehensive tool for your Mac that lets you monitor real time system statistics. The app runs as a widget under the Today view tab of your Mac’s Notification Center.   Features With StatsCenter, you get real time system stats (with full Retina support) for the following wide array of modules: […]"},{"link":"https://nmac.to/blog/layers-of-fear-1-0/","image":"https://nmac.to/wp-content/uploads/2016/02/Layers.of_.Fear_.png","title":"Layers of Fear 1.0 – A first-person psychedelic horror game","content":"You take another drink as the canvas looms in front of you. A light flickers dimly in the corner. You’ve created countless pieces of art, but never anything like…this. Why haven’t you done this before? It seems so obvious in retrospect. Your friends, critics, business partners—soon, they’ll all see. But something’s still missing…   You […]"},{"link":"https://nmac.to/blog/toycamera-analogcolor-0-8-8/","image":"https://nmac.to/wp-content/uploads/2016/02/Toycamera.Analogcolor.png","title":"Toycamera AnalogColor 0.8.8 – Make digital images appear like analog with Polaroid frames","content":"Toycamera AnalogColor is a photo editing tool that lets you add Polaroid frames and analog effects to digital photos.   Version 0.8.8: Added “Color” setting on Vintage mode. Fixed some bugs on Mac OS X   Intel, 64-bit processor OS X 10.7 or later    "}]