[{"link":"https://nmac.to/blog/favoriteapps-102/","image":"https://nmac.to/wp-content/uploads/2013/12/FavoriteApps.jpg","title":"FavoriteApps 1.0.2 – Quick access to your favorite applications","content":"This app created in the dock a menu of your selected programs. This means you always looking for a quick access to your favorite applications without long search in the Application folder ior LunchPad. Features:  Create our own favorite App menu in the dock with drag and drop  Sort your favorite applications menu by name  […]"},{"link":"https://nmac.to/blog/mixtab-pro-10/","image":"https://nmac.to/wp-content/uploads/2013/12/mac-icon.175x175-751.jpg","title":"Mixtab Pro 1.0 – Beautiful, easy-to-use RSS Reader","content":"We created Mixtab Pro, because we believe in RSS as an open standard, and that there is plenty of innovation left in the RSS space.   Easy import from Google Reader – Supports OPML file RSS import – Add all your RSS feeds from one OPML file ( Add feed > Upload OPML ) – […]"},{"link":"https://nmac.to/blog/torchlight/","image":"https://nmac.to/wp-content/uploads/2013/06/Torchlight.png","title":"Torchlight 1.15 – Action role playing game","content":"Torchlight is the boomtown where lies the Ember. Ember is the essence of magic and the keystone of alchemy; it lures the restless with promises of power and riches. Miners burrowed deep beneath the dirt streets of Torchlight, discovering veins of the ore richer than any found in living memory- but they were not the […]"},{"link":"https://nmac.to/blog/the-cave/","image":"https://nmac.to/wp-content/uploads/2013/12/Cave.png","title":"The Cave 1.0 – Wonderful Adventure Game ‘Mac Edition’","content":"The Cave is a new adventure game from Monkey Island and Maniac Mansion creator Ron Gilbert, and Double Fine Productions, the award-winning studio behind Psychonauts and Brütal Legend. Assemble your team of three from seven unlikely adventurers, each with their own unique personalities and stories,   then descend into the mysterious depths to explore locations […]"},{"link":"https://nmac.to/blog/izip-26/","image":"https://nmac.to/wp-content/uploads/2013/12/iZip.175x175-751.jpg","title":"iZip 2.6 – Application for managing archives","content":"iZip is the easiest way to manage .ZIP, .ZIPX and .RAR archives on your Mac, and best of all it’s completely free! When you open an archive with iZip it appears as a removable disk. This allows management of your files right inside the OS X Finder, all view modes including cover-flow just work. For […]"},{"link":"https://nmac.to/blog/macfonts-techfonts-12/","image":"https://nmac.to/wp-content/uploads/2013/12/Font_Installer.175x175-75.png","title":"MacFonts-TechFonts 1.2 – MacFonts Tech Collection","content":"A premier collection of 10 futuristic and digital style fonts, including a personal AND commercial use license for a single user so you can use the fonts in any home, business or for-profit project. All fonts are available in OpenType format and work in all applications including Quark, Illustrator, Photoshop, Microsoft Office, iLife, iWork, Pixelmator […]"},{"link":"https://nmac.to/blog/cm-text-cabinet-104/","image":"https://nmac.to/wp-content/uploads/2013/12/CM_Text_Cabinet.175x175-75.jpg","title":"CM Text Cabinet 1.0.4 – Store text snippets in one place","content":"CM Text Snippets is a small app which allows you to store all your snippets of text into one central location instead of having multiple stickies all around.  It can be used to store important information, shopping list, programming codes or anything you want to remember in one place. WHAT’S NEW Version 1.0.4: Updated engine […]"},{"link":"https://nmac.to/blog/wake-up-time-pro-121/","image":"https://nmac.to/wp-content/uploads/2013/06/Wake-Up-Time-Pro.png","title":"Wake Up Time Pro 1.2.1 – Customizable alarm clock","content":"Wake Up Time Pro is a handcrafted, simple-to-use alarm clock. It has everything you need for use on a daily basis.   Features: Realistic LCD nicely displays the current time and the day of the week. Enjoy lot of default alarm sounds. Add custom sounds at your choice. Wake up to your favorite tunes. Main […]"},{"link":"https://nmac.to/blog/echofon-180/","image":"https://nmac.to/wp-content/uploads/2013/12/echofon_mac_icon.175x175-75.jpg","title":"Echofon 1.8.0 – Syncs unread Tweets with your iPhone","content":"The Echofon interface was carefully designed to be comfortably left open all day. It stays out of the way when necessary and expands to support all the advanced features you need, when you need them.   Easily attach photos to your tweets with drag-and-drop. You can also attach screen captures, current iTunes song, or current […]"},{"link":"https://nmac.to/blog/snapseed-121/","image":"https://nmac.to/wp-content/uploads/2013/12/41477.jpg","title":"Snapseed 1.2.1 – Enhance, transform and share your photos","content":"Snapseed for Mac OS is the only photo app you’ll want to use every day! It makes any photograph extraordinary with a fun high-quality photo experience right on the desktop. Anyone can enhance, transform, and share their photos with ease using incredibly advanced features from the leader in digital photography software! Benefits: Easily adjust your […]"}]