[{"link":"https://nmac.to/blog/sayonara-wild-hearts/","image":"https://nmac.to/wp-content/uploads/2020/08/Sayonara-Wild-Hearts.png","title":"Sayonara Wild Hearts 1.0.1 – Casual Action & Musical Game","content":"Sayonara Wild Hearts is a dreamy arcade game about riding motorcycles, skateboarding, dance battling, shooting lasers, wielding swords, and breaking hearts at 200 mph.   As the heart of a young woman breaks, the balance of the universe is disturbed. A diamond butterfly appears in her dreams and leads her through a highway in the […]"},{"link":"https://nmac.to/blog/umbrella/","image":"https://nmac.to/wp-content/uploads/2019/07/Umbrella.png","title":"Umbrella 1.1.2 – Duplicate file prevention tool","content":"Umbrella is a prevention tool that reports the duplicates the moment they are created.   Prevention is better than cure.: Umbrella reports the duplicates the moment they are created. Forget the boring job of dealing with huge results when using a standard duplicate tool. Umbrella is the only duplicate-prevention tool available on the market. It […]"},{"link":"https://nmac.to/blog/smallimage/","image":"https://nmac.to/wp-content/uploads/2017/09/SmallImage.png","title":"SmallImage 2.5 – Smart PNG and JPEG compression","content":"Smart PNG and JPEG compression   Optimize your images with a perfect balance in quality and file size.   Uses smart lossy compression techniques to reduce the file size of your PNG files. By selectively decreasing the number of colors in the image, fewer bytes are required to store the data. The effect is nearly […]"},{"link":"https://nmac.to/blog/copyem-paste/","image":"https://nmac.to/wp-content/uploads/2017/10/Copyem-Paste2.png","title":"Copy’em 2.8.3 – Powerful clipboard menulet for copy & paste","content":"Copy’em is a resourceful menulet that makes tedious copy/paste operations super easy and fast! It remembers the things you copy (text, images, screenshots, files, etc.), and lets you quickly recall and paste them, right where your mouse cursor is. Use it to recover lost clippings, do bulk copying/pasting, or collect favorite clippings just by using copy […]"},{"link":"https://nmac.to/blog/video-converter-deluxe/","image":"https://nmac.to/wp-content/uploads/2020/08/Video-Converter-Deluxe.png","title":"Video Converter Deluxe 2.1.1 – Convert all popular video formats in one app","content":"Video Converter Deluxe can convert both DVD and all popular video formats in one app. You not only can convert the video files into other formats, such as MOV, FLAC, MP3, MP4, WMA, FLV, AVI, PSP and so on, but also can rip the DVD movies into the video or audio in any formats you […]"},{"link":"https://nmac.to/blog/audio-record-studio/","image":"https://nmac.to/wp-content/uploads/2020/08/Audio-Record-Studio.png","title":"Audio Record Studio 2.1.1 – Professional Mac audio recorder","content":"Want to listen to your favorite songs, radio programs and audio from video anytime and without needing an internet connection? Just record these streaming audios with the professional Mac audio recorder. Audio Record Studio is the best ever Mac version Audio Recorder, which empowers you the ability to record any online music and radio programs […]"},{"link":"https://nmac.to/blog/earthx/","image":"https://nmac.to/wp-content/uploads/2020/08/EarthX_2.png","title":"EarthX Early Access 0.3.1.1 – 3D Simulation & Strategy Game","content":"EarthX is a game that focuses mainly on managing your own private space company. You will have to develop better and better rockets, fight for contracts with competitors, and develop your company to the highest levels. This space company simulator, which has been under development for over a year, has a nice graphic design and […]"},{"link":"https://nmac.to/blog/spiritfarer/","image":"https://nmac.to/wp-content/uploads/2020/08/Spiritfarer.png","title":"Spiritfarer 32137c – A cozy adventure & management game","content":"Spiritfarer is a cozy management game about dying. You play Stella, ferrymaster to the deceased, a Spiritfarer. Build a boat to explore the world, then befriend and care for spirits before finally releasing them into the afterlife. Farm, mine, fish, harvest, cook, and craft your way across mystical seas. Join the adventure as Daffodil the […]"},{"link":"https://nmac.to/blog/doo/","image":"https://nmac.to/wp-content/uploads/2016/06/Doo.png","title":"Doo 2.4.0 – Turn your reminders into cards that help you focus","content":"Doo – Get Things Done   Turn your reminders into cards that help you focus and teach you better habits. Work small to achieve big.   Featured by Apple as one of the Best New Apps on iOS   FEATURES A unique, card-based interface Beautiful illustrations that add personality and warmth Custom repeat schedules Custom […]"},{"link":"https://nmac.to/blog/mp3-converter-pro/","image":"https://nmac.to/wp-content/uploads/2018/12/MP3-Converter-Pro.png","title":"MP3 Music Converter 3.2.0 – Professional music converter software","content":"MP3 Music Converter is a professional music converter software, it can convert all popular music formats to mp3 format. It also supports separate audio from video and convert to MP3.   Key features: Support audio formats:wma, aac, mp3,mp2, wav, ogg, ac3, flac, aiff, m4a, mka, ape. Supported video formats: wmv, asf, xwmv, xwma, avi, mpeg, […]"}]