[{"link":"https://nmac.to/blog/you-need-a-budget-4-3-817/","image":"https://nmac.to/wp-content/uploads/2013/12/You-Need-a-Budget-4.png","title":"You Need a Budget 4.3.817 – Easy-to-use budget software","content":"You Need a Budget is easy-to-use budget software paired with a powerful methodology.    The software is built around the YNAB Method, which is comprised of our Four Rules. These Four Rules help you break the paycheck to paycheck cycle, get out of debt, and save more money faster. Where other software packages tend to […]"},{"link":"https://nmac.to/blog/subtitles-3-2-8/","image":"https://nmac.to/wp-content/uploads/2015/03/Subtitles.png","title":"Subtitles 3.2.8 – Automatically downloads subtitles for your movies and TV shows","content":"Subtitles App is the easiest way to download subtitles, Just drop your videos into Subtitles and let it do its magic. It doesn’t matter if the files don’t have the right name or the format they’re in, Subtitles will always find the right subtitles for your movies and TV shows.   Automatically finds subtitles Just […]"},{"link":"https://nmac.to/blog/ismartphoto-1-7-5/","image":"https://nmac.to/wp-content/uploads/2014/12/iSmartPhoto.png","title":"iSmartPhoto 1.7.5 – Image browser and powerful image organizer","content":"iSmartPhoto is a fast image browser and powerful image organizer. Unlike iPhoto, iSmartPhoto doesn’t require you to manually import photos – it automatically pulls your photos from any folder or drive. By just double clicking a single image in Finder or dragging a folder, iSmartPhoto automatically displays every image from the selected folder and its […]"},{"link":"https://nmac.to/blog/compose-1-8-8/","image":"https://nmac.to/wp-content/uploads/2015/12/Compose.png","title":"Composé 1.8.8 – Develop iOS apps without writing code","content":"Composé creates apps for iOS that are tailored to iPhone and iPad. This ensures an authentic look-and-feel and no compromise on performance.   Features Arrange text and images on a pixel-perfect layout grid Include RSS-Feeds, JSON- and CSV data Include audio and video Add animations Create forms and databases Export your result for Xcode, so […]"},{"link":"https://nmac.to/blog/bevy-1-1-0/","image":"https://nmac.to/wp-content/uploads/2015/12/Bevy.png","title":"Bevy 1.1.0 – Application launcher shows you all apps in one window","content":"Bevy is a launcher that shows you all of your application icons in a single window that can be opened with a global hot key, from the menu bar or by clicking its dock icon. You just specify folders where your applications are located and Bevy creates visual groups of icons for each folder. To […]"},{"link":"https://nmac.to/blog/pixplant-3-0-8/","image":"https://nmac.to/wp-content/uploads/2014/09/PixPlant.png","title":"PixPlant 3.0.8 – 3D texturing tool","content":"PixPlant 3 is a smart 3D texturing tool that creates high quality normal, displacement, specular maps and seamless textures from plain photos.   Based on photos, PixPlant adds an unlimited choice of realistic materials for your projects: pick an interesting photo, run PixPlant and get a perfect seamless 3D texture.   Version 3.0.8: PixPlant now includes […]"},{"link":"https://nmac.to/blog/wondershare-video-editor-6-0-0/","image":"https://nmac.to/wp-content/uploads/2014/01/Wondershare-Video-Editor.png","title":"Wondershare Video Editor 6.0.0 – Video and photo editing","content":"Wondershare video Editor for Mac is an easy-to-use yet powerful Mac video editing software to edit and retouch videos with rich video and photo editing functions like trimming, cropping, rotating, adding stylish titles, applying filter effects, inserting transition and motion effects, etc. Furthermore, you can export videos to various popular video formats and portable devices […]"},{"link":"https://nmac.to/blog/desk-md-1-2/","image":"https://nmac.to/wp-content/uploads/2015/10/DeskMD.png","title":"Desk MD 1.2 – A Markdown-Powered Blogging App","content":"Desk MD is the FIRST desktop blogging client that is exclusively designed with Markdown in mind!   Built intentionally and specifically for writers, bloggers, and content creators who are passionate about the text-to-HTML conversion syntax that is Markdown, it is the only native blogging app of its kind!   Based on the award-winning “Best App […]"},{"link":"https://nmac.to/blog/jmp-pro-12-1-0/","image":"https://nmac.to/wp-content/uploads/2015/12/JMP-Pro.png","title":"JMP Pro 12.1.0 – Statistical analysis tool for visualizing and exploring data","content":"JMP is a statistical analysis tool, ideal for visualizing and exploring data.   Discover more in your data with JMP, now native for Mac OS X. In addition to its extraordinary graphical interface to display and analyze data, JMP offers new data access, statistics, and graphics commands, an enhanced JMP Scripting language, fully customizable menus […]"},{"link":"https://nmac.to/blog/eidetic-1-0-1/","image":"https://nmac.to/wp-content/uploads/2015/12/Eidetic.png","title":"Eidetic 1.0.1 – Quickly capture a screenshot from your menu bar","content":"Eidetic is a tiny app that puts an icon in your menu bar. Right-click the icon to take screenshots with ease.   Left-click the icon to display a menu which lets you quickly change the capture mode of your screenshot and access a settings panel. Here you can fine tune Eidetic’s behavior to your preferences, […]"}]