[{"link":"https://nmac.to/blog/adobe-media-encoder-cc/","image":"https://nmac.to/wp-content/uploads/2020/06/Adobe-Media-Encoder-2020.png","title":"Adobe Media Encoder 2022 22.2 – Included with Adobe Premier CC","content":"Adobe Media Encoder software automates the process of creating multiple encoded versions of source files, Adobe Premiere Pro sequences, and Adobe After Effects compositions. An intuitive interface, background encoding, and convenient presets help you quickly output for virtually any screen. Adobe Media Encoder is included in Adobe Premiere Pro, After Effects, and Adobe Prelude software.   […]"},{"link":"https://nmac.to/blog/farming-simulator/","image":"https://nmac.to/wp-content/uploads/2022/02/Farming_Simulator_22.png","title":"Farming Simulator 22 1.2.0 – The most complete farming simulator game [Intel ONLY]","content":"Take on the role of a modern farmer! Agriculture, animal husbandry and forestry offer a huge variety of farming activities while you face the challenges of the four seasons, especially when winter sets in. Creatively build your own farm and extend your farming operations with production chains – forming an agricultural empire! Even run your […]"},{"link":"https://nmac.to/blog/growing-up/","image":"https://nmac.to/wp-content/uploads/2022/02/Growing-Up.png","title":"Growing Up 1.2.3928 – Experience the entire journey from toddler to adulthood","content":"Your life is in your hands! Sculpt your childhood as well as parenthood with endless choices. Take control of what you learn, who you befriend, and find that special someone in this coming-of-age game.   Experience the entire journey from toddler to adulthood as you learn new skills, participate in various activities, develop your mind, […]"},{"link":"https://nmac.to/blog/prison-architect/","image":"https://nmac.to/wp-content/uploads/2017/02/prison.architect.png","title":"Prison Architect 8419 – Build and Manage A Maximum Security Prison","content":"Build and manage a Maximum Security Prison. As the sun casts it’s early morning rays on a beautiful patch of countryside the clock starts ticking. You’ve got to crack on and build a holding cell to detain the job­ lot of maximum security prisoners that are trundling to your future prison on their yellow bus. […]"},{"link":"https://nmac.to/blog/mini-metro/","image":"https://nmac.to/wp-content/uploads/2017/01/MiniMetro1.png","title":"Mini Metro 50 – Design the subway layout for a rapidly expanding city","content":"In Mini Metro, you take on the task of designing the subway layout for a rapidly expanding city. Your city starts with three stations. Draw routes between these stations to connect them with subway lines. Commuters travel along your lines to get around the city as fast as they can. Each station can only hold […]"},{"link":"https://nmac.to/blog/for-the-king/","image":"https://nmac.to/wp-content/uploads/2018/04/For-The-King.png","title":"For The King 1.1.00.113378 – A strategic RPG turn-based game","content":"The King is dead, murdered by an unknown assailant. Now the once peaceful kingdom of Fahrul is in chaos.   With nowhere left to turn and stretched beyond her means, the queen has put out a desperate plea to the citizens of the land to rise up and help stem the tide of impending doom. […]"},{"link":"https://nmac.to/blog/soma/","image":"https://nmac.to/wp-content/uploads/2015/10/SOMA.png","title":"SOMA 1.64 – A sci-fi horror game from Frictional Games","content":"SOMA is a sci-fi horror game from Frictional Games, the creators of Amnesia: The Dark Descent. It is an unsettling story about identity, consciousness, and what it means to be human.   The radio is dead, food is running out, and the machines have started to think they are people. Underwater facility PATHOS-II has suffered […]"},{"link":"https://nmac.to/blog/mac-cd-dvd-label-maker/","image":"https://nmac.to/wp-content/uploads/2022/02/Mac-CD-DVD-Label-Maker.png","title":"Mac CD DVD Label Maker 2.6.0 – Professional CD DVD Label Maker","content":"If you want to make your own CD, DVD cover, double cover labels, jewel cases, case inserts, spines, and more, or you need custom video and MP3 collections, have a lot of family photos and data for backups, or you would like to create unique gifts, then you have entered the right place.   With […]"},{"link":"https://nmac.to/blog/bootstrap-studio/","image":"https://nmac.to/wp-content/uploads/2018/05/Bootstrap-Studio.png","title":"Bootstrap Studio 5.9.3 – Create responsive websites using the Bootstrap framework","content":"Bootstrap Studio is a desktop application that helps web developers and designers create responsive websites using the Bootstrap framework. It supports a wide range of components and advanced features that make you more productive. It has a clean and intuitive interface and makes it easy for anyone to create a beautiful web page only with […]"},{"link":"https://nmac.to/blog/home-business-card/","image":"https://nmac.to/wp-content/uploads/2022/02/Home-Business-Card.png","title":"Home Business Card 1.7.0 – Business card designer","content":"Home Business Card is a business card designer that helps you to create business cards using various built-in label formats, clipart images, and pre-made designs provided. Various objects, like text, graphics and images can be easely added to your documents. Numerous image effects, like opacity level and image mask, in combination with other settings allow […]"}]