[{"link":"https://nmac.to/blog/dropcopy-pro-1-93/","image":"https://nmac.to/wp-content/uploads/2015/01/DropCopy.png","title":"DropCopy Pro 1.93 – Share files and folders between OS X machines","content":"DropCopy uses Apple’s Bonjour technology to help you to easily and quickly share files and folders between multiple Macs across your LAN. You simply drag your files in the Finder to a drop-zone containing a list of destinations (see screenshot) and drop it on the destination of your choice. This list conveniently disappears when one […]"},{"link":"https://nmac.to/blog/astro-1-137/","image":"https://nmac.to/wp-content/uploads/2014/01/Astro.png","title":"Astro 1.137 – Facebook Messenger on Mac","content":"Astro is one of the best Facebook Messenger app for Macs. For the first time, you can use lightning fast FB chat, just like Messages on Mac.   Features: Super fast interface, just like Messages The only app that supports group chat Drag-and-drop to send files Privacy control, to be invisible to nosy friends   […]"},{"link":"https://nmac.to/blog/slender-2-2-1/","image":"https://nmac.to/wp-content/uploads/2015/01/Slender.png","title":"Slender 2.2.1 – Analyze asset usage for Xcode and web-based projects","content":"Slender is one of those rare tools that fits neatly between development and design. Slender will scan your Xcode or Web projects and provide information on how image assets are being used. Exposing retina issues, unused assets, wasted space, and designer mistakes.   Features: Scan hundreds of file types for iPhone, iPad, Universal, Web, and […]"},{"link":"https://nmac.to/blog/mosaic-2-1-0/","image":"https://nmac.to/wp-content/uploads/2015/01/mosaic.png","title":"mosaic 2.1.0 – Convert images into a mosaic","content":"mosaic is a highly specialized app to create high quality image-from-images type mosaics. It doesn’t do anything else, but this one thing it does better than any other application available (and, yes, that even includes our own flagship ‘alpha’). In addition to being blindingly fast, photo mosaic comes with special presets that help you create […]"},{"link":"https://nmac.to/blog/isoburn-1-6/","image":"https://nmac.to/wp-content/uploads/2015/01/isoBurn.png","title":"isoBurn 1.6 – Burn discs quickly and easily","content":"isoBurn, simply put, is an easy-to-use burning software that performs two functions. It can write images to disc and it can get information about the media before and after its been burned. If you want a quick, easy way to burn, ISO or DMG files to disc then you should get isoBurn.   From the […]"},{"link":"https://nmac.to/blog/dockphone-1-1/","image":"https://nmac.to/wp-content/uploads/2014/12/DockPhone.png","title":"DockPhone 1.1 – Make iPhone calls from the Desktop","content":"DockPhone lets you make calls right from your Mac.   Keep it in your pocket…  Starting with iOS 8 and OS X Yosemite, your Mac and your iPhone perfectly work together. DockPhone for OS X is the missing piece to conveniently use your Mac as your phone.   Just dictate whom you want to call…  […]"},{"link":"https://nmac.to/blog/launchmagic-4-0-6/","image":"https://nmac.to/wp-content/uploads/2015/01/LaunchMagic.png","title":"LaunchMagic 4.0.6 – Robust application launching utility","content":"LaunchMagic (was F10 Launch Studio) is the premier launch management suite for OS X. The fastest way to open applications, documents, and folders. Its one-of-a-kind design delivers an extraordinarily fast and efficient way to open applications, documents, and folders. It will literally change the way you use your computer.   Version 4.0.6: Added OS X […]"},{"link":"https://nmac.to/blog/buzz-aldrins-space-program-manager/","image":"https://nmac.to/wp-content/uploads/2015/01/Buzz-Aldrins-Space-Program-Manager.png","title":"Buzz Aldrin’s Space Program Manager 1.0 – Space exploration game","content":"Buzz Aldrin’s Space Program Manager (SPM) Road to the Moon is the ultimate game of space exploration. It is the mid 1950s and the race for dominance between the US and the Soviet Union is about to move into a new dimension: space. Take charge of the US or Soviet space agencies – your duty […]"},{"link":"https://nmac.to/blog/appdelete-4-1-6/","image":"https://nmac.to/wp-content/uploads/2014/03/AppDelete.png","title":"AppDelete 4.1.6 – The speedy and efficient way to delete your unwanted apps","content":"AppDelete is an uninstaller for Macs that will remove not only applications but also widgets, preference panes, plugins, and screensavers along with their associated files. Without AppDelete these associated items will be left behind to take up space and potentially cause issues.   There are several ways to activate AppDelete: Drag items onto main window […]"},{"link":"https://nmac.to/blog/typed-1-0-1/","image":"https://nmac.to/wp-content/uploads/2015/01/Typed.png","title":"Typed 1.0.1 [Updated New K’ed] – Stunning word processing with markdown","content":"Typed is the stunning new writing app for the Mac, and the first that improves your focus so you can create great content. Typed makes writing for the web incredibly easy, and its Zen Mode features relaxing soundtracks that help you concentrate.   With stunning typography that makes it a breeze to write structured documents, […]"}]