[{"link":"https://nmac.to/blog/locko/","image":"https://nmac.to/wp-content/uploads/2013/11/49100.png","title":"Locko 1.0 – Password manager and file vault","content":"Locko is a beautiful and easy-to-use password manager and file vault. You can store confidential information such as web logins, credit card data, computer accounts, software licenses, private pictures and documents, and much more. Locko supports Dropbox, so you can keep your data synchronized across multiple computers while maintaining absolute security.   Features: Super strong […]"},{"link":"https://nmac.to/blog/ibank-472/","image":"https://nmac.to/wp-content/uploads/2013/11/iBank-1.175x175-75.jpg","title":"iBank 4.7.5 – Intuitive personal finance manager; widget available","content":"iBank is a new standard for Mac money management. With its intuitive user interface and a full set of money management features, iBank 4 is the most complete software available for Mac personal finance. iBank 4 lets you enter and edit your transactions with ease, download your online account data, reconcile your statements, and track […]"},{"link":"https://nmac.to/blog/triplety/","image":"https://nmac.to/wp-content/themes/nmac/images/placeholder-320.png","title":"Triplety 1.0.3 – Live preview of HTML, CSS, and Javascript code","content":"Triplety is an HTML, CSS, and Javascript playground for Web designers and developers. With Triplety, you can save the hassle of writing boilerplate code. Your code works with live preview and live reload.   Features: Built-in Preview with live reload Local HTTP server with live reload for external browsers (Live reload for modern browsers including […]"},{"link":"https://nmac.to/blog/tab-launcher/","image":"https://nmac.to/wp-content/uploads/2013/11/icon.175x175-75.png","title":"Tab Launcher 2.4 – Clean up and organize the Dock","content":"The idea of TabLauncher is not to replace the system’s dock, but to help keep it clean, with only the applications that are currently running.   By removing all the application from the dock and organizing them on tabs, you can quickly find and run any application you want.   Apart from that, you can […]"},{"link":"https://nmac.to/blog/appdelete/","image":"https://nmac.to/wp-content/uploads/2013/11/AppDelete.png","title":"AppDelete 4.1.1 – The speedy and efficient way to delete your unwanted apps","content":"AppDelete is an uninstaller for Macs that will remove not only applications but also widgets, preference panes, plugins and screensavers along with their associated files. Without AppDelete these associated items will be left behind to take up space and potentially cause issues. For a proper uninstall don’t just delete but be sure to AppDelete!   […]"},{"link":"https://nmac.to/blog/propedit/","image":"https://nmac.to/wp-content/uploads/2013/11/36630.png","title":"PropEdit 2.1.0 – Manage the permissions of your computer","content":"PropEdit is Mac OS X application which allows you to easily manage the permissions of your computer’s files.   It allows you to change the owner, group, permissions and specific system flags for any file or directory on your hard disk.   In its registered version, PropEdit also has a built-in support for Mac OS […]"},{"link":"https://nmac.to/blog/mail-stationery-v1-2/","image":"https://nmac.to/wp-content/uploads/2013/11/Mail_Stationery_Icon.175x175-75.jpg","title":"Mail Stationery 1.4 – Enhance letters with 200 creative designs","content":"Mail Stationery is a beautiful collection of 100 top-quality templates for Apple Mail, from professional designers who produced not only visually attractive, but also highly functional designs. In addition, most of the templates come with extra color themes or design variations, which will maximize your choice for creative solutions.   WHAT’S NEW Version 1.4: 14 […]"},{"link":"https://nmac.to/blog/dropcopy-pro/","image":"https://nmac.to/wp-content/uploads/2013/12/DropCopy_app_icon.175x175-75.png","title":"DropCopy Pro 1.87 – Share files and folders between OS X machines","content":"DropCopy Pro uses Apple’s Bonjour technology to help you to easily and quickly share files and folders between multiple Macs across your LAN. You simply drag your files in the Finder to a drop-zone containing a list of destinations (see screenshot) and drop it on the destination of your choice. This list conveniently disappears when […]"},{"link":"https://nmac.to/blog/investoscope/","image":"https://nmac.to/wp-content/uploads/2013/12/Investoscope.175x175-75.png","title":"Investoscope 2.3.2 – Portfolio tracker for the individual investor","content":"Investoscope is a portfolio tracker for the individual investor. With a compelling and intuitive one window user interface, Investoscope lets you monitor the performance of your investments in stocks, bonds, mutual funds, and other securities.   WHAT’S NEW Version 2.3.2: Bug fix: In the Performance Report, the Initial Value column would include positions that were […]"},{"link":"https://nmac.to/blog/wondershare-drfone-200/","image":"https://nmac.to/wp-content/uploads/2013/12/logo.jpg","title":"Wondershare Dr.Fone 3.6 – Mac iphone data recovery","content":"Dr.Fone is the World’s 1st iPhone, iPad & iPod touch Data Recovery Software for Mac. Recover 7 kinds of deleted files by directly scanning iPhone 5/4S, iPad 2, the new iPad, iPod touch 5, iPad with Retina display & iPad mini. Recover 12 kinds of deleted data directly from iPhone 4/3GS, iPod touch 4 and […]"}]