[{"link":"https://nmac.to/blog/irip-2-1-7/","image":"https://nmac.to/wp-content/uploads/2014/08/iRip.png","title":"iRip 2.1.7 – Transfer songs, videos, contacts, and more from your iOS device to your Mac","content":"iRip (was iPodRip) is the definitive iPod companion application. iRip allows you to get the most out of your iPod, iPhone and iPad — you can transfer music, videos, and books from your iOS device back to your iTunes Library, listen to music directly on your iPod (allowing you to save valuable disk space) and […]"},{"link":"https://nmac.to/blog/framer-studio-1-5-8/","image":"https://nmac.to/wp-content/uploads/2014/08/Framer.Studio.png","title":"Framer Studio 1.5.8 – Invent, design and experiment with interaction","content":"Framer Studio is built on Framer.js, an open source framework for rapid prototyping. Framer allows you to define animations and interactions. It runs on mobile devices, too.   Source on GitHub Hardware Accelerated Events & 3D Animations Spring Physics Framer.js used at: Google, Facebook, Instagram and Stripe   Generate Generate assets out of Sketch and […]"},{"link":"https://nmac.to/blog/shape-collage-3-1-0/","image":"https://nmac.to/wp-content/uploads/2014/08/Shape-Collage.png","title":"Shape Collage 3.1.0 – Automatic photo collage maker","content":"Shape Collage is a free automatic photo collage maker that lets you create picture collages in a variety of shapes in less than a minute with just a few mouse clicks. Shape Collage creates collages using an intelligent machine learning algorithm that automatically places the photos in the collage and can arrange the photos to […]"},{"link":"https://nmac.to/blog/pin-pro-for-pinterest-1-7/","image":"https://nmac.to/wp-content/uploads/2014/08/Pin-Pro-for-Pinterest.png","title":"Pin Pro for Pinterest 1.7 – Browse Pinterest from your menu bar","content":"Pin Pro takes your Pinterest addiction to a whole new level. It is the best app for instantly browsing and uploading to your Pinterest account without ever having to open your web browser! Browse through the latest pinned images from your friends and the wider Pinterest community. With Pin Pro, you can also upload images to […]"},{"link":"https://nmac.to/blog/macaw-1-5-3/","image":"https://nmac.to/wp-content/uploads/2014/04/Macaw1.png","title":"Macaw 1.5.3 – The code-savvy web design tool","content":"Stop writing code. Start drawing it.   Macaw provides the same flexibility as your favorite image editor but also writes semantic HTML and remarkably succinct CSS. It’s time to expect more from a web design tool.   Fluid canvas and grid Macaw is engineered for fluid widths. Resize the canvas and your grids and elements […]"},{"link":"https://nmac.to/blog/karaoketube-1-7/","image":"https://nmac.to/wp-content/uploads/2014/01/KaraokeTube.png","title":"KaraokeTube 1.7 – Sing your favorite songs right from your Mac","content":"Sing your favorite songs right from your Mac. KaraokeTube is the world’s first and only fully featured Mac karaoke application with a streaming library of over thousands of songs with lyrics!   What you get: Access to over 7000 songs from around the world High and HD quality of all the videos Intuitive song search […]"},{"link":"https://nmac.to/blog/ip-notification-4-6/","image":"https://nmac.to/wp-content/uploads/2014/08/IP-Notification.png","title":"IP Notification 4.6 – Trace your IP address","content":"The ultimate tool for tracking your IP address. Your internal and external addresses are continually monitored and displayed in the status bar. Whenever a change is detected any of the following actions can be taken automatically:   Receive an email No setup required, simply enter your email address and we will send you an email […]"},{"link":"https://nmac.to/blog/switch-4-62/","image":"https://nmac.to/wp-content/uploads/2014/08/Switch.png","title":"Switch 4.62 – Converts a variety of audio formats","content":"Switch File Format Converter is a sound file converter for Mac. It can convert audio files from many sources into mp3 or wav format. Switch Converter is very easy to use. Just add the files you want to convert to the list, select the format you want to use, and then click the convert button. […]"},{"link":"https://nmac.to/blog/desktop-tidy-2-0/","image":"https://nmac.to/wp-content/uploads/2014/08/Desktop-Tidy.png","title":"Desktop Tidy 2.0 – Organize and clean your desktop","content":"Desktop Tidy maintains a “Shadow Desktop”, moving any files found on your actual Desktop and keeping it completely clear. This doesn’t mean the files are harder to find because Desktop Tidy provides direct access to the files via a status menu icon, and also helps organise the files with the use of customisable filters. For […]"},{"link":"https://nmac.to/blog/desktop-groups-1-5-2/","image":"https://nmac.to/wp-content/uploads/2014/08/Desktop-Groups.png","title":"Desktop Groups 1.5.2 – Organize your desktop items in helpful groups","content":"Desktop Groups keeps the chaos off of your desktop. Keep related files in groups.The app lets you create groups of related files on your desktop. You can freely move groups of files around on your desktop and add or remove files via drag & drop.   Each group has a title so that you can […]"}]