[{"link":"https://nmac.to/blog/kaspersky-virus-scanner-8-1-5/","image":"https://nmac.to/wp-content/uploads/2013/12/kav.175x175-75.png","title":"Kaspersky Virus Scanner 8.1.5 – Advanced anti-virus protection for your Mac","content":"Kaspersky Virus Scanner… Advanced anti-virus protection for your Mac. Stops malware before it can be passed from your Mac onto PCs and other systems on your network. Small, frequent updates. Outstanding performance. And a familiar Mac-type interface.   Features: Advanced Protection Kaspersky Anti-Virus for Mac offers advanced protection from all known types of malware threats, […]"},{"link":"https://nmac.to/blog/cuptakes-1-7-5/","image":"https://nmac.to/wp-content/uploads/2013/12/Cuptakes.175x175-75.png","title":"Cuptakes 1.7.5 – desktop wallpapers for the girly girls","content":"Cuptakes is here to beautify the look of your Mac desktop by providing you with an exclusive girly girl selection of specially designed backgrounds.   DESCRIPTION As a graphic designer, I have always wanted to have a more girly selection of wallpapers for my desktop, iPhone and iPad. Unfortunately, most of the wallpapers and apps […]"},{"link":"https://nmac.to/blog/diskaid-6-5-0/","image":"https://nmac.to/wp-content/uploads/2013/12/27830.jpg","title":"DiskAid 6.5.0 – Use your iOS device as an external disk and more","content":"DiskAid is the ultimate transfer tool for accessing the iPod, iPhone or iPad directly from the desktop. Access data such as: music, video, photos, contacts, notes, call history, text messages (SMS), voicemail, and voice memos. With DiskAid you can also transfer files and folders betwen your iPhone, iPad or iPod touch and your computer and […]"},{"link":"https://nmac.to/blog/corel-painter-x3-sp1-13-0-1-1111/","image":"https://nmac.to/wp-content/uploads/2013/12/52402.png","title":"Corel Painter X3 SP1 13.0.1.1111 – Digital art software featuring realistic painting effects","content":"Corel Painter X3 helps you create astonishing art in a variety of media.    Paint with vivid oil paints, fluid water colors, and earthy charcoals. Corel Painter flawlessly recreates the tones and textures of each medium.   Your studio awaits Choose your brush. Corel Painter includes hundreds of built-in brushes. You can even create your own […]"},{"link":"https://nmac.to/blog/file-buddy/","image":"https://nmac.to/wp-content/uploads/2013/11/File-Buddy.png","title":"File Buddy 10.0 – File management utility","content":"File Buddy is the Swiss Army knife of Mac file utilities. First released in 1993, File Buddy features a wealth of functionality and powerful features that allow you to access that functionality quickly and easily. In addition to File Buddy’s normal functionality it adds several commands to Finder’s Services and contextual menus and allows the […]"},{"link":"https://nmac.to/blog/fonts/","image":"https://nmac.to/wp-content/themes/nmac/images/placeholder-320.png","title":"Fonts 1.0.1 – Previewing and organising your fonts","content":"If you’ve got more fonts than you dare to admit, how do you find that one font whose name you just can’t recall? You know, that one almost but not quite entirely unlike Garamond? Welcome to Fonts, a new app for previewing and organising your fonts from the people who brought you the award-winning Sketch […]"},{"link":"https://nmac.to/blog/airvlc/","image":"https://nmac.to/wp-content/uploads/2013/11/logo_app-dff991302f6058bb8081d89aa9ec87e0.jpg","title":"AirVLC 1.1.1 – Watch videos on your Mac and play the audio through AirPlay, in sync","content":"The launcher for VLC Media Player that compensates the AirPlay audio delay. AirVLC uses VLC. No need for a sub-par video player. AirVLC merely controls the awesome video player that you already know and love. Make sure you download VLC before getting started.   Get rid of the audio delay. AirPlay causes a delay in the […]"},{"link":"https://nmac.to/blog/silver-screen/","image":"https://nmac.to/wp-content/uploads/2013/11/49645.png","title":"Silver Screen 1.0.1 – Stream any movie to your Apple TV","content":"Silver Screen allows you to watch videos of nearly any format on your Apple TV – all controlled from a web browser, including your mobile device. Silver Screen runs on your Mac, and serves up a web app that provides access to your media library. Select your video and Silver Screen sends it to your […]"},{"link":"https://nmac.to/blog/mavericks-cache-cleaner/","image":"https://nmac.to/wp-content/uploads/2013/11/9503.png","title":"Mavericks Cache Cleaner 8.0.2 – Clear caches, access hidden OS X settings, and more","content":"Mavericks Cache Cleaner is an award-winning general purpose tool for OS X. MCC makes system maintenance simple with an easy point-and-click interface to many OS X functions. Novice and expert users alike will appreciate the powerful toolset MCC provides. Mavericks Cache Cleaner is one of the world’s leading maintenance tools, with millions of downloads around […]"},{"link":"https://nmac.to/blog/keynote-template-design/","image":"https://nmac.to/wp-content/uploads/2013/11/Icon.175x175-75.png","title":"Keynote Template Design 1.0 – Endearing keynote template","content":"Whether you are working, studying, or entertainment, celebration, this product will bring you convenience and happiness.We carefully crafted keynote template, the quality is guaranteed, but is definitely the low prices. This product now includes 50 sets of templates for your convenience, we will be constantly updated in late and perfection. Stay tuned.   The types […]"}]