[{"link":"https://nmac.to/blog/photovideocollage/","image":"https://nmac.to/wp-content/uploads/2018/04/PhotoVideoCollage.png","title":"PhotoVideoCollage 2.0 – Create beautiful and engaging video collages","content":"Create beautiful and engaging video collages with your memories and favorite music. Impress your friends and family with your awesome collages that contain not only photos but also video clips, and music!   PhotoVideoCollage is not your classic photo collage, it’s a video collage app that can add photos and music into the mix.   […]"},{"link":"https://nmac.to/blog/particle-designer/","image":"https://nmac.to/wp-content/uploads/2015/01/Particle-Designer-1.png","title":"Particle Designer 2.9 – Particle simulation software for Mac OS","content":"Particle Designer 2.0 is a powerful particle effects editor designed specifically for Mac OS X. Choose from a massive user submitted library or design your own unique effects. Limitless possibilities with multiple particle emitters, definable backgrounds, zooming & full-screen. Target hundreds of devices and multiple platforms with support for over 11 frameworks working out the […]"},{"link":"https://nmac.to/blog/balance-lock/","image":"https://nmac.to/wp-content/uploads/2017/12/Balance-Lock.png","title":"Balance Lock 1.0.5 – Prevent left/right drift when plugging in headphones","content":"Balance Lock keeps your Mac’s audio centred, preventing left/right drift. It’s the perfect utility for making sure that the audio stays centred when plugging or unplugging headphones. It was designed out of frustration from the long standing OS X bug where the audio balance can randomly move away from the center. It’s simple to use […]"},{"link":"https://nmac.to/blog/stat/","image":"https://nmac.to/wp-content/uploads/2018/04/Stat.png","title":"Stat 18.0 – View the status of your repository files right inside of Finder","content":"In an instant view the status of your repository files right inside of Finder. View Modified, New and Renamed files.   Monitor a folder and have stat automatically start monitoring them. View in a glance the changes in a folder contained.   Version 18.0: Completely re-written for speed. Monitor multiple large repos without pegging the […]"},{"link":"https://nmac.to/blog/hr/","image":"https://nmac.to/wp-content/uploads/2016/02/hr.png","title":"hr 1.4.0 – Task timer for the menu bar","content":"hr — short for hour — tracks your hours. It’s minimalistic, clean and easy to use, yet it’s a powerful time-tracking app for your menu bar.   Features Keep your projects and clients organized with categories. Manage your tasks, prioritize them by dragging to the right, archive by marking them finished. Press Play to start […]"},{"link":"https://nmac.to/blog/room-arranger/","image":"https://nmac.to/wp-content/uploads/2015/12/Room-Arranger.png","title":"Room Arranger 9.5.4 – Design your room, office, apartment and more…","content":"Room Arranger is 3D room / apartment / floor planner with simple user interface. Once you get the basics, you can draw whatever you imagine. While having wide library of objects, you can easily create your own piece of furniture.   Room Arranger can show your project in 3D. It uses VRML standard for it. […]"},{"link":"https://nmac.to/blog/avitools/","image":"https://nmac.to/wp-content/uploads/2015/07/AVItools3.png","title":"AVItools 3.7.0 – Tools for working with .avi video files","content":"AVItools is a collection of tools used to manipulate video files. It’s primary purpose is to prepare videos files for use in DivX enabled DVD players, though the AVI videos it creates are also playable on hardware like the PS3 and Xbox 360. AVItools is trialware – only $4.99 for full functionality, though it will […]"},{"link":"https://nmac.to/blog/fleet/","image":"https://nmac.to/wp-content/uploads/2018/04/Fleet.png","title":"Fleet 2.0.0 – A super simple, super fast local network speed test","content":"Ever wonder how fast your local network is? How fast you could possibly send data from one device to another, like a local speed test? Now you can know!   Fleet is a super simple, super fast local network speed test for macOS.   Features: Super simple server setup. specify port and away you go. […]"},{"link":"https://nmac.to/blog/codekit/","image":"https://nmac.to/wp-content/uploads/2016/09/CodeKit3.png","title":"CodeKit 3.6 – Build websites faster and better","content":"CodeKit helps you build websites faster and better.    Compile Everything: Process Less, Sass, Stylus, Jade, Haml, Slim, CoffeeScript, Javascript and Compass files automatically each time you save. Easily set options for each language.   Live Browser Reloads: Instantly see changes in your browser, with animation and without hitting the refresh button or installing plugins. […]"},{"link":"https://nmac.to/blog/picktorial/","image":"https://nmac.to/wp-content/uploads/2017/08/Picktorial.png","title":"Picktorial 3.0.6 – Non-destructive photo editor","content":"Picktorial is a powerful, smooth, and intuitive photo editor that provides tools for enhancing and retouching photos. Make local adjustments to RAW photos, retouch portraits, add filters, watermarks and more. It now integrates with OS X Photos, so you can enjoy the power of Picktorial right from Photos. Or, you can keep using Picktorial for […]"}]