[{"link":"https://nmac.to/blog/f-stop/","image":"https://nmac.to/wp-content/uploads/2018/11/F-Stop.png","title":"F-Stop 5.3.7 – Simple and clean Flickr client","content":"F-Stop (was Flicker1) is a Flickr client that allows users to browse Flickr in a simple, clean and intuitive way.   Features Browse all your stuff View photo details Monitor your Flickr activity Upload your photos Make and save your own searches Display account statistics Add notes to photos See geotag information over maps Reorder […]"},{"link":"https://nmac.to/blog/wondershare-mobiletrans/","image":"https://nmac.to/wp-content/uploads/2015/12/MobileTrans6.png","title":"Wondershare MobileTrans 6.9.11 – One-click phone to phone content transfer","content":"Wondershare MobileTrans allows you to transfer content from phone to phone in a single click.   Make moving to your new device an easy transition with Wondershare MobileTrans for Mac (fully compatible with Android 4.4 KitKat, iOS 7.1). You can transfer over all of your data — including contacts, text messages, call logs, photos, music, […]"},{"link":"https://nmac.to/blog/iskysoft-phone-transfer/","image":"https://nmac.to/wp-content/uploads/2018/11/iSkysoft-Phone-Transfer.png","title":"iSkysoft Phone Transfer 1.7.4.58 – A Powerful Phone to Phone Transfer","content":"iSkysoft Phone Transfer is an easy-to-use solution to transfer music, photos, video, sms text messages, contacts, call history, calendar and apps between iOS (iOS 12 supported), Android (Android 8.0 supported), BlackBerry and Symbian OS in just 1 click. No matter you switch to a new phone or upgrade phones, this mobile transfer tool can safely […]"},{"link":"https://nmac.to/blog/navicat-premium-essentials/","image":"https://nmac.to/wp-content/uploads/2018/05/Navicat-Premium-Essentials.png","title":"Navicat Premium Essentials 12.1.13 – Provides graphical frontend for many popular databases","content":"Navicat Premium Essentials is a compact version of Navicat which provides basic and necessary features you will need to perform simple administration on a database. It supports the latest features including Trigger, Function, View, and it also comes with an Import/Export tool which allow user to import and export data from plain text file formats […]"},{"link":"https://nmac.to/blog/navicat-for-oracle/","image":"https://nmac.to/wp-content/uploads/2018/01/Navicat-for-Oracle.png","title":"Navicat for Oracle 12.1.13 – Oracle administration and development","content":"Navicat for Oracle is an ideal solution for Oracle administration and development which lets you create, edit databases, run SQL queries and connect to remote Oracle in an easier way. It features an intuitive GUI and offers powerful visual tools such as Query Editor with syntax highlight capability, SQL Preview, SQL Console, TEXT, Hex and […]"},{"link":"https://nmac.to/blog/navicat-for-mysql/","image":"https://nmac.to/wp-content/uploads/2018/01/Navicat-for-MySQL.png","title":"Navicat for MySQL 12.1.13 – Graphically manage MySQL databases","content":"Navicat for MySQL Client from PremiumSoft, is an integrated GUI tool let you perform MySQL administration and database development in an easier way. Advanced features allow you to create data models, import/export data, backup, transfer databases, create queries, and manage your local or remote MySQL server. It also includes a full-featured graphical manager for setting […]"},{"link":"https://nmac.to/blog/navicat-for-postgresql/","image":"https://nmac.to/wp-content/uploads/2018/01/Navicat.for_.PostgreSQL.png","title":"Navicat for PostgreSQL 12.1.13 – PostgreSQL graphical interface","content":"Navicat for PostgreSQL is a powerful yet easy-to-use PostgreSQL graphical interface that provides extensive functionality for managing and developing PostgreSQL database. Advanced features allow you to create database models, import/export data, backup, transfer databases, create queries, and manage your local or remote SQLite server. It also includes a full-featured graphical manager for setting the users […]"},{"link":"https://nmac.to/blog/7-billion-humans/","image":"https://nmac.to/wp-content/uploads/2018/11/7-Billion-Humans.png","title":"7 Billion Humans 1.0.32487 – Programming Puzzle & Simulation Game","content":"Automate swarms of office workers to solve puzzles inside your very own parallel computer made of people. A thrilling followup to the award winning Human Resource Machine. Now with more humans!   THRILLING FEATURES! More puzzles, more humans, more rippling brain muscles – over 60+ levels of programming puzzles! 77.777778% more levels than Human Resource […]"},{"link":"https://nmac.to/blog/dream-daddy/","image":"https://nmac.to/wp-content/uploads/2018/11/Dream-Daddy.png","title":"Dream Daddy: A Dad Dating Simulator 0.11 – Dating Sim & Romance Simulation Game","content":"Dream Daddy: A Dad Dating Simulator is a game where you play as a Dad and your goal is to meet and romance other hot Dads. You and your daughter have just moved into the sleepy seaside town of Maple Bay only to discover that everyone in your neighborhood is a single, dateable Dad! Will […]"},{"link":"https://nmac.to/blog/machinarium/","image":"https://nmac.to/wp-content/uploads/2014/04/Machinarium3.png","title":"Machinarium Collector’s Edition 3.1.6 – Amazing adventure game","content":"Machinarium is award-winning independent adventure game developed by the makers of Samorost and Botanicula.   A little robot who’s been thrown out to the scrap yard behind the city must return and confront the Black Cap Brotherhood and save his robot-girl friend.   World: Machinarium world is populated only by robots of various forms and […]"}]