[{"link":"https://nmac.to/blog/hip-pro-iii-with-animations-3-8/","image":"https://nmac.to/wp-content/uploads/2014/11/Hip.Pro_.III_.with_.Animations.png","title":"Hip Pro III with Animations 3.8 – multiple cross sections (Sagittal, Coronal and Transverse)","content":"Hip Pro III gives users an in depth look into the body region and allows them to cut, zoom & rotate the hip. Hip Pro III provides multiple cross sections (Sagittal, Coronal and Transverse) as well as the ability to cut away different layers revealing the muscles, blood vessels, nerves and connective tissue down to […]"},{"link":"https://nmac.to/blog/heart-pro-iii/","image":"https://nmac.to/wp-content/uploads/2014/11/Heart.Pro_.III_.png","title":"Heart Pro III 3.8 – Heart surgery simulator","content":"Heart Pro lets you simply rotate, stop, cut open and label the components of the heart, all with simple strokes of the cursor.   The NEW Heart Pro III contains hundreds of improvements – here are a few: 360-degree, 3D horizontal rotation of the heart – with the swipe of your mouse. Rotate vertically for […]"},{"link":"https://nmac.to/blog/get-plain-text-1-3-convert-any-text-to-plain-text/","image":"https://nmac.to/wp-content/uploads/2014/11/Get.Plain_.Text_.png","title":"Get Plain Text 1.3 – Convert any text to plain text","content":"Get Plain Text is a practical utility program to process text within: It converts copied text into plain text. If you’ve used the copy/paste functions in Mac OS before, you’ll appreciate how valuable Get Plain Text is! We use it ourselves every day. This app will lower your stress level and save you tons of […]"},{"link":"https://nmac.to/blog/data-rescue-4-1-1/","image":"https://nmac.to/wp-content/uploads/2014/03/Data.Rescue.png","title":"Data Rescue 4.1.1 – Powerful hard drive data recovery solution","content":"Data Rescue is a robust and reliable data recovery solution for your Mac. Data Rescue has a 5-star average rating on the Mac App Store a 4.5 star rating on Amazon, in addition to over 150 industry awards for best-in-class Mac recovery since it’s debut in 2002. Works on all Mac hard drives even if […]"},{"link":"https://nmac.to/blog/ankle-foot-pro-iii-3-8/","image":"https://nmac.to/wp-content/uploads/2014/11/Ankle-Foot-Pro-III.png","title":"Ankle & Foot Pro III 3.8 – Cut, zoom, rotate & depth look into the man’s ankle & foot","content":"Ankle & Foot Pro III gives users an in depth look into the body region and allows them to cut, zoom & rotate the ankle & foot. Ankle & Foot Pro III provides multiple cross sections (Sagittal, Coronal and Transverse) as well as the ability to cut away different layers revealing the muscles, blood vessels, […]"},{"link":"https://nmac.to/blog/techtool-protogo-4-0-5/","image":"https://nmac.to/wp-content/uploads/2014/11/Protogo.png","title":"TechTool Protogo 4.0.5 – Turn your USB or Firewire device into a bootable diagnostic toolkit","content":"TechTool Protogo easily lets you turn your USB or Firewire device into a bootable, diagnostics toolkit for Mac.   You can take it with you. Using Protogo, you can easily turn a USB or FireWire device, such as an iPod, flash drive, compact hard drive, or SD Card, into a powerful toolkit to troubleshoot all […]"},{"link":"https://nmac.to/blog/smartday-3-2/","image":"https://nmac.to/wp-content/uploads/2013/12/SmartDay.png","title":"SmartDay 3.2 – Integrated organizer with automatic scheduling","content":"SmartDay is an integrated organizer that automatically schedules tasks into the free time in your calendar. SmartDay uses adaptive logic to organize your projects, tasks, appointments and check-lists. The included Cloud hub (free) keeps you connected across all of your Macs and PC’s, and syncs with our iPad organizer, SmartPad.   Beauty in Simplicity… SmartDay […]"},{"link":"https://nmac.to/blog/memory-cleaner-4-0/","image":"https://nmac.to/wp-content/uploads/2014/11/Memory.Cleaner.png","title":"Memory Cleaner 4.0 – Free up wasted memory","content":"Memory Cleaner lets you work more productively by freeing wasted memory!   Click a single button, and your computer will speed up! Clean memory means faster applications and more efficient work.Memory Cleaner frees wasted memory in your computer and so prevents your applications from slowing down.   Every time you open a file on your […]"},{"link":"https://nmac.to/blog/ghosttile-1-1-0/","image":"https://nmac.to/wp-content/uploads/2014/11/GhostTile.png","title":"GhostTile 1.1.0 – Hide your running applications from the dock","content":"GhostTile lets you hide running applications from Dock in multiple ways: Drag & Drop xSelect from /Applications folder Click icon on Dock Per app config to hide or add menubar item Notification for added Apps’ Dock activities   GhostTile also has multiple ways to quick switch back: Click on menubar Call out Quick Switch window […]"},{"link":"https://nmac.to/blog/designs-for-mail-3-0/","image":"https://nmac.to/wp-content/uploads/2014/11/Designs-for-Mail2.png","title":"Designs for Mail 3.0 – 100+ beautiful templates for Apple’s Mail","content":"Designs for Mail brings you a diverse collection of templates for creating customized email messages in Apple Mail.    Choose a lively seasonal template for a family newsletter. Or select a sharp, sophisticated design for a business proposal. Designs for Mail’s selection is constantly expanding, so you’ll always have access to the latest templates.   […]"}]