[{"link":"https://nmac.to/blog/f18-carrier-landing-ii-pro/","image":"https://nmac.to/wp-content/uploads/2014/09/F18-Carrier-Landing-II-Pro.png","title":"F18 Carrier Landing II Pro 1.1 – Flight simulator Game","content":"F18 Carrier Landing II Pro, The most advanced aircraft carrier landing system ever created.   Landing on an aircraft carrier is one of the most difficult tasks a pilot has to execute. The flight deck is only 150 meters long, just enough to stop the aircraft.   Accept the challenge, take on over thirty missions […]"},{"link":"https://nmac.to/blog/coucou-1-0-2/","image":"https://nmac.to/wp-content/uploads/2014/09/coucou.png","title":"coucou 1.0.2 – Network Browser","content":"With coucou you have every device on your network at your finger tips.   Need to share some files, or a screen? Want to manage a printer via its web interface? Maybe even check out that website your colleague is working on. Coucou makes it super easy to perform these tasks.   It also gives […]"},{"link":"https://nmac.to/blog/earth-3d-amazing-atlas-1-3-1/","image":"https://nmac.to/wp-content/uploads/2014/08/Earth.3D.Amazing.Atlas_.png","title":"Earth 3D Amazing Atlas 1.3.1 – 3D globe wonders of the world","content":"Earth 3D Amazing Atlas features wonders of the world, political and geographic maps, and weather. Discover a lot of fascinating facts and useful information about our planet! Original and colorful graphics, user-friendly interface and accurate information — this is what Earth 3D – Amazing Atlas is all about!   Features: Relief model of the Earth […]"},{"link":"https://nmac.to/blog/waffle-1-1/","image":"https://nmac.to/wp-content/uploads/2014/08/Waffle.png","title":"Waffle 1.1 – Easily create mosaic photos.","content":"Waffle is a photo mosaic application for the rest of us. Having a simplistic interface, this application requires only a few click to make a photomosaic! With a clean Mac interface, good look, reasonable performance and great result, this app is suitable for most everyone: from a creative kid to a pro designer who needs […]"},{"link":"https://nmac.to/blog/tcel-1-5-1/","image":"https://nmac.to/wp-content/uploads/2014/08/TCel.png","title":"TCel 1.5.1 – Make your webpages pixel-perfect","content":"TCel empowers front-end Web developers to get their webpages pixel perfect. While laying out a webpage, overlay an image on top of Safari or other web browsers and truly match what your graphic designers intended.   Features: Supports many image formats like PNG, PSD, AI, and JPEG Control the opacity of the image overlay Use […]"},{"link":"https://nmac.to/blog/simplescrobbler-2-0-1/","image":"https://nmac.to/wp-content/uploads/2014/08/SimpleScrobbler.png","title":"SimpleScrobbler 2.0.1 – Last.fm scrobbler without all the bells and whistles","content":"SimpleScrobbler is a Last.fm scrobbler without all the bells and whistles. A Mac App that lives in your status bar and leaves a smaller footprint on your computer.   SimpleScrobbler gives you: Simplicity. SimpleScrobbler has one purpose: Scrobble your tracks. Silence. Scrobbles your tracks silently from the status bar. We won’t bug you. Ever. Vigilance. […]"},{"link":"https://nmac.to/blog/compartments-2-1-2/","image":"https://nmac.to/wp-content/uploads/2014/08/Compartments.png","title":"Compartments 2.1.2 – Home inventory application","content":"Compartments is a home inventory application that has time-saving features like Quick Add and Smart Collections, Compartments makes the process of home inventory easier than ever. And with gorgeous icons and a beautifully illustrated, intuitive interface, home inventory has never been more pleasant.   Easy image import. Add images with drag-and-drop, from files on your […]"},{"link":"https://nmac.to/blog/translucent-1-7-1/","image":"https://nmac.to/wp-content/uploads/2014/08/Translucent.png","title":"Translucent 1.7.1 – Displays system monitoring info","content":"Translucent provides detailed real-time information about what is going on inside your Mac. At any given time Translucent displays how much each one of your processors is being utilized, detailed information about how your memory is being used, how much data is being sent and received on your network interfaces and how much is being […]"},{"link":"https://nmac.to/blog/temperature-gauge-pro-2-0-2/","image":"https://nmac.to/wp-content/uploads/2014/08/Temperature-Gauge-Pro.png","title":"Temperature Gauge Pro 2.0.2 – Control fan speeds, monitor temperatures, and find faulty sensors","content":"Temperature Gauge Pro is a must-have utility for every Mac user with four top features: Check up on your Mac by viewing the current and maximum recorded temperatures for every sensor. Choose between Celsius or Fahrenheit. Tune the fan speeds so that your Mac can run cooler with the manual fan control. Or have the […]"},{"link":"https://nmac.to/blog/pwsafe-3-0/","image":"https://nmac.to/wp-content/uploads/2014/08/pwSafe.png","title":"pwSafe 3.0 – Password Safe compatible Password Manager","content":"Simple & secure password management across devices and computers. pwSafe uses iCloud to keep your password databases backed-up and synced between Macs and iOS devices. It is compatible with open source Password Safe.   List of features: iCloud sync, realtime and bi-directional Generates strong passwords Print a hardcopy of your data for ultimate security agains […]"}]