[{"link":"https://nmac.to/blog/atext/","image":"https://nmac.to/wp-content/uploads/2014/12/aText2.png","title":"aText 2.40.5 – Automatically replaces abbreviations with frequently used phrases","content":"aText accelerates your typing by replacing abbreviations with frequently used phrases you define: for example, make an abbreviation “myname” to insert your name “First Middle Last” in any application.   With aText you can easily avoid typing the same thing over and over.   More Features Insert images and formatted text. Capitalize new sentences. Correct […]"},{"link":"https://nmac.to/blog/ftp-serv/","image":"https://nmac.to/wp-content/uploads/2021/11/Ftp-Serv.png","title":"Ftp-Serv 8.1.1 – An Easy Ftp Server","content":"A simple ftp server software for uploading files to your computer.   It’s a simple ftp server software for uploading files to your Mac, or share files to others.   This app do three things: You can upload files from printer-scanner-integrated machine to your Mac, if your Mac is in the same LAN with your […]"},{"link":"https://nmac.to/blog/drmare-imazonkit-music-converter/","image":"https://nmac.to/wp-content/uploads/2022/01/DRmare-iMazonKit-Music-Converter.png","title":"DRmare iMazonKit Music Converter 2.5.0 – Download Unlimited Music and HD Music to MP3, FLAC","content":"A professional Unlimited Music converter designed to convert and download Unlimited Music playlists to MP3, FLAC, WAV, AAC, M4A, M4B with a 5X faster batch conversion speed for offline playback anywhere.   With Unlimited Music subscription, you can download the music files for offline listening but you don’t own the real audio files. Luckily, DRmare […]"},{"link":"https://nmac.to/blog/image-tricks/","image":"https://nmac.to/wp-content/uploads/2022/01/Image_Tricks_3.png","title":"Image Tricks 3.9.5 – Edit images using Mac Core Image filters","content":"Image Tricks Pro lets you apply macOS Core Image filters and Quartz Compositions to your photos to achieve amazing effects. In addition to photo effects, Image Tricks Pro has embedded image generator for creating random images, and a collection of photo frames and borders to decorate your images even further.   Share photos with effects […]"},{"link":"https://nmac.to/blog/eye-candy/","image":"https://nmac.to/wp-content/uploads/2018/11/Eye-Candy.png","title":"Eye Candy 7.2.3.189 – 30 professional Photoshop filters","content":"Eye Candy renders realistic effects that are difficult or impossible to achieve in Photoshop alone, such as Fire, Chrome, and the new Lightning. Effects like Animal Fur, Smoke, and Reptile Skin are rendered in exquisite detail down to individual hairs, turbulent wisps, and shiny scales.   Eye Candy helps you quickly explore and design looks. […]"},{"link":"https://nmac.to/blog/twitterrific/","image":"https://nmac.to/wp-content/uploads/2020/11/Twitterrific_5.png","title":"Twitterrific 5.4.9 – Effortlessly read and compose tweets","content":"Twitterific has been re-imagined from the ground up to be the Mac’s most friendly, powerful and modern Twitter client. Twitterrific makes Twitter fun. Twitter Your Way – A clean, uncluttered timeline featuring just the content you care about; tweets are presented in chronological order and other people’s likes aren’t placed in your timeline. Designed for […]"},{"link":"https://nmac.to/blog/glyphs/","image":"https://nmac.to/wp-content/uploads/2020/08/Glyphs_3.png","title":"Glyphs 3.0.5 – Dependable and intuitive font editor","content":"Glyphs smart and simple approach helps you draw new typefaces, modify existing fonts, and sculpt your letterforms hassle-free.   Version 3.0.5: Release notes were unavailable when this listing was updated.   Intel, 64-bit processor OS X 10.11 or later    "},{"link":"https://nmac.to/blog/hej-stylus/","image":"https://nmac.to/wp-content/uploads/2020/05/Hej_Stylus_3.png","title":"Hej Stylus 3.7.4 – Makes your cursor behave like a brush","content":"Hej Stylus! is a control system for your graphic tablets pen, mouse or other input method. It gives you control over the smoothness of your lines — damp out little irregularities up to using Hej Stylus! like a ruler. Its pressure-control system lets you define pressure control curves has pressure smoothing and buffering. Also the […]"},{"link":"https://nmac.to/blog/pocket-cleaner-pro/","image":"https://nmac.to/wp-content/uploads/2021/08/Pocket-cleaner-Pro.png","title":"Pocket cleaner Pro 1.5.9 – Remove junk & clean apps","content":"Pocket cleaner Pro the application that includes ToolKit for cleanup disk space from unneeded junk files that contains on your Mac.   Uninstaller tool is software for completely removing applications and leftover files that associated with app.   Unwanted files Finder scan your files and allows you to quick select from their categories: apps, archives, documents, […]"},{"link":"https://nmac.to/blog/menuwhere/","image":"https://nmac.to/wp-content/uploads/2021/04/Menuwhere.png","title":"Menuwhere 2.2 – The menu, anywhere","content":"The menu, anywhere. Utility puts the frontmost app’s menu bar into a pop-up menu at your mouse’s location—say goodbye to those long trips to the menu bar; the main menu is now just a hot key away   Drill down with mouse or keyboard Once on-screen, you can drill down into the menus as far […]"}]