[{"link":"https://nmac.to/blog/org-chart-designer-pro-3-90-1/","image":"https://nmac.to/wp-content/uploads/2016/06/Org-Chart-Designer-Pro.png","title":"Org Chart Designer Pro 3.90.1 – Drag-and-drop designer for org charts and network diagrams","content":"Org Chart Designer Pro makes it simple to create and publish professional org charts and network diagrams.   Features Intuitive drag and drop designer Supports shapes, textboxes, photos, image slideshows and table grids Supports multiple layerings with full layer arrangement and grouping features Supports advanced “Auto Branch Generation”, allows you to quickly add new levels […]"},{"link":"https://nmac.to/blog/socialpanel-1-3-5/","image":"https://nmac.to/wp-content/uploads/2016/06/SocialPanel.png","title":"SocialPanel 1.3.5 – Access social networks from your desktop","content":"SocialPanel brings a completely new experience to accessing your favorite social networks from your desktop. SocialPanel stays hidden from your desktop without disturbing your work and fades in or out when you move your mouse to the very right side of the screen (excluding the corners so you can use the OS X hot-corner shortcuts). […]"},{"link":"https://nmac.to/blog/pictureviewer-7-0-2/","image":"https://nmac.to/wp-content/uploads/2016/06/PictureViewer.png","title":"PictureViewer 7.0.2 – Slideshow images without import","content":"PictureViewer (LTS) – Real Time Event Photography – Enjoy your pictures as a slideshow on any device without import in REAL TIME.   1. Take a picture 2. PictureViewer displays it in real time 3. Show it on your Big Screen   Support for Real Time Viewing – Supports WiFi SD Cards like eyefi, Transcend, […]"},{"link":"https://nmac.to/blog/phoneexpander-1-1-3/","image":"https://nmac.to/wp-content/uploads/2015/11/PhoneExpander.png","title":"PhoneExpander 1.1.3 – Quickly free up iOS storage","content":"PhoneExpander is an app that runs on your Mac, just like iTunes. You connect your iOS device and are able to clear out space for updates, new apps, and media. It takes a few minutes to run, and you can use just one or all of the different tools. PhoneExpander is designed to be simple […]"},{"link":"https://nmac.to/blog/capture-gif-1-4-1/","image":"https://nmac.to/wp-content/uploads/2016/06/Capture.Gif.png","title":"Capture Gif 1.4.1 – Record your screen as an animated GIF","content":"With Capture Gif, you can easily record your entire screen or just an area as an animated GIF image. Capture Gif has support for multiple displays, is Retina-ready, and always generates clear GIF images.   Features Record any connected display Optionally capture the mouse cursor Can record OS X menu bar area (or anywhere on […]"},{"link":"https://nmac.to/blog/the-hit-list-1-1-24/","image":"https://nmac.to/wp-content/uploads/2015/10/The.Hit_.List_.png","title":"The Hit List 1.1.24 – Advanced reminder application","content":"The Hit List manages the daily chaos of your modern life. It’s easy to learn – it’s as easy as making lists. And it’s powerful enough to let you plan, then forget, then act when the time is right.   Your life is complicated enough as it is. The tool to manage your life shouldn’t […]"},{"link":"https://nmac.to/blog/instastack-3-0-8/","image":"https://nmac.to/wp-content/uploads/2015/03/Instastack.png","title":"Instastack 3.0.8 – Instagram Mac desktop client","content":"Instastack is the most elegant way to browse Instagram on the Mac.   MenuBar Panel InstaStack is a new tool to help you to discover Instagram social media network. if you want to connect your instagram account from menubar on your mac , InstaStack is your tool.   Browse Photo Feeds Browse your Instagram feed, […]"},{"link":"https://nmac.to/blog/franz-3-0-1/","image":"https://nmac.to/wp-content/uploads/2016/03/Franz.png","title":"Franz 3.0.1 – A free messaging app for Slack, Facebook Messenger, WhatsApp and more","content":"Franz is a free messaging app/former Emperor of Austria and combines chat & messaging services into one application. He currently supports Slack, HipChat, Facebook Messenger, Telegram, WhatsApp, Google Hangouts, Skype and Grape. You can download Franz for Mac and he is soon coming to Windows as well.   Franz allows you to add every service several […]"},{"link":"https://nmac.to/blog/epubor-ultimate-3-0-8-13/","image":"https://nmac.to/wp-content/uploads/2016/03/Epubor.Ultimate.png","title":"Epubor Ultimate 3.0.8.13 – Convert eBook formats and remove DRM","content":"Epubor Ultimate lets you convert and remove DRM from eBooks. The software can decrypt and convert eBooks purchased from: Amazon Kindle, Kobo, Sony, Google Play, Barnes, Noble Nook, Smashwords, and even public libraries.   What’s Unique New eBook conversion core developed by Epubor, 5x faster than others Now supports the Kobo DRM version 3.19, which […]"},{"link":"https://nmac.to/blog/chocolat-3-3/","image":"https://nmac.to/wp-content/uploads/2014/12/Chocolat3.png","title":"Chocolat 3.3 – Native Cocoa text editor","content":"Chocolat is a new text editor that combines native Cocoa with powerful text editing tools.    Features: Split editing Code completion Live errors Folding Symbol list Blockedit Vim mode Jump to definition Project find Go to file Web preview Documentation   Version 3.3: New and Improved Umm, there might be some improvements to JS support. […]"}]