[{"link":"https://nmac.to/blog/fidelia-1-6-0/","image":"https://nmac.to/wp-content/uploads/2015/08/Fidelia.png","title":"Fidelia 1.6.0 – High-definition audio player for sophisticated music lovers","content":"Fidelia is an elegant and powerful music player created exclusively for Mac OS X.   True Listening Anyone with a passion for music knows the value of high-quality hardware, whether it’s a perfectly calibrated power amp or world-class pair of speakers. If you use a Mac to build, organize and enjoy your music library, shouldn’t […]"},{"link":"https://nmac.to/blog/annotate-2-1-1/","image":"https://nmac.to/wp-content/uploads/2015/06/Annotate2.png","title":"Annotate 2.1.1 – Screenshot capture and annotation tool (was Glui)","content":"Annotate (was Glui) is the simplest way to capture, annotate and share screenshots.   This is a complete rewrite that builds on what made Glui popular and adds some of the most requested features. It’s way faster, far better, and most importantly, just as simple.   Key features: Capture a screenshot or drag and drop […]"},{"link":"https://nmac.to/blog/vssh-1-10-2/","image":"https://nmac.to/wp-content/uploads/2014/04/vSSH.png","title":"vSSH 1.10.2 – SSH protocol connectivity tools","content":"VSSH is advanced customizable SSH and Telnet client with iCloud connections, macros and keys sharing.   Key fetaures: SSH and Telnet protocols Username/password and public/private Keys authentication Multi-sessions with tabbed interface iCloud connections, macros and keys sharing with other vSSH apps (for iPhone, iPad and OS X) Key forwarding Port forwarding (support connection without shell: […]"},{"link":"https://nmac.to/blog/regexptester-1-17/","image":"https://nmac.to/wp-content/uploads/2015/08/RegexpTester.png","title":"RegexpTester 1.17 – Regular expression testing tool","content":"RegexpTester makes creating regular expressions easier than ever for developer.   Features: 1. RegexpTester is your perfect companion for working with regular expressions. 2. Easily create regular expressions that match exactly what you want. 3. Clearly understand complex regexes written by others. 4. Quickly test any regex on sample strings , preventing mistakes on actual […]"},{"link":"https://nmac.to/blog/photoflow-1-2-1/","image":"https://nmac.to/wp-content/uploads/2015/08/Photoflow.png","title":"Photoflow 1.2.1 – Brings Instagram to your Desktop","content":"Photoflow brings Instagram to the Desktop. You can view your feed, view popular photos, search for hashtags, browse nearby photos, and search for other Instagram users.   ** All third-party Instagram applications including Photoflow are not able to upload photos.   Features:   Multiple accounts: Switch accounts with ease by opening the sidebar accounts drawer. […]"},{"link":"https://nmac.to/blog/notes-calendar-1-0/","image":"https://nmac.to/wp-content/uploads/2015/08/Notes.Calendar.png","title":"Notes Calendar 1.0 – Simple and stylish calendar with ability to save notes!","content":"Simple and stylish calendar with ability to save notes!   With Notes Calendar you can: Use it as Calendar Tool Save one or several notes per day Associate each note with one of seven colors See all notes saved in one day or month or year See notes with specified color Full control over note’s […]"},{"link":"https://nmac.to/blog/milk-2-3-2/","image":"https://nmac.to/wp-content/uploads/2015/08/Milk.png","title":"Milk 2.3.2 – Desktop client for Tumblr","content":"Everything you love about Tumblr, from the comfort of your desktop. Work your way through your dashboard, search tags, post and reblog without any interruptions or contextual switch. Milk offers a distraction-free reading experience to suit to your taste. And it looks great in full screen.   Bird’s Eye View Break through the surface noise […]"},{"link":"https://nmac.to/blog/iscan-3-3-2/","image":"https://nmac.to/wp-content/uploads/2015/08/iScan-Police-and-Fire-Scanner.png","title":"iScan 3.3.2 – Listen to police and fire scanners from around the U.S","content":"iScan for the Mac lets you listen to police and fire feeds from around the nation on your Mac.   Features: Listen to feeds from around the nation Save up to 5 favorites Police Codes   Feeds included: LAPD New York Police & Fire Miami Las Vegas Houston Hawaii Police Baltimore City Police & Fire […]"},{"link":"https://nmac.to/blog/painkiller-hell-damnation/","image":"https://nmac.to/wp-content/uploads/2015/08/Painkiller.Hell_.Damnation.png","title":"Painkiller Hell & Damnation 1.0 – Heaven’s Hitman is Back… With a Vengeance","content":"Evil has returned! Demonic powers are manifesting themselves as a myriad of dark creatures, fighting over the fates of imprisoned souls caught in Purgatory.   Once again, it is up to Daniel Garner, in the unenviable position of being the Curse of Darkness and the Toy of Light, to fight his way past hordes of […]"},{"link":"https://nmac.to/blog/lego-batman-3-beyond-gotham-1-0/","image":"https://nmac.to/wp-content/uploads/2015/08/LEGO.Batman.3-Beyond.Gotham.png","title":"LEGO Batman 3: Beyond Gotham 1.0 – Bring Justice to a new frontier!","content":"Batman and the Justice League join forces and blast off into outer space to the stop the evil android Brainiac from using the power of the mysterious Lantern Rings to shrink the Earth and add it to his twisted collection of miniaturized civilizations.   In this epic, original LEGO adventure, play as over 150 of […]"}]