[{"link":"https://nmac.to/blog/iskysoft-video-converter/","image":"https://nmac.to/wp-content/uploads/2015/09/iSkysoft-Video-Converter6.png","title":"iSkysoft Video Converter 6.1.0 – Easily convert videos, movies and TV shows","content":"iSkysoft Video Converter lets you easily convert videos, movies and TV shows to optimized preset formats to fit iPhone, iPad, iPod, or edit with iMovie. It makes easier than ever to enjoy videos on your mobile device.   Key Features:   30X Faster Conversion Speed Convert video 30X faster, especially converting H.264 encoded video, such […]"},{"link":"https://nmac.to/blog/togethershare-data-recovery/","image":"https://nmac.to/wp-content/uploads/2019/11/TogetherShare-Data-Recovery.png","title":"TogetherShare Data Recovery 7.1 – Easy and quick way to recover deleted or lost data on Mac","content":"TogetherShare Data Recovery gives Mac users an easy and quick way to recover deleted or lost data on Mac. Lots of Mac users lose important data due to accidental deletion, format or erasure. But the data is not lost forever. With reliable Mac data recovery software, like TogetherShare Data Recovery for Mac, the Mac users […]"},{"link":"https://nmac.to/blog/application-wizard/","image":"https://nmac.to/wp-content/uploads/2013/07/Application-Wizard.png","title":"Application Wizard 4.1 – Convenient app launcher and quitter","content":"Application Wizard provides fast access to applications, documents, folders, and disks. It lets you quickly open, quit, and make applications active, run AppleScripts, and reduce screen clutter by turning on single-application mode.   With Application Wizard you can also browse volumes and favorite folders to quickly open enclosed items, eject and mount disks, check memory […]"},{"link":"https://nmac.to/blog/movavi-photo-manager/","image":"https://nmac.to/wp-content/uploads/2018/12/Movavi-Photo-Manager.png","title":"Movavi Photo Manager 2.0.0 – Focus on the memories, forget about managing photos","content":"Movavi Photo Manager will help you manage your entire photo collection, including images in RAW, JPEG, PNG, and many other formats. Movavi’s photo organizer will be an essential tool for anyone who values their time as much as their photo collection.   Organize photos Automatic Album Creation Movavi’s photo organizer will automatically sort your images […]"},{"link":"https://nmac.to/blog/asterix-obelix-xxl-3-the-crystal-menhir/","image":"https://nmac.to/wp-content/uploads/2019/11/Asterix-Obelix-XXL-3.png","title":"Asterix & Obelix XXL 3 – The Crystal Menhir 1.56 – An exciting co-op & singleplayer adventure game","content":"The year is 50 B.C. Gaul is entirely occupied by the Romans. Well, not entirely… One small village of indomitable Gauls still holds out against the invaders. And life is not easy for the Roman legionaries who garrison the fortified camps of Totorum, Aquarium, Laudanum and Compendium.   Peace reigns in the small Armorican village, […]"},{"link":"https://nmac.to/blog/launchpad-manager/","image":"https://nmac.to/wp-content/uploads/2016/02/Launchpad.Manager.Yosemite.png","title":"Launchpad Manager 1.0.10 – Take control of Launchpad","content":"Launchpad Manager helps you get the most out of Launchpad! Delete, Rearrange, Group or Ungroup any of your Launchpad Icons, or simply put them into alphabetical order!   Version 1.0.10: Release notes were unavailable when this listing was updated.   Intel, 64-bit processor OS X 10.7 or later    "},{"link":"https://nmac.to/blog/monthlycal/","image":"https://nmac.to/wp-content/uploads/2016/10/MonthlyCal1.png","title":"MonthlyCal 1.5.5 – A colorful monthly calendar widget","content":"MonthlyCal is a beautiful and colorful monthly calendar widget for OS X Yosemite. MonthlyCal supports gregorian’s calendar and it is almost localized in every language!   With the new version you can click on a day to show the list of related events. Click on an event to show it in OS X Calendar app! […]"},{"link":"https://nmac.to/blog/capo/","image":"https://nmac.to/wp-content/uploads/2017/10/Capo3.png","title":"Capo 3.8.1 – Slow down and learn to play your favorite songs","content":"Capo lets you slow down your favorite songs so you can hear the notes and learn how they are played. With Capo, you can quickly tab out your songs atop a highly-detailed OpenCL-powered spectrogram display.   Detect, and enter chords Pitch adjustment Mark song sections Loop at slower speeds Export Capo-adjusted music Basic effects available […]"},{"link":"https://nmac.to/blog/curio/","image":"https://nmac.to/wp-content/uploads/2017/09/Curio11.png","title":"Curio 13.2 – Brainstorming and project management app","content":"Curio is the premier brainstorming and project-management application designed to promote visual thinking. Using Curio’s innovative freeform interface and tools, you can intuitively gather, associate, and recall your ideas, while easily managing all the notes and documents associated with your project.   The heart of Curio is the idea space. Think of idea spaces as […]"},{"link":"https://nmac.to/blog/declutter/","image":"https://nmac.to/wp-content/uploads/2017/02/Declutter2.png","title":"Declutter 2.5 – Automatic desktop organizer with Smart folders","content":"Declutter is a solution to desktop clutter that every Mac user faces. Declutter helps you to create Smart folders with rules based on file names and extensions. It automatically keeps your desktop organised and clean.   Version 2.5: Bugs fixed for macOS High Sierra. Optimised folder rule intelligence. Fixed minor bugs.   Intel, 64-bit processor […]"}]