[{"link":"https://nmac.to/blog/cathode/","image":"https://nmac.to/wp-content/uploads/2015/10/Cathode2.png","title":"Cathode 2.4.1 – Vintage terminal emulator","content":"Cathode is a graphically-rich, vintage terminal.   Bask in the glow of over-bright phosphors that flash on and slowly fade away. Customize the screen’s curvature, colors, and transparency. Slow the bit-rate to a crawl. Watch the strange dance of beam desyncs and shifting colors. Turn up the noise, jitter, and flicker to add a realistic […]"},{"link":"https://nmac.to/blog/tunesgo-retro/","image":"https://nmac.to/wp-content/uploads/2015/12/Wondershare-TunesGo-Retro.png","title":"TunesGo Retro 4.9.2 – Transfer music from your mobile to iTunes Library","content":"TunesGo Retro (was TunesGo) gives you the freedom to transfer music and playlists from your iPhone, iPad and iPod to your iTunes Library on your Mac. You can’t depend on iTunes to rebuild your iTunes Library or backup music, videos, photos, voice memos, etc. to your Mac. It simply can’t do it. Instead, you need […]"},{"link":"https://nmac.to/blog/ssh-shell/","image":"https://nmac.to/wp-content/uploads/2016/06/SSH-Shell.png","title":"SSH Shell 17.08 – Secure one-click log-in","content":"SSH Shell lets you login to your server with one click.   Notable Features Can manage multiple SSH sessions for different servers Automatically reconnect after disconnected by errors or waking up from sleep Remember and autofill SSH login passwords in OS X keychain automatically Able to manage private keys, and can remember / forget passphrases […]"},{"link":"https://nmac.to/blog/focus-ck/","image":"https://nmac.to/wp-content/uploads/2014/12/Focus-CK.png","title":"Focus CK 1.1.0 – Add professional lens effects without expensive gear","content":"Focus CK (was Focus Pro) helps you eliminate the need for additional physical (expensive) equipment and extends filter and lens functionality beyond your camera, simplifying your shoot and giving you more control. Break out of the ordinary and easily create selective focus, lens blur, motion blur and tilt-shift effects.   You’ll be amazed at how […]"},{"link":"https://nmac.to/blog/video-to-gif-maker/","image":"https://nmac.to/wp-content/uploads/2017/01/Video-to-GIF-Maker.png","title":"Video to GIF Maker 1.0.53 – Convert Any video to GIF Format","content":"Video to GIF Maker is one top gif maker on Mac OS X. On one hand, this video to GIF converter helps you to make a GIF from video. Like MP4 to GIF, MOV to GIF, and 200+ other videos to GIF. On the other hand, you can edit videos and adjust video settings before […]"},{"link":"https://nmac.to/blog/any-dvd-ripper/","image":"https://nmac.to/wp-content/uploads/2016/12/Any-DVD-Ripper.png","title":"Any DVD Ripper 3.7.95 – Convert DVD to MP4","content":"Any DVD Ripper is fast-converting and easy-to-use DVD ripping software to help you rip DVD movies to 4K/1080p HD video, to portable devices like iPhone, iPod, iPad, Samsung and other phone, etc. It serves as the best DVD Rip software and DVD audio extractor, allowing you to rip DVD to any video/audio formats like MP4, […]"},{"link":"https://nmac.to/blog/super-dvd-creator/","image":"https://nmac.to/wp-content/uploads/2017/07/Super-DVD-Creator.png","title":"Super DVD Creator 6.1.33 – Burn Any Video to DVD","content":"Super DVD Creator is especially designed for you to burn DVD with any video. You can convert any video like MP4, 3GP, MTS, TS, AVI, WMV, and MKV and some HD videos like HD MTS, HD TS and HD M2TS to DVD disc with no limitation. Also, it enables you to create DVD folder and […]"},{"link":"https://nmac.to/blog/fx-photo-studio-pro/","image":"https://nmac.to/wp-content/uploads/2015/03/FX-Photo-Studio-CK.png","title":"FX Photo Studio CK 3.1.0 – Creative filters and photo effects","content":"FX Photo Studio CK (was FX Photo Studio Pro) has a broad palette of effects and features which brings boundless creativity to your photography projects. Whether you are a professional photographer or a hobbyist, this powerful post-processing photo editor takes your images to a whole new level of clarity, brilliance, and style.   Features Includes […]"},{"link":"https://nmac.to/blog/money/","image":"https://nmac.to/wp-content/uploads/2017/04/Money5.png","title":"Money 5.1.5 – Personal accounting app","content":"Get your finances on track with the gorgeous new Money! Your day-to-day finance management will no longer be a chore with the beautiful and comprehensive suite of powerful features that is Money!   Oversee and control your accounts, plan budgets, easily generate informative reports, and schedule transactions – everything will be updated across your devices […]"},{"link":"https://nmac.to/blog/onde-rulers/","image":"https://nmac.to/wp-content/uploads/2017/08/Onde-Rulers.png","title":"Onde Rulers 1.13.1 – Measure objects on your screen","content":"Onde Rulers is an accurate virtual screen rulers on Mac, by which you can measure dimensions of objects in Pixels, Inches, Picas, Centimeters and calibrated units. In addition, a built-in protractor can measure angles in angles and radians.   Futures: Quickly and easily measure the length and width of any object in pixels, inches, picas, […]"}]