[{"link":"https://nmac.to/blog/itrash/","image":"https://nmac.to/wp-content/uploads/2017/02/iTrash4.png","title":"iTrash 5.3.3 – Comprehensive uninstaller; uses Levenshtein Distance algorithm","content":"iTrash is an uninstall utility that uses a special search algorithm (Levenshtein Distance algorithm) to find all related files and deletes them when asked.   Applications distribute several files throughout your system storage devices. Deleting an application itself is mostly not enough and will leave several files untouched.   Features: Simple drag-and-drop Enabled ‘Put Back’ […]"},{"link":"https://nmac.to/blog/duplicate-photos-sweeper/","image":"https://nmac.to/wp-content/uploads/2020/11/Duplicate-Photos-Sweeper.png","title":"Duplicate Photos Sweeper 3.9 – Best Duplicate Photos Cleaner","content":"Duplicates Photos Sweeper is a very simple and easy to use tool that helps you quickly find and remove duplicate and similar photos from your Mac. Anyone without being tech savvy can use it to search duplicate photos or similar photos on a Mac system and can remove them with ease of a click. Unlike […]"},{"link":"https://nmac.to/blog/the-solitaire-conspiracy/","image":"https://nmac.to/wp-content/uploads/2020/11/The.Solitaire.Conspiracy.png","title":"The Solitaire Conspiracy 1.06.4 – Cyberpunk Card Game","content":"Protego, the world’s leading spy agency, has been destroyed. Only one person can wield C.A.R.D.S to take control of Protego’s scattered spy crews and save the world.   You. Guided by Protego’s only remaining analyst, Jim Ratio (Greg Miller), you must master the unique powers of each crew in a game of tactical Solitaire like […]"},{"link":"https://nmac.to/blog/hexaflip/","image":"https://nmac.to/wp-content/uploads/2020/12/Hexaflip.png","title":"Hexaflip: The Action Puzzler 5.0.4 – Hyper-casual at its best","content":"In Hexaflip, you flip through hexagonal mazes filled with deadly obstacles. Avoid hammers, spikes, lasers and more to collect orbs and reach the end! This is a real action-puzzle brain-teaser that mixes timing with thinking.   Flip through beautiful and abstract worlds complemented by an atmospheric soundtrack in an experience brought to life with the […]"},{"link":"https://nmac.to/blog/iwatermark-pro/","image":"https://nmac.to/wp-content/uploads/2017/09/iWatermark-Pro2.png","title":"iWatermark Pro 2.6.3 – Easily add watermarks to art, photos and more","content":"iWatermark Pro – The Essential Watermarking App for Professionals, Business and Personal Use.    iWatermark, is the No. 1 and only watermarking tool available for all 4 platforms iPhone/iPad, Mac, Android and Windows. iWatermark is the most popular professional watermarking tool for photos.   Easily, secure and protect your photos with a text, graphic, signature […]"},{"link":"https://nmac.to/blog/blotter/","image":"https://nmac.to/wp-content/uploads/2015/09/Blotter_2.png","title":"Blotter 2.2.5 – Streamlined desktop calendar","content":"Blotter is a streamlined calendar viewer which displays itself right on your desktop. Beautifully discreet and out of the way, yet only a glance away. Did you ever mark something in your calendar only to forget to check the calendar? No more.   Blotter is an easy way to increase your productivity. With your week […]"},{"link":"https://nmac.to/blog/aweeraser/","image":"https://nmac.to/wp-content/uploads/2019/11/AweEraser4.png","title":"AweEraser 4.5 – Erase data securely","content":"AweEraser is a secure Mac data eraser. It can securely and permanently erase data from hard drive/storage media, permanently delete Mac files, wipe hard drive, and erase already deleted data under Mac OS. It also offers tools to help you batch remove applications on your Mac and clean up browsers histories, caches, privacy, etc.   […]"},{"link":"https://nmac.to/blog/stranded-deep/","image":"https://nmac.to/wp-content/uploads/2015/02/Stranded-Deep.png","title":"Stranded Deep 0.74.00 Early Access – Scavenge. Discover. Survive game","content":"Take the role of a plane crash survivor stranded somewhere in the Pacific Ocean. Experience terrifying encounters both above and below an endless environment. Come face to face with some of the most life threatening scenarios that will result in a different experience each time you play.   Features : Infinite Procedurally-generated World – Explore […]"},{"link":"https://nmac.to/blog/manifold-garden/","image":"https://nmac.to/wp-content/uploads/2020/12/Manifold-Garden.png","title":"Manifold Garden 1.0.14044 – Explore an Escheresque world","content":"Explore a beautiful Escheresque world where the laws of physics are different. Geometry repeats infinitely in every direction, and falling down leads you back to where you started. Manipulate gravity to change your perspective and see the world in new ways. Master the rules of the universe and restore a barren world with vegetation and […]"},{"link":"https://nmac.to/blog/tunefab-dvd-ripper/","image":"https://nmac.to/wp-content/uploads/2020/12/TuneFab-DVD-Ripper.png","title":"TuneFab DVD Ripper 1.0.20.93447 – Rip video contents from DVD","content":"TuneFab DVD Ripper can be used by Mac users to rip movies, TV shows, music videos, etc. stored in DVDs to common video formats such as MP4, MOV, AVI, etc., so that people can enjoy the contents freely without the limitations of DVD.   Features Rip DVD Contents to 300+ Formats on Mac TuneFab DVD […]"}]