[{"link":"https://nmac.to/blog/my-photo-pro/","image":"https://nmac.to/wp-content/uploads/2018/02/My-Photo-Pro.png","title":"My Photo Pro 1.1 – Create passport photos directly from your Mac","content":"Few and intuitive steps and you can print, save or share your photos for documents and passport.   Do not necessary great knowledge of photography world, you can use this app if you are inexperienced or photographer. Save time and money. Photo formats most common in the world, 4.5×3.5 cm, 2×2 inch, 4×3 cm and […]"},{"link":"https://nmac.to/blog/ddns-broker/","image":"https://nmac.to/wp-content/uploads/2018/02/dDNS-Broker.png","title":"dDNS Broker 2.7 – Ultimate dynamic DNS update client for Mac","content":"dDNS Broker (formally known as IP Monitor) works with about 50 popular DDNS service providers, and can monitor public IPv4 and IPv6 address changes across multiple network interfaces. Since dDNS Broker can distinguish between separate networks, it works without interruption should your server ever be on the move, either physically or virtually. Also, dDNS Broker always […]"},{"link":"https://nmac.to/blog/markdownd/","image":"https://nmac.to/wp-content/uploads/2016/03/MarkdownD.png","title":"MarkdownD 4.0.3 – A full-featured Markdown editor","content":"MarkdownD is a full-featured Markdown editor. For MacOS x 10.7.5 or later.   Features: Support standard Markdown/CommonMark and GFM (GitHub Flavored Markdown Live preview support Support formatted text, code blocks, tables, code folding, search and replace, multiple languages, HTML entity code – syntax highlighting Support Toc (Table of Contents), Emoji expression, TaskLists (task map), @Links […]"},{"link":"https://nmac.to/blog/mocks/","image":"https://nmac.to/wp-content/uploads/2015/10/Mocks.png","title":"Mocks 2.7 – A powerful, native UI Mockup tool for Mac OS X","content":"Rapidly create beautiful, high-fidelity mockups of iOS, iPad and iPhone applications with Mocks. Mocks is an modern, native app for Mac OS X that gives you special tools to design mockups of iOS applications and screens.   Mocks comes with a built-in collection of graphics depicting iOS UI controls and widgets (like buttons, toolbars, and […]"},{"link":"https://nmac.to/blog/typeit4me/","image":"https://nmac.to/wp-content/uploads/2015/01/TypeIt4Me6.png","title":"TypeIt4Me 6.0.3 – Completes partially typed words for you","content":"TypeIt4Me expands your abbreviations as you type, and works in all applications, not just one. It also lets you define meaningful abbreviations, so you can type them naturally, as part of your writing, without memorizing – or reaching for – obscure ⌃⌘xyz combinations.   Anytime you enter text in your Mac by typing it at […]"},{"link":"https://nmac.to/blog/niffelheim/","image":"https://nmac.to/wp-content/uploads/2018/02/Niffelheim.png","title":"Niffelheim 0.9.022.35 – RPG, Survival & Exploration Game","content":"Niffelheim is a 2D action exploration game in a Nordic fantasy setting, with a huge hand-drawn world.   Death means nothing to the Gods. Arise and face the demons of death. Fight against the blind rage of spirits. Triumph against the ancient forces that rule over this harsh world. Your path is steeped in blood […]"},{"link":"https://nmac.to/blog/google-docs-templates-by-gn/","image":"https://nmac.to/wp-content/uploads/2017/12/Google-Docs-Templates-by-GN.png","title":"Google Docs Templates by GN 4.1 – Templates Bundle for Google Docs, Sheets & Slides","content":"Google Docs Templates by GN are the ideal support for those who want to create beautiful content on cloud-based productivity tools.   Google Docs Templates provides over 100 templates for Google Docs, 70 for Google Sheets, and 110 for Google Slides.   Google Docs templates for: Books Certificates Faxes Invoices Letters Newsletters Posters Proposals   […]"},{"link":"https://nmac.to/blog/av-recorder-screen-capture/","image":"https://nmac.to/wp-content/uploads/2016/08/AV.Recorder..Screen.Capture.png","title":"AV Recorder & Screen Capture 2.2.0 – Easy-to-use screen capture software","content":"AV Recorder & Screen Capture – The best quality and easy-to-use screen capture and audio, video recording tool. Have the ability to record voice from mic & system audio at the same time. The app is perfect for creating tutorials, lectures, game playing and recording on your Mac. Also you can instantly share the recording […]"},{"link":"https://nmac.to/blog/colored/","image":"https://nmac.to/wp-content/uploads/2018/02/Colored.png","title":"Colored 1.2.2 – Create color palettes","content":"Colored enables you to create stunning color palettes and supports all common formats.   With Colored, you’ll create stunning color palettes in just a few seconds. Just choose a primary color — Colored then generates well-matching colors on-the-fly. Discover tones, shades, and tints, as well as complementary, triadic, and analogous colors. Export your color in […]"},{"link":"https://nmac.to/blog/disk-care/","image":"https://nmac.to/wp-content/uploads/2018/02/Disk-Care2.png","title":"Disk Care 2.0 – Clean & Create Free Space on your Drive","content":"Most powerful and beautiful disk space saving app. Time to find you much needed space on your drive.   Clean & create gigabytes of unneeded and unwanted files on your drive in a few clicks.   Disk Care optimizes the following folders: Cache App Logs Old iOS Downloads Mail Downloads Browser Data Trash   In […]"}]