[{"link":"https://nmac.to/blog/multimarkdown-composer/","image":"https://nmac.to/wp-content/uploads/2019/01/MultiMarkdown-Composer.png","title":"MultiMarkdown Composer 4.5.12 – Text editor built around the MultiMarkdown syntax","content":"MultiMarkdown Composer is a text editor specifically designed for writing in MultiMarkdown (or regular Markdown).   By using an editor built around Markdown/MultiMarkdown, you can focus on the *writing*, rather than worrying about formatting and styles. Composer’s intelligent tools provide automatic support while you write — organize your document with the Table of Contents, quickly […]"},{"link":"https://nmac.to/blog/tipard-all-music-converter/","image":"https://nmac.to/wp-content/uploads/2016/12/Tipard-All-Music-Converter.png","title":"Tipard All Music Converter 9.1.16 – Convert to MP3","content":"All Music Converter as the best audio conversion app, it can convert any audio file like MP3, M4A, WMA, WAV, AIFF, AAC, FLAC, OGG, and Apple Lossless (ALAC) and so on. Also the Audio Convert can extract music/audio from any videos include MP4.   Besides, it also works as Music Converter to iTunes/iPod, free audio […]"},{"link":"https://nmac.to/blog/simpleedit/","image":"https://nmac.to/wp-content/uploads/2013/07/SimpleEdit.png","title":"SimpleEdit 1.6 – Clean, easy, and customizable text editor","content":"SimpleEdit is powerful, customizable, has iCloud/Dropbox Support, and is Retina-aware.   Yes, sometimes a jam-packed editor is necessary. But in most cases we need something simple, fast and uncluttered. SimpleEdit will be your first second editor of choice. It is very fast, iCloud* enabled, powerful and clean.   The best thing about SimpleEdit is its […]"},{"link":"https://nmac.to/blog/write/","image":"https://nmac.to/wp-content/uploads/2017/03/Write2.png","title":"Write 2.6 – Simple, lightweight word processor","content":"Write is a cute, lightweight word processor for your daily writing tasks. It is fast, clean, intuitive to use, and has a native (Mac-like) and uncluttered interface. Most important of all, it is very user-friendly. It has some nifty features and tools that are sure to make it your word processor of choice for all […]"},{"link":"https://nmac.to/blog/windocd/","image":"https://nmac.to/wp-content/uploads/2019/12/windOCD.png","title":"windOCD 1.6 – Window management","content":"Let windOCD put windows in their places! One Tool to find them. Arrange, align, and move all your windows with a snap of the fingers. No need for a mouse or to open yet another window first. One Tool to bring them all. Clutter is the enemy of any productive work and creativity. With windOCD […]"},{"link":"https://nmac.to/blog/passwords/","image":"https://nmac.to/wp-content/uploads/2019/12/Passwords.png","title":"Passwords 1.6 – All your passwords in one safe place","content":"Passwords is document-based; thus you can have unlimited vaults with unlimited entries synced via Dropbox, iCloud, and Co.    With Password you manage all your important and sensitive information. Your entries and your files are password protected.    All your entries and files are stored encrypted. Once unlocked, they are available in a blink, completely searchable […]"},{"link":"https://nmac.to/blog/gobdocuments/","image":"https://nmac.to/wp-content/uploads/2018/04/GoBDocuments.png","title":"GoBDocuments 1.6 – Secure document archival","content":"Think of GoBDocuments as a secure container for all your important documents. All actions are monitored and logged, and this log can be exported at any time. Documents stored in the program cannot be modified or manipulated. Thus, GoBDocuments can be used for accounting, business, and legal documents.   GoBDocuments meets the strict requirements of […]"},{"link":"https://nmac.to/blog/bill/","image":"https://nmac.to/wp-content/uploads/2018/03/Bill.png","title":"Bill 2.8.2 – Invoicing made painless and fun","content":"Bill is invoicing made painless and fun. It doesn’t get any easier. Just three simple steps to your perfect invoice: Create Invoice: An invoice consists of three parts: Client information; invoice information; and items, shipping, discount, and amount. You can also create quotes, which can be converted into invoices. Invoices can have an individual number, […]"},{"link":"https://nmac.to/blog/free/","image":"https://nmac.to/wp-content/uploads/2019/12/Free.png","title":"Free 2.4 – Clean and clutter-free text editor","content":"Free is all you need to write. Truly write. Simple. Uncluttered. Sophisticated. Dropbox enabled. Retina-aware. No mess, no fuss. With All you need to write. Truly write., you don’t need to worry about the glitz and glamour of eye-candy filling your screen, meaning less clutter, less distractions, and less troubles; Free’s integrated automated environment helps […]"},{"link":"https://nmac.to/blog/umsatz/","image":"https://nmac.to/wp-content/uploads/2019/12/Umsatz.png","title":"Umsatz 9.0.2 – Accounting for the German tax system","content":"Umsatz is written and maintained for the German, Austrian, and Swiss finance and tax system – so it is German only.   Du hast Besseres zu tun, als dich mit der Finanzbuchhaltung, der Voranmeldung und benutzerunfreundlichen Programmen rumzuschlagen. Deswegen ist Umsatz auf intuitive und schnelle Bedienung ausgelegt. Du wirst dich sofort zurechtfinden und viel mehr […]"}]