[{"link":"https://nmac.to/blog/dockview/","image":"https://nmac.to/wp-content/uploads/2013/01/DockView_1.png","title":"DockView 1.2 – View previews of applications from the Dock","content":"DockView is a utility that adds a preview of the windows of the selected application in the macOS Dock. You just need to bring the mouse to its icon and thumbnails of all its windows will appear. By clicking on the one you need, you will immediately go to it. Through Window Thumbnails, you can […]"},{"link":"https://nmac.to/blog/silence-game/","image":"https://nmac.to/wp-content/uploads/2016/11/Silence.png","title":"Silence 1.2.2 – Point & Click Adventure & Fantasy Game","content":"War rages on. During an air raid, 16 year old Noah and his little sister Renie seek shelter in a bunker. There, not only are they protected from the deadly bombardment, but are also at the crossroads of a world between life and death: Silence. When Noah’s sister gets lost in Silence, he is forced […]"},{"link":"https://nmac.to/blog/bettertouchtool/","image":"https://nmac.to/wp-content/uploads/2016/01/BetterTouchTool.png","title":"BetterTouchTool 3.562 – Customize Multi-Touch trackpad gestures","content":"BetterTouchTool adds many new, fully customizable gestures to the Magic Mouse, Multi-Touch MacBook trackpad, and Magic Trackpad.   These gestures are customizable:   Magic Mouse: Pinch in / out (zoom) single-finger tap left single-finger tap right single-finger tap middle single-finger tap single-finger click middle two-finger tap two-finger click two-finger swipe (up/down/left/right) two-finger tip tap left/right […]"},{"link":"https://nmac.to/blog/references-design/","image":"https://nmac.to/wp-content/uploads/2020/02/References-Design.png","title":"References.Design 2.4.1 – Explore, discover and organize your digital inspirations","content":"References.Design helps to to get freshest inspirations from all over the popular design communities, as well as import your personal collections. You can easily manage all your online and offline assets in one place.   Browse the curated design inspirations and stories from a selective series of sources. Keep reading and more suitable contents will […]"},{"link":"https://nmac.to/blog/metasequoia/","image":"https://nmac.to/wp-content/uploads/2016/10/Metasequoia.png","title":"Metasequoia 4.7.7a – Create, edit and render complex 3D models","content":"3D modeling applications are in high demand these days, as graphic designers, game developers and animators need specialized tools to help them create new and better content. Whether you are an expert or beginner, there are plenty of apps to try out, but a versatile, easy-to-use platform is sometimes the best choice.   Metasequoia is […]"},{"link":"https://nmac.to/blog/paragon-ntfs/","image":"https://nmac.to/wp-content/uploads/2017/02/Paragon-NTFS-15.png","title":"Paragon NTFS 15.8.243 – Provides full read and write access to NTFS volumes","content":"NTFS breaks down the barriers between Windows and OS X. Paragon NTFS effectively solves the communication problems between the Mac system and NTFS, providing full read and write access to Windows NTFS partitions under OS X. Excellent solution for end users, SOHO, and enterprise, supports all NTFS versions from Windows NT 3.1 to Windows 8 […]"},{"link":"https://nmac.to/blog/circular-studio/","image":"https://nmac.to/wp-content/uploads/2017/05/Circular-Studio2.png","title":"Circular Studio 2.5 – Powerful ‘tiny planet’ photo editor","content":"Circular Studio is an incredibly powerful “tiny planet” app for the Mac. It has innovative new features never seen before in this type of app, such as sky objects, centers, clouds, and flares.   Features Real-time image editing Adjust image zoom, rotation, invert-mode, and repeats Innovative visual effects such as sky decorations, centers and flares. […]"},{"link":"https://nmac.to/blog/maxsnap/","image":"https://nmac.to/wp-content/uploads/2017/05/MaxSnap.png","title":"MaxSnap 1.74 – Powerful window manager","content":"MaxSnap is a powerful window manager which lets you: Move, arrange, and resize windows with menu-bar icon or keyboard shortcuts Option/Alt-Drag – move and resize windows without using the windows’ title bar Quickly move windows using multi-touch gestures   Version 1.74: Release notes were unavailable when this listing was updated.   Intel, 64-bit processor OS […]"},{"link":"https://nmac.to/blog/word-counter-pro/","image":"https://nmac.to/wp-content/uploads/2017/09/Word_Counter_Pro_3.png","title":"Word Counter Pro 3.1 – A simple and powerful application for writers","content":"Word Counter Pro is a simple and powerful application for writers. With Word Counter Pro you can view statistics of your writing such as Word count, Character count, Sentence count, Line count, Paragraph count, and more.   Word Counter Pro allows you to view stats in four different ways: You can type or paste text […]"},{"link":"https://nmac.to/blog/windowswitcher/","image":"https://nmac.to/wp-content/uploads/2019/02/WindowSwitcher.png","title":"WindowSwitcher 1.42 – Quickly switch between open windows","content":"WindowSwitcher allows you to quickly find and switch between open application windows (all windows, only active windows, active application windows) and control the position of windows on the screen, for example, right from the list of windows, place the Safari window on the left and the Pages window on the right, so it is convenient […]"}]