[{"link":"https://nmac.to/blog/far-lone-sails/","image":"https://nmac.to/wp-content/uploads/2019/03/Far.Lone_.Sails_.png","title":"FAR: Lone Sails 1.21 – Atmospheric Adventure Game","content":"FAR: Lone Sails is a vehicle adventure game. In a unique vehicle you travel across a dried-out ocean following the tracks of a once thriving civilization. Through an array of roadblocks and through hazardous weather you need to keep your vessel going. Where will this journey take you? Are you the last of your kind? […]"},{"link":"https://nmac.to/blog/hobo/","image":"https://nmac.to/wp-content/uploads/2016/06/Hobo1.png","title":"Hobo 1.5.3 – The best way to use Vagrant on your Mac","content":"Hobo is the best and easiest way to control your Vagrant boxes and edit Vagrantfiles on your Mac. You can quickly start, stop, and reload your Vagrant machines. And you can easily create a new Vagrantfile from scratch.   What Hobo Does Start, stop, reload, and destroy Vagrant environments. Novice users can launch new Vagrant […]"},{"link":"https://nmac.to/blog/indivisible/","image":"https://nmac.to/wp-content/uploads/2019/10/Indivisible.png","title":"Indivisible 1.0.38929 – An action RPG platformer game","content":"Indivisible is an action RPG platformer featuring stunning hand drawn art and animation combined with unique real-time combat mechanics.   Immerse yourself in a fantastical world with dozens of playable characters, a rich storytelling experience, gameplay that’s easy to learn but difficult to master, and the trademark razor-sharp quality that Lab Zero Games is known […]"},{"link":"https://nmac.to/blog/everspace/","image":"https://nmac.to/wp-content/uploads/2017/05/Everspace.png","title":"EVERSPACE 1.3.5 – Space Sci-fi Action Game","content":"Encounters is the first major expansion for EVERSPACE™, enriching the game world with new story characters and questlines, a brand-new player ship, freighter-loads of novel equipment, additional enemies, and much more.   A NEW RIDE Impress your peers with the new Colonial Sentinel, a medium fighter craft, and make use of its powerful shield and […]"},{"link":"https://nmac.to/blog/movavi-video-editor-business/","image":"https://nmac.to/wp-content/uploads/2018/06/Movavi-Video-Editor-Business.png","title":"Movavi Video Editor Business 15.5.0 – Create videos for your business","content":"With Movavi Video Editor Business for Mac, you can easily create high-quality videos for your business: tutorials, marketing videos, software presentations, video blog content, and much more. Grab your clients’ and prospects’ attention and increase your income with custom videos. Promote your company through branded footage, complete with your logo and contact information. Market your […]"},{"link":"https://nmac.to/blog/quiver/","image":"https://nmac.to/wp-content/uploads/2015/11/Quiver.png","title":"Quiver 3.2.7 – The Programmer’s Notebook","content":"Quiver is a notebook built for programmers. It lets you easily mix text, code, Markdown and LaTeX within one note, edit code with an awesome code editor, live preview Markdown and LaTeX, and find any note instantly via the full-text search.   Mix Text, Code, Markdown and LaTeX A note in Quiver is comprised of […]"},{"link":"https://nmac.to/blog/appdoo/","image":"https://nmac.to/wp-content/uploads/2019/04/appdoo.png","title":"appdoo 1.0.3 – Create native iOS apps without programming knowledge","content":"With appdoo you can create native iOS apps without programming knowledge and publish them in the App Store. appdoo is intended for all those who have a great idea for an app but don’t have the necessary programming knowledge. On the other hand, appdoo is suitable for very quickly creating a prototype of an app […]"},{"link":"https://nmac.to/blog/smart-zipper-pro/","image":"https://nmac.to/wp-content/uploads/2014/06/Smart-Zipper-Pro3.png","title":"Smart Zipper Pro 3.70 – File archiver and viewer","content":"Smart Zipper Pro is an easy-to-use and efficient compression and decompression tool.   Extraction formats supported:   Over 20 different file types ranging from RAR, 7z, ISO, CAB, Zip, StuffIt, Lzma, Tar, Gzip, Bzip2, EXE, PAX and much more.   Compression formats supported:   7z, Zip, Gzip, Tar, Bzip2 with 5 different compression levels.   […]"},{"link":"https://nmac.to/blog/mybrushes/","image":"https://nmac.to/wp-content/uploads/2016/10/MyBrushes.png","title":"MyBrushes 2.1.6 – Sketch, Paint, Design Tool","content":"MyBrushes for Mac is a wonderful paint program based on a former drawing application named Paintbrush. Paintbrush hadn’t been updated for 5 years and was not compatible with most of the Mac operating system already. It is time for a better paint program for Mac users.   My Brushes for Mac is the only digital […]"},{"link":"https://nmac.to/blog/synalyze-it-pro/","image":"https://nmac.to/wp-content/uploads/2017/10/Synalyze-It1.png","title":"Synalyze It! Pro 1.23.4 – Analyze and edit binary files of any size","content":"Synalyze It! Pro is a simple-to-use hex editor which will allow you to easily edit and analyze binary files of any size.   Synalyze It! features enhanced support for many character encodings and enables you to interactively define “grammars” for various file formats to speed up analysis and reduce manual decoding of files. Incremental search […]"}]