[{"link":"https://nmac.to/blog/purple-notes-4-2/","image":"https://nmac.to/wp-content/uploads/2016/10/Purple-Notes.png","title":"Purple Notes 4.2 – Simple, powerful and easy to use notes application","content":"Purple Notes is a very simple, powerful and easy to use notes application. The application uses iCloud for the data synchronisation between your iPhone, iPad and Mac. All data is stored on your devices.   It doesn’t perform many things like other notes apps however it executes a few functions with grace: Application stores all […]"},{"link":"https://nmac.to/blog/entropy/","image":"https://nmac.to/wp-content/uploads/2013/12/entropy.png","title":"Entropy 1.6.0 – Versatile and easy to use archiver [Update]","content":"Entropy is a versatile and easy to use archiver capable of creating, modifying and extracting many archive formats.allows you create, modify and extract popular archive formats like zip, 7z and tar.   A versatile tool, Entropy allows you to : Extract an entire archive, or individual files within it. View contents of an archive instantly […]"},{"link":"https://nmac.to/blog/warhammer-40-000-dawn-of-war-ii/","image":"https://nmac.to/wp-content/uploads/2016/10/Warhammer.40k.Dawn_.of_.War_.II_.png","title":"Warhammer 40.000 Dawn of War II 1.0.1 – Experience the intimate brutality of battles","content":"Developed by award winning studio Relic Entertainment, Dawn of War II ushers in a new chapter in the acclaimed RTS series – taking players to the brutal frontlines of war to lead an Elite Strike Force on a mission to save the galaxy.   It’s the 41st Millennium in the Sub-Sector Aurelia – a cluster […]"},{"link":"https://nmac.to/blog/the-metronomicon-1-0/","image":"https://nmac.to/wp-content/uploads/2016/09/The-Metronomicon.png","title":"The Metronomicon 1.0 – Rhythm gamer, marries RPG gamer","content":"Packing in a fully-fledged story mode with a colourful cast of musically-empowered heroes and villains, The Metronomicon sees you take control of a party of eight newly graduated masters of the “rhythmic combat arts” to wage musical warfare against a multitude of dance-mongering fiends. By switching between four concurrent hero-controlled tracks on-the-fly, you’ll select and […]"},{"link":"https://nmac.to/blog/timing-1-7-2/","image":"https://nmac.to/wp-content/uploads/2014/09/Timing.png","title":"Timing 1.7.2 – Discover how you spend time on your Mac","content":"Timing is the best way to keep track of the time you spend with your Mac. Find out where your time goes — without ever having to start a timer again!   Timing automatically tracks which documents you are editing, which applications you use, and the domains of the websites you visit. You’ll never have […]"},{"link":"https://nmac.to/blog/scratch-8-5-912/","image":"https://nmac.to/wp-content/uploads/2016/09/Scratch.png","title":"Scratch 8.5.912 – Experience the highest levels of creative DI","content":"Scratch – Designed for creative professionals who need the power of an advanced 2D/3D, real-time toolset that marries conform, editing, color grading, versioning, titling, compositing, and finishing.   Fluid digital workflow with consistent user interface and color, from on-set dailies through creative DI.   WHY START FROM SCRATCH? Buy and learn one tool to use, […]"},{"link":"https://nmac.to/blog/earthlock-festival-of-magic-1-0/","image":"https://nmac.to/wp-content/uploads/2016/09/EARTHLOCK.Festival.of_.Magic_.png","title":"EARTHLOCK: Festival of Magic 1.0 – A classic 3D RPGs game inspired by late of 90’s","content":"Snowcastle Games’ four year long passion project and first major title, Earthlock: Festival of Magic arrives on Steam. A tribute to true turn-based RPG fans, Earthlock: Festival of Magic will test even the most strategic of players.   Key Features: Explore the vast and magical world of Umbra Highly strategic turn‐based battles Harvest magical materials […]"},{"link":"https://nmac.to/blog/gif-machine-1-0/","image":"https://nmac.to/wp-content/uploads/2016/09/Gif-Machine.png","title":"Gif Machine 1.0 – Create awesome GIFs by recording your screen","content":"Gif Machine is a powerful and simple app which helps you to create awesome GIFs by recording your screen, recording your webcam or just from images. 3 Modes: > Image Gif > Capture Gif > Camera Gif   Features: Create GIF from Images Create GIF by capture your screen Create GIF by recording your webcam […]"},{"link":"https://nmac.to/blog/data-rescue-4-3/","image":"https://nmac.to/wp-content/uploads/2014/03/Data.Rescue.png","title":"Data Rescue 4.3 – Powerful hard drive data recovery solution","content":"Data Rescue is a robust and reliable data recovery solution for your Mac. Data Rescue has a 5-star average rating on the Mac App Store a 4.5 star rating on Amazon, in addition to over 150 industry awards for best-in-class Mac recovery since it’s debut in 2002. Works on all Mac hard drives even if […]"},{"link":"https://nmac.to/blog/clipart-prime-2-1/","image":"https://nmac.to/wp-content/uploads/2016/09/Clipart-Prime2.png","title":"Clipart Prime 2.1 – Large collection of high-quality clipart images","content":"The Clipart Prime collection contains clipart images of the highest quality available on the market. Each image speaks volumes about the immense skill and attention to detail that went into it. Now you can use Clipart Prime images to create icons or illustrate a variety of text content. Image themes range from business and science […]"}]