[{"link":"https://nmac.to/blog/master-of-typing-in-chinese/","image":"https://nmac.to/wp-content/uploads/2018/03/Master-of-Typing-in-Chinese.png","title":"Master of Typing in Chinese 7.3.1 – Learn touch typing in Chinese","content":"Now the popularly accepted version of Master of Typing is available in Chinese!   It’s an effective TOUCH typing course that uses the fastest method for Chinese input – Pinyin.   MASTERING TYPING TECHNIQUE:   Typing speed test at the beginning Checking the level of your proficiency   Variety of exercises Typing common words and […]"},{"link":"https://nmac.to/blog/launchbar/","image":"https://nmac.to/wp-content/uploads/2017/10/LaunchBar6.png","title":"LaunchBar 6.13.1 – Powerful file/URL/email launcher utility","content":"LaunchBar is an award-winning productivity utility that offers an amazingly intuitive and efficient way to search and access any kind of information stored on your computer or on the Web. It provides instant access to your applications, documents, contacts, and bookmarks, to your music library, to search engines and more, just by entering short abbreviations […]"},{"link":"https://nmac.to/blog/deliveries/","image":"https://nmac.to/wp-content/uploads/2017/09/Deliveries3.png","title":"Deliveries 3.2.4 – Keep track of all your packages","content":"Deliveries helps you keep track of all your packages, so you always know when they’re going to arrive. Whether it’s the latest gadget you’ve preordered online, or a new graphic novel you can’t wait to dive into, Deliveries will keep tabs on it so you don’t miss the doorbell.   The main list shows a […]"},{"link":"https://nmac.to/blog/touchcopy/","image":"https://nmac.to/wp-content/uploads/2017/01/TouchCopy.png","title":"TouchCopy 16.40 – Backup your music collection from your iPod","content":"TouchCopy lets you copy your music, video, photos, text messages and more from your iPod, iPhone or iPad back onto your Mac or directly into iTunes.   Features Transfer music and playlists from your iPhone, iPad or iPod back to iTunes on your Mac Save your Text Message, iMessage and WhatsApp conversations to your Mac. […]"},{"link":"https://nmac.to/blog/icons8/","image":"https://nmac.to/wp-content/uploads/2019/07/Icons85.png","title":"Icons8 5.7.3 – Searchable icon app","content":"Icons8 allows users to search icons and insert directly into Photoshop, Xcode, or any other program.   Features 5000 free icons for developers and designers PNG format in multiple sizes from 25x25px to 512×512 px iOS 7, Windows 8, and Android styles Search by tags Drag to Xcode, Photoshop, or anything Vector icons are not […]"},{"link":"https://nmac.to/blog/translatium/","image":"https://nmac.to/wp-content/uploads/2017/08/Translatium.png","title":"Translatium 13.8.2 – Powerful translation app for macOS","content":"Translate like a Pro with Translatium – the most powerful translation app for macOS.   FEATURES   150+ Languages & Dialects Translate words, phrases, and text between more than 150 languages & dialects.   Speech Recognition & Voice Output Use your voice to type and listen to translations using text-to-speech.   Optical Character Recognition Use […]"},{"link":"https://nmac.to/blog/troga/","image":"https://nmac.to/wp-content/uploads/2017/09/Troga1.png","title":"Troga 1.9.3 – Simple and fast translator","content":"Troga is a lightning-fast translator that supports 64 different languages. Just translate some text or a word, and Troga will display a random translation from your favourite list after an interval of time. You can add translations to your favourite list: just press ⌘F to add or remove the current translation.   Troga supports VoiceOver. […]"},{"link":"https://nmac.to/blog/bookends/","image":"https://nmac.to/wp-content/uploads/2017/08/Bookends13.png","title":"Bookends 13.4.5 – Reference management and bibliography software","content":"Bookends is a full-featured bibliography/reference and information-management system for students and professionals.   Access the power of Bookends directly from Mellel, Nisus Writer Pro, or MS Word (including Word 2011): Bookends allows you to scan your existing word-processor files and automatically generate finished manuscripts with properly formatted bibliographies. You can also scan Apple Pages ’08, […]"},{"link":"https://nmac.to/blog/transport-inc/","image":"https://nmac.to/wp-content/uploads/2020/09/Transport_Inc.png","title":"Transport INC 1.0.3 – Become the manager of the largest transport corporation ever","content":"Transport INC. is a game about management, competition, economy, and above all logistics. Use your skills to bring your transportation company to the top.   Connect capitals around the world. Watch and adapt to economic situations. Purchase your opponent’s companies or cause them to go bankrupt. Experience how it feels to face constantly changing traffic […]"},{"link":"https://nmac.to/blog/todeska/","image":"https://nmac.to/wp-content/uploads/2020/09/Todeska.png","title":"Todeska 1.4.1 – Transform Today Extensions into Desktop Widgets","content":"Todeska is the First and Only App to Transform Today Extensions into Desktop Widgets.   How does it Work? This was made possible after extensive reverse engineering of Notification Center itself. Once this was done, a complete reimplementation of the extension hosting capability was built from the ground up.   Now you can enjoy Today […]"}]