[{"link":"https://nmac.to/blog/gopanel/","image":"https://nmac.to/wp-content/uploads/2016/04/goPanel.png","title":"goPanel 2.9.4 – Manage Web servers","content":"goPanel is an incredibly intuitive OS X app for the management of web servers, an alternative to existing control-panel apps you install on Unix-based servers for web hosting. Easy-to-install and configure Apache, PHP, MySQL, FTP, domains, and emails on your server. goPanel lets you easily connect and manage unlimited Linux servers.   Features Add and […]"},{"link":"https://nmac.to/blog/touchretouch/","image":"https://nmac.to/wp-content/uploads/2021/12/TouchRetouch_2.png","title":"TouchRetouch 2.3.5 – Remove unwanted content from photos","content":"TouchRetouch is a photo editing app that primarily allows users to remove unnecessary or unwanted content from photos, but also features other basic image editing tools such as color correction, cloning, horizon straightening, and cropping.   Version 2.3.5: In this update, we have added a possibility to clear the Open Recent list in the File […]"},{"link":"https://nmac.to/blog/inklet/","image":"https://nmac.to/wp-content/uploads/2016/06/Inklet.png","title":"Inklet 2.2.4 – Allows your trackpad to emulate a pen tablet","content":"Inklet allows your trackpad to emulate a pen tablet. When you’re using a Pogo Sketch, the trackpad even becomes pressure sensitive.   Features The full tablet – Moving your Pogo Sketch lightly around the trackpad will allow the cursor to hover without inking. Increase pressure to draw; heavier pressure will result in a thicker stroke. […]"},{"link":"https://nmac.to/blog/bookreader/","image":"https://nmac.to/wp-content/uploads/2017/10/BookReader5.png","title":"BookReader 5.15 – Reader for non-DRM e-books","content":"BookReader marks another step towards virtual reality. Your bookshelves on your Mac, very realistic reading from the screen.   Moreover, you can fully customize your books, – change covers, fonts, colors, whatever you want to see all your books as you wish.   Please note: Perfume of the Books is not yet implemented due to […]"},{"link":"https://nmac.to/blog/panorama/","image":"https://nmac.to/wp-content/uploads/2017/03/Panorama.png","title":"Panorama 2.0 – Perspective Image Stitcher","content":"Panorama extends the capability of your digital camera or scanner by stitching multiple overlapping pictures into wide angle panoramas.   Why use Panorama rather than Camera app to make a panorama?   Panorama uses a better stitching technique that does not warp horizontal edges in your photos. Instead you obtain a panorama that is truer […]"},{"link":"https://nmac.to/blog/nosleep/","image":"https://nmac.to/wp-content/uploads/2018/02/NoSleep.png","title":"NoSleep 1.1.7 – Prevent your Mac from going to sleep","content":"NoSleep is an application that you use to prevent your Mac from going to sleep.   To address the negative reviewer comments: The purpose of NoSleep is primarily to keep the Mac awake so you can read the screen while not otherwise actively using the Mac. It is not a menubar app. It is a […]"},{"link":"https://nmac.to/blog/disney-melee-mania/","image":"https://nmac.to/wp-content/uploads/2021/12/Disney-Melee-Mania.png","title":"Disney Melee Mania 1.2.11 – Disney & Pixar 3v3 throwdown!","content":"Cue the lights! Hear the fans roar! Disney Melee Mania calls all worthy competitors to step into the spotlight! In this dazzling Arcade battle arena, your holo-team of rumble-ready Disney and Pixar champions competes in fast-paced 3v3 multiplayer battles. From Wreck-It Ralph, Elsa and Mickey to Frozone, Moana, Buzz Lightyear (and beyond!), choose from multiple […]"},{"link":"https://nmac.to/blog/kerbal-space-program/","image":"https://nmac.to/wp-content/uploads/2019/01/Kerbal.Space_.Program.png","title":"Kerbal Space Program 1.12.3 – Sandbox Space Simulation Game","content":"In Kerbal Space Program, take charge of the space program for the alien race known as the Kerbals. You have access to an array of parts to assemble fully-functional spacecraft that flies (or doesn’t) based on realistic aerodynamic and orbital physics. Launch your Kerbal crew into orbit and beyond (while keeping them alive) to explore […]"},{"link":"https://nmac.to/blog/the-long-dark/","image":"https://nmac.to/wp-content/uploads/2019/02/The-Long-Dark.png","title":"The Long Dark 1.98 – First-Person exploration & survival game","content":"The Long Dark is a thoughtful, exploration-survival experience that challenges solo players to think for themselves as they explore an expansive frozen wilderness in the aftermath of a geomagnetic disaster. There are no zombies — only you, the cold, and all the threats Mother Nature can muster.   WELCOME TO THE QUIET APOCALYPSE Bright lights […]"},{"link":"https://nmac.to/blog/tp-spotify-converter/","image":"https://nmac.to/wp-content/uploads/2020/11/TunePat-Spotify-Converter.png","title":"TunePat Spotify Converter 1.6.4 – The Best Spotify Music Downloader","content":"TunePat Spotify Converter – a 100% clean program with no need to install any extra software including the Spotify app, is designed for downloading songs, albums and playlists from Spotify so that you can listen to Spotify songs offline or transfer them to other devices for enjoying.   Convert Spotify to MP3/AAC/WAV/FLAC To enable you […]"}]