[{"link":"https://nmac.to/blog/enola-1-0/","image":"https://nmac.to/wp-content/uploads/2016/05/Enola.png","title":"Enola 1.0 – A psychological adventure game","content":"Enola is a psychological adventure game that delves into the inherent darkness of love, death and revenge. As Enola, you must survive a macabre world conjured up by the tortured memories of her lover, Angelica.   Immersed in this emotionally-charged and gripping story, as you decipher challenging death-traps. However, choose your path very carefully – […]"},{"link":"https://nmac.to/blog/deliverance-1-0/","image":"https://nmac.to/wp-content/uploads/2016/05/Deliverance.png","title":"Deliverance 1.0 – A first-person survival horror game","content":"Deliverance is a first-person survival horror game in which you are put into the captivity of a deranged man dawning a serial killing streak with no plans to stop. Play as “Victim #3” and try to find your way out of your captor’s imprisonment as you explore a maze-like abandoned asylum. With only a flashlight […]"},{"link":"https://nmac.to/blog/the-song-of-seven-chapter-one-1-0/","image":"https://nmac.to/wp-content/uploads/2016/05/The-Song-of-Seven.png","title":"The Song of Seven: Chapter One 1.0 – A single player third-person adventure game","content":"The Song of Seven is a single player third-person adventure game. Solve environment/inventory based puzzles, engage in meaningful conversation, and explore a world full of mystery.   NARRATIVE  A dark myth has awakened to threaten Pria, a gorgeous and mystical world desperate for a savior. To restore the balance of the realm, you’ll need to […]"},{"link":"https://nmac.to/blog/plugspy-2-3-1/","image":"https://nmac.to/wp-content/uploads/2016/05/PlugSpy.png","title":"PlugSpy 2.3.1 – Put your Mac under observation","content":"Plug Spy is a first-rate tool to observe your Mac. It activates automatically on-screen lock and triggers actions in case of unexpected occurrences. Instant notification on your phone will give you additional security if you leave your Mac alone.   Instant Protection to Catch a Thief  Plug-Spy lives in the OS X system menu, ready […]"},{"link":"https://nmac.to/blog/garageband-10-1-2/","image":"https://nmac.to/wp-content/uploads/2015/07/GarageBand10.png","title":"GarageBand 10.1.2 – Complete recording studio and more","content":"The new GarageBand is a whole music creation studio right inside your Mac — complete with keyboard, synths, orchestral and percussion instruments, presets for guitar and voice, an entirely redesigned sound library, and virtual session drummers. A beautiful and intuitive interface makes it easy to learn, play, record, and create great-sounding songs. And you can […]"},{"link":"https://nmac.to/blog/worlds-of-magic-1-2-6/","image":"https://nmac.to/wp-content/uploads/2016/05/Worlds-of-Magic.png","title":"Worlds of Magic 1.2.6 – A 4X turn-based strategy game","content":"Worlds of Magic is a 4X turn-based strategy game. Players can explore and conquer an almost limitless number of procedurally generated universes, using military and magical power to overcome their foes. Found cities, raise armies, research and cast spells, hire powerful heroes, and create powerful magical artifacts. All will help you in your bid to […]"},{"link":"https://nmac.to/blog/to-text-converter-1-3/","image":"https://nmac.to/wp-content/uploads/2016/05/To.Text_.Converter.png","title":"To Text Converter 1.3 – Convert numerous file types to plain text (.txt)","content":"To Text Converter is an app to convert files from various formats (PDF, HTML, RTF, RTFD) to standard plain text files It works with drag-and-drop of files from Finder to the application window. Process many files at once dropping them on the ‘To Text Converter’ main window, in that case it will save more files […]"},{"link":"https://nmac.to/blog/wailing-heights-1-0/","image":"https://nmac.to/wp-content/uploads/2016/05/Wailing-Heights.png","title":"Wailing Heights 1.0 – Musical adventure game","content":"A coffin-rocking, body-hopping, musical adventure game, set in a horrific hamlet of monsters.   Set in a peaceful, blood-curdling village blessed with gorgeous panoramic mountaintop views and the blissful stench of rotting corpses, Wailing Heights is home to the likes of vegan werewolves, hipster vampires, soulful zombies and all manner of well-adjusted supernatural taxpaying home-owners. […]"},{"link":"https://nmac.to/blog/scrap-garden/","image":"https://nmac.to/wp-content/uploads/2016/05/scrap-garden.png","title":"Scrap Garden 1.0 – A charming puzzle platformer game","content":"Scrap Garden is a charming puzzle platformer about the adventures of Canny, a lonely robot, who awakens in a post-apocalyptic world to find all other robots shut down and seized up. What happened to the City? Why did all robots stop moving? Did anyone survive except him? Little rusty Canny has to do all he […]"},{"link":"https://nmac.to/blog/n-verlore-verstand-1-0/","image":"https://nmac.to/wp-content/uploads/2016/05/n-Verlore-Verstand.png","title":"‘n Verlore Verstand 1.0 – Prepare to be transported to a reality of dreams and nightmares","content":"In ‘n Verlore Verstand you will be transported to a reality of dreams and nightmares. What will you discover about yourself in this journey through the subconscious?   In these realms of the unknown, you must travel through labyrinths of memories to eventually find your way to your own truth.   Features: Abstract adventure. Engaging […]"}]