[{"link":"https://nmac.to/blog/disk-graph/","image":"https://nmac.to/wp-content/uploads/2015/10/Disk.Graph_.png","title":"Disk Graph 2.3.1 – Disk inspection tool","content":"Disk Graph is a tool that allows you to inspect your disk and easily find the files that take away most of your disk space. With its beautiful interface and its pie-like graph, locating big files has never been easier.   Features of DiskGraph include: any directory reachable in the Finder (i.e. on your local […]"},{"link":"https://nmac.to/blog/simple-webmonitor/","image":"https://nmac.to/wp-content/uploads/2018/01/Simple-WebMonitor.png","title":"Simple WebMonitor 1.6.1 – Monitor your IPv4/IPv6 websites","content":"Simple WebMonitor (was WebMonitor) is a menubar tool to monitor whether your sites is still alive. WebMonitor will send PING6/PING/GET/POST requests to your target sites every two minutes. Simple WebMonitor will push notification while something wrong is detected.   Features IPv6 supported Monitor your web sites every two minutes default. The checking frequency can be […]"},{"link":"https://nmac.to/blog/bookmarktiles/","image":"https://nmac.to/wp-content/uploads/2021/11/BookmarkTiles.png","title":"BookmarkTiles 1.7.1 – Bookmarks with Thumbanils","content":"BookmarkTiles is mentioned as an Add-On for Safari to replace the missing TopSites Feature in Safari 14+.   It attempts to look and work similar to the well known features, but it also adds various new possibilities to your Bookmarks.   TopSites main goal is to create a visual Bookmark Picker, so you don’t need […]"},{"link":"https://nmac.to/blog/profanity-filter-for-safari/","image":"https://nmac.to/wp-content/uploads/2021/09/Profanity_Filter_for_Safari_1.png","title":"Profanity Filter for Safari 1.2 – Filter inappropriate words","content":"Filter profanity online! Useful for young children who are surfing the internet – or users trying to reduce the exposure to inappropriate language online.   Version 1.2: New icon Updated profanity list to include more inappropriate words   Intel, 64-bit processor macOS 10.14 or later    "},{"link":"https://nmac.to/blog/see-passwords-for-safari/","image":"https://nmac.to/wp-content/uploads/2021/11/See-Passwords-for-Safari.png","title":"See Passwords for Safari 1.2 – Reveal hidden text on the web","content":"See Passwords for Safari allows you to “see right through” hidden password fields as if they were plaintext. This is helpful if you use an autofill password manager, or would like to see stored passwords that exist on the webpage.   This application is private, secure, and easy to use. Thanks to the new security […]"},{"link":"https://nmac.to/blog/recompress/","image":"https://nmac.to/wp-content/uploads/2019/10/Recompress.png","title":"Recompress 21.11 – PDF optimization and recompression","content":"re/compress is a powerful PDF re-compression utility, which can decrease the size of your existing PDF files for archiving or sharing them on the web or email.   Many PDF creator applications, for example multi function printers, or other simple applications often do not use the most advanced forms of compression when creating your PDF […]"},{"link":"https://nmac.to/blog/screaming-seo-spider/","image":"https://nmac.to/wp-content/uploads/2016/08/Screaming.Frog_.SEO_.Spider.Tool_.png","title":"Screaming Frog SEO Spider 16.3.0 – Spider websites for SEO analysis","content":"The Screaming Frog SEO Spider is a small desktop program you can install locally on your PC, Mac, or Linux machine which spiders websites’ links, images, CSS, script, and apps from an SEO perspective. It fetches key onsite elements for SEO, presents them in tabs by type, and allows you to filter for common SEO […]"},{"link":"https://nmac.to/blog/fonepaw-iphone-data-recovery/","image":"https://nmac.to/wp-content/uploads/2018/01/FonePaw-iPhone-Data-Recovery.png","title":"FonePaw iPhone Data Recovery 6.7.0 – iPhone data recovery tool","content":"FonePaw iPhone Data Recovery is made for those unexpected incidents which can result in data loss on an iPhone, such as iPhone damaged/lost/stolen, reset, accident deletion, virus attack, jailbreak or even error operation. The lost data can be recovered using several free or paid, but how to choose the best iPhone Data Recovery software for […]"},{"link":"https://nmac.to/blog/pro-audio-converter/","image":"https://nmac.to/wp-content/uploads/2016/08/Pro-Audio-Converter1.png","title":"Pro Audio Converter 1.9.1 – Convert between a variety of audio file formats [FIX]","content":"Pro Audio Converter is an application for converting between a variety of audio file formats. It is multi-threaded and will batch convert multiple files at once to multiple formats at once. It supports reading and writing metadata and can create custom output file paths based on the metadata. It can also edit the metadata of […]"},{"link":"https://nmac.to/blog/quicklens/","image":"https://nmac.to/wp-content/uploads/2017/04/QuickLens_2.png","title":"QuickLens 2.8 – A powerful set of tools to explore the UI down to the pixel [FIX]","content":"As a UI Designer/Developer, it is natural to explore the UI created by you or by others.   Be it the margins that were chosen, the angle used in an icon, length or bounding box of some element, the colors used or just zooming closer to the pixels.   QuickLens offers a suite of tools […]"}]