[{"link":"https://nmac.to/blog/borderlands-2/","image":"https://nmac.to/wp-content/uploads/2019/03/Borderlands-2.png","title":"Borderlands 2 1.8.5 – First-person shooter with RPG elements","content":"Borderlands 2 furthers the distinct blending of First Person Shooter and Role Playing genres to create the true evolution of the Role Playing Shooter. Team up with up to three other players for four-player online goodness, sharing mayhem as you spend hours leveling up your character and equipping them with one of the millions of […]"},{"link":"https://nmac.to/blog/mojave-cache-cleaner/","image":"https://nmac.to/wp-content/uploads/2018/11/Mojave-Cache-Cleaner.png","title":"Mojave Cache Cleaner 12.0.6 – Clear caches, access hidden OS X settings, and more","content":"Mojave Cache Cleaner is an award-winning general purpose tool for macOS X. SCC makes system maintenance simple with an easy point-and-click interface to many macOS X functions. Novice and expert users alike will appreciate the powerful toolset SCC provides. Sierra Cache Cleaner is one of the world’s leading maintenance tools, with millions of downloads around […]"},{"link":"https://nmac.to/blog/weathersnoop/","image":"https://nmac.to/wp-content/uploads/2017/11/WeatherSnoop.png","title":"WeatherSnoop 4.1.10 – Capture weather info from a Davis Vantage Pro weather station","content":"WeatherSnoop talks to your Davis Vantage Pro/Vantage Vue, Ambient Weather WS-1080/WS-2080, Weatherwise Solar Pro, RainWise CC-3000, Peet Bros. ULTIMETER 100/800/2000/2100, WeatherHawk weather station, or Weather Underground to obtain current weather data and transfers it directly your Mac. You can upload your data to Weather Underground or the Citizen Weather Observer Program and share with the […]"},{"link":"https://nmac.to/blog/rumu/","image":"https://nmac.to/wp-content/uploads/2019/07/Rumu.png","title":"Rumu 2.1.0 – An intimate, narrative-driven adventure game","content":"Rumu is an intimate, narrative-driven adventure game where you play as a robot vacuum cleaner who has been programmed only to love on it’s journey in becoming Sentient and discovering other emotions a long the way.   You awake in a fully automated Smart Home created by your eccentric Human’s David and Cecily where you […]"},{"link":"https://nmac.to/blog/night-call/","image":"https://nmac.to/wp-content/uploads/2019/07/Night-Call.png","title":"Night Call 1.0.1 – Investigation With Story Rich Game","content":"A mysterious serial killer stalks the streets of modern-day Paris. The body count rises, and the police are no closer to catching the culprit. You are a taxi driver and survivor to the killer’s most recent attacks, having barely escaped with your life. You have seven nights to help find the killer, or the police […]"},{"link":"https://nmac.to/blog/light-fall/","image":"https://nmac.to/wp-content/uploads/2018/05/LightFall1.png","title":"Light Fall 1.2.0 – Action & Adventure Platformer Game","content":"Craft your path in this innovative 2D platformer. Master the use of your own platform to explore the Forgotten World of Numbra and save the land and its inhabitants from an imminent threat. Do you have what it takes to survive in perilous Numbra?   Key Features   The Ultimate Freedom Control the Shadow Core […]"},{"link":"https://nmac.to/blog/she-sees-red/","image":"https://nmac.to/wp-content/uploads/2019/07/She-Sees-Red.png","title":"She Sees Red 0.1 – An interactive live-action thriller game","content":"She Sees Red is an interactive live-action thriller full of drama, violence, and your responsibility.   Each walkthrough takes 30-35 minutes, but total video running time is about 90 minutes.    There’s been a strange murder in a night club. A detective is doing her best to find the elusive murderer who continues their killing […]"},{"link":"https://nmac.to/blog/hider/","image":"https://nmac.to/wp-content/uploads/2015/10/Hider2.png","title":"Hider 2.5 – Hide, encrypt, and password-protect your data","content":"Hider is an app that lets you hide, encrypt, and password-protect private data on your Mac. Just launch Hider, enter your password, and select a file to add to the Hider vault. Once added, you can toggle between hidden and visible with just a click of a switch; no one can see or find your […]"},{"link":"https://nmac.to/blog/antivirus-vk-pro/","image":"https://nmac.to/wp-content/uploads/2019/06/Antivirus-VK5.png","title":"Antivirus VK Pro 6.1.0 – Adware and Malware protection for Mac","content":"Do you have problems with a slow Mac or annoying popups and ads taking over your browser causing headache? You just found the solution.   Antivirus VK Pro is the perfect choice for your needs. It will restore your browser and clean your Mac from any malware it finds.   Besides that, you will also […]"},{"link":"https://nmac.to/blog/pictures-to-gif/","image":"https://nmac.to/wp-content/uploads/2019/07/Pictures-to-GIF.png","title":"Pictures to GIF 1.4.0 – Create animated GIFs from images","content":"Pictures to GIF is a Gif creator for mac for create incredible animated GIFs from images. It’s easy to customize GIF size, sequence, frame rate, and add text. You can also edit existing GIFs.   Input Features: Support almost all common images formats: JPEG, JPEG2000, BMP, PNG, TIFF, GIF, TGA etc. Edit Features: Support text […]"}]