[{"link":"https://nmac.to/blog/freeway-pro-7-0-1/","image":"https://nmac.to/wp-content/uploads/2014/12/Freeway-Pro.png","title":"Freeway Pro 7.0.1 – Drag-and-drop Web design solution","content":"Freeway Pro lets you build websites with speed and precision… without writing a line of code!   With it’s user-oriented drag-and-drop interface, Freeway Pro helps you piece together the website of your dreams. Add images, audio, video and interactive content — when your masterpiece is complete, Freeway Pro converts it into clean, standards-compliant code at […]"},{"link":"https://nmac.to/blog/disk-order-3-2-5/","image":"https://nmac.to/wp-content/uploads/2014/12/Disk-Order.png","title":"Disk Order 3.2.5 – File manager with dual pane interface","content":"Disk Order makes file management easy, fast and fun on your Mac. It allows to save time on every step and gives you a great file-management power.   Disk Order is an advanced Finder replacement with built-in FTP client and ability to handle archives like plain folders. This makes file management much faster then it […]"},{"link":"https://nmac.to/blog/decloner-1-6-1/","image":"https://nmac.to/wp-content/uploads/2014/12/Decloner.png","title":"Decloner 1.6.1 – Find and eliminate duplicate files on your Mac","content":"Decloner helps you find and eliminate duplicate files on your Mac. It uses SHA-1 algorithm to reliably determine if files are identical. Decloner has a simple straightforward user interface where you only need to choose where to scan, and Decloner will find duplicate files in those locations and all the subdirectories. You can scan multiple […]"},{"link":"https://nmac.to/blog/spark-inspector-1-3-4/","image":"https://nmac.to/wp-content/uploads/2014/09/Spark.Inspector.png","title":"Spark Inspector 1.3.4 – Runtime debugger for iOS apps","content":"Spark Inspector is a runtime debugger for iOS.   Features: Monitor & Experiment in Real-time Live Mirroring Experiment at Runtime Use a Device or Simulator See Notifications in Real-time Filtering Understand App Architecture Resend Past Notifications Xcode Integration   Version 1.3.4: Release notes were unavailable when this listing was updated.   Intel, 64-bit processor OS […]"},{"link":"https://nmac.to/blog/quickbooks-2015-16-0-2/","image":"https://nmac.to/wp-content/uploads/2014/12/QuickBooks-2015.png","title":"QuickBooks 2015 16.0.2 – Financial management and accounting for small businesses","content":"QuickBooks Pro 2015 helps you manage your business easily and efficiently. Organize your finances all in one   place, track money going in and out of your business, and spot areas where you can save.   Built for Mac OS – Looks and works like you’d expect Create invoices, pay bills, and manage expenses Gain […]"},{"link":"https://nmac.to/blog/optimal-layout-2-3-1/","image":"https://nmac.to/wp-content/uploads/2014/03/Optimal-Layout.png","title":"Optimal Layout 2.3.1 – Move, resize, and reorganize windows","content":"Optimal Layout (formerly WindowFlow Pro) makes organizing your application windows a breeze: Keyboard commands allow you to smoothly move and resize windows that snap into alignment. Window tiling instantly reorganizes a messy group of overlapping windows to optimally fill your screen. Window switching that lists all your open app windows, even those that are minimized […]"},{"link":"https://nmac.to/blog/istudio-publisher-1-1-9/","image":"https://nmac.to/wp-content/uploads/2014/12/iStudio.Publisher.png","title":"iStudio Publisher 1.1.9 – Desktop publishing app with dynamic text wrapping","content":"iStudio Publisher is an easy-to-use page layout application for desktop publishing on Mac, perfect for designing anything you want to layout and print.   Create stunning, professional quality documents with ease, including newsletters, brochures, adverts, flyers, invitations, menus, reports, posters, greetings cards, and yearbooks. Start with a professionally designed template or a blank document of […]"},{"link":"https://nmac.to/blog/finkit-3-3-4/","image":"https://nmac.to/wp-content/uploads/2014/09/FinKit.png","title":"FinKit 3.3.4 – Multi-function financial calculator","content":"FinKit is a financial calculator that solves all sorts of problems involving the time value of money.   Provides 55 financial calculations: Assets: capitalized cost – classic and MACRS depreciation Bonds: bond book value, price and yield – zero-coupon bond price and yield Dates: term date – date series – year fraction – time between […]"},{"link":"https://nmac.to/blog/yosemite-cache-cleaner-9-0-1-3-0/","image":"https://nmac.to/wp-content/uploads/2014/12/Yosemite-Cache-Cleaner.png","title":"Yosemite Cache Cleaner 9.0.1.3.0 – Clear caches, access hidden OS X settings, and more","content":"Yosemite Cache Cleaner is an award-winning general purpose tool for OS X. YCC makes system maintenance simple with an easy point-and-click interface to many OS X functions. Novice and expert users alike will appreciate the powerful toolset YCC provides. Yosemite Cache Cleaner is one of the world’s leading maintenance tools, with millions of downloads around […]"},{"link":"https://nmac.to/blog/xplan-3-6-7/","image":"https://nmac.to/wp-content/uploads/2014/12/xPlan3.png","title":"xPlan 3.6.7 – Track your projects","content":"With xPlan, creating, tracking, and managing your projects is easier than ever! xPlan is designed to keep track of tasks, milestones, and calculate a project’s cost.   If you’re not a professional project manager, you probably want something that’s easy to learn and inexpensive, but it’s got to pump out a professional project-management plan too. […]"}]