[{"link":"https://nmac.to/blog/scriptflow-1-4/","image":"https://nmac.to/wp-content/uploads/2017/05/ScriptFlow.png","title":"ScriptFlow 1.4 – Simple and lightweight code snippets manager","content":"ScriptFlow for macOS is helper tools to keep your code snippets on iCloud , simple and lightweight code snippets manager made for developers with ease of use.   Securely stores your code snippets on iCloud, keeps them updated across all your devices. So you can access from all your devices anywhere.   It comes with: […]"},{"link":"https://nmac.to/blog/business-card-studio-2-0/","image":"https://nmac.to/wp-content/uploads/2017/05/Business-Card-Studio.png","title":"Business Card Studio 2.0 – Templates for MS Word","content":"Business Cards Templates for MS Word by GN is a top-quality set of over 180 original templates for Microsoft Word. Whether you choose a tried and tested professional look or opt for a more creative and colorful style, Graphic Node’s templates will help you represent your company the best you can.   Every object in […]"},{"link":"https://nmac.to/blog/blue-penguin-ecard-templates-2-30-5/","image":"https://nmac.to/wp-content/uploads/2017/05/Blue-Penguin-eCard-Templates.png","title":"Blue Penguin eCard Templates 2.30.5 – Create your own beautiful and unique eCard designs","content":"Blue Penguin eCard Templates allows you to create your own beautiful and unique eCard designs with easy to use formatting options, hundreds of colors and fonts. Send personalized eCards through Apple Mail, easily share on Twitter, Facebook, Messages and Air Drop.   Note: you will need Apple Mail in order to email your eCard designs. […]"},{"link":"https://nmac.to/blog/appdelete-4-3-3/","image":"https://nmac.to/wp-content/uploads/2015/02/AppDelete.png","title":"AppDelete 4.3.3 – The speedy and efficient way to delete your unwanted apps","content":"AppDelete is an uninstaller for Macs that will remove not only applications but also widgets, preference panes, plugins, and screensavers along with their associated files. Without AppDelete these associated items will be left behind to take up space and potentially cause issues.   There are several ways to activate AppDelete: Drag items onto main window […]"},{"link":"https://nmac.to/blog/gridsutra-1-2/","image":"https://nmac.to/wp-content/uploads/2016/12/gridsutra.png","title":"Gridsutra 1.2 – Window arranging and positioning tool","content":"GridSutra is a window arranging and positioning tool for Apple macOS.   Features It helps you in working with different windows at the same time. Launcher gives you multiple layout options to select. It can assign shortcut keys to your favourite window arrangement.   Version 1.2: Custom-layout support Ignore / unignore application feature Localisation support […]"},{"link":"https://nmac.to/blog/xilisoft-hd-video-converter-7-8-20/","image":"https://nmac.to/wp-content/uploads/2014/12/Xilisoft-Video-Converter.png","title":"Xilisoft HD Video Converter 7.8.20 – Powerful Mac Video Converter","content":"Xilisoft HD Video Converter for Mac is a feature-rich Mac video converter that can convert between virtually all video and audio formats. No longer will you worry about files not being compatible with your devices, Xilisoft Video Converter for Mac makes most media files playable on the iPod, iPhone, iPad, Apple TV, Galaxy, Kindle, HTC One, […]"},{"link":"https://nmac.to/blog/xilisoft-audio-converter-pro-6-5-3/","image":"https://nmac.to/wp-content/uploads/2017/05/Xilisoft-Audio-Converter.png","title":"Xilisoft Audio Converter Pro 6.5.3 – Convert between various audio formats","content":"Xilisoft Audio Converter is a powerful application that can be used to convert your audio files between various formats.   Some of the formats supported by Xilisoft Audio Converter are WMA, MP3, OGG, APE, FLV, MKV, or AAC. All-in-one audo converter software. Convert between all popular audio formats. Extract audio from general and HD videos. […]"},{"link":"https://nmac.to/blog/spillo-2-0/","image":"https://nmac.to/wp-content/uploads/2014/08/Spillo.png","title":"Spillo 2.0 – Take full control over your bookmarks on Pinboard","content":"Spillo is a powerful, beautiful and amazingly fast Pinboard client. Spillo lets you browse and organize your bookmarks in a stunning modern interface. Spillo also makes creating a bookmark from anywhere on your Mac as convenient as possible.   A beautiful interface Spillo has a beautiful modern interface that feels just right at home on […]"},{"link":"https://nmac.to/blog/dear-esther-landmark-edition-1-0/","image":"https://nmac.to/wp-content/uploads/2017/05/Dear.Esther-Landmark.Edition.png","title":"Dear Esther: Landmark Edition 1.0 – Walking Simulator & Adventure Game","content":"‘A deserted island… a lost man… memories of a fatal crash… a book written by a dying explorer.’   Dear Esther immerses you in a stunningly realised world, a remote and desolate island somewhere in the outer Hebrides. As you step forwards, a voice begins to read fragments of a letter: ‘Dear Esther…’ – and […]"},{"link":"https://nmac.to/blog/scrollstickies-3-10/","image":"https://nmac.to/wp-content/uploads/2016/07/ScrollStickies.png","title":"ScrollStickies 3.10 – Resizable Reminders, notes, clippings stickies on your desktop","content":"A sticker/post it app with a teleprompter-like text scrolling mode!   Leave as many colorful, resizable stickies on your desktop with reminders, notes, clippings as you want. Contents are automatically saved with backups and can be restored at startup. Includes a very useful teleprompter mode that allows single line scrolling text.   Version 3.10: option […]"}]