[{"link":"https://nmac.to/blog/hellpoint/","image":"https://nmac.to/wp-content/uploads/2020/08/Hellpoint.png","title":"Hellpoint 358 – An intense action RPG Game","content":"Hellpoint is a dark and challenging action RPG set in a heavily atmospheric sci-fi universe where the line between science and occultism is blurred.   Once a pinnacle of human achievement, the Irid Novo space station has fallen. Its ruins are now overrun by cruel interdimensional entities acting as puppets of the malevolent Cosmic Gods.  […]"},{"link":"https://nmac.to/blog/nova-drift/","image":"https://nmac.to/wp-content/uploads/2019/06/Nova-Drift.png","title":"Nova Drift Early Access 0.29.12 – Classic arcade space combat","content":"Nova Drift is a “Roguelite” space shooter that melds a classic arcade experience with modern action-RPG elements like theory-crafting and deep player choice. Your ship rapidly evolves as you defeat enemies, allowing you to shape its abilities and weaponry to your desires in a matter of minutes. Unlike many ARPGs which can absorb hundreds of […]"},{"link":"https://nmac.to/blog/astute-graphics-plugins-bundle/","image":"https://nmac.to/wp-content/uploads/2016/07/Astute-Graphics.png","title":"Astute Graphics Plugins Bundle 2.0.4 – Pro Texture Packs for Adobe Illustrator","content":"Astute Graphics – company specializing in the development of creative tools for vector design, which saves time, increase creativity and help to achieve excellent results.   Astute Graphics is developing tools that designers really need in their daily work.   Ever found yourself zooming in order to align paths in Illustrator? COLLIDERSCRIBE allows you to […]"},{"link":"https://nmac.to/blog/trashme/","image":"https://nmac.to/wp-content/uploads/2016/07/TrashMe.png","title":"TrashMe 2.1.23 – Uninstall your applications by deleting all related files","content":"TrashMe will help you in uninstalling your applications by deleting all related files (preferences, temp files…).   Drag-and-drop an application to uninstall it Choose application to uninstall in a list Uninstall other components (widget, pref pane, etc.) Protect default apps, opened apps, or any other app Smart mode to auto-detect app moved to trash Manage […]"},{"link":"https://nmac.to/blog/disco-elysium/","image":"https://nmac.to/wp-content/uploads/2020/05/Disco-Elysium.png","title":"Disco Elysium vf71b54b8 – Story Rich Detective RPG Game","content":"Disco Elysium is a groundbreaking open world role playing game. You’re a detective with a unique skill system at your disposal and a whole city block to carve your path across. Interrogate unforgettable characters, crack murders or take bribes. Become a hero or an absolute disaster of a human being.   Features: Unprecedented freedom of […]"},{"link":"https://nmac.to/blog/the-jackbox-party-pack-7/","image":"https://nmac.to/wp-content/uploads/2020/10/The-Jackbox-Party-Pack-7.png","title":"The Jackbox Party Pack 7 495 – Party Board Game","content":"Five new incredible party games to bring the fun!   The say-anything threequel Quiplash 3 (3-8 players). Get big laughs answering the quirkiest prompts. The collaborative chaos game The Devils and the Details (3-8 players). Can you survive the daily torture of human life? The drawing fighting game Champ’d Up (3-8 players) . Can you […]"},{"link":"https://nmac.to/blog/broforce/","image":"https://nmac.to/wp-content/uploads/2020/10/Broforce.png","title":"Broforce 1130.20201008 – 2D Pixel Graphics Co-op Action Game","content":"When evil threatens the world, the world calls on Broforce – an under-funded, over-powered paramilitary organization dealing exclusively in excessive force. Brace your loins with up to four players to run ‘n’ gun as dozens of different bros and eliminate the opposing terrorist forces that threaten our way of life. Unleash scores of unique weapons […]"},{"link":"https://nmac.to/blog/vagrus/","image":"https://nmac.to/wp-content/uploads/2020/07/Vagrus.png","title":"Vagrus – The Riven Realms Early Access 0.5.16 – Story Rich RPG & Strategy Game","content":"Vagrus is an award-winning roleplaying game with a narrative focus, open-world exploration, and strong elements of strategy. The player takes the role of a vagrus – a caravan leader who strives to survive in a strange and dangerous dark fantasy world by leading a traveling company on all kinds of ventures.   A vast realm […]"},{"link":"https://nmac.to/blog/entity-pro/","image":"https://nmac.to/wp-content/uploads/2020/10/Entity-Pro.png","title":"Entity Pro 1.3.1 – Unicode & Emoji Finder","content":"Entity Pro is the ultimate Unicode and Emoji Finder for macOS. Search smart, copy fast and learn digital typography.   Features Smart & fast search engine Finds Unicodes, Hex, Decimal, HTML and Swift entities Helpful typography advice: Learn how to use your glyphs right Curated: Choose from over one hundred glyph collections Detail View: Inspect […]"},{"link":"https://nmac.to/blog/limbo/","image":"https://nmac.to/wp-content/uploads/2013/08/limbo.png","title":"LIMBO 33782 – Side-scrolling platformer","content":"Uncertain of his sister’s fate, a boy enters LIMBO.   Version 33782: Release notes were unavailable when this listing was updated.   Intel, 64-bit processor OS X 10.7 or later    "}]