[{"link":"https://nmac.to/blog/passport-photo/","image":"https://nmac.to/wp-content/uploads/2017/10/Passport-Photo.png","title":"Passport Photo 1.5 – Format, print, or save passport photos","content":"Passport Photo allows you to format, print, or save passport photos in seconds. It comes with passport photo templates for 100 countries. As well as passport photos, this app is ideal for printing photos for job applications. More than ten popular formats for job application photos have also been predefined.   The app already provides […]"},{"link":"https://nmac.to/blog/voice-notes/","image":"https://nmac.to/wp-content/uploads/2015/12/Voice-Notes.png","title":"Voice Notes 6.1.1 – Voice Recorder, Diary & Memos","content":"Record directly to MP3 & M4A for as you & share the recording with your friends at the touch of a button.   Add notes, tags, markers & photos to your audio recording in second with this useful app.   FEATURES: Direct recording MP3 audio format – Minimum file size, and can share to any […]"},{"link":"https://nmac.to/blog/sketch-design/","image":"https://nmac.to/wp-content/uploads/2017/09/Sketch-Design.png","title":"Sketch Design 3.1 – Easily create great sketches from your images","content":"Trying to create amazing sketches with your own images and don’t know how? With Sketch Design – Color Pencil you can easily create great sketches from your images. This application converts color images into sketches so they can be printed and used as entertainment for people of different ages, especially children.   Enjoy our amazing […]"},{"link":"https://nmac.to/blog/sigpro/","image":"https://nmac.to/wp-content/uploads/2016/10/SigPro.png","title":"SigPro 2.1 – Adds features to Mail.app signatures feature","content":"SigPro (formerly known as SignatureProfiler) is a simple and intuitive plugin for Apple’s Mail application that makes it easier for your to handle and gain more control over your signatures.   Create, edit and assign tail signature to your email accounts SigPro comes as a viable solution for Mac users that have multiple email accounts […]"},{"link":"https://nmac.to/blog/dropshelf/","image":"https://nmac.to/wp-content/uploads/2013/06/Dropshelf.png","title":"Dropshelf 1.3.3 – Makes dragging and dropping easier","content":"Dropshelf makes dragging and dropping easier by providing a resting place for draggable items. Just drag an item to the edge of the screen, and a ‘shelf’ smoothly slides out.   Drop images, URLs, and text clippings on the shelf to keep them handy while you find a window or switch apps. Then just drag […]"},{"link":"https://nmac.to/blog/privacy-cleaner/","image":"https://nmac.to/wp-content/uploads/2017/09/Privacy-Cleaner.png","title":"Privacy Cleaner 1.3 – Protect your privacy","content":"Privacy Cleaner is designed to protect your privacy by cleaning up all the unwanted history data on your Mac. With simply one click, Privacy Cleaner allows you to erase cache files, browsing history, cookies, temporary files and more.   Features Web browsers (Safari, Chrome, Firefox, etc): Remove Caches, Cookies, History, Downloads, Forms, Recent Searches, Top […]"},{"link":"https://nmac.to/blog/desktopapp-for-messenger/","image":"https://nmac.to/wp-content/uploads/2017/09/DesktopApp-for-Messenger.png","title":"DesktopApp for Messenger 2.1 – Messenger Desktop Client For Mac","content":"The Best App to use Facebook Messenger on Mac! Facebook Chats. Groups. Emoji & Stickers. Drag&Drop Photos and Videos. Download Photos and Videos. Play Video. Voice messages listening. New messages notification. Unread messages on app icon. Icon on MenuBar. Full Screen mode supported. Split Screen mode supported.   …but why would you prefer DesktopApp for […]"},{"link":"https://nmac.to/blog/thunder-video-converter-pro/","image":"https://nmac.to/wp-content/uploads/2017/05/Thunder-Video-Converter-Pro.png","title":"Thunder Video Converter Pro 2.0 – Video convert & cut","content":"Thunder Video Converter Pro – Conversion speed is as fast as thunder, output file is as slim as thunder!   Key Features Without the loss of video quality, it only need 5~10 mins to convert 1 hour video. Without the loss of video quality, it can compress 1G video to only 100M. Unique video comparison […]"},{"link":"https://nmac.to/blog/patterno/","image":"https://nmac.to/wp-content/uploads/2014/09/Patterno1.png","title":"Patterno 2.7.1 – Tiled pattern and background image generator","content":"Patterno is a tiled pattern and background image generator for Mac OS X. It easily creates background images for Twitter, MySpace or any other site. Patterno can be used to create wallpapers, postcards, book covers and more.   Version 2.7.1: Fixed an issue that caused image saving fail on some machines under OS X 10.10. […]"},{"link":"https://nmac.to/blog/tubeg/","image":"https://nmac.to/wp-content/uploads/2017/02/TubeG.Pro_.png","title":"TubeG Pro 5.2 – Watch YouTube videos in a separate window","content":"TubeG Pro lets you manage playlists and channel items, search with autocomplete and advanced filter options, and watch on top of apps (does not include YouTube download). Watching a playlist has never been easier: just click on a video in the playlist and enjoy browser-free watching! You can also single-click when using our Web-browser extensions […]"}]