[{"link":"https://nmac.to/blog/designs-for-mail-2-0/","image":"https://nmac.to/wp-content/uploads/2014/02/Designs.for_.Mail_.png","title":"Designs for Mail 2.0 – 100+ beautiful templates for Apple’s Mail","content":"Designs for Mail brings you a diverse collection of templates for creating customized email messages in Apple Mail.    Choose a lively seasonal template for a family newsletter. Or select a sharp, sophisticated design for a business proposal. Designs for Mail’s selection is constantly expanding, so you’ll always have access to the latest templates.   […]"},{"link":"https://nmac.to/blog/fontboss-1-0/","image":"https://nmac.to/wp-content/uploads/2014/08/FontBoss.png","title":"FontBoss 1.0 – Quick and easy font manager","content":"Easily take control of your fonts using FontBoss, a quick and easy font manager.   Using different fonts at home or at work make your design and print projects look better, including presentations, advertisements, websites, logos, and other creative work. As you collect more fonts, you need better control over your typefaces.   FontBoss makes […]"},{"link":"https://nmac.to/blog/data-rescue-3-2-4/","image":"https://nmac.to/wp-content/uploads/2014/03/Data.Rescue.png","title":"Data Rescue 3.2.4 – Recover lost data on drives","content":"Data Rescue is a robust and reliable hard-drive recovery solution for your Mac. Recover lost or deleted files, mount corrupted drives, and more — Data Rescue offers complete relief from crippling hard-drive disasters!   Feature-rich Recovery Recover hundreds of file types. Preview recoverable files. Clone drives ahead of physical failure. Reach out to free pre- […]"},{"link":"https://nmac.to/blog/timelime-1-2-3/","image":"https://nmac.to/wp-content/uploads/2014/01/Timelime.png","title":"Timelime 1.2.3 – Track and visualize your working hours","content":"Timelime is the easiest and most beautiful way to track and visualize your working hours. Timelime is the perfect assistant for:   Freelancers and independent contractors who have to track their time spent on projects Students who want to spend more time studying by monitoring their daily/weekly/monthly workload Individuals who are interested in how they […]"},{"link":"https://nmac.to/blog/rm-origin/","image":"https://nmac.to/wp-content/uploads/2014/01/Rayman-Origins.png","title":"Rayman Origins 1.0.1 – Magical adventure game","content":"Rayman returns in a magical adventure that brings back the spirited 2D platforming of his celebrated first outing. When a invasion of nightmarish monsters threatens the peace and tranquility of The Glade of Dreams, it’s up to the limbless legend to rescue his idyllic home.   Push your platforming skills to the limit as you […]"},{"link":"https://nmac.to/blog/angry-birds-space/","image":"https://nmac.to/wp-content/uploads/2014/06/Angry-Birds-Space.png","title":"Angry Birds Space 2.0.1 – Angry Birds action with a zero-gravity twist","content":"Angry Birds Space is the latest in the chart-topping series, bringing you colorful, bird-flinging action with a zero-gravity twist!   After a giant claw kidnaps their eggs, the Angry Birds chase it into a wormhole and find themselves floating in a strange new galaxy – surrounded by space pigs! Luckily the Angry Birds have super […]"},{"link":"https://nmac.to/blog/angry-birds-rio/","image":"https://nmac.to/wp-content/uploads/2014/07/Angry-Birds-Rio.png","title":"Angry Birds Rio 2.2.0 – Episodic puzzle game with Rio film twists","content":"In Angry Birds Rio, the original Angry Birds are kidnapped and taken to the magical city of Rio de Janeiro, where they eventually escape their captors and set out to save their friends, Blu and Jewel – two rare macaws and the stars of the hit motion picture, Rio. Angry Birds Rio pairs the physics-based […]"},{"link":"https://nmac.to/blog/1954-alcatraz/","image":"https://nmac.to/wp-content/uploads/2014/07/1954.Alcatraz.png","title":"1954 Alcatraz 1.3 – Great adventure and challenging puzzles game","content":"Joe’s doing 40 years on Alcatraz for a heist on an armored truck. The loot is still hidden out there, but only Joe knows where it is. In the streets of San Francisco, Joe’s ex-accomplices and his wife are eager to find the stolen money. Who will get their hands on the dough?   In […]"},{"link":"https://nmac.to/blog/new-file-here-2-2-1/","image":"https://nmac.to/wp-content/uploads/2014/07/New.File_.Here_.png","title":"New File Here 2.2.1 – Create files easily in any location","content":"New File Here adds a “New File Here” menu item to Finder’s context menu, enabling you to create files easily in any location.   New File Here supports templates now! There are over 30 built-in file templates, and you can also add your own templates!   Creating a new document can be a drawn-out process […]"},{"link":"https://nmac.to/blog/lifeless-planet-1-0/","image":"https://nmac.to/wp-content/uploads/2014/07/LifelessPlanet.png","title":"Lifeless Planet 1.0 – Discover the human life over a mystery planet","content":"While seeking life on a distant planet, an astronaut discovers an abandoned Russian town. He suspects his mission is a hoax until a mysterious young woman saves him from a strange and deadly phenomenon… Lifeless Planet is a third-person action-adventure that features an old-school sci-fi story and spectacular environments in the spirit of classic action-adventures. […]"}]