[{"link":"https://nmac.to/blog/grids/","image":"https://nmac.to/wp-content/uploads/2017/02/Grids4.png","title":"Grids for Instagram 7.0.20 – A beautiful way to experience Instagram","content":"Grids brings the best Instagram experience to your Mac.   Features Clean, adaptive UI; works at full screen as well as widget-sized window Pixel-perfect layout and rendering; retina display support; your Instagram photos never looked this gorgeous 4 beautiful layout styles for the pleasure of your eyes Picture size as well as spacing and background […]"},{"link":"https://nmac.to/blog/photo-ai/","image":"https://nmac.to/wp-content/uploads/2021/11/Photo-AI.png","title":"Photo AI 2.1 – Image Editor, Filters & Text","content":"With over 150 filter adjusters & effects. Upgrade to Pro to get 400 filter adjustments, combined with custom masking, A.I. face filters, content-aware object removal, add texts and shapes, Photo AI Lite combines the power of Photoshop with the ease of use of Instagram. Photo AI Lite gives you complete control over your photos with […]"},{"link":"https://nmac.to/blog/file-cabinet-pro/","image":"https://nmac.to/wp-content/uploads/2021/05/File_Cabinet_Pro_4.png","title":"File Cabinet Pro 8.4.1 – File manager for the menu bar","content":"File Cabinet Pro is the file manager for the OS X menu bar. Quickly navigate to files without cluttering your desktop. Open, move, rename, tag, trash, copy, and paste files, all from the menu bar! You can open many file types natively in File Cabinet Pro or open files by launching other applications. Store files […]"},{"link":"https://nmac.to/blog/memory-clean-3/","image":"https://nmac.to/wp-content/uploads/2018/07/Memory-Clean-3.png","title":"Memory Clean 3 1.0.24 – Utility for purging inactive memory","content":"Memory Clean 3 is an absolutely gorgeous, extremely powerful and super slick app for optimizing your Mac’s memory. The app replicates the feeling of a fresh system restart and helps to keep your Mac running smoothly.   The app works by purging your Mac’s inactive memory and is best used when you close a memory […]"},{"link":"https://nmac.to/blog/northgard/","image":"https://nmac.to/wp-content/uploads/2018/12/Northgard.png","title":"Northgard 2.7.5 – A city builder & strategy game based on Norse mythology","content":"After years of tireless explorations, brave Vikings have discovered a new land filled with mystery, danger and riches: Northgard.   The boldest Northmen have set sail to explore and conquer these new shores, bring fame to their Clan and write history through conquest, trading, or devotion to the Gods.   That is, if they can […]"},{"link":"https://nmac.to/blog/rimworld/","image":"https://nmac.to/wp-content/uploads/2018/01/RimWorld.png","title":"RimWorld 1.3.3287 – A sci-fi colony sim driven by an intelligent AI storyteller","content":"RimWorld is a sci-fi colony sim driven by an intelligent AI storyteller. Inspired by Dwarf Fortress, Firefly, and Dune.   You begin with three survivors of a shipwreck on a distant world. Manage colonists’ moods, needs, wounds, and illnesses. Fashion structures, weapons, and apparel from metal, wood, stone, cloth, or futuristic materials. Tame and train […]"},{"link":"https://nmac.to/blog/superliminal/","image":"https://nmac.to/wp-content/uploads/2020/11/Superliminal.png","title":"Superliminal 1.3 – Story Rich First-Person Puzzle Game","content":"Superliminal is a first-person puzzle game based on forced perspective and optical illusions. Puzzles in this game give you a sense of the unexpected. Players need to change their perspective and think outside the box to wake up from the dream.   WAKE UP As you fall asleep with the TV on at 3AM, you […]"},{"link":"https://nmac.to/blog/sketchup-pro/","image":"https://nmac.to/wp-content/uploads/2020/08/SketchUp_2021.png","title":"SketchUp Pro 2022 22.0.353 – Create 3D design concepts with Google Earth integration","content":"SketchUp is an easy-to-learn 3D modeling program that enables you to explore the world in 3D. With just a few simple tools, you can create 3D models of houses, sheds, decks, home additions, woodworking projects – even space ships. And once you’ve built your models, you can place them in Google Earth, post them to […]"},{"link":"https://nmac.to/blog/pacifist-app/","image":"https://nmac.to/wp-content/uploads/2014/01/Pacifist.png","title":"Pacifist 4.0.3 – Install individual files from .pkg installers and more","content":"Pacifist opens up .pkg installer packages, .dmg disk images, .zip, .tar. tar.gz, .tar.bz2, .pax, and .xar archives and more, and lets you extract or install individual files out of them. This is useful if you need to install just one file out of a package instead of the entire package (for example, if you deleted […]"},{"link":"https://nmac.to/blog/querious/","image":"https://nmac.to/wp-content/uploads/2014/08/Querious2.png","title":"Querious 3.2 – MySQL database management application","content":"Querious is the best MySQL database management application for OS X.   View, search, edit, import, export, build, configure, and monitor your MySQL and MariaDB databases easier than ever before. With Querious, you can even open up raw CSV or Tab files and easily split, join, reorder, add, remove, and process columns and rows, and […]"}]