[{"link":"https://nmac.to/blog/moneywiz-2-0-4/","image":"https://nmac.to/wp-content/uploads/2015/02/MoneyWiz2.png","title":"MoneyWiz 2.0.4 – Personal finance solution","content":"All your accounts, budgets and bills in one place! With powerful reports, worldwide online banking and instant sync between all your devices!   That’s MoneyWiz – the world’s most powerful and beautiful finance software.   HOW CAN MONEYWIZ HELP YOU? GET OUT OF DEBT : We’ve built MoneyWiz in a way that makes it easy […]"},{"link":"https://nmac.to/blog/framer-studio-1-11-173/","image":"https://nmac.to/wp-content/uploads/2014/08/Framer.Studio.png","title":"Framer Studio 1.11.173 – Invent, design and experiment with interaction","content":"Framer Studio is built on Framer.js, an open source framework for rapid prototyping. Framer allows you to define animations and interactions. It runs on mobile devices, too.   Source on GitHub Hardware Accelerated Events & 3D Animations Spring Physics Framer.js used at: Google, Facebook, Instagram and Stripe   Generate Generate assets out of Sketch and […]"},{"link":"https://nmac.to/blog/cleanmyphone-3-6-3/","image":"https://nmac.to/wp-content/uploads/2014/01/CleanMyPhone.png","title":"CleanMyPhone 3.6.3 – Keep your iPhone, iPad, or iPod touch clean and well-organized","content":"CleanMyPhone is an ingeniously simple and powerful application that will help you keep your iPhone, iPad, or iPod touch clean and running smoothly. It includes useful tools such as Disk Manager, App Cleaner, Removal of Document and Data, Find Large Files, One-Click-Copy, and more.   Configure, Organize and Manage Files and Apps on Your iOS […]"},{"link":"https://nmac.to/blog/strata-design-3d-cx-8-0/","image":"https://nmac.to/wp-content/uploads/2015/05/Strata.Design.3D.CX_.png","title":"Strata Design 3D CX 8.0 – 3D rendering, modeling, animation","content":"Strata Design 3D CX 8 is our professional-level 3D modeling and animation software for Mac that delivers end-to-end power for the entire 3D design workflow. Quickly bring your creative ideas to life with a simplified learning curve, tight integration with Adobe Photoshop, and award-winning rendering quality rivaling any software at any price.   All the […]"},{"link":"https://nmac.to/blog/tonality-pro-1-1-4/","image":"https://nmac.to/wp-content/uploads/2014/08/Tonality-Pro.png","title":"Tonality Pro 1.1.4 – Professional-grade monochrome image editor","content":"Tonality Pro gives you the power to create stunning and dramatic black & white images. This is a complete monochrome image editor with more than 150 one-click style presets, totally unique creativity tools, stackable layers, adjustable brushes, RAW file support and so much more will blow you away.   Features: Professional image quality with a […]"},{"link":"https://nmac.to/blog/tadam-1-4/","image":"https://nmac.to/wp-content/uploads/2015/05/Tadam.png","title":"Tadam 1.4 – Simple Pomodoro timer","content":"Tadam is a simple Pomodoro timer that stays out of your way and lets you get the work done.   Simple: Few buttons, few features and no configuration. The simpler the better for your productivity. At your fingertips: Tadam lives in the status bar, so its always just a click away. Out of the way: […]"},{"link":"https://nmac.to/blog/sweetie-1-3-1/","image":"https://nmac.to/wp-content/uploads/2015/05/Sweetie.png","title":"Sweetie 1.3.1 – Turn images into beautiful text art","content":"Sweetie app stylizes images and turns them into beautiful text art. The app has a simple and clean interface that allows one to choose tile type and size, font, charset, color option etc.   Features: Total control over text generator: font, used symbols set, colors. Two layout kinds Accurate edges processing Various colorization and background […]"},{"link":"https://nmac.to/blog/mindnode-pro-1-11-2/","image":"https://nmac.to/wp-content/uploads/2014/12/MindNode-Pro2.png","title":"MindNode Pro 1.11.2 – Elegant mindmapping application","content":"MindNode Pro is a powerful and intuitive mind mapping application. Its focus and flexibility make it the perfect tool for brainstorming and organizing your life – and iCloud sharing means you always have your mind maps with you. MindNode lets you lay out your notes and tasks visually so you can get a bird’s-eye view […]"},{"link":"https://nmac.to/blog/desk-1-3-1/","image":"https://nmac.to/wp-content/uploads/2015/02/Desk.png","title":"Desk 1.3.1 – Free writing environments app","content":"Desk is a premium writing experience for all types of writers.   Whether you’re a casual enthusiast, the weekend writer, blogger, or digital publishing professional, you’ll find Desk to be a much-needed breath of fresh air.   Designed to marry both function and form, it is the desktop publishing client that you’ve always wanted: Simple, […]"},{"link":"https://nmac.to/blog/blogo-2-2-2/","image":"https://nmac.to/wp-content/uploads/2014/08/Blogo.png","title":"Blogo 2.2.2 – Write, publish and manage multiple blogs","content":"Blogo is the easiest and fastest way to write, publish and manage multiple blogs. Blogo gathered features for a powerful solution and helps users to publish and create content easily. It makes it possible to manage multiple blogs at the same time, edit pictures with a built-in image editor, preview your posts on real-time, manage […]"}]