[{"link":"https://nmac.to/blog/color-strokes-v21-create-most-stunning/","image":"https://nmac.to/wp-content/uploads/2013/12/colorsplashstudio.png","title":"Color strokes 2.1 – Create the most stunning photos with the colors you want","content":"ColorStrokes is the only app that lets you play and manipulate the colors on photos in any possible way. ColorStrokes is simple, yet incredibly powerful app to make ordinary picture look catchy and extremely awesome.   ReColor photos: You have all the colors and tones under the hand, so pick whatever you like, mix colors […]"},{"link":"https://nmac.to/blog/winonx-v14-run-windows-applications-on/","image":"https://nmac.to/wp-content/uploads/2013/12/image1s.png","title":"WinOnX 1.4 – Run Windows applications on Mac OSX","content":"WinOnX lets you run your Windows applications on OS X without the need of buying a Windows license. Well, you even do not need to install Windows.   Just download WinOnX and you are ready to go within 2 minutes.   No need to install Windows or a virtual machine.   Please note: WinOnX should only […]"},{"link":"https://nmac.to/blog/live-wallpaper-v20-wallpapers-with-live/","image":"https://nmac.to/wp-content/uploads/2013/12/lsp.png","title":"Live Wallpaper v2.0 – Wallpapers with live clock and weather forecasts","content":"Live Wallpaper is a beautiful wallpaper application with live clock and weather forecast. It provides a variety of themes which has different layouts and unique styles. Currently, we have 12 themes and we are adding themes continuously (All themes are free). Each theme has the unique layout, clock, text, and weather forecast. The application provides a […]"},{"link":"https://nmac.to/blog/livequartz-v202-simple-image-editor/","image":"https://nmac.to/wp-content/uploads/2013/12/1349437454_lq.png","title":"LiveQuartz 2.0.2 – Simple image editor","content":"LiveQuartz is simple and powerful photo editor for the Mac. It is based on non-destructive layers and Filters. The layers are at the left and the Filters are at the right of the window.   To edit a photo, just drag it into the window (or layers’ list) and it will be added as a new […]"},{"link":"https://nmac.to/blog/littlesnapper-185/","image":"https://nmac.to/wp-content/uploads/2013/12/LittleSnapperIcon.png","title":"LittleSnapper v1.8.5","content":"LittleSnapper is built to be the designer’s digital scrapbook, allowing creatives to snap, organise, edit and share screenshots and webpages that interest them. LittleSnapper is the ideal choice for anyone looking for a beautifully crafted application built to make managing screen and websnaps easy. From the comprehensive capture tools for the desktop and web, the […]"},{"link":"https://nmac.to/blog/tor-browser-v2239-powerful-proxy/","image":"https://nmac.to/wp-content/uploads/2013/12/vidalia1.png","title":"Tor Browser v2.2.39 – Powerful Proxy Application For Mac","content":"Tor is free software and an open network that helps you defend against a form of network surveillance that threatens personal freedom and privacy, confidential business activities and relationships, and state security known as traffic analysis. Tor protects you by bouncing your communications around a distributed network of relays run by volunteers all around the […]"},{"link":"https://nmac.to/blog/perian-n123-for-mac/","image":"https://nmac.to/wp-content/uploads/2013/12/Perian.png","title":"Perian v1.2.3 for Mac","content":"Perian enables QuickTime application support for additional media types: – AVI, FLV, and MKV file formats – MS-MPEG4 v1 & v2, DivX, 3ivx, H.264, FLV/Sorenson Spark,  FSV1, VP6, H263i, VP3, HuffYUV, FFVHuff, MPEG1 & MPEG2 Video, Fraps, Windows Media Audio v1 & v2, Flash ADPCM, Xiph Vorbis (in Matroska), and MPEG Layer II Audio – AVI […]"},{"link":"https://nmac.to/blog/plants-vs-zombies/","image":"https://nmac.to/wp-content/uploads/2012/10/zom.png","title":"Plants vs Zombies 1.0.4 – Action strategy game","content":"Plants vs Zombies: Game of the Year Edition…Get ready to soil your plants in an all-new action-strategy game from PopCap! A mob of fun-loving zombies is about to invade your home, and your only defense is an arsenal of 49 zombie-zapping plants. Use peashooters, wall-nuts, cherry bombs and more to mulchify 26 types of zombies […]"},{"link":"https://nmac.to/blog/zeker-quran-for-mac/","image":"https://nmac.to/wp-content/uploads/2012/10/Zekr.png","title":"Zeker Qur’an 1.1.0 – Qur’an Kareem For Mac","content":"Zekr Qur’an was made with coding made for Macintosh, giving it the feel of any other Mac application. It is fully featured with advanced searching, navigation, recitation, and commentary.The backbone of Zekr is very generic, allowing customization in many ways. Customize the language, translation, recitation, commentary, and theme. Make Zekr perfect for you.   The […]"},{"link":"https://nmac.to/blog/virtualbox-v4118-for-mac/","image":"https://nmac.to/wp-content/uploads/2013/12/virt.png","title":"VirtualBox v4.1.18 – Install virtual system on your mac","content":"VirtualBox is a family of powerful x86 virtualization products for enterprise as well as home use. Not only is VirtualBox an extremely feature rich, high performance product for enterprise customers, it is also the only professional solution that is freely available as Open Source Software under the terms of the GNU General Public License (GPL). Presently, […]"}]