[{"link":"https://nmac.to/blog/hot-shots-2-5/","image":"https://nmac.to/wp-content/uploads/2016/05/Hot-Shots-2.png","title":"Hot Shots 2.5 – Browse artwork and designs from Dribbble.com","content":"Hot Shots is an even better way to browse Dribbble shots from amazing designers and developers on Dribbble.com. It’s been updated to use the new Dribbble API – you can like shots, follow players, and browse shots of a player. Login with your Dribbble account to like, follow, view shots you’ve liked, and shots of […]"},{"link":"https://nmac.to/blog/solavant-2-0/","image":"https://nmac.to/wp-content/uploads/2016/05/Solavant.png","title":"Solavant 2.0 – More challenging Solitaire card game","content":"Solavant is hard solitaire for serious solitaire players; it includes 240 different solitaire games for your Mac! No easy games, hints, or cheats – it’s just you versus the cards in a professional solitaire collection that does absolutely nothing to help you win. Work your mind. Play your Solavant!   Version 2.0: Release notes were […]"},{"link":"https://nmac.to/blog/race-the-sun-1-455/","image":"https://nmac.to/wp-content/uploads/2016/05/Race-The-Sun.png","title":"Race The Sun 1.455 – Single player Racing & Action Game","content":"You are a solar craft. The sun is your death timer. Hurtle towards the sunset at breakneck speed in a futile race against time. Delay the inevitable by catching energy boosts which reverse the setting sun – if only for a moment.   Race The Sun is inspired by arcade games of the past with […]"},{"link":"https://nmac.to/blog/pdf-studio-10-4-1/","image":"https://nmac.to/wp-content/uploads/2016/04/PDF.Studio.png","title":"PDF Studio 10.4.1 – Utility for working with PDF documents","content":"PDF Studio is an easy-to-use yet powerful program for working with PDF documents. View and Print: Open any PDF document and send it to the printer. Documents will be automatically resized to fit the paper size. PDF Studio supports all types of PDF fonts. PDF Interactive Forms: Fill any PDF form and save it locally. […]"},{"link":"https://nmac.to/blog/foldingtext-2-2/","image":"https://nmac.to/wp-content/uploads/2016/02/FoldingText.png","title":"FoldingText 2.2 – Markdown text editor with productivity features","content":"For Mac users who love plain text. FoldingText is the markdown text editor with productivity features. Unlike other editors, FoldingText does outlining, todo lists, and more.   Simple Plain text Outline formatting Fold and Focus to see   Surprisingly Adept Live formatting Scripts, themes, and plugins Plain text productivity platform   Version 2.2: Outline View: […]"},{"link":"https://nmac.to/blog/chroma-1-0/","image":"https://nmac.to/wp-content/uploads/2016/05/Chroma.png","title":"Chroma 1.0 – Find naturally harmonious colors from images","content":"Chroma will give you naturally harmonious colors from images. It takes away the pain of picking matching colors, automatically creating a palette of over fifty colors from your images. Chroma takes advantage of your Mac’s enhanced color capabilities to generate color palettes that are naturally compatible and beautifully balanced. Copy-and-paste individual colors to use wherever […]"},{"link":"https://nmac.to/blog/carnage-racing-1-0/","image":"https://nmac.to/wp-content/uploads/2014/12/Carnage.Racing.png","title":"Carnage Racing 1.0 – Combat racing game","content":"Strap in, gun your engine and go full throttle into the most turbocharged, hi-octane combat racing game to hit Steam. From the developers behind the epic Midnight Club series, Carnage Racing combines seat-of-the-pants driving, tricks and stunts with explosive vehicle combat in a no-holds-barred race for the chequered flag.   Take on the rest of […]"},{"link":"https://nmac.to/blog/transocean-2-rivals-1-0/","image":"https://nmac.to/wp-content/uploads/2016/05/TransOcean-2.png","title":"TransOcean 2: Rivals 1.0 – Business simulation TransOcean game","content":"In TransOcean 2: Rivals you face a new challenge as the boss of your own shipping line: The international competition has gotten a lot tougher and the battle for the most lucrative contracts has only just begun. Will you succeed in sweeping your rivals from the seven seas and leading your shipping line to global […]"},{"link":"https://nmac.to/blog/sibelius-8-3-0/","image":"https://nmac.to/wp-content/uploads/2014/07/Sibelius.png","title":"Sibelius 8.3.0 – Music notation solution","content":"Sibelius is the world’s best-selling music notation software for Mac. It is as intuitive to use as a pen, yet so powerful that it does most things in less than the blink of an eye. The demo includes example scores and a demo user guide summarizing the main features of the program.   Version 8.3.0: […]"},{"link":"https://nmac.to/blog/phoneexpander-1-1-1/","image":"https://nmac.to/wp-content/uploads/2015/11/PhoneExpander.png","title":"PhoneExpander 1.1.1 – Quickly free up iOS storage","content":"PhoneExpander is an app that runs on your Mac, just like iTunes. You connect your iOS device and are able to clear out space for updates, new apps, and media. It takes a few minutes to run, and you can use just one or all of the different tools. PhoneExpander is designed to be simple […]"}]