[{"link":"https://nmac.to/blog/iconfly/","image":"https://nmac.to/wp-content/uploads/2016/12/IconFly.png","title":"IconFly 3.10.1 – Create icons from images","content":"IconFly is an incredible time saver that allows you to easily create icons in many formats for your Mac, iPhone, iPad and Apple Watch applications. Moreover, IconFly allows you to create icons for Android applications as well as Web clip icons and favicons. IconFly is actively supported and consistently updated.   Supported image formats for […]"},{"link":"https://nmac.to/blog/fenetre/","image":"https://nmac.to/wp-content/uploads/2017/10/Fenêtre.png","title":"Fenêtre 0.8.1 – Keep a window open, on top of everything else","content":"Fenêtre lets you visualize a video, a picture, a flat file or a website. Feel free to watch the latest episode on Netflix while working on your paper. Keep an eye on some documentation while working on your latest library. Have a reference design open while working on you’re amazing website. The window will stay […]"},{"link":"https://nmac.to/blog/total-video-downloader/","image":"https://nmac.to/wp-content/uploads/2017/03/Total-Video-Downloader.png","title":"Total Video Downloader 2.4.5 – Powerful Internet Video Downloader","content":"Total Video Downloader for Mac is an extremely simple online video downloader for mac with ultra-fast download speed! With this professional total video downloader software, you are able to download any video on mac, which of different resolution (SD & HD) and format (.mp4, .3gp, .mov…). What is more, You can always use this wonderful […]"},{"link":"https://nmac.to/blog/iconographer-mini/","image":"https://nmac.to/wp-content/uploads/2021/04/Iconographer-Mini.png","title":"Iconographer Mini 1.2 – Make icons for fruit computers","content":"Iconographer Mini is a quick and easy way to take a logo and create either a Mac Iconset (for use with Xcode) or a compressed ICNS file for use with other Mac development tools (like Xojo).   Iconographer Mini was designed for macOS 11.0 Big Sur, to fit in with the new visual theme while […]"},{"link":"https://nmac.to/blog/audio-playr/","image":"https://nmac.to/wp-content/uploads/2018/11/Audio_Playr_2.png","title":"Audio Playr 2.3.1 – Play and export almost any file that contains audio","content":"Audio Playr App is a handy tool to play and export almost any file that contains audio. It can handle almost anything you throw at it, as long as the file contains audio in some form. Everything from odd audio formats to movie file containers and you can export everything back to AAC or Apple […]"},{"link":"https://nmac.to/blog/rumpus/","image":"https://nmac.to/wp-content/uploads/2017/09/Rumpus8.png","title":"Rumpus 9.0.1 – High performance FTP server","content":"Rumpus is an easy-to-use, high-performance FTP, WebDAV, and Web file-transfer server for OS X.   Key features include built-in, easy-to-administer user accounts, integrated Web file transfers, file upload notification, extensive security options, blazing performance, and more…. Also included is a remote-server activity monitor, Rumpus FileWatch, and a server-statistics widget, RumpusStat.   Version 9.0.1: Release notes […]"},{"link":"https://nmac.to/blog/cloud-outliner-pro/","image":"https://nmac.to/wp-content/uploads/2016/02/Cloud-Outliner-2-Pro.png","title":"Cloud Outliner Pro 2.6 – Outline your ideas to align your life","content":"Cloud Outliner Pro 2 enables you to create and share outlines between your Mac, iOS devices, and Evernote account. Got a sudden flash of insight? Don’t risk forgetting it — just enter it right away on whatever device is closest, and see your changes synchronized with all your devices at once.   This tool is […]"},{"link":"https://nmac.to/blog/pastenow/","image":"https://nmac.to/wp-content/uploads/2021/04/PasteNow.png","title":"PasteNow 1.1 – Make Clipboard Management Easy","content":"PasteNow is a clipboard management app that make your daily work easier and faster. You can use it to store every kinds of temporary data: text, link, image and even code.   It support the following features: Sync data between multi-devices Create smart lists to filter and search content easily View different content in different […]"},{"link":"https://nmac.to/blog/dawn-of-man/","image":"https://nmac.to/wp-content/uploads/2019/03/Dawn-Of-Man.png","title":"Dawn Of Man 1.7.2 – City Builder Strategy Game","content":"Take control of a settlement of the first modern humans, guide them through the ages in their struggle for survival.   Dawn of Man is a survival/city-builder from the creators of Planetbase.   The game starts in the Stone Age, and takes you up to the Iron Age, spanning more than 10,000 years of human […]"},{"link":"https://nmac.to/blog/design-for-keynote/","image":"https://nmac.to/wp-content/uploads/2019/12/Templates_for_Keynote_DesiGN_6.png","title":"Templates for Keynote DesiGN 7.3 – High-quality templates set for Keynote","content":"Templates for Keynote – DesiGN set consists over 670 high-quality designs for Keynote presentations, infographics and data visualization templates. These are more than just beautiful backgrounds – each one of them includes up to 25 different master slides, which lets you choose the best layout for your information.   Themes like: Portfolio Business Travel Infographics […]"}]