[{"link":"https://nmac.to/blog/guidance-v143-islamic-prayer-time/","image":"https://nmac.to/wp-content/uploads/2013/12/mzi.geiewotu.png","title":"Guidance 1.4.3 – Islamic prayer time notifier","content":"Guidance is an Islamic prayer times application for Mac OS X that plays the Adhan when it is time for prayer. Designed to be simple and elegant, Guidance sits in the menu bar and shows a countdown until the next prayer. When it’s time for prayer, Guidance displays a Growl notification and plays the adhan. […]"},{"link":"https://nmac.to/blog/smart-memory-v111-free-memory-at-touch/","image":"https://nmac.to/wp-content/uploads/2013/12/Smart_Memory.png","title":"Smart Memory v1.1.1 – Free memory at the touch of a button","content":"Free memory at the touch of a button or the smart way. When using the “Smart Free” option the application will free memory periodically when the system is idle. The application will also keep a running total of all the memory saved. You can also hide the status bar icon. What’s New in Version 1.1.1 […]"},{"link":"https://nmac.to/blog/social-pro-v115-manage-all-your/","image":"https://nmac.to/wp-content/uploads/2013/12/Social.png","title":"Social Pro v1.15 – Manage all your favorite social networking services at one single application","content":"Social Pro is a collection of social management tools that is ideal for people who use multiple social network accounts. It is the only Mac-native multi social network client, and it saves you time by following statuses on Facebook, Twitter and Gmail. No more jumping from site to site to monitor, update and engage your […]"},{"link":"https://nmac.to/blog/pdf-converter-pro-v30/","image":"https://nmac.to/wp-content/uploads/2013/12/Product_Logo.png","title":"PDF Converter Pro 3.0 – Convert PDFs to Offices files, HTML, and more","content":"PDF Converter Pro offers the best converter from PDF to editable Microsoft Word, Excel, PowerPoint, Plain Text, Rich Text Format, and images. It is a must for people who want to work more smartly in the office or who need to get PDF content quickly. Wondershare PDF Converter Pro adds advanced OCR technology that allows […]"},{"link":"https://nmac.to/blog/evernote-v500-capture-notes-from/","image":"https://nmac.to/wp-content/uploads/2013/12/Evernote.png","title":"Evernote v5.0.0 – Capture notes from anywhere and store them in a central, searchable place","content":"Evernote allows you to easily capture information in any environment using whatever device or platform you find most convenient, and makes this information accessible and searchable at anytime, from anywhere. Create notes containing text and audio Find printed and handwritten text within images Clip application and web content directly into Evernote Synchronize with the Evernote […]"},{"link":"https://nmac.to/blog/fun-booth-v101-add-fun-webcam-effects/","image":"https://nmac.to/wp-content/uploads/2013/12/mzi.sqarchqi.png","title":"Fun Booth v1.0.1 – Add fun webcam effects to your face","content":"Fun Booth is the Web cam software that lets you take laugh-out-loud funny, scary, or outright silly digital photos of yourself  Fun Booth uses advanced face-tracking algorithms to perform real-time tracking of your face using your webcam / isight on macs to apply funny and real life props on your face. It includes Props Dock […]"},{"link":"https://nmac.to/blog/zumas-revenge/","image":"https://nmac.to/wp-content/uploads/2012/11/Zumas-Revenge.png","title":"Zuma’s Revenge 1.0 – Fight tiki bosses to make the world safe for amphibious life","content":"Zuma’s Revenge… Enter an all-new world of Zuma where evil tiki bosses rule the land! Conquer over 60 levels by firing stone spheres to make matches and destroy the deadly stream of balls, then take on six tiki boss battles and guide your agile amphibian to victory! Leap into action in four game modes with […]"},{"link":"https://nmac.to/blog/lets-golf-2/","image":"https://nmac.to/wp-content/uploads/2012/11/Lets-Golf-2.png","title":"Let’s Golf 2 1.0.5 – 3D animated golf game with six exotic world courses","content":"Let’s Golf! 2 is a colorful, animated golfing game where you pick from 8 3D characters and travel to 6 exotic locations around the globe. If you have an iOS device, you can play multiplayer with your friends.    Features: Select from 8 fun 3D characters that you can customize with unlocked caps, clothes and […]"},{"link":"https://nmac.to/blog/monster-trucks-nitro/","image":"https://nmac.to/wp-content/uploads/2012/11/Monster-Trucks-Nitro.png","title":"Monster Trucks Nitro 1.0 – Race nitro-equipped monster trucks in this 3D game","content":"Monster Trucks Nitro is a game where you race, jump and nitroboost your massive Monster Trucks over crazy cool tracks.   Race your way through thrilling dynamic levels with your monster trucks. Earn medals while unlocking new levels and vehicles.   Game Features: Console class 3D game Lots of brilliant tracks Be fast but use […]"},{"link":"https://nmac.to/blog/sparrow-v164-minimalist-e-mail-for-imap/","image":"https://nmac.to/wp-content/uploads/2013/12/Sparrow.175x175-75.jpg","title":"Sparrow v1.6.4 – Minimalist e-mail for IMAP accounts","content":"Sparrow is a minimalist mail application for Mac. It was designed to keep things simple and efficient. No fancy stuff here… just your mail and nothing else.  Threads Quickly flick through threaded conversations on your mac like never before. Not so minimal… See your mails the way you want. Quickly glance at the preview. Read […]"}]