[{"link":"https://nmac.to/blog/piezo/","image":"https://nmac.to/wp-content/uploads/2013/12/Piezo.png","title":"Piezo 1.7.8 – Quickly record audio from any application","content":"Piezo makes it a snap to record audio on your Mac. In seconds, you’ll be recording audio from any application or from audio inputs like microphones. Piezo requires almost no configuration, and it’s a blast to use! Simple and inexpensive – that’s a winning combination.   Version 1.7.8: Updates to ACE 11.7.8: The Audio Capture […]"},{"link":"https://nmac.to/blog/unite/","image":"https://nmac.to/wp-content/uploads/2020/07/Unite_4.png","title":"Unite 4.1.3 – Turn websites into full-featured apps","content":"Unite allows you to quickly and easily turn websites into full-featured, native apps on macOS. Using the revolutionary Unite browser as a backend, each Unite app features its own browser, while remaining incredibly small and full-featured. And, because Unite apps are each a unique browser, they feature separate cookies and settings, as well as support […]"},{"link":"https://nmac.to/blog/battery-indicator/","image":"https://nmac.to/wp-content/uploads/2017/03/Battery_Indicator_2.png","title":"Battery Indicator 2.12.3 – Remaining battery time/percent","content":"Shows the remaining battery time and percentage in the menu bar.   The app has a setting to hide the menu bar icon when the power plug is connected, which can be useful if you only care about the battery time/percentage when on battery.   You can hide the system battery indicator by dragging its […]"},{"link":"https://nmac.to/blog/iring-app/","image":"https://nmac.to/wp-content/uploads/2018/04/iRingg.png","title":"iRingg 4.0.16 – Create ringtones and push them to an iPhone","content":"iRingg will allow you to make personalized ringtones from virtually anything you can find on the internet. Easily trim the segment of audio from songs in your iTunes library, or find them instantly on SoundCloud or YouTube. Add sound effects (called SndMoji™️) or record your own voice and use filters to create extremely personal ringtones. […]"},{"link":"https://nmac.to/blog/folder-colorizer/","image":"https://nmac.to/wp-content/uploads/2022/02/Folder-Colorizer.png","title":"Folder Colorizer 4.0.0 – Change Folder Color on macOS","content":"Folder Colorizer makes significant folders stand out on a cluttered desktop. It’s built for Mac users whose life depends on color to navigate successfully between folders. You can change folder color, add emojis or a special image background. Change Folder Color on Mac. In 1-Click.   Why change folder color on Mac? The colored folders […]"},{"link":"https://nmac.to/blog/live-home-3d-pro/","image":"https://nmac.to/wp-content/uploads/2018/10/Live-Home-3D-Pro.png","title":"Live Home 3D Pro 4.3.1 – Powerful and intuitive interior design","content":"Live Home 3D Pro, a successor of Live Interior 3D, is the powerful yet intuitive home design software that lets you build the house of your dreams right on your Mac.   It has every feature of Live Home 3D, plus some exclusive ones: 2D-elevation view Build three and more stories buildings Additional tools (building […]"},{"link":"https://nmac.to/blog/turbomosaic/","image":"https://nmac.to/wp-content/uploads/2017/12/TurboMosaic.png","title":"TurboMosaic 3.6.6 – Best Photo Mosaic Maker for Mac","content":"TurboMosaic is a photomosaic software that lets you make the most amazing picture mosaics with little effort — we bet you’d be pleasantly surprised with the quality of results.   A mosaic is a photo made out of many smaller photos. When viewed from a distance the big picture is prominent whereas when viewed from […]"},{"link":"https://nmac.to/blog/gemini/","image":"https://nmac.to/wp-content/uploads/2016/05/Gemini-2.png","title":"Gemini 2.9.2 – Locate and eliminate duplicate and similar files","content":"Gemini 2 helps you find duplicate files and wipe them away. It’s smart, laser-accurate, and recovers tons of space on your Mac.   Features Detect and delete duplicates. Locate and remove duplicate files, even if they’re in remote corners of your system. Gemini 2 scans your whole disk speed-of-light fast, no matter how massive it […]"},{"link":"https://nmac.to/blog/waltr-pro/","image":"https://nmac.to/wp-content/uploads/2021/05/WALTR-PRO.png","title":"WALTR PRO 4.0.114 – Quickly Transfer ANY File into iPhone, iPad","content":"At its core, WALTR PRO continues to deliver the easiest way of transferring files without any hassle. So if you need to get any file on iPhone, forget worrying about compatibility.   What’s New in WALTR PRO?   Edit Metadata & Cover Art  Back in 2016, we’ve introduced ACR – Automatic Content Recognition feature that […]"},{"link":"https://nmac.to/blog/hyperkey/","image":"https://nmac.to/wp-content/uploads/2021/12/Hyperkey.png","title":"Hyperkey 0.14 – The extra macOS modifier key.","content":"Hyperkey allows you to convert your caps lock key or any of your modifier keys to the hyper key: ⌃⌥⌘⇧   The hyper key acts as an additional modifier key that you can use in all of your other apps that have keyboard shortcuts   Don’t want to sacrifice a key?   Use a simple […]"}]