[{"link":"https://nmac.to/blog/clipboard-booster/","image":"https://nmac.to/wp-content/uploads/2020/11/Clipboard-Booster.png","title":"Clipboard Booster 1.8 – Unlimited Copy Paste Manager","content":"Clipboard Booster is a very simple and light app that helps you manage your clipboard for your Mac. Running discreetly from your menu bar, the app stores all the texts that you have copied or cut in the past, allowing you to easily find that snippet of text you need, whenever you want to paste […]"},{"link":"https://nmac.to/blog/hyperdither/","image":"https://nmac.to/wp-content/uploads/2020/11/HyperDither.png","title":"HyperDither 2.0.2 – Convert images to 1-bit black and white","content":"HyperDither uses an elegant color reduction (dithering) routine to turn color or grayscale images into black and white or grayscales. The visual effect produced by this technique creates rich, velvety tones, and is higher-quality than the “Diffusion Dither” method offered by Photoshop.   HISTORY: In the early 1980s, while developing the graphics technology for the […]"},{"link":"https://nmac.to/blog/knights-and-bikes/","image":"https://nmac.to/wp-content/uploads/2020/08/Knights-And-Bikes.png","title":"Knights And Bikes 1.11 – 2D Action & Adventure Game","content":"Saddle up for a bike-riding, friendship-building, frisbee-throwing, goose-petting, high-fiving, treasure-hunting adventure for 1 or 2 players!    You’ll play as Nessa & Demelza as they explore an ancient island with their pet goose Captain Honkers, riding and upgrading their bikes on a quest for treasure, adventure, and an end to childhood boredom!   As the […]"},{"link":"https://nmac.to/blog/wondershare-allmymusic/","image":"https://nmac.to/wp-content/uploads/2015/05/AllMyMusic2.png","title":"Wondershare AllMyMusic 3.0.2.1 – High-quality recorder for streaming audio","content":"With Wondershare’s AllMyMusic, an unlimited supply of free music is just a click away.   Want to listen to your favorite songs, radio programs and audio from video anytime and without needing an Internet connection? Just record your favorite streaming audio with a polished Mac audio recorder, Wondershare AllMyMusic for Mac. Wondershare AllMyMusic for Mac […]"},{"link":"https://nmac.to/blog/currencier/","image":"https://nmac.to/wp-content/uploads/2020/01/Currencier_2.png","title":"Currencier 2.5.2 – Currency-converter widget","content":"Currencier is a converter of more than 180 currencies in all directions. A distinctive feature is elegant and modern design, easy to enter, clear and friendly interface.   Thanks to the built-in calculator, you can calculate the input amount for conversion when entering without going into third-party calculators. To do this, simply swipe the input […]"},{"link":"https://nmac.to/blog/motive/","image":"https://nmac.to/wp-content/uploads/2020/11/Motive.png","title":"Motive 1.3.0 – Be more expressive, use Emoji","content":"Isn’t it annoying that you can use Emoji easily on your phone but your desktop or laptop requires a ton of steps to hunt down just the right Emoji? With Motive, you get the Emoji finder you always wanted.   Just click on the status bar icon and you’ll get a list of organized Emoji […]"},{"link":"https://nmac.to/blog/new-file-menu/","image":"https://nmac.to/wp-content/uploads/2017/04/New-File-Menu.png","title":"New File Menu 1.5 – Create new files quickly via the Finder context menu","content":"New File Menu allows you to create new files quickly via the Finder context menu. Right click in any Finder window to create a new file. You can even right click on the desktop to create your files!   Features Right click in any Finder window to create a new file Over 30 built-in file […]"},{"link":"https://nmac.to/blog/maff-viewer/","image":"https://nmac.to/wp-content/uploads/2020/11/MAFF-Viewer.png","title":"MAFF Viewer 1.2 – Mozilla Archive Format Viewer","content":"MAFF Viewer is a lightweight utility for viewing/reading Mozilla Archive Format (.maff) documents.   Features Minimal reader user interface Support multiple pages in the same archive Keyboard shortcuts to navigate through the pages MAFF Quick Look plugin available Export page to PDF / Webarchive   The Mozilla Archive Format (MAFF) is a web page archiving […]"},{"link":"https://nmac.to/blog/particulars/","image":"https://nmac.to/wp-content/uploads/2020/09/Particulars.png","title":"Particulars 34 – Displays system information on your desktop","content":"Particulars displays system information about your Mac on your desktop. It shows computer name, model, CPU, RAM, OS version, Server version, current user, uptime, disk space and network configuration. Particulars provides up-to-date information and dynamically changes when your system changes. For instance, if you switch Wi-Fi networks, Particulars shows the new network configuration immediately. Particulars […]"},{"link":"https://nmac.to/blog/realpolitiks/","image":"https://nmac.to/wp-content/uploads/2020/11/Realpolitiks.png","title":"Realpolitiks 1.6.4 – A streamlined real-time grand strategy game","content":"Realpolitiks is a streamlined real-time grand strategy game that allows you to become the leader of any contemporary nation. Dive deep into the issues of the modern world, with its current geopolitical borders, using your country’s power and economic strength to engage in military conflicts and international affairs. Choose your own method of coping with […]"}]