[{"link":"https://nmac.to/blog/watermarker-2-0-1/","image":"https://nmac.to/wp-content/uploads/2015/08/Watermarker.png","title":"Watermarker 2.0.1 – Branding images with a wide varitey of watermark types","content":"Watermarker is a professional tool for branding images with a wide varitey of watermark types. No stone was left unturned when it came to overhauling the original Watermaker. It was necessary to completely re-write Watermarker from the ground up using the latest technologies to accomplish Watermarker’s ambitious feature set. Thanks to these new technologies, not […]"},{"link":"https://nmac.to/blog/loop-editor-2-1-3/","image":"https://nmac.to/wp-content/uploads/2015/07/Loop.Editor.png","title":"Loop Editor 2.1.3 – Audio loop editing tool","content":"Loop Editor is the perfect replacement for Apple Loops Utility. It supports all audio file formats that support loop points: AIFF Apple Loops, compressed and uncompressed CAF (AIFF, AAC, and Apple Lossless) Apple Loops, AIFF, WAV, W64, and ACID. Additionally, Loop Editor supports forward, forward-backward, and backward looping. Loop Editor is one of the only […]"},{"link":"https://nmac.to/blog/disk-space-pro-2-3/","image":"https://nmac.to/wp-content/uploads/2015/09/Disk.Space_.Pro_.png","title":"Disk Space Pro 2.3 – Shows disk drive information","content":"Disk Space Pro is an app that shows disk drive information. This includes hard drives, external drives, network drives, DVD’s, CD’s, memory cards, and USB flash drives. Scan your home folders for a sortable list showing their size on your hard drive. Then single click in the scan results to drill down to subfolders. Disk […]"},{"link":"https://nmac.to/blog/calcbot-1-0-3/","image":"https://nmac.to/wp-content/uploads/2015/02/Calcbot.png","title":"Calcbot 1.0.3 – Intelligent calculator and unit converter","content":"Calcbot is an intelligent calculator and unit converter for the rest of us. Featuring an easy-to-read history tape, expression view, intuitive conversion, and much more!   Features History Tape – Every calculation you enter gets saved to the history tape and optionally sent to your clipboard for quick pasting. Refer to calculations later or send […]"},{"link":"https://nmac.to/blog/appdelete-4-2-2/","image":"https://nmac.to/wp-content/uploads/2015/02/AppDelete.png","title":"AppDelete 4.2.2 – The speedy and efficient way to delete your unwanted apps","content":"AppDelete is an uninstaller for Macs that will remove not only applications but also widgets, preference panes, plugins, and screensavers along with their associated files. Without AppDelete these associated items will be left behind to take up space and potentially cause issues.   There are several ways to activate AppDelete: Drag items onto main window […]"},{"link":"https://nmac.to/blog/oh-my-star-1-1-7/","image":"https://nmac.to/wp-content/uploads/2015/09/OhMyStar.png","title":"Oh My Star 1.1.7 – Organise your GitHub Stars","content":"Oh My Star provides a convenient way to manage your starred GitHub repositories. You can easily use Oh My Star to view, group, organise your GitHub Stars.   Features: View your starred repositories. (update automatically) Group your starred repositories. Sort your starred repositories. (by name, rate, date added) Add tags to your starred repositories. Rate […]"},{"link":"https://nmac.to/blog/file-time-1-4-2/","image":"https://nmac.to/wp-content/uploads/2015/09/File.Time_.png","title":"File Time 1.4.2 – Ultimate file date changing tool","content":"File Time is the ultimate file date changing tool.   File Time allows you to batch change the created and modified date and time of files or folders.   set the new date and time and apply the changes. You can set new date to files only or you can set new date for both […]"},{"link":"https://nmac.to/blog/checkout-4-0-10/","image":"https://nmac.to/wp-content/uploads/2015/09/Checkout.png","title":"Checkout 4.0.10 – Powerful, easy-to-use point-of-sale system","content":"Checkout is a powerful, easy to use point of sale system for the Mac. Use Checkout to take orders, make sales, print invoices and accept payments. Checkout records all in-store transactions to generate a range of interactive reports. Together with a Mac and the right peripherals, Checkout offers a perfect retail solution.   Version 4.0.10: […]"},{"link":"https://nmac.to/blog/promotee-1-3-0/","image":"https://nmac.to/wp-content/uploads/2015/09/Promotee.png","title":"Promotee 1.3.0 – Create pixel-perfect artwork for apps","content":"Promotee is an application to create pixel-perfect and professional looking artwork for iOS, Mac, Apple Watch and Android apps. Just drop a screenshot from your app onto a template in Promotee and our graphics engine will blend it into the template to generate a gorgeous looking result.   You’ve invested hundreds of hours crafting your […]"},{"link":"https://nmac.to/blog/moneywiz-2-1-1/","image":"https://nmac.to/wp-content/uploads/2015/02/MoneyWiz2.png","title":"MoneyWiz 2.1.1 – Personal finance solution","content":"All your accounts, budgets and bills in one place! With powerful reports, worldwide online banking and instant sync between all your devices!   That’s MoneyWiz – the world’s most powerful and beautiful finance software.   HOW CAN MONEYWIZ HELP YOU? GET OUT OF DEBT : We’ve built MoneyWiz in a way that makes it easy […]"}]