[{"link":"https://nmac.to/blog/sparkchess/","image":"https://nmac.to/wp-content/uploads/2015/02/SparkChess.png","title":"SparkChess 14.0.3 – An easy to pick up chess game","content":"SparkChess is the only chess game that puts fun first. With a choice of boards, computer opponents and online play it delivers a first-class game of chess that’s as accessible to experts as it is to novices, kids and anyone else who wants to discover how enjoyable this ancient strategy board game really is.   […]"},{"link":"https://nmac.to/blog/weather-feel/","image":"https://nmac.to/wp-content/uploads/2018/10/Weather-Feel.png","title":"Weather Feel 1.2 – Beautiful and highly accurate weather app","content":"Weather Feel is a breath of fresh air in the realm of weather apps. It is clean, elegant and works smoothly on any given point of time. It loads basic weather statistics on a small yet compact app layout and sends you weather alerts as soon as there are any changes in your weather.   […]"},{"link":"https://nmac.to/blog/markeditor/","image":"https://nmac.to/wp-content/uploads/2020/05/MarkEditor.png","title":"MarkEditor 1.12 – WYSIWYG Markdown editor","content":"MarkEditor is a lightweight Markdown editor for developers. Features live preview, sync scroll, auto save, auto pair, custom themes and CSS, HTML and PDF export and more.   Version 1.12: Improved stability   Intel, 64-bit processor OS X 10.8 or later    "},{"link":"https://nmac.to/blog/nighttone/","image":"https://nmac.to/wp-content/uploads/2017/09/NightTone.png","title":"NightTone 2.6.0 – Shifts display colors to promote mental health and productivity","content":"NightTone makes your screen more comfortable, enjoyable and healthier by shifting the colors of your display to a warmer, eye-friendly palette. It makes you sleep and feel better. It’s perfect for everyone’s health, especially for people with visual perception problems, light sensitivity or discomfort.   Predefined color palets for common scenarios: Warm orange for late […]"},{"link":"https://nmac.to/blog/sip/","image":"https://nmac.to/wp-content/uploads/2017/02/Sip.png","title":"Sip 1.2 – Simple color picker for developers","content":"Finding that perfect color made easy with Sip. Use this robust color detector to determine, isolate and identify specific colors. Get the exact color you need and use smart formats aligned with your software. Interact with your colors directly from the touch bar. This color picker makes a wonderful solution for those who interact with […]"},{"link":"https://nmac.to/blog/snap-converter/","image":"https://nmac.to/wp-content/uploads/2013/01/Snap-Converter.png","title":"Snap Converter 3.0.1 – Image and icon conversion tool","content":"Snap Converter is an easy-to-use tool for image and icon conversion. It supports many image file formats, including bitmap graphics, Mac and Windows icons, Camera RAW images, PDFs, Photoshop files, and more.   If you need to convert several images, Snap Converter’s batch processing allows you to perform multiple image conversions at once. The new […]"},{"link":"https://nmac.to/blog/iclock/","image":"https://nmac.to/wp-content/uploads/2017/04/IClock-Pro.png","title":"iClock 5.7.1 – Customizable menu bar clock, calendar, alarms, timezones and chimes","content":"iClock replaces the old Apple’s default menu bar clock with more features, customization and increases your productivity.   Features: Have your Apple or Google calendar instantly available from the menubar 2 types of calendars (tiny or big calendars) accessible from the menubar to help you see and easily edit your schedule and events From the […]"},{"link":"https://nmac.to/blog/rise-of-industry/","image":"https://nmac.to/wp-content/uploads/2019/04/Rise.of_.Industry.png","title":"Rise of Industry Include DLC 2.2.0 – A complex strategic tycoon game","content":"With Rise of Industry we’re set on resurrecting the good old industrial tycoon games of the 90s, with modern twists. The game is still under development, and major game-changing updates are constantly rolled out. With your feedback and support we can make this game a real classic of the genre. Made by fans, for fans! […]"},{"link":"https://nmac.to/blog/tabletop-simulator/","image":"https://nmac.to/wp-content/uploads/2015/06/Tabletop-Simulator.png","title":"Tabletop Simulator Include DLCs 12.3.5 – Simulation Board Game","content":"Create your own original games, import custom assets, set up complete RPG dungeons, manipulate the physics, create hinges & joints, and of course flip the table when you are losing the game. All with an easy to use system integrated with Steam Workshop. You can do anything you want in Tabletop Simulator. The possibilities are […]"},{"link":"https://nmac.to/blog/def-zone-2/","image":"https://nmac.to/wp-content/uploads/2014/01/Defense-zone.png","title":"Def zone 2 1.7.0 – Tower defense game","content":"The new, engaging levels are even more stunning and impressive. New weapons have been added, along with new opponents, and even more action and tactics.   The game supports four languages: English, Russian, French and German.   The game settings are balanced to meet the goals of different players. If you want to test your […]"}]