[{"link":"https://nmac.to/blog/appsana-2-8/","image":"https://nmac.to/wp-content/uploads/2017/04/AppSana.png","title":"AppSana 2.8 – Smart app that integrates with Asana","content":"AppSana is a smart app that integrates with Asana. Designed to be the perfect client for Asana with native notifications, app icon badge, smart tabs, screen lock option, dark mode support, and mobile view option.   Features Native notifications: You will be informed with clean and optimised messages about every activity at your Asana Workspaces. […]"},{"link":"https://nmac.to/blog/video-editor-robot-2-1/","image":"https://nmac.to/wp-content/uploads/2017/02/Video.Editor.Robot_.png","title":"Video Editor Robot 2.1 – Edit video, audio, image, titles using fabulous tools","content":"Video Editor Robot editing video is only three-step: Step 1, Import media; Step 2, Edit video, audio, image, titles using fabulous tools Step 3, Export video.   Supported Input Formats Support high-resolution videos such as 4K, 3D, 8K Video formats: MPG, MPEG, MPEG 2, VOB, DAT, MP4, M4V, TS, MTS, M2TS, RM, RMVB, WMV, ASF, […]"},{"link":"https://nmac.to/blog/vault-101-1-4-8/","image":"https://nmac.to/wp-content/uploads/2015/08/Vault.101.png","title":"Vault 101 1.4.8 – Protect critical data with AES-256 encryption. Optionally share online","content":"Vault 101 will help you keep your data protected via strong AES-256 encryption, 256-bit Advanced Encryption Standard. Password-protect files and folders in 3 easy steps: choose the source folder; set capsule name and password; click “Create”.   Easy Access to Your Encrypted Data Since your capsule is encrypted, it’s not possible for others to read […]"},{"link":"https://nmac.to/blog/poster-1-6-4/","image":"https://nmac.to/wp-content/uploads/2016/06/Poster.png","title":"Poster 1.6.4 – Post photos and video to the Web","content":"Poster enables you to post photos and videos to the web. Poster can send photos and videos to Flickr, SmugMug, Facebook profiles and Facebook pages.   Poster sports a sleek design that lets you see your photos properly and work with them effortlessly. Whether posting to Flickr, Facebook or SmugMug, Poster takes a tailored approach […]"},{"link":"https://nmac.to/blog/appgenome-1-4-2/","image":"https://nmac.to/wp-content/uploads/2016/06/AppGenome.png","title":"AppGenome 1.4.2 – Create your own URL-based apps","content":"AppGenome lets you set your own URL, browser agent type (mobile or desktop), and create your own desktop app that will stay in your menubar, so you can forget about all those “app for” apps.   Features Set your own URL of any web page or web app Manually set your agent type (browser type): […]"},{"link":"https://nmac.to/blog/smartbackup-4-1-1/","image":"https://nmac.to/wp-content/uploads/2017/04/SmartBackup.png","title":"SmartBackup 4.1.1 – Daily backups with Spotlight integration","content":"SmartBackup is an alternative lightweight backup application for OS X. Backup multiple source items to a destination folder on an external harddrive, flashdrive or network share, or create a bootable clone of your system. SmartBackup only copies what has changed after the initial run and is very fast in updating your backup or system clone. […]"},{"link":"https://nmac.to/blog/offline-pages-pro-1-3/","image":"https://nmac.to/wp-content/uploads/2016/11/Offline-Pages-Pro.png","title":"Offline Pages Pro 1.3 – Browse the internet without an internet connection","content":"Offline Pages Pro is an offline browser. Download entire websites with all formatting, lightboxes, galleries, and video, so you can browse offline without any Internet connection.   Version 1.3: Easier sharing and AirDrop between devices Improved compatibility with many sites and web products, including Wix, SquareSpace, TypeKit, WordPress, Slider Revolution, and more Many bug fixes […]"},{"link":"https://nmac.to/blog/life-1-1/","image":"https://nmac.to/wp-content/uploads/2014/05/Life.png","title":"Life 1.1 – Personal journal","content":"Life is a clean, beautiful, awesome journal that helps you to capture life as it happens and view it as a personal timeline. Stunning Design and App Flow   Life is beautiful and the app for capturing it should also be as beautiful. A lot of design and usability thought has gone in to the […]"},{"link":"https://nmac.to/blog/bills-1-10-6/","image":"https://nmac.to/wp-content/uploads/2013/03/Bills.png","title":"Bills 1.10.6 – Plan and track your expenses every month","content":"Bills is an application that can help you plan and track your expenses every month. Brilliant interface will remind you of a real-life office room (check the screenshots). Clear, simple and quick (a MUST HAVE) financial planning!   You always need a simple tool to control how much you want to spend this month. Essentially […]"},{"link":"https://nmac.to/blog/quern-undying-thoughts-1-0/","image":"https://nmac.to/wp-content/uploads/2017/04/Quern-Undying.Thoughts.png","title":"Quern – Undying Thoughts 1.0 – First-Person Mystery Puzzle & Adventure Game","content":"You try to clear your vision and get on your feet after your arrival. You hear the portal closing behind you as you take a step forward. You are trapped, your way back is gone.   Quern – Undying Thoughts is a first-person puzzle adventure game, inviting you on a journey to explore it and […]"}]