[{"link":"https://nmac.to/blog/video-uploader-for-youtube/","image":"https://nmac.to/wp-content/uploads/2017/09/Video-Uploader-for-YouTube.png","title":"Video Uploader for YouTube 3.1.0 – Directly upload videos to YouTube","content":"Powered by Apple’s Share Extension feature, Video Uploader lets you to directly upload videos from Photos, Finder and Desktop to YouTube.   You are just a click away before sharing your favourite videos on YouTube.   Drag and drop as many videos as you like and Video Uploader for YouTube will upload all of them […]"},{"link":"https://nmac.to/blog/netnewswire/","image":"https://nmac.to/wp-content/uploads/2016/11/NetNewsWire4.png","title":"NetNewsWire 4.1.0 – RSS and Atom news reader","content":"NetNewsWire is the best way to keep up with the sites and authors you read most regularly. Let NetNewsWire pull down the latest articles, and read them in a distraction-free and Mac-like way. Native Interface… NetNewsWire looks right at home in OS X 10.8 Find Later… Bookmark individual articles, mark sites as your favorites, and […]"},{"link":"https://nmac.to/blog/battlezone-98-redux/","image":"https://nmac.to/wp-content/uploads/2018/03/Battlezone-98-Redux.png","title":"Battlezone 98 Redux 2.2.301 – Sci-fi strategy & action game","content":"One of the greatest sci-fi strategy games of all time returns Spring 2016 with remastered visuals, online multiplayer, and near unlimited mod content from Steam Workshop.   Enter an alternate vision of the 1960s where the “space race” is nothing more than a cover for an interplanetary war between the US and Soviet Russia over […]"},{"link":"https://nmac.to/blog/all-walls-must-fall/","image":"https://nmac.to/wp-content/uploads/2018/03/All-Walls-Must-Fall.png","title":"All Walls Must Fall 4.19 – A Tech-Noir Tactics game","content":"Berlin, November 2089: The Cold War never ended. For 150 years both sides have used time manipulation technology to observe and counter each other’s every move. Now this fragile state of affairs is approaching a breaking point, as a rogue nuclear strike will send the world into turmoil. Both sides have scrambled to send agents […]"},{"link":"https://nmac.to/blog/witch/","image":"https://nmac.to/wp-content/uploads/2018/03/Witch.png","title":"Witch 4.1 – Shortcut for switching between windows","content":"Witch makes switching between windows easy. Have you ever wanted to switch to a certain window, not just the application it belongs to? While you can use Exposé to switch windows, doing so can be very clumsy if you’re the keyboard-only type of user. And don’t all of these windows look just the same when […]"},{"link":"https://nmac.to/blog/aktuell/","image":"https://nmac.to/wp-content/uploads/2016/11/Aktuell3.png","title":"Aktuell 3.8.1 – Modern, intuitive, elegant news reader","content":"Aktuell is a modern, intuitive, elegant reader for blogs and news. All your favorite feeds in one app. Built-in RSS/Atom/RDF sync, support of all versions of standards. Ability to sync all feeds or selected feeds automatically in background.   Keyboard navigation with arrow keys (between panes). OS X El Capitan look and feel, designed special […]"},{"link":"https://nmac.to/blog/app-uninstall/","image":"https://nmac.to/wp-content/uploads/2018/03/App-Uninstall.png","title":"App Uninstall 2.0.4 – Remove application and its service files for complete uninstallation","content":"Installing one application distributes many files throughout your Mac. App Uninstaller provides a straightforward way to remove apps and their associated files including Applications Caches, Application Log Files, Application Preferences and Crash Report.   Main Features: Manage all the applications installed on your Mac easily View all the information of applications installed on your Mac […]"},{"link":"https://nmac.to/blog/far-out/","image":"https://nmac.to/wp-content/uploads/2018/03/Far-Out.png","title":"Far Out 1.0 – A retro-futuristic first-person survival & adventure game","content":"Far-Out is a hardcore retro-futuristic first-person adventure game, made with old quests such as Space Quest, The Dig, Full Throttle etc. in mind.   In this game you will face a really old-school challenge, no map arrows, no one will lead you and tell you what to do. This is a one-man show with full […]"},{"link":"https://nmac.to/blog/quickcalc-pro/","image":"https://nmac.to/wp-content/uploads/2018/02/Quickcalc-Pro.png","title":"Quickcalc Pro 1.0 – Menubar Calculator","content":"Doing math on a Mac with Quickcalc Pro is so easy and convenient. It’s located in your menubar and allow you to make simple and advanced calculations.   Buttons cut out the extra typing and allow you to quickly make advanced calculations. Simply use two fingers to horizontally scroll and see your options.   macOS […]"},{"link":"https://nmac.to/blog/zoc-terminal/","image":"https://nmac.to/wp-content/uploads/2017/08/ZOC7.png","title":"ZOC Terminal 7.17.5 – Telnet/SSH/SSH2 client and terminal emulator","content":"ZOC Terminal is a Telnet/SSH/SSH2 client and terminal emulator.   Featuring tabbed sessions, typed command history, scrollback, and multi-window support, ZOC Terminal’s implemented emulations have made it the preferred tool for anyone who needs to access Unix shell accounts from a Windows or OS X platform.   Emulate widely-used or specialized terminals vt102 vt220 TN3270 […]"}]