[{"link":"https://nmac.to/blog/datum-6-5-3/","image":"https://nmac.to/wp-content/uploads/2015/05/Datum.png","title":"Datum 6.5.3 – Full featured SQLite database manager","content":"Datum is a full featured SQLite database manager. It is light weight and blazing fast. It has all the tools to help you be a SQLite master as soon as you launch the app. Instant loading and editing. Fast, powerful, complete. It’s the most powerful SQLite manager in the App Store.   Features include: Easy […]"},{"link":"https://nmac.to/blog/better-window-manager-1-11/","image":"https://nmac.to/wp-content/uploads/2015/05/Better-Window-Manager.png","title":"Better Window Manager 1.11 – Move and position your windows where you want","content":"Better Window Manager is a utility for power users who like having application windows in specific locations and sizes. It allows you to save a window state (position and size), and apply that window state to a window with a keyboard shortcut of your choice.   Version 1.11: Allowed single key keyboard shortcuts as requested […]"},{"link":"https://nmac.to/blog/power-word-pro-1-1-5/","image":"https://nmac.to/wp-content/uploads/2015/05/Power.Word_.Pro_.png","title":"Power Word Pro 1.1.5 – A magic, easy-to-use word processor","content":"Power Word Pro is a magic, easy-to-use word processor that can make the writing and the picture have perfect layout, support Retina resolutions and export all the common formats: .pdf, .rtf, .doc, .txt, .odt and more. To insert the pictures make your document more rich and colorful. Automatic save function let you don’t have to […]"},{"link":"https://nmac.to/blog/outcome-1-1/","image":"https://nmac.to/wp-content/uploads/2015/05/Outcome.png","title":"Outcome 1.1 – A new calculator application usage experience","content":"With its innovative and minimal interface, Outcome provides a new calculator application usage experience.   With none of the traditional buttons found on calculators, it is easy and enjoyable to use. Rather than being faced with an array of buttons replicating the keys on a keyboard, users have an interface with which to interact with […]"},{"link":"https://nmac.to/blog/designs-for-mail-3-2/","image":"https://nmac.to/wp-content/uploads/2014/11/Designs-for-Mail2.png","title":"Designs for Mail 3.2 – 100+ beautiful templates for Apple’s Mail","content":"Designs for Mail brings you a diverse collection of templates for creating customized email messages in Apple Mail.    Choose a lively seasonal template for a family newsletter. Or select a sharp, sophisticated design for a business proposal. Designs for Mail’s selection is constantly expanding, so you’ll always have access to the latest templates.   […]"},{"link":"https://nmac.to/blog/characters-1-2-2/","image":"https://nmac.to/wp-content/uploads/2015/05/Characters.png","title":"Characters 1.2.2 – Access special characters","content":"Characters makes it easy for writers, designers and developers to access special characters. They are easily found and copied to your clipboard, either as the character itself or the html code.   For example, if you need the copyright symbol, just type “copy” into the search bar and the app finds the character you’re looking […]"},{"link":"https://nmac.to/blog/slender-2-2-2/","image":"https://nmac.to/wp-content/uploads/2015/05/Slender.png","title":"Slender 2.2.2 – Xcode scanning tool","content":"Slender is one of those rare tools that fits neatly between development and design. Slender will scan your Xcode or Web projects and provide information on how image assets are being used. Exposing retina issues, unused assets, wasted space, and designer mistakes.   Scan hundreds of file types for iPhone, iPad, Universal, Web, and Image […]"},{"link":"https://nmac.to/blog/instastack-1-83/","image":"https://nmac.to/wp-content/uploads/2015/03/Instastack.png","title":"Instastack 1.83 – Instagram Mac desktop client","content":"Instastack is the most elegant way to browse Instagram on the Mac.   MenuBar Panel InstaStack is a new tool to help you to discover Instagram social media network. if you want to connect your instagram account from menubar on your mac , InstaStack is your tool.   Browse Photo Feeds Browse your Instagram feed, […]"},{"link":"https://nmac.to/blog/instareel-2-6/","image":"https://nmac.to/wp-content/uploads/2015/05/InstaReel.png","title":"InstaReel 2.6 – Browse your Instagram directly form mac desktop","content":"InstaReel is a beautifully crafted app that makes it easy to browse your Instagram feed, like/comment on images/videos and discover amazing new content through its powerful search.   The app has been designed from the ground up with the aim of providing a sleek, unified and pleasurable Instagram experience. The flow and speed of the […]"},{"link":"https://nmac.to/blog/fumy-2-4-2/","image":"https://nmac.to/wp-content/uploads/2014/09/Fumy.png","title":"Fumy 2.4.2 – Edit bitmaps to create unique visual effects","content":"Fumy (was Smoke) is a kind of graphics editor, yet unusual as you will not find regular tools here. Fumy offers an absolutely unique type of brush that renders stunning graphics with the simplest mouse movements. Abstract backgrounds, lighting texts, art-house drawings or anything you can imagine this brilliant tool helps to convert an idea […]"}]