[{"link":"https://nmac.to/blog/intensify-1-0-2/","image":"https://nmac.to/wp-content/uploads/2014/05/Intensify.png","title":"Intensify 1.0.2 – Create clarity and intensity in your photos","content":"Intensify lets discerning photographers of all skill levels create powerful photographic images with unprecedented drama and detail. Precise control of contrast, structure, detail and sharpening across different tonal ranges delivers high quality results every time.   Special algorithms to prevent image artifacts, image layer stacking with opacity control, dozens of professionally created presets, adjustment brushes, RAW […]"},{"link":"https://nmac.to/blog/document-scanner-1-0/","image":"https://nmac.to/wp-content/uploads/2014/05/Document-Scanner.png","title":"Document Scanner 1.0 – Scan image or text fast and easy","content":"Document Scanner can allow scanning image or text fast and easy, using Document scanner, you can convert the scanned image to pdf file, or convert the scanned result to text format by OCR function, so, you can edit it or copy the text to other application convenient, you can also save the result as a […]"},{"link":"https://nmac.to/blog/dictaphone-1-0-5/","image":"https://nmac.to/wp-content/uploads/2014/05/Dictaphone.png","title":"Dictaphone 1.0.5 – A simple audio dictation application","content":"A simple audio dictation application. Keep audible notes as reminders or reference. Export recordings as .wav files, for attaching to email, uploading to the web or playing in iTunes.   With retro styling and animated interface Dictaphone will be a pleasure to use again and again.   Features: Unlimited recordings. CD quality sound. Export any […]"},{"link":"https://nmac.to/blog/card4call-1-1/","image":"https://nmac.to/wp-content/uploads/2014/05/Card4Call.png","title":"Card4Call 1.1 – Easily create your own business cards","content":"Card4Call is a simple application that lets you easily create your own business cards (size 8.5 x 5.5 cm).    Features: choose from 2360 icons and 140 textures; set the background (texture or color); insert an image, an icon and text; set the font, size and color of the text; apply the shadow; apply an […]"},{"link":"https://nmac.to/blog/energyxt-2-5-4/","image":"https://nmac.to/wp-content/uploads/2014/05/EnergyXT.png","title":"EnergyXT 2.5.4 – Easy to use application for music creation and production","content":"EnergyXT is a powerful, yet easy to use application for music creation and production. Record instruments such as guitar and keyboards, play virtual instruments and make drum beats with the built-in drum machine. Mix your tune with professional sounding effects, save as MP3, and share it online.   EnergyXT features: Browser: Drag & drop samples, […]"},{"link":"https://nmac.to/blog/lego-marvel-super-heroes/","image":"https://nmac.to/wp-content/uploads/2014/05/LEGO.Marvel.Super_.Heroes.png","title":"LEGO Marvel Super Heroes 1.0 – Help LEGO-style Marvel characters take Doctor Doom apart","content":"LEGO Marvel Super Heroes sends you flying, smashing, and swinging your way through a side-splitting LEGO adventure as over 100 classic Marvel characters. The Avengers, X-Men, Spider-Man, and the rest of the universe’s heroes must fight together to stop Doctor Doom’s evil alliance of villains.   You’ll need all your super-skills to thwart their plan […]"},{"link":"https://nmac.to/blog/moneybag-1-0-5/","image":"https://nmac.to/wp-content/uploads/2014/05/MoneyBag.png","title":"MoneyBag 1.0.5 – Personal finance manager","content":"MoneyBag is an elegant money manager that tracks and analyzes your financial transactions. Interpret and monitor your spending and saving patterns with unprecedented ease and simplicity!   One License, Endless Options Synchronize your data on two separate Macs Access free updates and support Integrates with the companion iOS app   Empowering Features Track Expenses, Income, […]"},{"link":"https://nmac.to/blog/imuscle-3-9-1/","image":"https://nmac.to/wp-content/uploads/2014/05/iMuscle.png","title":"iMuscle 3.9.1 – Everything you need to plan and track your fitness program","content":"iMuscle is a highly visual, award-winning health and fitness app that has everything you need to plan and track your fitness program.   iMuscle provides users with the ability to zoom into an area on our 3D human body and tap on a muscle to reveal exercises and stretches targeted to the development and/or rehabilitation […]"},{"link":"https://nmac.to/blog/icircuit-1-6/","image":"https://nmac.to/wp-content/uploads/2014/05/iCircuit.png","title":"iCircuit 1.6 – Design and experiment with circuits","content":"iCircuit is the easiest way to design and experiment with circuits. Its advanced simulation engine can handle both analog and digital circuits and features realtime always-on analysis. It is the perfect companion to students, hobbyists, and engineers.   You use it as you would any CAD program: you add elements, connect them together, and set […]"},{"link":"https://nmac.to/blog/equilibrium-1-0/","image":"https://nmac.to/wp-content/uploads/2014/05/Equilibrium.png","title":"Equilibrium 1.0 – Control Your Music","content":"Equilibrium gives you quick, easy access to music controls from your menu bar, desktop and keyboard. You can pause, skip, scrub and rate tracks without unhiding your music player.   Support for controlling these OS X music players (requires player to be installed and open): iTunes (including iTunes Radio) Spotify Rdio Vox   See your […]"}]