[{"link":"https://nmac.to/blog/piccure-2-0-0-271/","image":"https://nmac.to/wp-content/uploads/2014/12/Piccure.png","title":"Piccure+ 2.0.0.271 – Correct optical aberrations like never before","content":"piccure+ is a new software program capable of correcting optical aberrations that cause a lack of sharpness in your images.   piccure+ uses a new method that essentially inverts the optical processes that cause images to look blurry. With the help of piccure+, your equipment can now be upgraded with a mouse click. It is […]"},{"link":"https://nmac.to/blog/condense-1-6/","image":"https://nmac.to/wp-content/uploads/2014/09/Condense.png","title":"Condense 1.6 – Optical character recognition (OCR) application","content":"Typing out has come to an end. Say ‚Hello‘ to Condense. Your easy to use optical character recognition (OCR) application.   Imagine one of the following scenarios:   You’re writing an essay for University and you’ve to quote from a PDF, an EBook or one of your professor’s presentations? That’s a huge amount of text […]"},{"link":"https://nmac.to/blog/deja-vu-4-8-4/","image":"https://nmac.to/wp-content/uploads/2014/12/Deja-Vu.png","title":"Deja Vu 4.8.4 – Effortless backup and cloning utility","content":"Deja Vu offers an intuitive and reliable way to back up your data. It’s a preference pane that shows up in your System Preferences, and it allows you to schedule unattended backups of important folders, or even your entire system.   With Deja Vu, you can: Backup an unlimited number of folders. Accurately clone your […]"},{"link":"https://nmac.to/blog/tab-launcher-2-8/","image":"https://nmac.to/wp-content/uploads/2013/12/Tab-Launcher.png","title":"Tab Launcher 2.8 – Clean up and organize the Dock","content":"The idea of Tab Launcher is not to replace the system’s dock, but to help keep it clean, with only the applications that are currently running.   By removing all the application from the dock and organizing them on tabs, you can quickly find and run any application you want.   Apart from that, you […]"},{"link":"https://nmac.to/blog/thumbs-1-0-3/","image":"https://nmac.to/wp-content/uploads/2014/12/Thumbs.png","title":"Thumbs 1.0.3 – Generate images from your media collection","content":"Meet Thumbs, your new personal assistant for movie stills and thumbsheets. Powerful, flexible and with a unique personality, Thumbs is a Mac app that quickly and easily generates images for your media collection.   Easy to Use, and Fun   A simple, Drag and Drop interface makes Thumbs a breeze to work with. Just drag […]"},{"link":"https://nmac.to/blog/receiptbox-2-3-1/","image":"https://nmac.to/wp-content/uploads/2014/03/receiptbox.png","title":"ReceiptBox 2.3.1 – Keep track of your receipts","content":"ReceiptBox is a very easy to use application designed to help you keep track of your receipts.   Features: Organize your receipts into multiple accounts. Import-export to file Receipts templates Autocompletes receipt data Search into records Print report Total amount per expenses category   Version 2.3.1: Remove VAT-tax field Bug fixes   Intel, OS X […]"},{"link":"https://nmac.to/blog/printopia-2-1-10-2/","image":"https://nmac.to/wp-content/uploads/2014/12/Printopia.png","title":"Printopia 2.1.10.2 – Share Mac printers with iOS devices","content":"Run Printopia on your Mac to share its printers to any capable iPhone, iPad or iPod Touch. Printopia will also add virtual printers, allowing you to save print-outs to your Mac and send to apps.   Wireless Printing To Your Mac’s Printers Whether you have an inkjet printer plugged into your Mac, a laser printer […]"},{"link":"https://nmac.to/blog/aquarium-videos-2-3-1/","image":"https://nmac.to/wp-content/uploads/2014/12/Aquarium.Videos.png","title":"Aquarium Videos 2.3.1 – Show videos of aquariums and fishes","content":"The program shows you videos of aquariums and fishes in HD quality. These are played online (streaming) and thus saves your disk space. In the course of time come to more videos.   In App Purchase: New Full HD Videos, better Video Quality Riff Aquariums, 3D Anaglyph, 3D Side by Side, 4K   Features: Video […]"},{"link":"https://nmac.to/blog/mindnode-pro-1-11/","image":"https://nmac.to/wp-content/uploads/2014/12/MindNode-Pro2.png","title":"MindNode Pro 1.11 – Elegant mindmapping application","content":"MindNode Pro is a powerful and intuitive mind mapping application. Its focus and flexibility make it the perfect tool for brainstorming and organizing your life – and iCloud sharing means you always have your mind maps with you. MindNode lets you lay out your notes and tasks visually so you can get a bird’s-eye view […]"},{"link":"https://nmac.to/blog/ivideo-7-0-1/","image":"https://nmac.to/wp-content/uploads/2014/12/iVideo.png","title":"iVideo 7.0.1 – Powerful app for organizing and sharing movies","content":"iVideo is the best way to find, play, and share your videos.   Organize videos across multiple hard drives and websites, all from one place. Browse your videos by thumbnail, list, or gallery view. Find videos by name, author, album, genre, tag, note, or location. Play multiple videos in a row automatically, and choose a […]"}]