[{"link":"https://nmac.to/blog/icon-maker/","image":"https://nmac.to/wp-content/uploads/2018/02/Icon-Maker.png","title":"Icon Maker 1.5 – Resize Apps icons and Asset Catalogs","content":"Easy way to resize iOS, OS X, Android, Watch App icons and Asset Catalogs in just two clicks.   Features: iOS & Android App Icons OS X App Watch App Custom size Icons   Drag and drop generated Asset Catalog directly into your project workspace Very thin and light weight app   Version 1.5: Updated […]"},{"link":"https://nmac.to/blog/speed-read/","image":"https://nmac.to/wp-content/uploads/2018/02/Speed-Read.png","title":"Speed Read 2.0.1 – Improve your ability to read quickly","content":"Speed Read – speed reading technique aimed to improve your ability to read quickly.   EFFECTIVE LEARNING STRATEGY The method involves moving a pointer below the lines you are reading; Whether you consider yourself a slow or fast reader, a moving pointer will help force your eyes to follow the words appearing in the focus […]"},{"link":"https://nmac.to/blog/putty/","image":"https://nmac.to/wp-content/uploads/2018/02/Putty.png","title":"Putty 8.7.0 – Terminal emulator","content":"Putty is one of the best terminal emulators available today. It supports different types of network protocols such as SSH, FTP, SCP, Telnet, etc. In Windows, it is used as SSH client to connect to your Linux server, or for some other purpose. But what will you do if you are on Mac? You might […]"},{"link":"https://nmac.to/blog/rampage-knights/","image":"https://nmac.to/wp-content/uploads/2018/02/Rampage-Knights.png","title":"Rampage Knights 1.8 – Beat ’em up Co-op Action Game","content":"Rampage Knights is a cooperative beat ’em up game mixed up with randomized dungeon crawling and exploration which you can play alone or with a friend online.   You play as a hero trapped by a spell in a magical forest. All paths lead you to a nearby ruined castle, infested with goblins, skeletons and […]"},{"link":"https://nmac.to/blog/crossing-souls/","image":"https://nmac.to/wp-content/uploads/2018/02/Crossing-Souls.png","title":"Crossing Souls 1.0 – Pixel Graphics Adventure & Action Game","content":"It’s 1986 in California. A group of friends discover a mysterious pink stone that allows to travel between two realms. This gang will live the summer of their lives in an adventure that will get them involved in a government conspiracy. Control five kids with special skills while fighting and solving puzzles in order to […]"},{"link":"https://nmac.to/blog/easyping/","image":"https://nmac.to/wp-content/uploads/2017/07/EasyPing.png","title":"EasyPing 2.6.1 – Simple and practical","content":"EasyPing is a network tool to test whether a particular host is reachable across an IP network. This network can be IPv4 or IPv6. It works by sending ICMP packets to the host and listening for ICMP replies. This tool estimates the round-trip time, detects any packet loss, and prints a statistical summary. Just type […]"},{"link":"https://nmac.to/blog/window-manager/","image":"https://nmac.to/wp-content/uploads/2017/06/Window-Manager.png","title":"Window Manager 1.0.5 – Rapidly Move, Rearrange & Resize Windows on your Mac","content":"Window Manager is the perfect utility for managing the positions and sizes of your windows. The app allows you to quickly rearrange windows on your Mac using a range of preset options via its customizable shortcuts, fullscreen button overlay menu, menubar dropdown, and by dragging windows into various hotspots around the edges of your screen. […]"},{"link":"https://nmac.to/blog/giftools/","image":"https://nmac.to/wp-content/uploads/2018/02/GifTools.png","title":"GifTools 1.4.0 – GIF-to-APNG / APNG-to-GIF converter and resizer","content":"Romanysoft GifTools is designed for Mac users to convert animated images from GIF to APNG format. It generates APNG files with better quality and smaller file sizes, and meanwhile removes white pixels around the edges in the original GIFs. In addition, it allows users to resize images to the exact pixels or proportion specified before […]"},{"link":"https://nmac.to/blog/print-templates-for-word-by-gn/","image":"https://nmac.to/wp-content/uploads/2018/02/Print-Templates-for-Word-by-GN.png","title":"Print Templates for Word by GN 3.2.4 – Professionally-designed templates for Word","content":"Print Templates for Word by GN is a powerful companion to supercharge your personal and business Microsoft Word documents! Make use of thousands of professionally-designed templates with limitless customization opportunities. Creating exceptional work with Microsoft Word has never been quicker and easier!   Print Templates for Word by GN offers a wide range of customizable […]"},{"link":"https://nmac.to/blog/design-letters-templates/","image":"https://nmac.to/wp-content/uploads/2018/02/DesiGN-Letters-Templates.png","title":"DesiGN Letters Templates 1.6 – Templates for Pages","content":"DesiGN Letters Templates (was Letter Mill, then was GN Letters for Pages) is an indispensable tool for all your letter needs. An ever-growing collection of templates in a variety of styles will give you the means to create beautiful, informative, memorable letters in minutes. It provides you with a broad selection of letter styles for […]"}]