[{"link":"https://nmac.to/blog/ufocus-3-0-3/","image":"https://nmac.to/wp-content/uploads/2016/03/uFocus.png","title":"uFocus 3.0.3 – Distraction-free writing tool","content":"uFocus is the first distraction-free writing application that lets you open all kinds of plain text files as well as directories, allowing you to structure your stories into chapters, articles, sections … whatever you wish! Looking for an alternative to those heavy word processors? Seeking for freshness? You are on the right place to start. […]"},{"link":"https://nmac.to/blog/istudiez-pro-1-4/","image":"https://nmac.to/wp-content/uploads/2016/03/iStudiez-Pro1.png","title":"iStudiez Pro 1.4 – Student planner with iOS syncing","content":"iStudiez Pro is a student planner with iOS syncing.   A student’s life is a dizzying mix of activity and just plain craziness! Take charge of your schedule and put iStudiez Pro to work for you! Take advantage of iStudiez Pro easy navigation and never miss another course, lecture and lab, track tasks and deadlines, […]"},{"link":"https://nmac.to/blog/file-optimizer-2-01/","image":"https://nmac.to/wp-content/uploads/2016/03/File-optimizer.png","title":"File Optimizer 2.01 – An Advanced File Optimizer App","content":"File Optimizer – An Advanced File Optimizer Featuring a Lossless (no quality loss) File Size Reduction   Very Easy to Use, Just Drag and Drop.   File Optimizer is a reliable and useful piece of software designed to provide you with a simple means of re-compressing and optimizing files of various types, so you can […]"},{"link":"https://nmac.to/blog/cloudmagic-email-7-9-6/","image":"https://nmac.to/wp-content/uploads/2016/01/CloudMagic.png","title":"CloudMagic Email 7.9.6 – One app for all of your email accounts","content":"CloudMagic is the perfect app to handle your email accounts.   Instant push notifications for ALL types of email accounts: Gmail, Exchange, Yahoo, Outlook, iCloud, Google Apps, Office 365, IMAP – you name it! Supports all versions of Exchange: ActiveSync (EAS), EWS and IMAP. Handoff: Effortlessly hand off what you’re doing on iPhone, iPad or […]"},{"link":"https://nmac.to/blog/moxile-3-0-0/","image":"https://nmac.to/wp-content/uploads/2016/02/Moxile.png","title":"Moxile 3.0.0 – Productive markdown editor app","content":"Moxile, the missing Markdown editor designed for productivity. It comes with **Live Preview**. It offers full support for regular Markdown Syntax as well as Github flavored markdown extension.   syntax highlight auto save powerful actions featured picture inserter full github flavored markdown extension support light and dark theme built-in, support customize HTML and PDF export […]"},{"link":"https://nmac.to/blog/bear-simulator-1-0/","image":"https://nmac.to/wp-content/uploads/2016/03/Bear-Simulator.png","title":"Bear Simulator 1.0 – A game where you live life through the eyes of a bear","content":"Bear Simulator is a game where you live life through the eyes of a bear. Eat things, go on an adventure and discover things about your forest home.   Explore 7 different regions from the regular forest, to the mountain top or maybe take a long walk on the beach. But don’t go to the […]"},{"link":"https://nmac.to/blog/snail-bob-2-1-0/","image":"https://nmac.to/wp-content/uploads/2016/03/Snail.Bob_.2.png","title":"Snail Bob 2 1.0 – Help Snail Bob avoid the dangers that lie on his path","content":"Bob is a snail who needs your help to traverse dangerous obstacles and avoid bug baddies. Bob will simply crawl onwards regardless of the situation, and your job is to press buttons, activate machines and fill deadly gaps to keep this snail trailing.   Snail Bob 2 is the perfect game for parents to play […]"},{"link":"https://nmac.to/blog/writeroom-3-2-1/","image":"https://nmac.to/wp-content/uploads/2016/03/WriteRoom.png","title":"WriteRoom 3.2.1 – Fullscreen distraction-free writing environment","content":"WriteRoom is for Mac users who enjoy the simpllicity of a typewriter, but live in the digital world. WriteRoom is a full-screen, distraction-free writing environment. Unlike the cluttered word processors you’re used to, WriteRoom is just about you and your text.   Version 3.2.1: Fix: Sandboxing issue with QuickCursor (App Store only) Fix: Sandboxing issue […]"},{"link":"https://nmac.to/blog/my-paper-boat-4-9-1/","image":"https://nmac.to/wp-content/uploads/2016/03/My.Paper_.Boat_.png","title":"My Paper Boat 4.9.1 – Beat the challenges of water using boats made of paper","content":"In “My Paper Boat”, the player takes over control of an eponymous paper boat and steers it through various waters. In the course of this, some challenges are waiting. It is a small game, ideal for the meantime – and thus, My Paper Boat it is a lot of fun.   Following an optional tutorial, five […]"},{"link":"https://nmac.to/blog/enforcer-police-crime-action-1-0/","image":"https://nmac.to/wp-content/uploads/2016/03/Enforcer.Police.Crime_.Action.png","title":"Enforcer: Police Crime Action 1.0 – A new breed of Police Simulator game","content":"While on duty you’ll need to remain ever vigilant and question any suspicious behaviour to protect your small American town from a rising criminal threat. Off duty you’ll need to visit friends, family and live life to its fullest. Your actions while at work and home affect your stress levels. If you spend too much […]"}]