[{"link":"https://nmac.to/blog/bevy-1-1-2/","image":"https://nmac.to/wp-content/uploads/2015/12/Bevy.png","title":"Bevy 1.1.2 – Application launcher shows you all apps in one window","content":"Bevy is a launcher that shows you all of your application icons in a single window that can be opened with a global hot key, from the menu bar or by clicking its dock icon. You just specify folders where your applications are located and Bevy creates visual groups of icons for each folder. To […]"},{"link":"https://nmac.to/blog/imapic-1-4/","image":"https://nmac.to/wp-content/uploads/2016/10/ImaPic.png","title":"ImaPic 1.4 – Crop, resize, rotate, convert, compress, and share images","content":"ImaPic is a simple menu-bar image-editing tool with minimalist UI.   Editing features include: crop and resize; orientation change; convert images to different formats; (PNG, BMP, JPG, TIFF) image compression.   Batch image resize and conversion are also available. Just drag-and-drop your images on the menu-bar icon and edit them. You can store or share […]"},{"link":"https://nmac.to/blog/ifoto-montage-2-7-1084/","image":"https://nmac.to/wp-content/uploads/2016/10/iFoto-Montage.png","title":"iFoto Montage 2.7.1084 – Easy Mosaic Photo Maker","content":"iFoto Montage is a special photomontage maker to create stunning mosaic photo with many tile-images. The advanced tiling techniques and special effects empower you to create photo collage in shape with ease. And you can also perfect the montage photo with micro-image pattern, repetition, grid and border options and other splendid features.   As a […]"},{"link":"https://nmac.to/blog/bee-2-4-3/","image":"https://nmac.to/wp-content/uploads/2015/03/Bee.png","title":"Bee 2.4.3 – Client for tracking in FogBugz, GitHub, and JIRA","content":"Bee syncs with GitHub Issues, JIRA, and FogBugz. You can also use Bee to keep track of your plain text notes.   Features: Flight Path. Flight Path lives in your menu bar and helps you by intelligently selecting the task you should be working on next. Notifications. Bee uses Notification Center to inform you of […]"},{"link":"https://nmac.to/blog/video-to-gif-pro-2-0-0/","image":"https://nmac.to/wp-content/uploads/2016/10/Video-to-GIF-Pro.png","title":"Video to GIF Pro 2.0.0 – Video to GIF creator tool","content":"Video to GIF Pro is the best video to GIF creator, It can extract clips even frame from your video files for convert to GIFs. It supports all popular video formats, such as avi, mp4, wmv, rmvb.   Key features: Convert clips into small GIF files Rotate, flip, crop, resize the video Support multiple captions […]"},{"link":"https://nmac.to/blog/istudiez-pro-1-4-1/","image":"https://nmac.to/wp-content/uploads/2016/03/iStudiez-Pro1.png","title":"iStudiez Pro 1.4.1 – Student planner with iOS syncing","content":"iStudiez Pro is a student planner with iOS syncing.   A student’s life is a dizzying mix of activity and just plain craziness! Take charge of your schedule and put iStudiez Pro to work for you! Take advantage of iStudiez Pro easy navigation and never miss another course, lecture and lab, track tasks and deadlines, […]"},{"link":"https://nmac.to/blog/ifoto-denoise-2-1/","image":"https://nmac.to/wp-content/uploads/2016/10/iFoto-Denoise.png","title":"iFoto Denoise 2.1 – Photo/Image Noise Reduction","content":"Since noisy images are inevitable, what should you do to reduce noise for cameras or iPhone? Especially when you shooting in Lowlight environment or moving stuff. iFoto Denoise is the best Noise reduction software to minimize image grain and other imperfections.   iFoto Denoise is not only a noiseware for landscapes, but also photo beautifier […]"},{"link":"https://nmac.to/blog/ifoto-converter-2-1/","image":"https://nmac.to/wp-content/uploads/2016/10/iFoto-Converter.png","title":"iFoto Converter 2.1 – Batch Conversion","content":"iFoto Converter is the ultimate photo converter for most of the formats.   The excellent batch conversion can transform one image or an entire folder of mixed format images to single file format. The advanced algorithm let you instant preview watermarks and captions added to all the photos. What’s more, when you convert RAW to […]"},{"link":"https://nmac.to/blog/world-clock-1-4-0/","image":"https://nmac.to/wp-content/uploads/2015/04/World.Clock_.png","title":"World Clock 1.4.0 – International time simplified","content":"World Clock is a simple and powerful world clock.   Features: Add cities and timezones like GMT and UTC with a few key strokes. Convert international time with a drag of a cursor. Schedule international calls and meetings and add them to your calendar. Add Interactive Widget to your Today’s View (OSX Yosemite only): quickly […]"},{"link":"https://nmac.to/blog/timing-1-7-5/","image":"https://nmac.to/wp-content/uploads/2014/09/Timing.png","title":"Timing 1.7.5 – Discover how you spend time on your Mac","content":"Timing is the best way to keep track of the time you spend with your Mac. Find out where your time goes — without ever having to start a timer again!   Timing automatically tracks which documents you are editing, which applications you use, and the domains of the websites you visit. You’ll never have […]"}]