[{"link":"https://nmac.to/blog/chaos-on-deponia/","image":"https://nmac.to/wp-content/uploads/2014/07/Chaos.on_.Deponia.png","title":"Chaos on Deponia 3.2.5 – Unique adventure game for mac","content":"With this long-expected sequel to the critically highly acclaimed and lavishly praised Deponia, the player enters round two. Chaos on Deponia turns out to be even wackier than its predecessor and instantly puts the player under its spell.   After the events on Deponia, it seems that Rufus came to his senses. He’s grown prudent, […]"},{"link":"https://nmac.to/blog/macaw-1-5/","image":"https://nmac.to/wp-content/uploads/2014/04/Macaw1.png","title":"Macaw 1.5 – The code-savvy web design tool","content":"Stop writing code. Start drawing it.   Macaw provides the same flexibility as your favorite image editor but also writes semantic HTML and remarkably succinct CSS. It’s time to expect more from a web design tool.   Fluid canvas and grid Macaw is engineered for fluid widths. Resize the canvas and your grids and elements […]"},{"link":"https://nmac.to/blog/espionage-3-6/","image":"https://nmac.to/wp-content/uploads/2014/07/Espionage.png","title":"Espionage 3.6 – Simple, state of the art encryption and plausible deniability for your data","content":"Espionage offers state-of-the-art encryption and plausible deniability for your confidential data.   Sometimes, encrypting your data isn’t enough to protect it. That’s why Espionage 3 goes beyond data encryption.   Features: Source code available for security professionals. Designed for plausible deniability. Multiple master passwords through Folder Sets. Want two versions of your email? Espionage can […]"},{"link":"https://nmac.to/blog/blink-pro-3-9-1/","image":"https://nmac.to/wp-content/uploads/2014/07/Blink.Pro_.png","title":"Blink Pro 3.9.1 – Provides IM/file transfer functionality based on SIP SIMPLE","content":"Blink Pro is a state of the art, easy to use multimedia SIP client. It is elegant, intuitive to use and feature-full.   Blink can be used on the LAN without an account or can be configured with a SIP account obtained from a SIP service provider. One click account signup is provided out of […]"},{"link":"https://nmac.to/blog/eagle-6-5-0/","image":"https://nmac.to/wp-content/uploads/2014/07/Eagle.png","title":"Eagle 6.5.0 – Schematic capture and printed circuit board design","content":"Eagle Layout Editor is a schematic capture and printed circuit board design package that runs in the X11 application environment.   Version 6.5.0: Consistency Checking: Added full consistency check of packages to avoid misleading informations used e.g., for DesignLink. The inequality of part and element attributes or the absence of part attributes in the appropriate […]"},{"link":"https://nmac.to/blog/book-palette-1-3/","image":"https://nmac.to/wp-content/uploads/2014/07/Book-Palette.png","title":"Book Palette 1.3 – Book templates for iBooks Author","content":"Book Palette makes your iPad books special.   With the new, revolutionary iBooks Author app, anyone can create and publish great multi-touch books for iPad, including you. Jumsoft swiftly offers you an enhanced experience in book creation with 35 beautiful templates for iBooks Author.   Each template included in the Book Palette app features an […]"},{"link":"https://nmac.to/blog/airfile-2-5/","image":"https://nmac.to/wp-content/uploads/2014/03/AirFile.png","title":"AirFile 2.5 – Manage and access all your clouds in one place","content":"AirFile for iOS now comes to Mac! It lets you manage and access all your clouds in one place. You don’t need to use each application for each cloud. It provides you a unified access to all your clouds. Are you looking for an app that allows for accessing multiple Dropbox, multiple Box, multiple Google […]"},{"link":"https://nmac.to/blog/set-for-ms-office-1-4/","image":"https://nmac.to/wp-content/uploads/2014/07/Set-for-MS-Office.png","title":"Set for MS Office 1.4 – Word, PowerPoint, and Excel designs bundle","content":"Set for MS Office is the ultimate bundle of all designs for Word, PowerPoint, and Excel for Mac offered by Jumsoft. It gives numerous options for producing professional and exciting content ranging from striking themes for your slideshows to smart multi-layout templates for brochures and catalogs. Set for MS Office will make your work more […]"},{"link":"https://nmac.to/blog/powershot-1-5/","image":"https://nmac.to/wp-content/uploads/2014/07/powershot.png","title":"Powershot 1.5 – Essential screen capture app","content":"Powershot will be an essential screen capture app in your Mac.   1. You can capture anything with hotkey (CMD+CTRL+x). 2. Add markups and annotations to the screen shot. 3. Images are save into Mac clipboard, or into files. 4. Support multiple displays.   Version 1.5: New stealth mode which hides the menu bar icon. […]"},{"link":"https://nmac.to/blog/mashup-2-5-1/","image":"https://nmac.to/wp-content/uploads/2014/04/Mashup.png","title":"Mashup 2.5.1 – Professional-quality remixing","content":"Mashup lets you create your own mashups and remixes. Experiment with your favorite music, and discover combinations that sound perfect together. Developed by the award-winning Mixed In Key team with 100,000+ fans on Facebook. With Mashup, you can mix as many songs as you want from your music collection to make a perfect mashup.   […]"}]