[{"link":"https://nmac.to/blog/duplicates-exp/","image":"https://nmac.to/wp-content/uploads/2016/03/Duplicates-Expert.png","title":"Duplicate File Remover PRO 5.8.1 – Professional duplicate finder, cleaner. and reporting tool","content":"Duplicate File Remover Pro (was Duplicates Expert) is a new generation class of duplicates managers, scanning for similar folders and supporting all external drives. The application scans for duplicates in multiple folders at the same time and presents animated duplicates chart while scanning. Once duplicate files and folders are identified, Duplicates Expert provides cleanup recommendations. […]"},{"link":"https://nmac.to/blog/impresso-pro/","image":"https://nmac.to/wp-content/uploads/2017/09/Impresso.Pro1_.png","title":"Impresso Pro 1.8.14 – Use layers to combine paint styles and depth","content":"Lucky you, 21st century software wielding seer and lover of beauty—you have Impresso Pro. With the same enduring attention to detail, light, color, and texure, Impresso transforms your photos into multi-textured, stroke-filled Impressionist masterpieces. And keen eyes will love how Impresso maintains the balance of your piece! The result—captivating, print-worthy paintings brimming with passion, life, […]"},{"link":"https://nmac.to/blog/oxygen-not-included/","image":"https://nmac.to/wp-content/uploads/2019/03/Oxygen-Not-Included.png","title":"Oxygen Not Included 419840 – A space-colony simulation game","content":"In the space-colony simulation game Oxygen Not Included you’ll find that scarcities of oxygen, warmth and sustenance are constant threats to your colony’s survival. Guide colonists through the perils of subterranean asteroid living and watch as their population grows until they’re not simply surviving, but thriving…    Just make sure you don’t forget to breathe. […]"},{"link":"https://nmac.to/blog/strafe/","image":"https://nmac.to/wp-content/uploads/2017/05/STRAFE.png","title":"STRAFE: Gold Edition 1.4 – Action-packed first-person shooter game","content":"STRAFE is a roguelike first-person shooter pushing the limits of computer-generated photorealism and hardcore sci-fi action into unimaginable territory.   With virtually no load times and infinite replayability, just choose your gun and be instantly blown away by: FACE MELTING SPEED! The blazing fast action will hit you like the blast wave of a 50 […]"},{"link":"https://nmac.to/blog/hand-of-fate/","image":"https://nmac.to/wp-content/uploads/2015/02/Hand.of_.Fate_.2.png","title":"Hand of Fate 2 1.9.8 – Deckbuilding comes to life in Hand of Fate!","content":"Hand of Fate 2 is a dungeon crawler set in a world of dark fantasy. Master a living boardgame where every stage of the adventure is drawn from a deck of legendary encounters chosen by you! Choose wisely – your opponent, the enigmatic Dealer, will pull no punches as he shapes you into the instrument […]"},{"link":"https://nmac.to/blog/viscosity/","image":"https://nmac.to/wp-content/uploads/2017/10/Viscosity1.png","title":"Viscosity 1.8.6 – Graphical user interface for OpenVPN","content":"Viscosity is an OpenVPN client for Mac, providing a rich Cocoa user interface for creating, editing, and controlling VPN connections. Viscosity provides a complete OpenVPN solution for OS X 10.5 Leopard, and does not require any additional downloads or software.   With Viscosity and OpenVPN you can securely connect to your home or company network […]"},{"link":"https://nmac.to/blog/beatunes/","image":"https://nmac.to/wp-content/uploads/2017/08/beaTunes5.png","title":"beaTunes 5.2.10 – Organize your music collection","content":"beaTunes is a full-featured music player and organizational tool for music collections.   How well organized is your music Library? Are your artists always spelled the same way? Any R.E.M. vs REM? beaTunes can easily fix this and other problems with its unique inspection feature (license required for applying one-click solutions). Could your last mix […]"},{"link":"https://nmac.to/blog/doxillion-plus/","image":"https://nmac.to/wp-content/uploads/2020/07/Doxillion-Plus.png","title":"Doxillion Plus 4.14 – Document Converter","content":"Doxillion Plus Document Converter is a way to convert your files into multiple other file formats. Whether you are trying to convert .wps to word, a .docx file into a .doc, or simply converting a pdf file, all of this can be managed quickly and easily in your Doxillion Plus Document Converter.   With an […]"},{"link":"https://nmac.to/blog/viso/","image":"https://nmac.to/wp-content/uploads/2020/07/Viso.png","title":"Viso 4.1.4 – Beautiful minimal image viewer for MacOS","content":"Viso is a beautiful minimal image viewer for MacOS. Features a non intrusive UI that allows you to get the most viewing experience out of your images.   Version 4.1.4: Release notes were unavailable when this listing was updated.   Intel, 64-bit processor macOS 10.15 or later    "},{"link":"https://nmac.to/blog/bloons-td/","image":"https://nmac.to/wp-content/uploads/2017/03/Bloons-TD-6.png","title":"Bloons TD 6 18.1.2747 – Five-star tower defense with unrivaled depth and replayability","content":"The Bloons are back and better than ever! Get ready for a massive 3D tower defense game designed to give you hours and hours of the best strategy gaming available.   Craft your perfect defense from a combination of awesome monkey towers, upgrades, Heroes, and activated abilities, then pop every last Bloon that comes your […]"}]