[{"link":"https://nmac.to/blog/algotica-iteration-1-1-0-5/","image":"https://nmac.to/wp-content/uploads/2017/04/Algotica-Iteration-1.png","title":"Algotica – Iteration 1 1.0.5 – An educational adventure-puzzle game","content":"Algotica is an educational adventure-puzzle game about programming, along with a story that breaks the fourth wall. If you wanted to start learning programming but it seems too difficult to understand, you don’t have enough time, or you’re just not sure that you need it – this game is a great place to start.   […]"},{"link":"https://nmac.to/blog/tab-launcher-2-9-5/","image":"https://nmac.to/wp-content/uploads/2013/12/Tab-Launcher.png","title":"Tab Launcher 2.9.5 – Clean up and organize the Dock","content":"The idea of Tab Launcher is not to replace the system’s dock, but to help keep it clean, with only the applications that are currently running.   By removing all the application from the dock and organizing them on tabs, you can quickly find and run any application you want.   Apart from that, you […]"},{"link":"https://nmac.to/blog/remixvideo-1-1-4/","image":"https://nmac.to/wp-content/uploads/2017/02/Remixvideo.png","title":"Remixvideo 1.1.4 – Enhance your live shows with Remixvideo, the intuitive video sampler","content":"Remixvideo is the weapon of choice for creative video mixing, with a slick grid interface that makes DJs/producers instantly feel at home.   It offers two ways to enhance music performances with visuals: linking audio samples to video pads in standalone mode, or playing it as a video plug-in within your favorite music software. Running […]"},{"link":"https://nmac.to/blog/aerofly-rc-7-4-7/","image":"https://nmac.to/wp-content/uploads/2016/01/aerofly-RC-7.png","title":"aerofly RC 7.4.7 – R/C flight simulator","content":"Learn to fly radio controlled (R/C) models with aerofly RC 7. When it comes to learning and improving R/C flying skills, aerofly RC 7 is the number one choice for R/C pilots. Our state of the art physics simulation gives you a stunning level of realism. Together with our superb model details and awesome scenery […]"},{"link":"https://nmac.to/blog/aerofly-fs-1-3-3/","image":"https://nmac.to/wp-content/uploads/2017/04/aerofly-FS.png","title":"aerofly FS 1.3.3 – Enter the world of flying in a quality never seen before","content":"aerofly FS lets you enter the world of flying in a quality never seen before. aerofly FS sets a high value on realistic flight physics, highly detailed aircraft and terrain and smooth frame rates. At the same time, aerofly FS features an intuitive user interface and requires virtually no training time.   The highly detailed […]"},{"link":"https://nmac.to/blog/dr-fone-for-ios-8-2-1/","image":"https://nmac.to/wp-content/uploads/2017/04/Dr.Fone-for-iOS8.png","title":"Dr.Fone for iOS 8.2.1 – iPhone Data Recovery Software","content":"Dr.Fone for iOS – World’s 1st Mac iPhone and iPad data recovery software.   Recover iPhone data on Mac with three ways. Able to recover contacts, SMS, notes, call logs, photos, video, etc. Compatible with latest iPhone and Mac OS.   Other Scenarios Data lost after factory restore Data lost due to iOS update Device […]"},{"link":"https://nmac.to/blog/mr-shifty-1-0/","image":"https://nmac.to/wp-content/uploads/2017/04/Mr.Shifty.png","title":"Mr. Shifty 1.0 – A new kind of action & adventure game","content":"Shift through bullets, and master lightning-fast takedowns in an all new kind of action game from tinyBuild and Team Shifty! Mr. Shifty follows a teleportation-fueled heist to break into the world’s most secure facility. Shift through walls, through bullets, cover huge distances and be everywhere at once One shot kills. Survive on skills. Use distraction, […]"},{"link":"https://nmac.to/blog/flying-logic-pro-3-0-7/","image":"https://nmac.to/wp-content/uploads/2016/07/Flying-Logic-Pro.png","title":"Flying Logic Pro 3.0.7 – A spreadsheet-style reasoning tool","content":"Flying Logic Pro is a highly visual, easy-to-use software application that does for reasoning what spreadsheets do for numbers. Just as you would not do detailed financial projections in your head, you need Flying Logic for all nontrivial planning and reasoning endeavors.   Features The Flying Logic Advantage – Project management software won’t help you […]"},{"link":"https://nmac.to/blog/desk-3-1/","image":"https://nmac.to/wp-content/uploads/2015/02/Desk.png","title":"Desk 3.1 – Writing, Blogging, and Notes for WordPress","content":"Desk is a premium writing experience for all types of writers.   Whether you’re a casual enthusiast, the weekend writer, blogger, or digital publishing professional, you’ll find Desk to be a much-needed breath of fresh air.   Designed to marry both function and form, it is the desktop publishing client that you’ve always wanted: Simple, […]"},{"link":"https://nmac.to/blog/viscera-cleanup-detail-1-0/","image":"https://nmac.to/wp-content/uploads/2017/04/Viscera.Cleanup.Detail.png","title":"Viscera Cleanup Detail 1.0 – First-Person Bloody Simulation Game","content":"Disaster! An alien invasion and subsequent infestation have decimated this facility. Many lives were lost, the facility was ruined and the aliens were unstoppable. All hope was lost until one survivor found the courage to fight back and put the aliens in their place! It was a long and horrific battle as the survivor dueled […]"}]