[{"link":"https://nmac.to/blog/shellcraft-1-0-7/","image":"https://nmac.to/wp-content/uploads/2016/12/ShellCraft.png","title":"ShellCraft 1.0.7 – Modern and Powerful SSH Client","content":"A modern and powerful SSH/Telnet client with entire fresh design and excellent experience.   With convenient and powerful user interface, ShellCraft significantly improve your efficiency. ShellCraft implements the standard SSH/Telnet protocol, it can simply connect to various servers. The session management function make you managing sessions easily, connecting to session is very convenient from anywhere. […]"},{"link":"https://nmac.to/blog/orion-markup-3-0/","image":"https://nmac.to/wp-content/uploads/2016/11/Orion-Markup.png","title":"Orion Markup 3.0 – Add image notes and annotations","content":"Orion Markup lets you express your thoughts and comments though images. It makes it easy to add notes, zoom-in bubbles, outlines boxes, lines, and arrows to images and screenshots.   Supports a full suite of annotation objects, including: zoom bubbles: creates magnified versions of selected image regions multiple sized outline boxes and text labels hundreds […]"},{"link":"https://nmac.to/blog/corporate-templates-business-stationery-3-1-2/","image":"https://nmac.to/wp-content/uploads/2016/12/Corporate-Templates3.png","title":"Corporate Templates – Business Stationery 3.1.2 – Collection of professional Pages templates","content":"Develop your professional image and brand identity, save thousands on creative agency fees! Explore a broad range of professionally-designed customizable business stationery templates, easily adapt them to your professional needs!   Corporate Templates – Business Stationery offers templates in convenient packs sorted by style and appearance. Every style pack is a comprehensive collection of stationery […]"},{"link":"https://nmac.to/blog/desktopr-1-8/","image":"https://nmac.to/wp-content/uploads/2016/04/Desktopr.png","title":"Desktopr 1.8 – Create dynamic desktops","content":"Desktopr is simple way to extend your desktop with any content you can even imagine.   With Desktopr you can set any website, quartz composition, flash movie or other content as your desktop background.   Imagine your Facebook, Gmail, Twitter or favorite blog or magazine as a background of your desktop. You can switch currently […]"},{"link":"https://nmac.to/blog/photo-album-templates-for-photoshop-2-0/","image":"https://nmac.to/wp-content/uploads/2016/12/Photo-Album-Templates.png","title":"Photo Album Templates for Photoshop 2.0 – Scrapbook templates for PS","content":"Photo Album Templates for Photoshop (was Adobe Albums for Adobe Photoshop) offers quirky and fun scrapbook templates for Adobe Photoshop–a great way to preserve and share your photos or give someone a gorgeous gift. The templates provide a variety of ways to display your photos and show off your creativity with stylish and modern embellishments. […]"},{"link":"https://nmac.to/blog/the-little-acre-2-0-0-1/","image":"https://nmac.to/wp-content/uploads/2016/12/The-Little-Acre.png","title":"The Little Acre 2.0.0.1 – Singleplayer Adventure Game","content":"The Little Acre follows the story of Aidan and his daughter, Lily, set in 1950’s Ireland. After discovering clues as to the whereabouts of his missing father, Aidan begins investigating until he inadvertently finds himself transported to a strange new world. Ever the hero, Lily sets off after him, encountering her own perils along the […]"},{"link":"https://nmac.to/blog/stellar-mail-converter-2-0/","image":"https://nmac.to/wp-content/uploads/2016/12/Stellar-Mail-Converter.png","title":"Stellar Mail Converter 2.0 – Easily convert mail to different client formats","content":"Stellar Mail Converter can convert a variety of email clients, such as Apple Mail, Thunderbird, Postbox, and Outlook for Mac to the other two trending and popularly used email clients: Apple Mail or Outlook for Mac 2011.   The software is very user-friendly in its approach and does the conversion within moments. The only thing […]"},{"link":"https://nmac.to/blog/msecure-3-5-6/","image":"https://nmac.to/wp-content/uploads/2014/05/mSecure.png","title":"mSecure 3.5.6 – Safely store sensitive information","content":"mSecure safely stores sensitive and important information like web logins and passwords, credit card numbers, frequent flyer and social security numbers, and any other data you want quick, easy access. mSecure uses an industry-proven data encryption method so your information is safe guarded should your computer be lost or stolen.   mSecure comes with 17 […]"},{"link":"https://nmac.to/blog/digital-performer-9-1-2/","image":"https://nmac.to/wp-content/uploads/2016/12/Digital-Performer.png","title":"Digital Performer 9.1.2 – MIDI and audio sequencer/recorder","content":"Digital Performer is a versatile and powerful DAW specially made to turn your Mac into a recording studio.   Helps you play, record, edit, mix, process and mix audio with ease Thanks to Digital Performer you can record, mix, edit, process and master your recordings with the help of virtual instruments, loops, MIDI tracks and […]"},{"link":"https://nmac.to/blog/cleanusbdrive-1-2-3/","image":"https://nmac.to/wp-content/uploads/2016/09/CleanUSBDrive.png","title":"CleanUSBDrive 1.2.3 – The fastest DS_Store remover for external drives","content":"CleanUSBDrive is an utility to eject any external drive removing those files that you don’t want to see in your smartTV multimedia-browser, for example. It cleans all drives from system junk before ejecting, with a very high performance.   Features Simple and fast Very minimalist design Status bar App Remove .DS_Store, ._AppleDouble, Thumbs.db, .Trashes, .Spotlight, […]"}]