[{"link":"https://nmac.to/blog/watermark-sense/","image":"https://nmac.to/wp-content/uploads/2016/10/Watermark_Sense_1.png","title":"Watermark Sense 1.4.2 – Flexible batch image watermarking utility","content":"Watermark Sense is a flexible batch image watermarking utility. It enables you to achieve great creative results in batch mode, saving a lot of time on repetitive tasks. With Watermark Sense, you can easily protect your intellectual property, promote your brand, or simply add some useful information to many images at a time.   Watermark […]"},{"link":"https://nmac.to/blog/idol-manager/","image":"https://nmac.to/wp-content/uploads/2021/09/Idol.Manager.png","title":"Idol Manager 1.0.5 – A Business Simulation & Management Game","content":"You take on the role of manager at a small (but growing!) talent agency. As you cultivate and train the newest generation of young pop stars, you’ll have to decide who to hire and who to fire, who gets promoted when things go well and who gets reprimanded when things get sour. The personal lives […]"},{"link":"https://nmac.to/blog/list-my-apps/","image":"https://nmac.to/wp-content/uploads/2021/09/List-My-Apps.png","title":"List My Apps 1.9.0 – Lists all purchased apps from AppStore","content":"This app lists all purchased apps from AppStore that are installed on your computer.   Features: Show all applications from the folder «/Applications» (for the current operating system also /System/Applications) Show all purchased apps from the Apple AppStore that are installed on your computer Show the count of applications in the Dock Window with details […]"},{"link":"https://nmac.to/blog/timeless/","image":"https://nmac.to/wp-content/uploads/2016/03/Timeless.png","title":"Timeless 1.93 – Gorgeous alarm clock and reminder app","content":"Timeless is the best and most gorgeous alarm clock and reminder app for your Mac. With its beautiful and easy to use interface, Timeless is a pleasure to use and will integrate seamlessly into your workflow, from morning till night.   Key Features: Ability to set unlimited unique alarms Ability to add custom titles to […]"},{"link":"https://nmac.to/blog/calca/","image":"https://nmac.to/wp-content/uploads/2015/05/Calca1.png","title":"Calca 1.5.3 – Symbolic calculator with Markdown editor","content":"Calca is a powerful symbolic calculator that updates as you type, giving you instant answers. It solves equations and simplifies complex expressions. It is also a rich Markdown text editor so that you can explain your ideas alongside your calculations.   Calca is perfect for professionals and students – anyone who works with numbers and […]"},{"link":"https://nmac.to/blog/iconkit/","image":"https://nmac.to/wp-content/uploads/2018/12/IconKit_10.png","title":"IconKit 10.1.2 – Icon Resizer for App Development","content":"IconKit – So you want to include all of your app icons at the correct sizes without having to resize every single one manually? Are you tired of confusing apps?   IconKit brings you a great new experience of icon generator for developers and designers, just drag your image into IconKit to start.   Features: […]"},{"link":"https://nmac.to/blog/pro-disk-cleaner/","image":"https://nmac.to/wp-content/uploads/2018/01/Pro-Disk-Cleaner.png","title":"Pro Disk Cleaner 1.8 – Extensive removal of unneeded files","content":"Let Pro Disk Cleaner free up your hard drive space! Disk Cleaner does all the work for you! We’ve optimised the most efficient locations to quickly scan and remove all the junk taking up your valuable disk space. Stop wasting disk space on unneeded files leftover from uninstalled apps, temporary internet files, old mail attachments, […]"},{"link":"https://nmac.to/blog/cisdem-duplicatefinder/","image":"https://nmac.to/wp-content/uploads/2017/05/Cisdem-DuplicateFinder.png","title":"Cisdem DuplicateFinder 5.10.0 – Find and remove duplicate files","content":"Cisdem DuplicateFinder offers a accurate way to find and delete all duplicate files. With this tool you can scan both computer drives and folders located on external devices, as well as Apple applications like iPhoto, iTunes, and Mail. Providing smart scanning algorithms, the program can find and remove duplicate files in batches, save hard drive […]"},{"link":"https://nmac.to/blog/dotpass/","image":"https://nmac.to/wp-content/uploads/2021/09/DotPass_1.png","title":"DotPass 1.5.1 – Secure passwords with patterns","content":"Use one pattern to get different passwords for all your accounts   DotPass is an app for generating and retrieving passwords. You enter a graphical pattern in a dot grid and a plain text seed word (like “facebook”, “work email” or whatever makes sense to you), and the app then generates a password based on […]"},{"link":"https://nmac.to/blog/wordmark/","image":"https://nmac.to/wp-content/uploads/2021/08/WordMark.png","title":"WordMark 49 – Write markdown the easy way","content":"WordMark is a lightweight markdown editor. It renders markdown inline so that you can focus on your content better.   You can quickly write articles/posts and publish to multiple online platforms based on your needs.   Version 49: Fix a bug causing italic text cannot be rendered inline when there is a bold text behind. […]"}]