[{"link":"https://nmac.to/blog/mkvtools/","image":"https://nmac.to/wp-content/uploads/2017/01/MKVtools3.png","title":"MKVtools 3.7.1 – Manipulate .ogm and .mkv video files","content":"MKVtools is a collection of tools used to manipulate video files. It’s primary purpose is to convert mkv files into more user friendly formats for playback on a variety of hardware. MKVtools is trialware – only $4.99 for full functionality, though it will function unregistered, with some minor limitations.   Features: Convert videos to either […]"},{"link":"https://nmac.to/blog/canary-mail/","image":"https://nmac.to/wp-content/uploads/2017/07/Canary-Mail.png","title":"Canary Mail 2.21 – Easy, elegant e-mail","content":"Canary is an exciting new email client for Mac that offers a full set of powerful features with one key difference – your emails are not stored on a 3rd-party server. Every facet of Canary has been designed in accordance with our core philosophy of ensuring complete user privacy and offering reliable and snappy performance. […]"},{"link":"https://nmac.to/blog/aiseesoft-mac-video-downloader/","image":"https://nmac.to/wp-content/uploads/2014/12/Aiseesoft.Mac_.Video_.Downloader.png","title":"Aiseesoft Mac Video Downloader 3.3.8 – Download videos from online video sites","content":"Aiseesoft Mac Video Downloader lets you download videos from online video sites to Mac with ease and convert videos to popular video formats supported by iPhone, iPad, iPod, Samsung Galaxy S4 and other popular personal devices.   Support downloading online videos to Mac Download videos from other video sharing websites like Vimeo, Metacafe, etc. Convert […]"},{"link":"https://nmac.to/blog/elimisoft-pdf-creator/","image":"https://nmac.to/wp-content/uploads/2019/03/Elimisoft-PDF-Creator.png","title":"Elimisoft PDF Creator 1.0.0 – Create PDF from Word, PowerPoint, EPUB, Image, etc","content":"Great App to convert Word(.docx), PowerPoint(.pptx), EPUB, RTFD, HTML, JPG, PNG, GIF, Plain Text to PDF files, keeping tables and formatting!   How to convert Word(.docx) to PDF files, and keep its formatting? Unlike other PDF Creator Apps, Elimisoft PDF Creator is a great way to help you create PDF from Word(.docx), PowerPoint(.pptx), Plain Text, […]"},{"link":"https://nmac.to/blog/xmind-zen/","image":"https://nmac.to/wp-content/uploads/2019/03/XMind-ZEN.png","title":"XMind ZEN 9.1.3 – Mind mapping and project management app","content":"XMind ZEN is a mind-mapping tool based off of the same open-source project as XMind Pro. It supports the same map structures and 100% compatible with XMind 8. It has new themes, some with more muted tones for a more modern look and feel. Its distinct feature is the “ZEN Mode” that will automatically hide […]"},{"link":"https://nmac.to/blog/steel-rats/","image":"https://nmac.to/wp-content/uploads/2019/03/Steel-Rats.png","title":"Steel Rats 1.0 – Arcade Action Racing Game","content":"Become one of the Steel Rats, a biker gang sworn to protect their city against an invading army of alien robots – Junkbots. Wreck and ride through hordes of enemies, switching between four unique characters as you wreak havoc with the ultimate killing machine; your flame spewing, saw bladed, motorcycle.   Ride in style through […]"},{"link":"https://nmac.to/blog/wing-ide-professional/","image":"https://nmac.to/wp-content/uploads/2016/12/WingIDE.Professional.png","title":"Wing IDE Professional 6.1.5 – An intuitive Integrated Development Environment","content":"Wing IDE Professional provides powerful debugging, editing, code intelligence, and search capabilities that reduce development and debugging time, cut down on coding errors, and make it easier to understand and navigate Python code.   Unlike many competing technologies, Wing IDE Professional and Python let you concentrate on building your application-specific functionality.   Version 6.1.5: Features […]"},{"link":"https://nmac.to/blog/cb-antivirus-and-internet-security/","image":"https://nmac.to/wp-content/uploads/2018/12/CyberByte-Antivirus-and-Internet-Security.png","title":"CyberByte Antivirus and Internet Security 3.0.5 – Anti-virus tool","content":"CyberByte Antivirus is the absolute protection for your Mac against malware available on the AppStore.   We, at CyberByte, besides our security consultancy expertise, we study the malware evolution, and we had observed that there had been a 120% increase in Mac malware.    This is the reason why we had developed the CyberByte Antivirus. […]"},{"link":"https://nmac.to/blog/nb-m4v-converter-plus/","image":"https://nmac.to/wp-content/uploads/2016/06/NoteBurner.M4V.Converter.png","title":"NoteBurner M4V Converter Plus 4.3.8 – Remove DRM from M4V videos","content":"NoteBurner M4V Converter Plus helps you remove DRM from purchased and rented M4V movies from the iTunes Store and convert them to unprotected video formats including MP4, AVI, MPG, MPEG-1, MPEG-2, 3GP, 3G2, FLV, and SWF.   The DRM M4V Converter has various built-in output profiles for iPad, iPhone, iPod, Apple TV, Samsung, HTC, Sony […]"},{"link":"https://nmac.to/blog/egypt-old-kingdom/","image":"https://nmac.to/wp-content/uploads/2019/03/Egypt-Old-Kingdom.png","title":"Egypt: Old Kingdom 2.0.2 – Single player Historical Turn-Based Game","content":"You are one of the multitudes of incarnations of the great Horus, and side by side with the pharaohs, you are fighting against the mighty Seth, who unleashes numerous disasters upon the lands of Ancient Egypt. Win wars and overcome crises, discover new technologies, worship your gods and conquer neighboring tribes! Are you wise enough […]"}]