[{"link":"https://nmac.to/blog/adobe-photoshop-cs6/","image":"https://nmac.to/wp-content/uploads/2013/12/13553.png","title":"Adobe Photoshop CS6 v13.0.2 – Professional image editor","content":"    Adobe Photoshop CS6 is a power image and photo editor. Easily make complex selections. Remove any image element and see the space fill in almost magically. Paint realistically. Create stunning HDR images, remove noise, add grain, and create vignettes with state-of-the-art photography tools. Experience fast performance on 64-bit systems   Intel, 64-bit processor […]"},{"link":"https://nmac.to/blog/winonx-1-5/","image":"https://nmac.to/wp-content/uploads/2013/12/Icon.175x175-755.png","title":"WinOnX 1.5 – Run Windows applications on OS X","content":"WinOnX lets you run your Windows applications on OS X without the need of buying a Windows license. Well, you even do not need to install Windows.   Just download WinOnX and you are ready to go within 2 minutes.   No need to install Windows or a virtual machine.   Please note: WinOnX should only […]"},{"link":"https://nmac.to/blog/jelly-defense/","image":"https://nmac.to/wp-content/uploads/2013/02/Jelly-Defense.png","title":"Jelly Defense 1.0.3 – Tower defense game with colorful landscapes","content":"Jelly Defense is finally something worth defending!   Join the Jelly forces now and lead them to glory in this uneven and fierce fight against the invaders! Use your tactical skills and wisdom to tip the scales of victory in your favor in order to save the Diploglobe and the Jelly nation from the aggressors! […]"},{"link":"https://nmac.to/blog/idocument-1-6-38/","image":"https://nmac.to/wp-content/uploads/2013/12/334431.png","title":"iDocument v1.6.38 – Organize, tag and search your documents","content":"iDocument makes documents managing as easy as creating them. It helps you to organize and manage documents on Mac; it puts all of your documents in order in its library. With Tag, search, smart folder and flag features, iDocument not only gives you full range of the managing function for you to manage documents on Mac, […]"},{"link":"https://nmac.to/blog/disklens-1-0-4/","image":"https://nmac.to/wp-content/uploads/2013/12/47028.png","title":"Disklens v1.0.4 – Quickly and easily find anything on your Mac","content":"Disklens is the Spotlight alternative, lets you quickly and easily find about anything on your Mac. Disklens performs an extensive search, delivering thousands of search results in just a matter of seconds. Drill down into search categories, if you’re looking for items of a specific kind. Cursor Left will bring you back. Create copies (or aliases, when holding […]"},{"link":"https://nmac.to/blog/css3-buttonbuilder-1-0/","image":"https://nmac.to/wp-content/uploads/2013/12/CSS3_ButtonBuilder.175x175-75.png","title":"CSS3 ButtonBuilder v1.0 – Design Your Own CSS3 Button","content":"CSS3 Buttonbuilder lets you visually design sophisticated cross-browser CSS3 imageless buttons.By simply adjusting the sliders for each property you have full control over the design and once you are happy with the result you can output cross-browser CSS3 code ready to use in your CSS3 style sheet. CSS3 ButtonBuilder also lets you save all your […]"},{"link":"https://nmac.to/blog/clarify-1-2-0/","image":"https://nmac.to/wp-content/uploads/2013/12/Clarify.175x175-75.png","title":"Clarify v1.2.0 – Transform screenshots into documents","content":"Clarify provides a hassle-free way of turning screenshots into beautiful documents in five minutes or less. Many screen capture applications let you work with one picture at a time. But combining multiple screenshots into clear documents is a pain. It’s such a pain that most of us don’t take the time to do it, even though […]"},{"link":"https://nmac.to/blog/apptivate-2-0-2/","image":"https://nmac.to/wp-content/uploads/2013/12/mzi.ifziacfu.175x175-75.png","title":"Apptivate v2.0.2 – Assign system wide shortcuts to applications and more","content":"Apptivate… There are a lot of applications that would be better if you could assign a system wide hotkey for them. This is where Apptivate comes into the picture. Apptivate lets you assign a system wide shortcut for any application, script file or other file on your system for easy access any time. Simply launch Apptivate, […]"},{"link":"https://nmac.to/blog/pages-4-3/","image":"https://nmac.to/wp-content/uploads/2013/12/Pages.175x175-75.png","title":"Pages v4.3 – Update for iWork ’09 version of Pages","content":"Apple Pages is a word processor with incredible style. Pages showcases amazing typography and a freeform graphics canvas with 40 easy to use, Apple-designed templates. From letters to invitations, from reports to newsletters, you’ll be building full documents in minutes. Quickly add your favorite photos, movies and music with the built-in media browser. And, of […]"},{"link":"https://nmac.to/blog/numbers-2-3/","image":"https://nmac.to/wp-content/uploads/2013/12/Numbers.175x175-75.png","title":"Numbers v2.3 – Update for iWork ’09 version of Numbers","content":"Apple Numbers is the spreadsheet you’ve been waiting for – and already know how to use. Innovative, powerful, and intuitive, Numbers ’08 lets you do everything from setting up your family budget to completing a lab report to creating detailed financial documents. WHAT’S NEW Version 2.3: Adds support for Keynote iOS 1.7 apps. REQUIREMENTS Intel/PPC […]"}]