[{"link":"https://nmac.to/blog/beautiful-fish-screensaver-1-4/","image":"https://nmac.to/wp-content/uploads/2014/04/Beautiful.Fish_.Screensaver.png","title":"Beautiful Fish Screensaver 1.4 – Fish screensaver with realistic effects","content":"First, it must be noted that Beautiful Fish Screensaver is NOT a real screensaver, it is actually an application. HOWEVER, its realistic effects and vivid sounds will bring you a different experience. You will feel that your mac screen showing real live fishes swimming in the water. There are 8 kinds of fish and 3 […]"},{"link":"https://nmac.to/blog/napkin-1-1-4/","image":"https://nmac.to/wp-content/uploads/2014/04/Napkin.png","title":"Napkin 1.1.4 – Create visual notes and diagrams quickly and easily","content":"Napkin is the ultimate tool for concise visual communication. Painlessly create visual notes and diagrams and share the results quickly.   Use Napkin when you need to create an image that makes your point crystal clear. Designers, product managers, software developers, artists, photographers, bloggers, journalists, and anyone who needs to annotate images will find Napkin […]"},{"link":"https://nmac.to/blog/music-player-2-2/","image":"https://nmac.to/wp-content/uploads/2014/04/Music-Player.png","title":"Music Player 2.2 – Enjoy listening to millions of popular songs","content":"Music Player is a must have music player to enjoy listening to millions of popular songs.   Awesome features: Beautiful design. Fast access to music of your friends, subscriptions, favored public pages and communities. Music news. All songs from one post could be added in one click to your music. Hot keys: Fn-F7 — previous […]"},{"link":"https://nmac.to/blog/instacast-1-1/","image":"https://nmac.to/wp-content/uploads/2014/04/Instacast.png","title":"Instacast 1.1 – Podcasts for the next generation","content":"Instacast brings you podcasts like no other. The popular iOS app is moving onto the Desktop! With managed podcast subscriptions, advanced playback controls, the ability to follow show notes, and WiFi download capability to save on your mobile broadband allowance, Instacast is the perfect solution for the mobile viewer.   Version 1.1: New Features Added […]"},{"link":"https://nmac.to/blog/effect-stack-1-0-2/","image":"https://nmac.to/wp-content/uploads/2014/04/Effect.Stack_.png","title":"Effect Stack 1.0.2 – Non-destructive image editor","content":"Effect Stack offers a variety of image filters that can be stacked together and saved as presets that you can reuse. The filters’ effects ripple downward through the stack, changing the current state of the selected image(s). All changes are reversible and visible immediately. It is possible to work on multiple images at once and […]"},{"link":"https://nmac.to/blog/osfoora-1-3-5/","image":"https://nmac.to/wp-content/uploads/2014/04/Osfoora.png","title":"Osfoora 1.3.5 – Clean and intuitive Twitter client","content":"Osfoora for Twitter is a powerful Twitter client with a clean and intuitive user interface. You’ll enjoy a wide set of powerful features such as Muting users, Read Later, Message Conversations, Multiple Accounts, and more.   Features: Multiple accounts with multi-windows. TweetMarker Support: Timeline syncing of reading position between different Twitter apps. Inline picture thumbnails […]"},{"link":"https://nmac.to/blog/pulp-2-5-3/","image":"https://nmac.to/wp-content/uploads/2014/04/Pulp.png","title":"Pulp 2.5.3 – Turn your favorite news sites into your own newspaper","content":"Pulp is a unique and innovative newsreader that lets you turn your favorite news sites into your own personalized newspaper, and make scanning through the news quicker and more enjoyable than ever before. By combining multiple news feeds onto a single page, Pulp lets you quickly scan through headlines, previews, and photos to find the […]"},{"link":"https://nmac.to/blog/macaw-1-0-5/","image":"https://nmac.to/wp-content/uploads/2014/04/Macaw1.png","title":"Macaw 1.0.5 – The code-savvy web design tool","content":"Stop writing code. Start drawing it.   Macaw provides the same flexibility as your favorite image editor but also writes semantic HTML and remarkably succinct CSS. It’s time to expect more from a web design tool.   Fluid canvas and grid Macaw is engineered for fluid widths. Resize the canvas and your grids and elements […]"},{"link":"https://nmac.to/blog/tuba-1-7/","image":"https://nmac.to/wp-content/uploads/2014/01/Tuba.png","title":"Tuba 1.7 – Super fast and elegantly designed YouTube app","content":"Tuba is a super fast and elegantly designed YouTube app for your beloved Mac   Why use Tuba app instead of youtube.com? 1) The app is blazing fast compare with the website.Everything is much faster. 2) Better design: more content, no clutter. 3) Save 50% battery. Tuba only uses half the power compare with youtube.com, […]"},{"link":"https://nmac.to/blog/smashtunes-3-0/","image":"https://nmac.to/wp-content/uploads/2014/04/SmashTunes.png","title":"SmashTunes 3.0 – Control iTunes and Spotify from your menu bar","content":"SmashTunes is an iTunes and Spotify controller that lets you control iTunes and Spotify by keyboard shortcuts. It displays the currently playing song in your menu bar and artwork floating in a window. This means no more interuptions of your work, to lookup what song’s palying. From the menu you can control iTunes and Spotify, […]"}]