[{"link":"https://nmac.to/blog/paragon-camptune/","image":"https://nmac.to/wp-content/uploads/2016/01/Camptune.png","title":"Paragon Camptune 10.13.433 – Resize Mac’s Boot Camp volume with ease","content":"CampTune makes your Boot Camp Windows partition freely resizable. You may need to adjust the size of your Windows partition when, for example, you run out of disk space or want to install an application with particularly high storage requirements. CampTune provides a simple slider to redistribute storage space between Macintosh HD and Boot Camp […]"},{"link":"https://nmac.to/blog/akvis-artsuite/","image":"https://nmac.to/wp-content/uploads/2018/08/AKVIS-ArtSuite.png","title":"AKVIS ArtSuite 15.0 – Collection of edge effects for decoration of photos","content":"AKVIS ArtSuite is a photo decoration software that allows you to add effects or frames to your photos.   There are two effect groups in the program: Frames which let you generate a frame for your photo; and Effects which allow experimenting with photos (colors, surface, etc).   Photo frames samples that come with ArtSuite […]"},{"link":"https://nmac.to/blog/virtualdj/","image":"https://nmac.to/wp-content/uploads/2015/03/VirtualDJ.Pro_.png","title":"VirtualDJ 8.3.4459 – DJ software chosen by DJ brands such as Numark, Denon, and Hercules","content":"VirtualDJ is the DJ software chosen by DJ brands such as Numark, Denon and Hercules. It is used around the world by bedroom DJs and professional superstars alike.   With its cutting-edge beatlock engine, your songs will always stay on the beat, and you can work your mixes incredibly faster than any other DJ. The […]"},{"link":"https://nmac.to/blog/ticktick/","image":"https://nmac.to/wp-content/uploads/2018/08/TickTick.png","title":"TickTick 2.6.50 – To-do list and task manager","content":"TickTick is your daily must-have to-do and task list to get all things done. TickTick can be accessed on more than 10 different platforms including Mac, iPhone, iPad, Apple Watch which enables you to manage tasks on all your devices/Web.   Features Add task via shortcut (Command+Shift+A) Instant reminder Set priority levels to tasks Set […]"},{"link":"https://nmac.to/blog/handyprint/","image":"https://nmac.to/wp-content/uploads/2016/10/handyPrint-Pro.png","title":"handyPrint Pro 5.5.0 – Activate AirPrint by adding or removing the required files","content":"handyPrint v5 is a 64-bit OS X application that allow you to print from your iPods, iPads and iPhones on printers that do not support the AirPrint protocol. v5 has been re-designed as a standard application similar to the ones you would find in the Apple App Store. You simply copy it to the Applications […]"},{"link":"https://nmac.to/blog/analytics-for-google-analytics/","image":"https://nmac.to/wp-content/uploads/2016/07/Statistics-for-GoogleAnalytics.png","title":"Analytics for Google Analytics 2.03 – Google Analytics app for Mac","content":"Millions of people use Google Analytics™ to understand their website usage and to improve their business plans.   Unfortunately the Google Analytics™ website is neither easy to read nor to use. It fails to show the information that are really important.   With Analytics for Google Analytics we are proud to introduce the first powerful […]"},{"link":"https://nmac.to/blog/boson/","image":"https://nmac.to/wp-content/uploads/2015/11/Boson.png","title":"Boson 1.5.5 – Audio recorder, editor, and converter","content":"Boson is a modern, easy-to-use audio editor optimized to make full use of your Mac’s power. With Boson you can record audio, edit existing audio files, convert your music between the most common audio file formats, digitize your old vinyl records, or record internet radio stations. Whatever you need to get done – if it […]"},{"link":"https://nmac.to/blog/cmm/","image":"https://nmac.to/wp-content/uploads/2017/09/CleanMyMac.png","title":"CMM 3.9.9 – Delete files that waste your disk space","content":"CMM makes space for the things you love. Sporting a range of ingenious new features, CMM 3 lets you safely and intelligently scan and clean your entire system, delete large, unused files, reduce the size of your iPhoto library, uninstall unneeded apps or fix the ones that started to work improperly, manage all your extensions from […]"},{"link":"https://nmac.to/blog/textlab/","image":"https://nmac.to/wp-content/uploads/2017/03/TextLab1.png","title":"TextLab 1.4.2 – A text transformation tool","content":"The TextLab is a text transformation tool, which is suggesting what operations can be performed based on your input. For   Supported operations: HTML, XML Format Validate & Clean up Save as HTML, XML Save as escaped HTML, XML   JSON Validate & Format Save as JSON   URL Encode Decode Extract URL parameters into […]"},{"link":"https://nmac.to/blog/3d-coat/","image":"https://nmac.to/wp-content/uploads/2015/06/3D-Coat4.png","title":"3D-Coat 4.8.20 – Boosts speed and quality of 3D-object texturing and detailing","content":"3D-Coat is the one application that has all the tools you need to take your 3D idea from a block of digital clay all the way to a production ready, fully textured organic or hard surface model.   Main Features:   – Physically Based Rendering & Smart Materials Introduced! Physically based rendering (PBR) is rendering […]"}]