[{"link":"https://nmac.to/blog/icon-glue-1-2-1/","image":"https://nmac.to/wp-content/uploads/2013/07/Icon-Glue.png","title":"Icon Glue 1.2.1 – Easily create Apple icon images for apps","content":"Icon Glue is the easiest way to quickly create an Apple Icon Image (.icns) for your Mac app from a single 1024×1024 pixels sized PNG or TIFF image. Just open your image, select what you want to create (Icon Glue will remember these settings) and save it. You can also open an OS X application […]"},{"link":"https://nmac.to/blog/shadow-blade/","image":"https://nmac.to/wp-content/uploads/2014/03/ShadowBlade.png","title":"Shadow Blade 1.1.1 – Becoming a ninja is at your fingertips","content":"Kuro is a young man on his quest to become the Shadow Blade. He must seek the teachings of the last remaining ninja master.   You will guide him through challenging levels, around countless traps, sneaking past enemies or right over their dead bodies.   You have to be fast, be stealthy, be aware of […]"},{"link":"https://nmac.to/blog/png-compressor-1-1/","image":"https://nmac.to/wp-content/uploads/2014/03/PNG.Compressor.png","title":"PNG Compressor 1.1 – Lossless PNG compression for designers and developers","content":"PNG compression … Drag & drop PNGs from Finder into the app to reduce their files sizes. This tool is an easy and lightweight wrapper around OptiPNG by Cosmin Truţa.   Why do you need PNG Compressor: Optimize graphics on your website for faster loading and saving the bandwidth. Reduce file sizes of pictures to […]"},{"link":"https://nmac.to/blog/internet-radio-1-5/","image":"https://nmac.to/wp-content/uploads/2014/03/Internet.Radio_.png","title":"Internet Radio 1.5 – Internet radio stations directly on your mac","content":"The ‘Internet Radio‘ plays internet radio stations. There are over 16000 radio stations the edited monthly editorial. If you can not find your favorite radio station, write to Pocketkai, it will try to add channels.   Features: Hand-picked, working stations Over 1400 German radio stations Over 5000 international radio stations Over 7500 ‘internet only’ radio […]"},{"link":"https://nmac.to/blog/ipin-1-13/","image":"https://nmac.to/wp-content/uploads/2014/01/iPIN.png","title":"iPIN 1.13 – Secure PIN & Password Safe","content":"You have to remember several PINs and passwords? For various credit cards, online-banking, security-token, email accounts and so on?   iPIN – and your PINs and passwords are always at hand. Access at lightning speed, as secure as possible and – if you like – also in synch via iCloud at any time on your […]"},{"link":"https://nmac.to/blog/gif-creator-1-0-2/","image":"https://nmac.to/wp-content/uploads/2014/03/GIF.Creator.png","title":"GIF Creator 1.0.2 – Easy to use GIF animator","content":"GIF Creator is the only GIF maker which support almost all popular video formats.   GIF Creator is the best video to GIF maker on Mac OS X.   GIF Creator lets you convert clips from your video files to GIFs. GIF Creator will easily do the hard work for you.   Features: Convert clips […]"},{"link":"https://nmac.to/blog/filtromatic-0-7/","image":"https://nmac.to/wp-content/uploads/2014/03/Filtromatic.png","title":"Filtromatic 0.7 – Special effects to your photos and images","content":"Make your photos look great and share them with your friends.   Filtromatic allows you apply effects to your photos and images and upload them to social networks.   Version 4.8.0: Borders “Random Filter” feature Minor bug fixes   OS X 10.9 or later, 64-bit processor   Bluehaste          Uploaded        […]"},{"link":"https://nmac.to/blog/quake/","image":"https://nmac.to/wp-content/uploads/2014/03/Quake-4.png","title":"Quake 4 1.4.3 – Desperate War for Earth’s Survival","content":"Earth is under siege by the Strogg, a barbaric alien race moving through the universe consuming, recycling and annihilating any civilization in their path. In a desperate attempt to survive, an armada of Earth’s finest warriors is sent to take the battle to the Strogg home planet.   In addition to a compelling single player […]"},{"link":"https://nmac.to/blog/sega-superstars-tennis/","image":"https://nmac.to/wp-content/uploads/2013/10/SEGA-Superstars-Tennis.png","title":"SEGA Superstars Tennis 1.0.1 – Tennis gets a SEGA spin","content":"Sonic and a superstar cast of fan-favourite characters serve up extreme arcade tennis on courts inspired by SEGA’s psychedelic gameworlds. Compete in madcap matches, crazy tournaments and wacky minigames in this wildly imaginative take on tennis.   Hone your skills in quick matches, then take on the grand challenge of “Planet Superstars” mode, a series […]"},{"link":"https://nmac.to/blog/networking-2014-1-0/","image":"https://nmac.to/wp-content/uploads/2014/03/Networking.2014.png","title":"Networking 2014 1.0 – Learning the Basic Foundation of Networking","content":"Networking 2014 is an Excellent Application on Learning the Basic Foundation of Networking, This Course Comes with Video Training and Practice Exam, Learning Networking is a must if you want to further your Career and Obtain the CompTIA Networking+ or Get the Cisco Certified Network Associate (CCNA). Updated for the 2014 Objectives   OS X […]"}]