[{"link":"https://nmac.to/blog/lattice/","image":"https://nmac.to/wp-content/uploads/2020/10/Lattice_1.png","title":"Lattice 1.8.14 – LUT editor and viewer","content":"Lattice allows you to manipulate, transform, and convert 3D and 1D LUTs. Supports many popular LUT formats, and can seamlessly convert between any of them. It provides a simple and powerful interface that is right at home. Use visualization tools to see how your LUT modifies colors.   Apply LUTs to your images easily and […]"},{"link":"https://nmac.to/blog/rottenwood/","image":"https://nmac.to/wp-content/uploads/2020/08/Rottenwood_1.png","title":"Rottenwood 1.2.10 – Catalog your movies","content":"Rottenwood gives you a centralized location for listing the movies you’ve seen or want to see, to mark them as favorites, or even to make notes about them, all in an attractive interface complete with advanced search features.   Version 1.2.10: Fixing thumbnail load.   Intel, 64-bit processor macOS 10.12 or later    "},{"link":"https://nmac.to/blog/totalspaces/","image":"https://nmac.to/wp-content/uploads/2016/10/TotalSpaces2.png","title":"TotalSpaces 2.9.9 – The ultimate grid spaces manager","content":"TotalSpaces is a desktop manager that brings back grid Spaces to OS X and more!   Define your grid – and navigate left, right, up and down between your desktops Choose your transitions – Cube, slide and other effects, or turn them off altogether to really speed up your mac Manage your desktops and windows […]"},{"link":"https://nmac.to/blog/marble-knights/","image":"https://nmac.to/wp-content/uploads/2021/05/Marble-Knights.png","title":"Marble Knights 2.2.0 – Roll into adventure for 1-4p","content":"Now with two more new multiplayer minigames: Bombing Blast and Lazer Orb Arena!   Sword-swinging fantasy meets marble mania! Roll into battle with Orbin, Marabelle, and the other Knights of the Round to defend King Rolland and the Kingdom of Roundingham from the evil Lord Terroball! Armed with your blade, your wits, and a variety […]"},{"link":"https://nmac.to/blog/mount-blade-warband/","image":"https://nmac.to/wp-content/uploads/2015/04/Mount_Blade.png","title":"Mount & Blade: Warband 2.059 – Realistic combat game with high detailed fighting system","content":"In a land torn asunder by incessant warfare, it is time to assemble your own band of hardened warriors and enter the fray. Lead your men into battle, expand your realm, and claim the ultimate prize: the throne of Calradia!   Mount & Blade: Warband is the eagerly anticipated stand alone expansion pack for the […]"},{"link":"https://nmac.to/blog/ulysses/","image":"https://nmac.to/wp-content/uploads/2020/08/Ulysses-21.png","title":"Ulysses 22.1 – Creative-writing text editor","content":"Ulysses lets you focus when you need to concentrate. It keeps all your texts neatly stuffed in its intuitive library. With a few clicks, Ulysses can create beautiful documents from your manuscripts: PDFs, web pages, even iBooks-ready ePubs. With its simple, clutter-free interface, it will turn work hours into fun time. And mere thoughts into […]"},{"link":"https://nmac.to/blog/timeedition/","image":"https://nmac.to/wp-content/uploads/2020/01/timeEdition.png","title":"timeEdition 2.3 – Time Tracking App","content":"You don’t give away your time or your money. With timeEdition you have the perfect tool to track your work time, and your colleagues work time. You can track the work outlay of your project and give your clients a detailed bill.   The concept of timeEdition: timeEdition puts great emphasis on easy use and […]"},{"link":"https://nmac.to/blog/readkit/","image":"https://nmac.to/wp-content/uploads/2017/03/ReadKit2.png","title":"ReadKit 2.7.4 – Read-later and RSS client for Mac","content":"ReadKit is a full-featured read-later and RSS client that supports services from Instapaper, Pocket, Readability, Pinboard, Delicious, Fever, NewsBlur, Feed Wrangler, and Feedbin, and has built-in RSS capabilities.   Choose the layout, formatting, and style you prefer for reading, with the ability to move, add, archive, and even mark your bookmarks as favorites. The interface […]"},{"link":"https://nmac.to/blog/sound-control/","image":"https://nmac.to/wp-content/uploads/2018/01/Sound-Control2.png","title":"Sound Control 2.6.1 – Software volume mixer","content":"Sound Control lets users use a software volume mixer. Sound Control enables users to easily and quickly change app volumes as well as selectively apply a system-wide EQ to app audio. Sound Control does this by adding a software mixer to the menu bar of your Mac. In addition to the volume mixer, Sound Control […]"},{"link":"https://nmac.to/blog/db-text/","image":"https://nmac.to/wp-content/uploads/2021/03/DB-Text.png","title":"DB-Text 1.11 – Import formatted database text files (CSV, TSV CSV-S)","content":"DB-Text is able to open and manipulate CSV and TSV file as never was possible before To import any CSV or TSV file is enough to drag and drop (or select via a standard open dialog) the file to import It has a lot of function and utilities to make your job faster and easier […]"}]