[{"link":"https://nmac.to/blog/demon-hunter-3-revelation-collectors-edition-1-0/","image":"https://nmac.to/wp-content/uploads/2016/05/Demon-Hunter.png","title":"Demon Hunter 3: Revelation Collector’s Edition 1.0 – Point & click investigation game","content":"There have been no signs of demonic activity since Ragnar’s defeat five years ago. Now you’ve been called in to help Officer Arthur Brown with his newest case. A woman’s been murdered, and her daughter’s missing. Is this your typical murder case, or is there something more sinister to blame? Follow in the path of […]"},{"link":"https://nmac.to/blog/royal-envoy-3-collectors-edition-1-0/","image":"https://nmac.to/wp-content/uploads/2016/05/Royal.Envoy_.3.png","title":"Royal Envoy 3 Collector’s Edition 1.0 – A strategy game about exploring new lands","content":"Royal Envoy 3 Collector’s Edition is a strategy game about exploring new lands.   South Ocean. HMS “Islandshire” is exploring the white spots on the map. All of a sudden they see new lands! Previously unknown islands contain immense supplies of fish, pearls, troves of ancient pirate treasure and vast deposits of gold. They are […]"},{"link":"https://nmac.to/blog/the-hit-list-1-1-23/","image":"https://nmac.to/wp-content/uploads/2015/10/The.Hit_.List_.png","title":"The Hit List 1.1.23 – Advanced reminder application","content":"The Hit List manages the daily chaos of your modern life. It’s easy to learn – it’s as easy as making lists. And it’s powerful enough to let you plan, then forget, then act when the time is right.   Your life is complicated enough as it is. The tool to manage your life shouldn’t […]"},{"link":"https://nmac.to/blog/lego-harry-potter-years-1-4-1-0/","image":"https://nmac.to/wp-content/uploads/2016/05/LEGO-Harry-Potter.png","title":"LEGO Harry Potter Years 1-4 1.0 – Family-friendly action-adventure game","content":"In LEGO Harry Potter Years 1-4, connect the bricks from Privet Drive to the Triwizard Tournament and experience the magic and adventure of Harry Potter and his friends in the first four stories – LEGO style! Cast spells, make potions and discover a fantastical world in this humorous action adventure game for the whole family. […]"},{"link":"https://nmac.to/blog/emulsion-1-3-9/","image":"https://nmac.to/wp-content/uploads/2015/06/Emulsion.png","title":"Emulsion 1.3.9 – Photo library catalog","content":"Emulsion is a new photo catalog app. Emulsion can adjust exposure, colors, and almost everything else. You can also add gradients to your images to darken skies, or even add dust and scratches for a cool retro look. Emulsion can apply adjustments, effects, and metadata changes to one or hundreds of images at once. Want […]"},{"link":"https://nmac.to/blog/copyless-1-8-9/","image":"https://nmac.to/wp-content/uploads/2014/12/CopyLess.png","title":"CopyLess 1.8.9 – Store and access up to 100 clipboard items","content":"CopyLess is an advanced and flexible clipboard manager.   Unlike the system clipboard CopyLess can store up to 100 items to which you have instant access at any time. With CopyLess is no longer necessary to switch constantly between different applications or windows just to copy and paste several different items. Everything can now be […]"},{"link":"https://nmac.to/blog/moebius-empire-rising/","image":"https://nmac.to/wp-content/uploads/2016/05/Moebius.png","title":"Moebius: Empire Rising 1.0 – Thrilling new adventure game","content":"This thrilling new adventure game from master storyteller Jane Jensen (Gabriel Knight, Gray Matter) and Phoenix Online Studios (Cognition, The Silver Lining) introduces Malachi Rector, an expert in antiquities whose photographic memory and eye for detail transform people and clues into interactive puzzles.   When a secretive government agency enlists him to determine whether a […]"},{"link":"https://nmac.to/blog/making-history-the-great-war-1-0/","image":"https://nmac.to/wp-content/uploads/2016/05/Making-History.png","title":"Making History: The Great War 1.0 – Grand Strategy game in events of World War I","content":"Making History – The Great War: Write your own story and change the course of history as you lead of one of the Great Powers during the era of the First World War. Can you prevail as modern industrialized warfare changes the age of empires forever?   Your actions will influence world events as you […]"},{"link":"https://nmac.to/blog/lumo-1-05-21/","image":"https://nmac.to/wp-content/uploads/2016/05/Lumo.png","title":"Lumo 1.05.21 – A classic isometric adventure game","content":"Witness the rebirth of a genre in Lumo – a classic isometric adventure with a modern twist for gamers young and old alike!   As a contemporary take on the long-lost isometric platform genre, Lumo can be enjoyed by anyone looking for an absorbing, challenging and rewarding adventure. But for those who lived through the […]"},{"link":"https://nmac.to/blog/dracula-4-and-5/","image":"https://nmac.to/wp-content/uploads/2016/05/Dracula.4.and_.5.png","title":"Dracula 4 and 5 1.0.3 – Special Steam Edition","content":"Dracula 5 – The Blood Legacy Dare you face the Prince of Darkness?   THE ADVENTURE  Back at the Metropolitan Museum of Art, Ellen Cross finally unveils the Dracula Portrait that she’s brought back from Istanbul. This highly prized work is unfortunately stolen during its first night in New York. While tracking the thief, Ellen […]"}]