[{"link":"https://nmac.to/blog/temps/","image":"https://nmac.to/wp-content/uploads/2014/12/Temps.png","title":"Temps 1.13.7 – Monitor weather for up to 12 locations from your menu bar","content":"Temps is an elegant menu-bar app which shows temperatures and weather conditions from one or more worldwide locations/cities at a glance.   Easily add and remove up to 12 locations, and choose your preferred units of measurement with only a few clicks. Sync your locations to all your Macs via iCloud.   Temps runs invisibly […]"},{"link":"https://nmac.to/blog/noflashtube/","image":"https://nmac.to/wp-content/uploads/2016/10/NoFlashTube.png","title":"NoFlashTube 2.2.0 – A player for YouTube","content":"Enjoy a revolutionary way to watch your videos!   Have you a Mac without Adobe Flash installed?   Have you removed Adobe Flash component from your Mac?   Do you want to watch youtube without the overhead of flash?   NoFlashTube is all what you need to surf YouTube in a simple and efficient way! […]"},{"link":"https://nmac.to/blog/9-cut/","image":"https://nmac.to/wp-content/uploads/2014/01/9-Cut.png","title":"9 Cut 1.2.1 – pictures cutting software","content":"9 Cut is literary and fresh pictures cutting software , it can help you to cut into 9 photos to upload collage as a queen figure , features a simple, refreshing the screen , the effect is unexpected.   9Cut, page simple and clear, only “Open ” and “Save ” buttons . A good selection […]"},{"link":"https://nmac.to/blog/metatv/","image":"https://nmac.to/wp-content/uploads/2015/08/MetaTV.png","title":"MetaTV 1.8.0 – Add information about TV shows and cover arts to your video files","content":"With MetaTV you can very easily add information about TV shows and cover arts to your video files (.mp4, .m4v). Simply drop your video files on the episode list of MetaTV, search for your TV show, select the right season and press copy. MetTV loads all information about your episodes like air date, actors and […]"},{"link":"https://nmac.to/blog/zoom-it/","image":"https://nmac.to/wp-content/uploads/2015/12/Zoom.It_.png","title":"Zoom It 1.2.4 – On-screen magnifier","content":"Zoom It is an on-screen magnifier that is always available via simple keyboard shortcuts. You can customize Zoom It shortcuts, keep the customizable magnifying loupe on-screen, or just show it for a moment when you need it.   Version 1.2.4: Bugs fixed Memory issue fixed   Intel, 64-bit processor OS X 10.7 or later   […]"},{"link":"https://nmac.to/blog/minutes/","image":"https://nmac.to/wp-content/uploads/2017/08/Minutes.png","title":"Minutes 2.1.0 – A simple, colorful timer","content":"Minutes gently reminds you of meaningful moments, like walking your dog, picking up your children from school, or doing work-related tasks.   Just slide the toggle around to set the desired timespan, and Minutes starts counting down.   When the time is up, you will receive a gentle, customizable notification.   This compact tool is […]"},{"link":"https://nmac.to/blog/video-backgrounds-hd/","image":"https://nmac.to/wp-content/uploads/2017/08/Video-Backgrounds-HD.png","title":"Video Backgrounds HD 4.0 – 10 looping, multipurpose, HD backgrounds","content":"Video Backgrounds HD is a collection of 10 high-definition, animated backgrounds for your video or multimedia projects. Whether you are a video producer, artist, or hobbyist, you will find the right motion background for your project. Video backgrounds can be used for a variety of video or Web projects, Keynote or PowerPoint presentations, live performances […]"},{"link":"https://nmac.to/blog/periodic-table-explorer/","image":"https://nmac.to/wp-content/uploads/2013/06/Periodic-Table-Explorer.png","title":"Periodic Table Explorer 1.6 – Complete reference for the elements","content":"The Periodic Table Explorer is the complete reference for the elements of the periodic table. It contains over 1400 pages of (searchable) text, a glossary of terms, biographies of important chemists, lists of compounds, hundreds of scientific constants, and over two hundred images! In addition, there are lists of elements by property (melting point, discovery […]"},{"link":"https://nmac.to/blog/neighbours-from-hell/","image":"https://nmac.to/wp-content/uploads/2017/08/Neighbours-from-Hell.png","title":"Neighbours from Hell: Season 1 1.1 – Comedy, Adventure & Classic Puzzle Game","content":"Creep around your neighbour ’s house performing ever more elaborate tricks upon the unsuspecting resident.   As the star of a fantastic new TV show, cameras will track your every move as you set your fiendish traps. Your objectives are to create more and more disarray, increase ratings and maybe even winning prestigious awards. But […]"},{"link":"https://nmac.to/blog/coollector-movie-database/","image":"https://nmac.to/wp-content/uploads/2013/12/Icon.175x175-75.png","title":"Coollector Movie Database 4.9.8 – Personal movie and video collection manager","content":"Coollector Movie Database is the most complete tool for the movie lovers. It’s a huge database of movies and series, personalized with what you’ve seen, how much you’ve liked it, and what you wish to see. It’s also a video collection manager, to track what DVDs you own, where they’re stored, and which ones you’ve […]"}]