[{"link":"https://nmac.to/blog/ravenfield/","image":"https://nmac.to/wp-content/uploads/2020/08/Ravenfield.png","title":"Ravenfield Early Access Build 21 – Singleplayer Shooter Action Game","content":"Fight upon the Ravenfield together with your Blue allies! Take down those pesky Reds using helicopters, tanks, guns, and active ragdoll physics!   Ravenfield is a singleplayer game in the vein of older team-vs-team AI shooters. The game is designed to be easy to pick up and play, but also rewarding for all skill levels! […]"},{"link":"https://nmac.to/blog/timelie/","image":"https://nmac.to/wp-content/uploads/2020/08/Timelie.png","title":"Timelie 1.0.5 – Adventure, Strategy & Puzzle Game","content":"Every second matters in Timelie, a stealth puzzle game that puts the power of time in your very hands. Trapped in an abstract and surreal world, a girl and a mysterious cat must work together to escape their surroundings, pursued by a nameless enemy at every turn.   The Timeline ability gives players the power […]"},{"link":"https://nmac.to/blog/steamworld-quest/","image":"https://nmac.to/wp-content/uploads/2019/06/SteamWorld-Quest.png","title":"SteamWorld Quest: Hand of Gilgamech 2.1 – Adventure RPG Game","content":"SteamWorld Quest is the roleplaying card game you’ve been waiting for! Lead a party of aspiring heroes through a beautifully hand-drawn world and intense battles using only your wits and a handful of cards. Take on whatever threat comes your way by crafting your own deck choosing from over 100 unique punch-cards!   What awaits […]"},{"link":"https://nmac.to/blog/the-sims-4/","image":"https://nmac.to/wp-content/uploads/2018/01/THE.SIMS_.4.png","title":"THE SIMS 4 1.87.40.1030 + ALL DLC – Popular simulation game (WineSkin)","content":"You can create any Sim you can dream up. Plan their lives, pick their friends, make enemies, and watch their hilarious stories unfold. Go ahead, make a Sim whose greatest aspiration is to hone his gardening skills. With enough work, he might become the world’s greatest freelance botanist. Or maybe you want to create a […]"},{"link":"https://nmac.to/blog/crying-suns/","image":"https://nmac.to/wp-content/uploads/2020/07/Crying-Suns.png","title":"Crying Suns 2.0 – Sci-fi 2D Space Game","content":"Crying Suns is a tactical rogue-lite that puts you in the role of a space fleet commander as you explore a mysteriously fallen empire.   In this story rich experience inspired by Dune and Foundation, each successful run will uncover the truth about the Empire… and yourself as well.   Main Features Space exploration in […]"},{"link":"https://nmac.to/blog/mitch/","image":"https://nmac.to/wp-content/uploads/2017/10/Mitch.png","title":"Mitch 1.8.1 – Lightweight native Twitch app","content":"Mitch for Twitch is a lightweight native macOS app for Twitch.   Features Watch every game and channel on Twitch Browse top games and channels Quick access to channels you’re following Discover and follow new streamers Get notifications when your favorite streamers go live Resizable video player and chat (Fullscreen and split view supported) Chat […]"},{"link":"https://nmac.to/blog/mindjet-mindmanager/","image":"https://nmac.to/wp-content/uploads/2018/11/Mindjet-MindManager12.png","title":"Mindjet MindManager 13.1.115 – Professional mind mapping & project management tool","content":"MindManager is a powerful mind mapping tool that increases your productivity. From business plans or developing a new website, its robust mind maps have all the features you need to accomplish your projects.   Version 13.1.115: Release notes were unavailable when this listing was updated.   Intel, 64-bit processor macOS 10.13 or later    "},{"link":"https://nmac.to/blog/power-manager/","image":"https://nmac.to/wp-content/uploads/2020/01/Power-Manager5.png","title":"Power Manager 5.4.9 – Auto-start, shut down, or sleep your Mac","content":"Power Manager is the solution for reducing the energy costs of Mac computers. Use Power Manager to assert control over when your Macs are available and when they are switched off.   Power Manager extends the scheduling functionality provided by OS X’s Energy Saver. Unlike Energy Saver, Power Manager is aware of multiple users, offers […]"},{"link":"https://nmac.to/blog/ftl-faster-than-light/","image":"https://nmac.to/wp-content/uploads/2018/03/Faster-Than-Light.png","title":"FTL: Faster Than Light 1.6.12 – Spaceship simulation game","content":"In FTL you experience the atmosphere of running a spaceship trying to save the galaxy. It’s a dangerous mission, with every encounter presenting a unique challenge with multiple solutions. What will you do if a heavy missile barrage shuts down your shields? Reroute all power to the engines in an attempt to escape, power up […]"},{"link":"https://nmac.to/blog/ezee-graphic-designer/","image":"https://nmac.to/wp-content/uploads/2018/12/Ezee-Graphic-Designer.png","title":"Ezee Graphic Designer 2.1.2 – Powerful graphic design software","content":"Ezee Graphic Designer is a simple yet powerful graphic design software that everyone can use to design amazingly engaging graphical images.   You can use TurboLayout to make eye-catching graphical announcements, blog images, brochures, business cards, calendars, flyers, coupons, infographics, invitations, letterheads, postcards, posters, presentations, recipe books, social media images, etc.   Version 2.1.2: Release […]"}]