[{"link":"https://nmac.to/blog/elimisoft-app-uninstaller/","image":"https://nmac.to/wp-content/uploads/2018/12/Elimisoft-App-Uninstaller2.png","title":"Elimisoft App Uninstaller 2.6 – Intelligent App Uninstaller","content":"Elimisoft App Uninstaller intelligently locates ALL leftover files (caches, logs, preferences, crash reports) of App and cleans your Mac, Free up that valuable disk space.   Features: Full find all Apps on your Mac and its related remaining files, incl. leftover, logs, caches, preferences, crash reports, etc. Scan rogue Apps, viruses, that slow down your […]"},{"link":"https://nmac.to/blog/dead-in-vinland/","image":"https://nmac.to/wp-content/uploads/2018/06/Dead.in_.Vinland1.png","title":"Dead In Vinland 1.4 – RPG survival & management game","content":"DEAD IN VINLAND is a survival/management game, mixed with RPG and adventure elements, about a Viking family trying their best to survive on a mysterious island.   Exiled on a faraway and unknown land, lead Eirik and his family on their quest to survive.   Manage their physical and mental health, explore the island, organize […]"},{"link":"https://nmac.to/blog/adze/","image":"https://nmac.to/wp-content/uploads/2016/06/Adze1.png","title":"Adze 1.4.12 – View and edit GPX files from your GPS device","content":"Adze gives you the tools to edit GPX documents like a pro: create, modify and delete tracks, plan routes, mark waypoints, and more.   Features Dissect Recordings – Merge tracks that shouldn’t have been split, or split tracks that should have. Delete undesired sections or extract detours as a separate track. Plan Routes – If […]"},{"link":"https://nmac.to/blog/back-in-time/","image":"https://nmac.to/wp-content/uploads/2016/01/Back-In-Time5.png","title":"Back-In-Time 5.1.1 – Easy access to all data backed up by Time Machine","content":"Back-In-Time allows users to transcend Time Machine restoration possibilities. Back-In-Time offers an easy access to all the data backed up by Time Machine.   Features that you can do with Back-In-Time only: Show how many versions of each document are available, and when they were saved. Show items that were deleted. Drag and Drop to […]"},{"link":"https://nmac.to/blog/fetch/","image":"https://nmac.to/wp-content/uploads/2020/02/Fetch.png","title":"Fetch 5.8 – FTP/SFTP client with Bonjour, Unicode support and more","content":"Fetch is a full-featured FTP, SFTP and FTPS (FTP with TLS/SSL) client with a simple and easy-to-use interface.   Fetch features include: one-click editing remote files with any application, automatic restart of failed or stalled transfers, Quick Look, WebView, droplet shortcuts, automatic support for Zip, Tar, Gzip, StuffIt and other common file formats, Bonjour support, […]"},{"link":"https://nmac.to/blog/extf/","image":"https://nmac.to/wp-content/uploads/2016/09/Paragon-ExtFS10.png","title":"ExtFS 11.3.30 – Provides full read/write access to Ext2/Ext3 file systems","content":"ExtFS is a low-level file system driver was specially developed to bridge file system incompatibility between Linux and Mac by providing full read/-write access to the Ext2, Ext3, and Ext4 file systems under OS X.   Version 11.3.30: Release notes were unavailable when this listing was updated.   Intel, 64-bit processor OS X 10.10 or […]"},{"link":"https://nmac.to/blog/screenie/","image":"https://nmac.to/wp-content/uploads/2017/09/Screenie2.png","title":"Screenie 2.1.2 – Your favorite screenshot manager reimagined","content":"Screenie is the image manager Apple forgot. It lets you: Drag screenshots from the icon on your menubar Access any of your images right from your menubar Change where your screenshots are saved Change screenshot filetypes to PSD, JPG, and more Filter and search through your images   Version 2.1.2: Fixed a bug preventing dragging […]"},{"link":"https://nmac.to/blog/aiseesoft-mac-pdf-to-word-converter/","image":"https://nmac.to/wp-content/uploads/2014/12/Aiseesoft-Mac-PDF-to-Word-Converter3.png","title":"Aiseesoft Mac PDF to Word Converter 3.3.12 – Convert PDF files to Word documents","content":"Aiseesoft Mac PDF to Word Converter offers users a professional solution of converting PDF files to Microsoft Word document (.doc) and RTF file on Mac. After the conversion, the output document could be easily read and edit with Microsoft office, OpenOffice, LibreOffice, etc. And this software could preserve the original text, images, graphics, layout in […]"},{"link":"https://nmac.to/blog/fuel-for-keynote/","image":"https://nmac.to/wp-content/uploads/2014/12/Fuel-for-Keynote2-1.png","title":"Fuel for Keynote 2.0 – Themes for Keynote presentations","content":"Fuel for Keynote – handmade themes for your perfect presentation. Unique themes for your business, personal or any other presentation.   The app contains 170 multiple layout themes. Each theme has 32 unique master slides – a mix of bullet text and photo-oriented layouts. The layouts are modern, with custom bullets, matching tables and easily […]"},{"link":"https://nmac.to/blog/fuel-for-pages/","image":"https://nmac.to/wp-content/uploads/2014/04/Fuel-for-Pages2.png","title":"Fuel for Pages 2.0 – Unique design templates for Pages","content":"Fuel for Pages provides a new look for your Pages documents. The application includes a collection of excellent templates for commercial and personal use. Designs are sorted into 10 categories to simplify your world: brochures, business cards, cards, invitations, envelopes, flyers, forms, letters, newsletters, and reports. Whenever you need an amazing brochure, flyer or any […]"}]