[{"link":"https://nmac.to/blog/solis/","image":"https://nmac.to/wp-content/uploads/2018/04/Solis.png","title":"Solis 1.0.8 – A Live Design Output that integrates seamlessly with your favourite code editor","content":"Solis for Mac is a Live Design Output that integrates seamlessly with your favourite code editor. Delivering real time, multi viewport previewing of HTML, CSS, SCSS and LESS as you write it. A powerful addition to your web design workflow.   Multiple Viewports Effortlessly draw, resize and arrange multiple viewports that simultaneously display your live code. It couldn’t be […]"},{"link":"https://nmac.to/blog/hostbuddy/","image":"https://nmac.to/wp-content/uploads/2017/11/Hostbuddy.png","title":"Hostbuddy 2.2.5 – Manage and update the /etc/hosts file on your Mac [FIX]","content":"Hostbuddy is the easiest way to manage and update the /etc/hosts file on your Mac. Add new entries and turn on and off existing ones with one click. It’s perfect for switching between staging and production servers or just for testing out your new website before it goes live.   What it Does Quickly add […]"},{"link":"https://nmac.to/blog/flexi-player-turntable/","image":"https://nmac.to/wp-content/uploads/2021/09/Flexi-Player-Turntable.png","title":"Flexi Player Turntable 1.4 – music player / mp3 player / dj","content":"Flexi Player is interactive music player with lots of effects and real turntable for scratches.   8 build in effects and song speed changer.   Made for the Hi-Fi lovers   Old songs are fun again. Flexi Player is interactive music player with lots of effects and real turntable.   It is easy to remake […]"},{"link":"https://nmac.to/blog/textbar/","image":"https://nmac.to/wp-content/uploads/2016/04/TextBar.png","title":"TextBar 3.5.6 – Add any text to your menu bar","content":"TextBar allows you to use scripts to add anything to your menu bar.   Features Configure TextBar to run scripts/commands/… and display the results in your menubar. Quickly copy the text to your clipboard. Enable/disable each item individually. Configure how often you want each item to be updated. Configure whether you want to be notified […]"},{"link":"https://nmac.to/blog/crazytalk-animator/","image":"https://nmac.to/wp-content/uploads/2017/09/CrazyTalk-Animator-3.png","title":"Cartoon Animator 4.51.3511.1 – Create animations with modifiable actors and scenes","content":"Cartoon Animator 4 (formerly CrazyTalk Animator) is a 2D animation software designed for both ability of entry and productivity. With Cartoon Animator you can turn images into animated characters, control characters with your facial expressions, generate lip-sync animation from audio, accomplish 3D parallax scenes, produce 2D visual effects, and access content resources to rapidly customize […]"},{"link":"https://nmac.to/blog/super-lrc-editor-with-ai/","image":"https://nmac.to/wp-content/uploads/2021/11/Super-LRC-Editor-With-AI.png","title":"Super LRC Editor With AI 6.42.3 – Support multi-language charset","content":"lrc editor with Ai voice abstract, Support Multi-languages charsets. Support Undo and Redo.   Basic Operation steps: 1. Click the open mp3 button to open a mp3 file; 2. Click the play button to play; 3. Click the plus button to add a lyric on the right time; 4. After finished the lyric editing, click […]"},{"link":"https://nmac.to/blog/background-music-abstractor/","image":"https://nmac.to/wp-content/uploads/2021/11/Background-Music-Abstractor.png","title":"Background Music Abstractor 5.8.3 – Abstractor mp3’s obbligato","content":"A tiny tool for musics(obbligato) abstract from mp3, wav, m4a songs.   Attention, this software Can Not abstract music data from video, the only function of this software is abstracting obbligato from mp3(or wav, or m4a) file by Ai algorithm.   Operation steps: Click the folder icon, and select a mp3(or wav, or m4a) song […]"},{"link":"https://nmac.to/blog/video-snapshotcollage/","image":"https://nmac.to/wp-content/uploads/2021/06/Video-Snapshot-Collage.png","title":"Video Snapshot&Collage 2.4.2 – Snapshot&collage extreme fast","content":"A handy, high quality and easy to use video snapshot&montage tool.   Key Feature Base on FFmpeg, support all popular video formats. Powerful and accurate video clips selection, you won’t miss any wonderful moment. Rich snapshot option, help to extract the most interesting video frame, and support snapshot preview, help to choose the best snapshot. […]"},{"link":"https://nmac.to/blog/pixelmator/","image":"https://nmac.to/wp-content/uploads/2017/10/Pixelmator3.png","title":"Pixelmator 3.9.9 – Powerful layer-based image editor","content":"Pixelmator is a beautifully designed, easy-to-use, fast, and powerful image editor for OS X. It has everything you need to create, edit, and enhance your images.   Pixelmator is a layer-based image editor. You can quickly create layers from your photos, other pictures, from selections, or even your iSight. Yes, Pixelmator can add a layer […]"},{"link":"https://nmac.to/blog/folx-go/","image":"https://nmac.to/wp-content/uploads/2016/05/folx-5.png","title":"Folx GO+ 5.26 – Perfect download manager for Mac","content":"Folx GO allows the most complete control over your downloads with its fast speed, splitting downloads in threads, resuming of paused and interrupted downloads. You can add new downloads to Folx GO in various ways.   Another appealing feature of Folx GO is tagging of downloads according to their content. This way the downloads will […]"}]