[{"link":"https://nmac.to/blog/totals-3-0-17/","image":"https://nmac.to/wp-content/uploads/2015/05/Totals.png","title":"Totals 3.0.17 – Create stylish invoices and more","content":"Totals is a full-featured invoice application for SOHO or business users. Designed from scratch for the power and beauty of the Mac OS, it makes life easy for its users.   Totals is a combination of powerful features and a simple user interface. Every single step, every single process is well thought-out. One window for […]"},{"link":"https://nmac.to/blog/screenninja-2-0-1/","image":"https://nmac.to/wp-content/uploads/2015/07/ScreenNinja.png","title":"ScreenNinja 2.0.1 – Create time-lapse recordings of your work","content":"ScreenNinja is a time-lapse screen recording program. It records things that would be too long or boring to watch in real time, but when sped up can be interesting or beautiful. You’ve probably seen a time-lapse video of a building, concert or conference hall being set up. Imagine what it would look like to see […]"},{"link":"https://nmac.to/blog/ipartition-3-4-5/","image":"https://nmac.to/wp-content/uploads/2015/07/iPartition.png","title":"iPartition 3.4.5 – Smart hard disk partitioning utility","content":"iPartition makes it easy to create, destroy, resize or format partitions on your hard disks, whether internal, external, fixed or removable.   With iPartition, resizing a partition is as simple as selecting it, grabbing the resize handle and dragging. Not only that, but if you have several operations to perform, iPartition lets you queue them […]"},{"link":"https://nmac.to/blog/invoice-3-3-11/","image":"https://nmac.to/wp-content/uploads/2015/07/Invoice.png","title":"Invoice 3.3.11 – Create and manage invoices","content":"Invoice allows you to style your finances.   Invoice is an application with a wide array of features. The goal was to make a Mac-friendly application with all the required features for Mac users. Currently Invoice only supports English and German language.   Style your invoices with PDF – Create your own background with your […]"},{"link":"https://nmac.to/blog/source-1-3/","image":"https://nmac.to/wp-content/uploads/2015/07/Source.png","title":"Source 1.3 – System-wide code-snippet manager","content":"Source is a powerful code-snippet manager that stores the most valuable pieces of code for reuse in different projects many times.   Source uses syntax highlighting for over 110 languages.   Languages: Abap, Abc, ActionScript, Ada, Apache Conf, Applescript, Ascii Doc, Assembly x86, Autohotkey, Batchfile, C/C++, C9 Search, Cirru, Clojure, Cobol, Coffee, Coldfusion, C#, CSS, […]"},{"link":"https://nmac.to/blog/seasons-1-3/","image":"https://nmac.to/wp-content/uploads/2015/06/Seasons.png","title":"Seasons 1.3 – A beautiful app to explore, in a fun way, what to watch in TV","content":"Of course you will want to track your favourite TV programmes too and this app will help you a lot on this. But tracking TV programmes is just the beginning: discover it yourself!   (Soon there will be versions for iPad and iPhone too, so you can automatically synchronise between your devices the TV shows […]"},{"link":"https://nmac.to/blog/annas-quest/","image":"https://nmac.to/wp-content/uploads/2015/07/Annas-Quest2.png","title":"Anna’s Quest 2.0 – Featured Point & Click Adventure Game","content":"Dragons, witches, trolls… No one can stop Anna. With her telekinesis, unorthodox use of torture instruments, a knack for improvisation and the help of a shady fox she just makes her way. She communes with the dead, shuts off the local taverns beer supply and gets old ladies behind bars…   The world of author […]"},{"link":"https://nmac.to/blog/perfect-photo-suite-9-5-1644/","image":"https://nmac.to/wp-content/uploads/2015/07/Perfect.Photo_.Suite_.png","title":"Perfect Photo Suite 9.5.1644 – onOne digital photo products as a standalone application","content":"Your photo. Your look. Each photo you take holds a personal connection, whether a hobbyist, advanced amateur, or pro. Discover what you can do with any photo with Perfect Photo Suite 9—designed just for you. Perfect Photo Suite 9 is a complete photo editor with seven powerful apps in one integrated suite. Work the way […]"},{"link":"https://nmac.to/blog/loop-editor-2-1-0/","image":"https://nmac.to/wp-content/uploads/2015/07/Loop.Editor.png","title":"Loop Editor 2.1.0 – Audio loop editing tool","content":"Loop Editor is the perfect replacement for Apple Loops Utility. It supports all audio file formats that support loop points: AIFF Apple Loops, compressed and uncompressed CAF (AIFF, AAC, and Apple Lossless) Apple Loops, AIFF, WAV, W64, and ACID. Additionally, Loop Editor supports forward, forward-backward, and backward looping. Loop Editor is one of the only […]"},{"link":"https://nmac.to/blog/ismartphoto-1-6-6/","image":"https://nmac.to/wp-content/uploads/2014/12/iSmartPhoto.png","title":"iSmartPhoto 1.6.6 – Image browser and powerful image organizer","content":"iSmartPhoto is a fast image browser and powerful image organizer. Unlike iPhoto, iSmartPhoto doesn’t require you to manually import photos – it automatically pulls your photos from any folder or drive. By just double clicking a single image in Finder or dragging a folder, iSmartPhoto automatically displays every image from the selected folder and its […]"}]