[{"link":"https://nmac.to/blog/stater-1-0/","image":"https://nmac.to/wp-content/uploads/2016/02/Stater.png","title":"Stater 1.0 – Displays system information in its Dock icon","content":"Stater is a system-monitoring application that displays all information in one Dock icon and a Dock menu.   You can click the dock icon to change view. There are four views total: combined, multi-core CPU usage, memory usage, and drive space (you can turn off any view). Open the dock menu for detailed information about […]"},{"link":"https://nmac.to/blog/moxile-2-1-4/","image":"https://nmac.to/wp-content/uploads/2016/02/Moxile.png","title":"Moxile 2.1.4 – Productive markdown editor app","content":"Moxile, the missing Markdown editor designed for productivity. It comes with **Live Preview**. It offers full support for regular Markdown Syntax as well as Github flavored markdown extension.   syntax highlight auto save powerful actions featured picture inserter full github flavored markdown extension support light and dark theme built-in, support customize HTML and PDF export […]"},{"link":"https://nmac.to/blog/bloom-1-0-285/","image":"https://nmac.to/wp-content/uploads/2016/02/Bloom.png","title":"Bloom 1.0.285 – Lightweight, cross-platform, procedural graphics editor","content":"Bloom (was Ormr) is a fast, lightweight, cross-platform procedural graphics editor that lets you tweak any action you have ever performed — organized by layer. In Bloom, everything is numerically adjustable – all the time, long after the initial effect has been applied. You can tweak and adjust every detail to your heart’s delight until […]"},{"link":"https://nmac.to/blog/spillo-1-7/","image":"https://nmac.to/wp-content/uploads/2014/08/Spillo.png","title":"Spillo 1.7 – Take full control over your bookmarks on Pinboard","content":"Spillo is a powerful, beautiful and amazingly fast Pinboard client. Spillo lets you browse and organize your bookmarks in a stunning modern interface. Spillo also makes creating a bookmark from anywhere on your Mac as convenient as possible.   A beautiful interface Spillo has a beautiful modern interface that feels just right at home on […]"},{"link":"https://nmac.to/blog/relaxing-sounds-2-0/","image":"https://nmac.to/wp-content/uploads/2016/02/Relaxing-Sounds.png","title":"Relaxing Sounds 2.0 – Pleasant nature sounds","content":"Brand new tab bar application with pleasant nature sounds. Can’t sleep at night because of the noises? Can’t concentrate on your work? Want to relax? Try Relaxing Sounds. There are 9 different sounds that will help you to relax and concentrate.   Featured sounds: Thunder rain Wind through the trees Flowing river Morning in the […]"},{"link":"https://nmac.to/blog/gifquickmaker-1-5-1/","image":"https://nmac.to/wp-content/uploads/2015/08/GIFQuickMaker.png","title":"GIFQuickMaker 1.5.1 – Make animated GIFs","content":"GIFQuickMaker allows you to create GIFs, then combine them with TIFF, BMP, PNG and JPEG images.   Version 1.5.1: The target OS changed since OS X 10.6.   Intel, 64-bit processor OS X 10.6.6 or later    "},{"link":"https://nmac.to/blog/frozen-cortex-1-0/","image":"https://nmac.to/wp-content/uploads/2016/02/Frozen-Cortex1.png","title":"Frozen Cortex 1.0 – Simultaneous turn-based strategy game","content":"Frozen Cortex is a simultaneous turn-based strategy game from Mode 7, the creators of Frozen Synapse. Get a free key for a friend with every purchase!   Make a plan for your customised robots on a randomly-generated playfield. Positioning, timing and reading the terrain are all vital if you want to outwit your opponent.   […]"},{"link":"https://nmac.to/blog/flip4mac-studio-pro-hd-3-3-7-3/","image":"https://nmac.to/wp-content/uploads/2015/06/Flip4Mac.Studio.Pro_.HD_.png","title":"Flip4Mac Studio Pro HD 3.3.7.3 – Import and playback WMV in QuickTime","content":"Flip4Mac WMV Studio Pro HD lets you import, export and play Windows Media file in QuickTime applications.   WMV Player Features: Playback Windows Media Video 7,8,9 SD and HD, and Windows Media Video 9 Advanced in QuickTime Player directly WMV Player Pro Features: Import Windows Media Video 7,8,9 and Windows Media Video 9 Advanced Convert […]"},{"link":"https://nmac.to/blog/disk-health-1-2/","image":"https://nmac.to/wp-content/uploads/2016/02/Disk-Health.png","title":"Disk Health 1.2 – Fast disk cleaner and duplicate finder","content":"Disk Health gives you 2-in-1. Clean tons of unneeded files from your Mac’s drive, and find duplicate files with just a drag-and-drop. We have combined two essential utilities for your Mac in one effective app, with a gorgeous and user-friendly interface, suited for OS X 10.10 Yosemite and Retina displays, as well as for standard […]"},{"link":"https://nmac.to/blog/calcbot-1-0-5/","image":"https://nmac.to/wp-content/uploads/2015/02/Calcbot.png","title":"Calcbot 1.0.5 – Intelligent calculator and unit converter","content":"Calcbot is an intelligent calculator and unit converter for the rest of us. Featuring an easy-to-read history tape, expression view, intuitive conversion, and much more!   Features History Tape – Every calculation you enter gets saved to the history tape and optionally sent to your clipboard for quick pasting. Refer to calculations later or send […]"}]