[{"link":"https://nmac.to/blog/seasons-1-3-7/","image":"https://nmac.to/wp-content/uploads/2015/06/Seasons.png","title":"Seasons 1.3.7 – A beautiful app to explore, in a fun way, what to watch in TV","content":"Of course you will want to track your favourite TV programmes too and this app will help you a lot on this. But tracking TV programmes is just the beginning: discover it yourself!   (Soon there will be versions for iPad and iPhone too, so you can automatically synchronise between your devices the TV shows […]"},{"link":"https://nmac.to/blog/netspot-wi-fi-reporter-2-1-475/","image":"https://nmac.to/wp-content/uploads/2016/07/NetSpot.Wi-Fi.Reporter.png","title":"NetSpot Wi-Fi Reporter 2.1.475 – Advanced visualizations and powerful WiFi reporting","content":"Installing a wireless network isn’t always easy. Interference from neighboring networks, and radio noise from electronic devices can cause serious connection problems. While you can overcome those by trial and error, there’s a much better solution: NetSpot is here to do the job for you!   NetSpot WiFi Reporter adds advanced visualizations and powerful reporting […]"},{"link":"https://nmac.to/blog/shadow-tactics-blades-of-the-shogun-1-1-1/","image":"https://nmac.to/wp-content/uploads/2016/12/Shadow-Tactics-Blades-of-the-Shogun.png","title":"Shadow Tactics Blades of the Shogun 1.1.1 – A hardcore tactical stealth game","content":"Shadow Tactics is a hardcore tactical stealth game set in Japan around the Edo period.   Take control of a team of deadly specialists and sneak in the shadows between dozens of enemies. Choose your approach when infiltrating mighty castles, snowy mountain monasteries or hidden forest camps. Set traps, poison your opponents or completely avoid […]"},{"link":"https://nmac.to/blog/my-medical-2-5/","image":"https://nmac.to/wp-content/uploads/2016/12/My-Medical.png","title":"My Medical 2.5 – Keep all medical records digitally available","content":"My Medical is a comprehensive record-keeping app for your personal medical information. It’s the perfect replacement for unreliable paper records or various electronic systems that hold bits and pieces of your medical history. With My Medical, any and all information that is important to you is kept together in one place.   Version 2.5: Release […]"},{"link":"https://nmac.to/blog/mira-1-5-0b2/","image":"https://nmac.to/wp-content/uploads/2016/12/Mira1.png","title":"Mira 1.5.0b2 – Control any app with the Apple Remote","content":"With Mira, you can free yourself from the keyboard to streamline your activities. Take control of yor music from across the room, flip through a presentation in front of an audience, or sit back and relax with a movie. Uses for the Apple Remote are limited only by your imagination.   Mira includes built-in support […]"},{"link":"https://nmac.to/blog/business-templates-for-pages-3-1/","image":"https://nmac.to/wp-content/uploads/2015/07/Business.Mix_.for_.Pages2_.png","title":"Business Templates for Pages 3.1 – business templates for Apple Pages","content":"Business Templates gives a boost to the chemistry between you and your clients! Pick up 146 professional and stylish business templates for Apple’s Pages application.   Business Mix Set presents an excellent kit of 146 templates for Pages, from business cards and newsletters to proposals and various project management forms. Some of the templates contain […]"},{"link":"https://nmac.to/blog/master-of-orion-revenge-of-antares-1-0/","image":"https://nmac.to/wp-content/uploads/2016/12/Master.of_.Orion_.png","title":"Master of Orion – Revenge of Antares 1.0 – Space Strategy Game","content":"The ascendant spacefaring 4X strategy game returns! A new chapter in the epic Master of Orion saga is poised to once again capture the imaginations of millions of gamers.   Diehard fans of the first games will be ecstatic to know that this revival is being built under the watchful eyes of members from the […]"},{"link":"https://nmac.to/blog/adobe-captivate-9-0-2-437/","image":"https://nmac.to/wp-content/uploads/2016/12/Adobe.Captivate.png","title":"Adobe Captivate 9.0.2.437 – An efficient elearning authoring software","content":"Adobe Captivate is designed to be the industry-leading elearning authoring software and allows you to rapidly create and maintain interactive eLearning content.   Import your existing Microsoft PowerPoint content and make it more engaging with rich media, application simulations, branching scenarios, and quizzes.   Easily publish to leading SCORM- and AICC-compliant Learning Management Systems and […]"},{"link":"https://nmac.to/blog/webcam-settings-control-2-2-1/","image":"https://nmac.to/wp-content/uploads/2016/12/Webcam-Settings-Control.png","title":"Webcam Settings Control 2.2.1 – Full Camera Adjustment","content":"Freely adjust all webcam’s settings, so you’d look great when using FaceTime, Skype, iStopMotion, or other apps!   Webcam Settings Control allows you customize all settings of your webcam, including exposure time, contrast, saturation, white balance, & many more. And you can adjust zoom, pan, tilt, and camera focus as well. It supports both built-in […]"},{"link":"https://nmac.to/blog/3d-converter-6-3-87/","image":"https://nmac.to/wp-content/uploads/2016/11/3D-Converter.png","title":"3D Converter 6.3.87 – 2D to 3D video conversion","content":"3D Converter – The best 3D Video Converter with most 3D modes.   If you are 3D video lover, you shouldn’t miss this 3D Video Converter.It can convert 2D Video to 3D Effect, 3D video to other 3D modes, 3D video to common 2D video easily and fast. It provides Anaglyph, Side by Side or […]"}]