[{"link":"https://nmac.to/blog/pdf-encrypt-3-0-0/","image":"https://nmac.to/wp-content/uploads/2016/12/PDF-Encrypt.png","title":"PDF Encrypt 3.0.0 – Encrypt your PDF documents","content":"PDF Encrypt is an easy to use utility to encrypt your PDF documents, which can reduce the risk of distributing confidential and sensitive information. Besides, it can also merge multiple PDF files into one PDF and modify the PDF author, subject,title and keywords.   Now, Support macOS Sierra.   Key features: Prevent opening and viewing PDF without entering the correct open password. Prevent printing of […]"},{"link":"https://nmac.to/blog/otomatic-1-1-2/","image":"https://nmac.to/wp-content/uploads/2016/05/Otomatic.png","title":"Otomatic 1.1.2 – The easiest way to get the content you care about","content":"Otomatic aims to help you keep tabs on media content with ease, and download video files both from private and public sources. The app comes with a built-in TV shows collection to which you can subscribe, or you can add new RSSs and set private download sources.   Monitor RSS feeds and get the associated […]"},{"link":"https://nmac.to/blog/mira-1-5-0/","image":"https://nmac.to/wp-content/uploads/2016/12/Mira1.png","title":"Mira 1.5.0 – Control any app with the Apple Remote","content":"With Mira, you can free yourself from the keyboard to streamline your activities. Take control of yor music from across the room, flip through a presentation in front of an audience, or sit back and relax with a movie. Uses for the Apple Remote are limited only by your imagination.   Mira includes built-in support […]"},{"link":"https://nmac.to/blog/hot-simple-image-viewer-1-4-1/","image":"https://nmac.to/wp-content/uploads/2016/08/Hot-Simple-Image-Viewer.png","title":"Hot Simple Image Viewer 1.4.1 – keyboard and mouse controlled image viewer","content":"Hot Simple Image Viewer is keyboard and mouse controlled viewer intended to make viewing of files inside one folder easy.   Inspired by good ol’ Irfan view it uses simply shortcuts: space to move to next file in directory; enter to toggles full screen view; arrow keys to navigate back and forth. cmd+o to open […]"},{"link":"https://nmac.to/blog/disco-dancer-1-3-1/","image":"https://nmac.to/wp-content/uploads/2016/12/Disco-Dancer.png","title":"Disco Dancer 1.3.1 – Simple Scrobbler for Last.fm","content":"Disco Dancer makes it easy to scrobble on Last.fm the music you listen to on iTunes, Spotify, Rdio and also SoundCloud! No fancy player features, Disco Dancer does one job and does it perfectly: scrobble your music to Last.fm, making sure that you never miss a track!   Disco Dancer supports scrobbling from iTunes, Spotify, […]"},{"link":"https://nmac.to/blog/acdsee-pro/","image":"https://nmac.to/wp-content/uploads/2016/12/ACDSee-Pro3.png","title":"ACDSee Pro 3.7.201 – Fast and effective image viewer and browser","content":"ACDSee Pro can accelerate your photography workflow. Manage and view your images with speed and ease. ACDSee Pro is the photography software with the flexibility to adapt to the way you work; helping you optimize every aspect of your workflow.   Unlike catalog-based photo applications, you don’t need to spend valuable time importing files that […]"},{"link":"https://nmac.to/blog/video-editor-enhancer-1-0-35/","image":"https://nmac.to/wp-content/uploads/2016/08/Video.Editor.Enhancer.png","title":"Video Editor Enhancer 1.0.35 – Video editing/video quality enhancer","content":"Video Editor Enhancer does everything to supply you a visual feast by improving video quality better and better. It is the best video editing software to edit your video, enhance the video quality and the viewing experience. It is capable of increasing video resolution, automatically adjusting video brightness and contrast ratio, and removing video noise. […]"},{"link":"https://nmac.to/blog/ifoto-stitcher-2-14-1027/","image":"https://nmac.to/wp-content/uploads/2016/10/iFoto-Stitcher.png","title":"iFoto Stitcher 2.14.1027 – Make Panorama Photo with Ease","content":"Make stunning panoramas with high-resolution images taken by camera, scanner or smartphone, the automatic panorama maker for Mac should be the initial choice.   Auto-Select by Group and auto-stitch make it easy to align images without manually messing around moving photos, automatic exposure leveling and lens shading correction, automatic cropping algorithm to create a stunning […]"},{"link":"https://nmac.to/blog/ifoto-converter-2-3/","image":"https://nmac.to/wp-content/uploads/2016/10/iFoto-Converter.png","title":"iFoto Converter 2.3 – Batch Conversion","content":"iFoto Converter is the ultimate photo converter for most of the formats.   The excellent batch conversion can transform one image or an entire folder of mixed format images to single file format. The advanced algorithm let you instant preview watermarks and captions added to all the photos. What’s more, when you convert RAW to […]"},{"link":"https://nmac.to/blog/ic3d-suite-4-0-6/","image":"https://nmac.to/wp-content/uploads/2016/12/iC3D.png","title":"IC3D SUITE 4.0.6 – All-in-one package design software","content":"iC3D is the first real-time, all-in-one package design software that lets you generate live 3D digital mockups on-the-fly, including cartons, labels, flexibles, bottles, shrink wraps and in-store visualization.   Other software applications frustratingly separate design applications into specific model types. iC3D encompasses all these and more, allowing these elements to be seamlessly combined in the […]"}]