[{"link":"https://nmac.to/blog/video-flow-2-1-3/","image":"https://nmac.to/wp-content/uploads/2013/12/icns.175x175-751.jpg","title":"Video Flow v2.1.3 – Video Edit and Screen Record","content":"You can get online video or online music with Video Flow software. Fire up Video Flow, webpage, or Keynote presentation that you want to appear in your screencast video, and the screen recorder captures everything that happens on your screen while also capturing your video camera, microphone and your computer audio. Video Flow is easy […]"},{"link":"https://nmac.to/blog/translateq-1-1-1/","image":"https://nmac.to/wp-content/uploads/2013/12/icons.175x175-751.png","title":"TranslateQ v1.1.1 – Online translator (Services:Google,Yandex)","content":"Select the text.Use keybindings ctrl+alt (or right alt)for translate.   Supported languages(Google): English, German, Chinese(Simplified), Chinese(Traditional), Spanish, Japanese, Russian, French, Portuguese, Arabic, Korean, Basque, Catalan, Czech, Danish, Dutch, Esperanto, Estonian, Finnish, Galician, Georgian, Greek, Haitian, Creole, Hebrew, Hungarian, Icelandic, Indonesian, Irish, Italian, Latvian, Lithuanian, Macedonian, Malay, Norwegian, Polish, Romanian, Slovak, Slovenian, Swahili, Swedish, Thai, Turk..."},{"link":"https://nmac.to/blog/phone-to-mac-4-4-3/","image":"https://nmac.to/wp-content/uploads/2013/12/30886.jpg","title":"Phone to Mac v4.4.3 – Copy media from an iOS device to your Mac","content":"Phone to Mac lets you easily copy, transfer or rip the music, videos and playlists from any iPod, iPhone, iPad directly into iTunes on any Mac. By decoding the iOS binary database, Phone to Mac rapidly reveals the contents of your device and then lets you choose what to do with the tracks. Play counts, […]"},{"link":"https://nmac.to/blog/screen-shade-1-3/","image":"https://nmac.to/wp-content/uploads/2013/12/icon.175x175-7542.jpg","title":"Screen Shade v1.3 – Control the brightness of your screen","content":"Screen Shade allows you to control the brightness of your screen. This customizable app allows you to place a shade over your screen to reduce the strain on your eyes. Screen Shade will reduce your Mac’s brightness on demand, without any risk to your activities on your computer. Screen Shade was built specifically to save […]"},{"link":"https://nmac.to/blog/moneywiz-1-4-0/","image":"https://nmac.to/wp-content/uploads/2013/12/MoneyWiz.175x175-751.jpg","title":"MoneyWiz v1.4.0 – Personal finance solution","content":"MoneyWiz lets you do more with your money. View all your accounts, budgets and bills in one place. Experience reports on a whole new level. Sync Everything across devices!   Meet MoneyWiz – the personal finance assistant that just works!   HOW IS MONEYWIZ BETTER? Automatically keeps data consistent across multiple devices Gives you beautiful […]"},{"link":"https://nmac.to/blog/eisenpower-1-1-3/","image":"https://nmac.to/wp-content/uploads/2013/12/Eisenpower.175x175-75.jpg","title":"Eisenpower v1.1.3 – Manage and organize your day-to-day tasks","content":"Eisepower is all about saving time and getting more productive. The app provides a 4-quadrant structure for organizing your tasks by importance and urgency, a principle that goes back to Dwight D. Eisenhower, 34th President of the United States. The first of those four sections is for important and also urgent tasks that are done at […]"},{"link":"https://nmac.to/blog/icona-1-2/","image":"https://nmac.to/wp-content/uploads/2013/12/icona.175x175-751.jpg","title":"Icona v1.2 – Create your own icons from image","content":"Icona is a simple App that allows you to create icons from image. You can decide to save the icon or apply it to a folder. Is very easy to use. Drag an image into the Icona window and then drag the folder you want to change. Creating icons has never been so easy. not guarantee […]"},{"link":"https://nmac.to/blog/battery-stats-v1-1-1/","image":"https://nmac.to/wp-content/uploads/2013/12/icon.175x175-7544.jpg","title":"Battery Stats v1.1.1 – Simple Batterry Status Bar","content":"A quick and simple Status Bar app to show you your remaining battery time, either until fully charged or fully depleted. Customise it to show in reverse order and to start at login. WHAT’S NEW Version 1.1.1: Bug fixes and new images to fix distortion issues. REQUIREMENTS OS X 10.6 or later, 64-bit processor ScreenShots […]"},{"link":"https://nmac.to/blog/cefipx-3-10/","image":"https://nmac.to/wp-content/uploads/2013/12/40804.jpg","title":"Cefipx v3.10 – Transfer media from an iOS device to your Mac","content":"Cefipx is an iOS-to-Mac transfer app, an iPhone file browser, and an iPad file explorer. Cefipx transfers music and videos from iPod and iOS devices to your Mac, allowing you to recover your music library. With Cefipx, you can copy all the songs and videos on your iDevice to any folder on your Mac and iTunes […]"},{"link":"https://nmac.to/blog/sentenza-desktop-1-0/","image":"https://nmac.to/wp-content/uploads/2016/03/Sentenza-Desktop.png","title":"Sentenza Desktop 1.0 – Develop native OS X applications using modern web languages","content":"With Sentenza Desktop, build Mac OS X applications with HTML5, CSS3 and JavaScript. Use the APIs library to add advanced features to your project. You will be able to build standalone web applications for Mac OS X (from Snow Leopard to Mountain Lion) and deploy them on the Mac App Store or sell them in […]"}]