[{"link":"https://nmac.to/blog/business-templates-for-pages-3-1-1/","image":"https://nmac.to/wp-content/uploads/2015/07/Business.Mix_.for_.Pages2_.png","title":"Business Templates for Pages 3.1.1 – business templates for Apple Pages","content":"Business Templates gives a boost to the chemistry between you and your clients! Pick up 146 professional and stylish business templates for Apple’s Pages application.   Business Mix Set presents an excellent kit of 146 templates for Pages, from business cards and newsletters to proposals and various project management forms. Some of the templates contain […]"},{"link":"https://nmac.to/blog/bloom-1-0-593/","image":"https://nmac.to/wp-content/uploads/2016/02/Bloom.png","title":"Bloom 1.0.593 – Lightweight, cross-platform, procedural graphics editor","content":"Bloom (was Ormr) is a fast, lightweight, cross-platform procedural graphics editor that lets you tweak any action you have ever performed — organized by layer. In Bloom, everything is numerically adjustable – all the time, long after the initial effect has been applied. You can tweak and adjust every detail to your heart’s delight until […]"},{"link":"https://nmac.to/blog/corporate-templates-business-stationery-3-1-1/","image":"https://nmac.to/wp-content/uploads/2016/09/Corporate-Packs-for-Pages.png","title":"Corporate Templates – Business Stationery 3.1.1 – Collection of professional Pages templates","content":"Develop your professional image and brand identity, save thousands on creative agency fees! Explore a broad range of professionally-designed customizable business stationery templates, easily adapt them to your professional needs!   Corporate Templates – Business Stationery offers templates in convenient packs sorted by style and appearance. Every style pack is a comprehensive collection of stationery […]"},{"link":"https://nmac.to/blog/stasis-2-3-0-6/","image":"https://nmac.to/wp-content/uploads/2016/12/Stasis.png","title":"STASIS 2.3.0.6 – A point-and-click, sci-fi horror adventure game","content":"STASIS is a point-and-click, sci-fi, horror adventure game played from a unique isometric perspective. STASIS intertwines a gruesome narrative with retro adventure gameplay. Combine items, interact with computers and solve puzzles while experiencing the gritty atmosphere.   In the distant future, aboard a seemingly abandoned spacecraft, John Maracheck awakes from stasis. He must push himself […]"},{"link":"https://nmac.to/blog/the-descendant-ep-1-5-3-2/","image":"https://nmac.to/wp-content/uploads/2016/09/The-Descendant.png","title":"The Descendant EP 1-5 3.2 – The end of the world is only the start","content":"THE DESCENDANT is a five part episodic adventure game series where the end of the world is only the start.   After climate change wrecked the planet, a man-made extinction event wiped humankind off the face of the Earth. Only a few thousand ‘descendants of humanity’ were hand-picked to survive the apocalypse, cryogenically suspended in […]"},{"link":"https://nmac.to/blog/solitaire-pro-3-7-2/","image":"https://nmac.to/wp-content/uploads/2016/12/Solitaire-Pro.png","title":"Solitaire Pro 3.7.2 – Modern & stylish version of Solitaire","content":"Take a break from your everyday life with this classic version of Solitaire. Enjoy a modern & stylish version of Solitaire, with the gameplay you know & love from Solitaire for Windows™.   Get hints & undo moves right from the top bar. Toggle sound, auto move & much more under settings.   We have […]"},{"link":"https://nmac.to/blog/super-mov-converter-6-2-9/","image":"https://nmac.to/wp-content/uploads/2015/07/Super.MOV.Converter.png","title":"Super MOV Converter 6.2.9 – Convert any HD video and common video to MOV format","content":"Super MOV Converter lets you convert any HD video and common video to MOV format for playback on QuickTime, Apple TV, iPhone 6/6 plus/5S/5C/5/4S, iPad Air 2/ Air/mini 3/mini 2/mini/4, iPod with absolutely faultless performance. Converting AVCHD videos (M2TS, MTS), HD videos (TS, HD MP4, HD WMV, HD MPG, HD MPEG), and common videos like […]"},{"link":"https://nmac.to/blog/rubbernet-1-2/","image":"https://nmac.to/wp-content/uploads/2016/12/Rubbernet.png","title":"Rubbernet 1.2 – Keeps an eye on your all network-enabled apps running on your Mac","content":"Rubbernet provides a breakdown of per-app network usage, so you can quickly detect apps that phone home, connect to servers without your knowledge, or blame the app that’s slowing down your network.   Features: Real-time network dashboard: Rubbernet provides real-time monitoring so you can keep an eye on the exact state of your live network […]"},{"link":"https://nmac.to/blog/daily-1-8-0/","image":"https://nmac.to/wp-content/uploads/2016/02/Daily.png","title":"Daily 1.8.0 – Time tracking for professionals","content":"Looking for an easy way to get insights in your daily activities? Meet Daily, world’s most convenient time tracking companion for professionals, loved by many due its simplicity. It works by asking what you’re doing in a discrete manner.   Each time Daily asks you what you’re doing, a sample is recorded. Together with other […]"},{"link":"https://nmac.to/blog/ifoto-hdr-2-5-1104/","image":"https://nmac.to/wp-content/uploads/2016/09/iFoto-HDR.png","title":"iFoto HDR 2.5.1104 – Make HDR Photo Effects with Ease","content":"HDR should be a tricky subject to master for photographers. When you merge the images with different exposure to HDR photographs, how to ensure a creative and natural look? iFoto HDR should be the best answer for you to merge HDR photos. It is a super easy HDR program to make awesome results.   When […]"}]