[{"link":"https://nmac.to/blog/snow-white-solitaire/","image":"https://nmac.to/wp-content/uploads/2018/06/Snow.White_.Solitaire.png","title":"Snow White Solitaire. Legacy of Dwarves 2.0 – Casual Adventure Solitaire Game","content":"Help the dwarves find their legacy!! Mix of solitaire, hidden objects and puzzles! Fun story and characters Varied bonuses and helpers 5 colorful worlds and 160 fantastic puzzles Stunning illustrations and delightful music   Dwarves want to find the most powerful weapon that will help them in the fight against trolls. They need to join […]"},{"link":"https://nmac.to/blog/secrets-of-magic/","image":"https://nmac.to/wp-content/uploads/2018/06/Secrets-of-Magic-2.png","title":"Secrets of Magic 2: Witches and Wizards 2.0 – Casual Puzzle Game","content":"After learning the fine art of magic and becoming a true witch, Victoria is ready to go after Agnes and set her parents free. Witches and wizards united in the fight against evil!   Dive into an exciting adventure by matching your way through a magical and dangerous land to defeat the ultimate evil. Grab […]"},{"link":"https://nmac.to/blog/archimedes-eureka/","image":"https://nmac.to/wp-content/uploads/2018/06/Archimedes-Eureka.png","title":"Archimedes Eureka 2.0 – Time Management, Strategy & Simulation Game","content":"The great inventor Archimedes presents his newest and most advanced invention: a large winch powered by the wind. Even Hercules is no match for this mechanism! However, it’s no match against nature as a strong gust of wind destroys the device, which in turn, destroys the entire city of Syracuse.   Can you guide Archimedes […]"},{"link":"https://nmac.to/blog/new-yankee-in-king-arthurs-court/","image":"https://nmac.to/wp-content/uploads/2018/06/New-Yankee-in-King-Arthurs-Court.png","title":"New Yankee in King Arthur’s Court 5 CE 2.0 – Time Management Strategy & Simulation Game","content":"Return to a world of knights and dragons, witches and goblins and swords and magic to save King Arthur from a fate worse than helmet hair! With its refined gameplay, unique challenges and gorgeous visuals, New Yankee in King Arthur’s Court 5 offers the best reasons yet to experience the fantastical adventures of the heroic […]"},{"link":"https://nmac.to/blog/viking-brothers/","image":"https://nmac.to/wp-content/uploads/2014/01/Viking-Brothers4.png","title":"Viking Brothers 4 2.0 – Action game of Viking adventure","content":"Help the Viking Brothers hold their own as a mythological race rises from the bottom of the ocean and threatens to change their world forever!   Having gained the eternal favor of the gods after defeating Loki and his evil plans, Everand and Boromere are looking forward to a well-earned retirement. But then a tsunami […]"},{"link":"https://nmac.to/blog/overload/","image":"https://nmac.to/wp-content/uploads/2018/06/Overload.png","title":"Overload 1.0 – First-Person Sci-fi Action & Shooter Game","content":"Revival Productions is proud to present the ultimate 6-degree-of-freedom shooter, OVERLOAD, from the creators of the classic game Descent. Overload combines intense action with awesome graphics and effects to create the ultimate zero-gravity shooter. Overload features an engaging single-player story campaign, intense survival mode, online multiplayer, VR support, and a variety of customization options to […]"},{"link":"https://nmac.to/blog/startupizer/","image":"https://nmac.to/wp-content/uploads/2017/09/Startupizer2.png","title":"Startupizer 2.3.11 – Advanced login handler","content":"Startupizer is an advanced, yet simple-to-use login-items handler. It greatly enchances login items from your account settings in OS X System Preferences. You can choose among several criteria which determine whether and when a specific item should be started. Different criteria can be freely combined for each item in the login list. This can dramatically […]"},{"link":"https://nmac.to/blog/starcraft-ii/","image":"https://nmac.to/wp-content/uploads/2014/07/Starcraft-II4.png","title":"Starcraft II 4.3.2 – Famous strategy game [UPDATE]","content":"StarCraft II: Wings of Liberty is the sequel to Blizzard Entertainment’s 1998 hit StarCraft, which has been hailed by players and critics worldwide as one of the top real-time strategy games of all time. StarCraft II will once again center on the clash between the protoss, terrans, and zerg, with each side deploying favorite units […]"},{"link":"https://nmac.to/blog/malwarebytes/","image":"https://nmac.to/wp-content/uploads/2017/08/Malwarebytes.png","title":"Malwarebytes 3.2.35.1162 – Adware removal tool","content":"Malwarebytes (was AdwareMedic) helps you get your Mac experience back. Malwarebytes scans for and removes code that degrades system performance or attacks your system. Making your Mac once again your Mac.   What It Does Removes adware, such as Genieo, VSearch, and Vidx Removes malware, including Trojans Scans quickly Simplifies program management through a clean, […]"},{"link":"https://nmac.to/blog/pdf-guru/","image":"https://nmac.to/wp-content/uploads/2017/11/PDF-Guru.png","title":"PDF Guru 3.0.26 – Edit, Read/Annotate PDF files","content":"Fast and clean tabbed style PDF reader & editor, which make reading & editing enjoyable and efficient.   Key features: Tabbed style window; PDF Pages Editing; Provides themes, including night mode; Annotate PDF; Split view; Outline editing; In-document bookmarking; Tabbed style sidebar; Clean and powerful toolbar; Powerful searching capabilities;   Version 3.0.26: Fixed a couple […]"}]