[{"link":"https://nmac.to/blog/music-tube-2-1-0/","image":"https://nmac.to/wp-content/uploads/2016/03/Music-Tube.png","title":"Music Tube 2.1.0 – Online Free Song Player & Playlist Manager for YouTube","content":"Music Tube is the native desktop client for YouTube Music. It plays and organizes music directly from YouTube. In it you can get recommendation for the hottest songs, find tracks you seek, build your personal playlists, and more. Best of all? It lives right in your menu bar and is super easy to control!   […]"},{"link":"https://nmac.to/blog/wav-to-mp3-2-3-0/","image":"https://nmac.to/wp-content/uploads/2016/03/WAV-to-MP3.png","title":"WAV to MP3 2.3.0 – The best WAV to MP3 Converter","content":"WAV to MP3 Converter to convert WAV to MP3. Sometimes you may record some voice audio files with your camera, phones, etc. in WAV format and want to play them on MP3 player or other portable devices, then what will you do? Under this situation, converting WAV to MP3 format could be an ideal solution […]"},{"link":"https://nmac.to/blog/pdf-to-microsoft-word-0-9-1/","image":"https://nmac.to/wp-content/uploads/2016/03/PDF-to-Microsoft-Word.png","title":"PDF to Microsoft Word 0.9.1 – Convert PDF files to Microsoft Word format (.docx)","content":"PDF to Microsoft Word is designed to convert PDF files to Microsoft Word format (.docx). It provides a reliable conversion with 100% accuracy. Drag & Drop files to easily convert them Choose files from finder Easy to use, drop and click convert right away   Version 0.9.1: Minor Bug Fix.   OS X 10.10 or […]"},{"link":"https://nmac.to/blog/ocr-butler-1-2-1/","image":"https://nmac.to/wp-content/uploads/2016/03/OCR-Butler.png","title":"OCR Butler 1.2.1 – Easy image-OCR with multilingual support","content":"OCR Butler is one of the easiest ways to transform text inn images into plain-text files. Just drag-and-drop an image into the OCR Butler screen, or load an image from the File Menu and OCR Butler will instantly recognize the text in the image and convert it into plain text which can be used in […]"},{"link":"https://nmac.to/blog/mapzap-1-0-3/","image":"https://nmac.to/wp-content/uploads/2016/03/MapZap.png","title":"MapZap 1.0.3 – Place maps on your Desktop","content":"With MapZap, you can put maps directly on your desktop. Plus, you can drag photos of family and friends onto your map to associate your favorite people with your favorite places.   Features Desktop Map – Maps are fun to look at and explore. Maps are also beautiful which is why people frame and hang […]"},{"link":"https://nmac.to/blog/display-desktop-1-0/","image":"https://nmac.to/wp-content/uploads/2016/03/Display-Desktop.png","title":"Display Desktop 1.0 – Show desktop with just 1-click","content":"With just 1-click, Display Desktop will display your clean desktop!   Don’t want to let your boss or girlfriend/boyfriend or children or colleagues know what you are doing in your mac? Use Display Desktop to hidden all your activities at that instance, and show them a clear desktop instead.   TIPS: Drag this app to […]"},{"link":"https://nmac.to/blog/samorost-3-1-1-272/","image":"https://nmac.to/wp-content/uploads/2016/03/Samorost.3.png","title":"Samorost 3 1.1.272 – An exploration adventure and puzzle game","content":"Samorost 3 is an exploration adventure and puzzle game from the award-winning creators of Machinarium and Botanicula. It is Amanita Design’s most ambitious experience to date and a loose continuation of the hit indie games Samorost and Samorost 2.   Samorost 3 follows a curious space gnome who uses the powers of a magic flute […]"},{"link":"https://nmac.to/blog/igetter-2-9-3/","image":"https://nmac.to/wp-content/uploads/2016/03/iGetter.png","title":"iGetter 2.9.3 – Download manager and accelerator","content":"iGetter is a powerful, full-featured download manager and accelerator.   iGetter can greatly improve the speed of your downloads using segmented downloading.   In addition it allows auto resume on broken downloads, queue filtering by various criteria, site explorer, history list, scheduling downloads for low traffic periods, auto redial on broken connection, auto hang-up and […]"},{"link":"https://nmac.to/blog/hideandclick-2-0-0/","image":"https://nmac.to/wp-content/uploads/2016/03/HideAndClick.png","title":"HideAndClick 2.0.0 – Hide all current applications and show desktop in a single click","content":"HideAndClick is a tiny application which stays in the menu bar and provides the following features: Show the desktop with one single click Hide all the currently running applications Bring any hidden application to the front   Version 2.0.0: Brand-new UI Real one-click experience: right-click on menubar icon to hide all applications and show desktop. […]"},{"link":"https://nmac.to/blog/disk-space-tab-1-5-1/","image":"https://nmac.to/wp-content/uploads/2016/03/Disk.Space_.Tab_.png","title":"Disk Space Tab 1.5.1 – Access disk drive information from mac menu bar","content":"Disk Space Tab is a menu bar app that shows disk drive information. This includes hard drives, external drives, network drives, DVD’s, CD’s, memory cards, and USB flash drives.   Features: Size information for disk drives, network drives, DVD’s, CD’s, memory cards and USB flash drives Single click eject for DVD’s, CD’s, memory cards and […]"}]