[{"link":"https://nmac.to/blog/clockwork-1-0/","image":"https://nmac.to/wp-content/uploads/2016/10/Clockwork.png","title":"Clockwork 1.0 – A time-bending puzzle-platformer game","content":"Clockwork, set in the great mechanical city of Watchtower, is a story about unlikely friends coming together to try to fix an imperfect world. The city’s mysterious past is questioned when Atto’s trusty pocket watch suddenly wakes up and introduces itself as Milli. Renewed with a sense of purpose, Atto and Milli must explore the […]"},{"link":"https://nmac.to/blog/appnwire-1-2-1/","image":"https://nmac.to/wp-content/uploads/2016/10/appnwire.png","title":"appn’wire 1.2.1 – RSS news reader","content":"appn’wire is your RSS news resource for iPhone, iPod touch, iPad, and Mac apps, app reviews, new and top applications, app updates, app price drops, software, and technology.   Features: View RSS feeds with detailed content, links, and images, or as plain text 69 default feeds included Add as many RSS feeds as you want […]"},{"link":"https://nmac.to/blog/all-docs-1-4-1/","image":"https://nmac.to/wp-content/uploads/2016/10/All-Docs.png","title":"All Docs 1.4.1 – Microsoft Office Edition in OneDrive","content":"All Docs is magic and easy-to-use app help you easier to create Microsoft office 365 documents in OneDrive on your Mac.   Features: Create Word, Excel and PowerPoint documents. Sync documents in OneDrive’s Documents folder to local. Keep track all changes of online documents and automatic update on local. Calendar and manage email with Outlook. […]"},{"link":"https://nmac.to/blog/datagraph-4-1/","image":"https://nmac.to/wp-content/uploads/2014/04/DataGraph.png","title":"DataGraph 4.1 – Simple and powerful graphing program","content":"DataGraph is a powerful and easy to use graphing and charting application. DataGraph minimizes the fuss and frustration associated with creating clean and accurate publication quality graphs and charts. DataGraph also includes powerful function fitting and statistical analysis capabilities, which enables high quality analysis of the data. Import data from files, paste in numbers from […]"},{"link":"https://nmac.to/blog/adobe-cs6-master-collection-ls16/","image":"https://nmac.to/wp-content/uploads/2016/10/cs6.png","title":"Adobe CS6 Master Collection LS16 – Ultimate Adobe design environment","content":"Adobe Creative Suite 6 Master Collection software is the ultimate design environment for realizing your creative vision. Use industry‐leading tools with unlimited creative possibilities, precision, and power to deliver for print, the web, and the silver screen. Build standards‐based websites and applications, design for the latest platforms, and deliver pristine‐quality video in native formats. Intuitive […]"},{"link":"https://nmac.to/blog/tonality-ck-1-4-2/","image":"https://nmac.to/wp-content/uploads/2015/10/Tonality.CK_.png","title":"Tonality CK 1.4.2 – Professional-grade monochrome image editor (was Tonality Pro)","content":"Tonality CK (was Tonality Pro) is the award-winning black-and-white photo software for Mac, and the world’s only monochrome photo editing app, picked as Editor’s Choice by Apple. Tonality CK brings unique, powerful features, and over 150 professional one-click presets that will take your photography to a whole new level of awesomeness. Take advantage of stackable […]"},{"link":"https://nmac.to/blog/city-70s80s90s-2-7/","image":"https://nmac.to/wp-content/uploads/2016/02/City.70s80s90s.png","title":"City 70s80s90s 2.7 – Continuous music of the 70s 80s and 90s.","content":"City 70s80s90s includes the world’s first radio search engine where any radio station, song or artist can be located and played from anywhere in the world.   This Radio City selection brings together the best radio stations that broadcast continuous music of the 70s 80s and 90s.   If you enjoy music from the 70’s, […]"},{"link":"https://nmac.to/blog/backup-gmail-1-9-4/","image":"https://nmac.to/wp-content/uploads/2016/10/BackUp.Gmail_.png","title":"BackUp Gmail 1.9.4 – Create a local backup of your Gmail","content":"BackUp Gmail creates a local backup of your Gmail account. It’s lightweight, silent, and reliable: the easiest way to backup your Gmail account and protect your data.   Features: Access your data whenever and wherever you want Install it and forget about it Is a lightweight menu-bar app that works in background Can personalize how […]"},{"link":"https://nmac.to/blog/ginger-beyond-the-crystal-1-0/","image":"https://nmac.to/wp-content/uploads/2016/10/Ginger.Beyond.the_.Crystal.png","title":"Ginger: Beyond the Crystal 1.0 – 3D adventure platformer game","content":"A world destroyed by a crystal explosion, a mysterious threat hanging over its inhabitants, and a goddess who creates a hero. This is Ginger: Beyond The Crystal.   The towns are devastated and their inhabitants disappeared, but there is still hope. Ginger must reestablish the connection with the goddess by purifying corrupted crystals that have […]"},{"link":"https://nmac.to/blog/clockwork-empires-1-0/","image":"https://nmac.to/wp-content/uploads/2016/10/Clockwork.Empires.png","title":"Clockwork Empires 1.0 – Indie, Simulation & Strategy Game","content":"Take on the role of a Colonial Bureaucrat sent forth by the Clockwork Empire to build a Frontier Colony. Design buildings and their contents from the ground-up to feed the Ravenous Maw of Industry, manage the uniquely unruly population, and make Important Decisions when the Occult Investigator shows up for a surprise inspection. It’s up […]"}]