[{"link":"https://nmac.to/blog/fuzzmeasure-pro/","image":"https://nmac.to/wp-content/uploads/2017/11/FuzzMeasure4.png","title":"FuzzMeasure Pro 4.2 – Measure/graph frequency response of speakers and more","content":"FuzzMeasure Pro is an audio and acoustical measurement application you use to perform, analyze, and produce visually stunning graphs of your measurements. Using FuzzMeasure’s tools, you can easily gather measurements of a home theater system, recording studio, stage, auditorium, raw loudspeaker components, and more.   FuzzMeasure Pro’s design makes a highly complex tool very easy […]"},{"link":"https://nmac.to/blog/skyhill/","image":"https://nmac.to/wp-content/uploads/2018/02/Skyhill.png","title":"SKYHILL 1.1.20 – RPG Survival & Adventure Game","content":"World War III was one cruel tragedy, at least for the others. You seemed to have a quite nice time, hidden in your fancy penthouse at the Skyhill Hotel… Till the impact of a bio-weapon blew away the life you once knew.   Now there are mutants everywhere, and they’re eager to rip you to […]"},{"link":"https://nmac.to/blog/textography/","image":"https://nmac.to/wp-content/uploads/2018/02/Textography.png","title":"Textography 1.0 – Typography + Text Fonts + Photo Effects for Photos","content":"Textography = Text + Photography   “A picture is worth a thousand words.” Add gorgeous and inspirational text to your photos in ways you never thought you could. With Textography, you can: Mask a text box giving it the illusion the text is apart of the image Add a new image layer for your company […]"},{"link":"https://nmac.to/blog/smart-scroll/","image":"https://nmac.to/wp-content/uploads/2015/03/Smart-Scroll.png","title":"Smart Scroll 4.3.7 – Scroll more smoothly, more quickly, and more comfortably","content":"Smart Scroll makes scrolling smoother, faster, and more comfortable.   Features: Scroll Wheel+ & Multi-Touch+: smoother, more comfortable and/or faster scrolling for your trackpad or mouse. Try it! Hover Scroll: just hover the cursor near the top or bottom of a window and relax, no need to keep scrolling! Auto Scroll: read more comfortably with […]"},{"link":"https://nmac.to/blog/droppy/","image":"https://nmac.to/wp-content/uploads/2018/02/DropPy.png","title":"DropPy 1.2.0 – Automate drag-and-drop with Python","content":"DropPy lets you automate anything you can drag-and-drop… with Python. Drop Anything – As long as you can drag something outside your source application, you can use it as input for DropPy. On top of direct interaction being more intuitive, this also gives you a way to access objects that scripts from Terminal are not […]"},{"link":"https://nmac.to/blog/marginnote/","image":"https://nmac.to/wp-content/uploads/2017/05/MarginNote.png","title":"MarginNote X 2.7.11 – Highlight, organize, review, and sync notes and annotations","content":"MarginNote Pro is an in-depth ebook reading and learning, note-taking app for nerds, geeks, and learners. You can easily capture, organize, and review your book annotations and notes. It provides five powerful tools to create multi-dimensional notebooks from fragmented annotations and notes: book margin, hierarchy outline, mind map, hashtags, and flashcards. These tools help to […]"},{"link":"https://nmac.to/blog/tempest/","image":"https://nmac.to/wp-content/uploads/2018/01/Tempest1.png","title":"Tempest – Jade Sea 1.2.0 – Pirate Action RPG Game","content":"Hey Captain! Now that you’ve got the Jolly Roger fluttering in the wind over your ship, you’re ready to rove the seas, take on merchant ships loaded with booty and storm formidable fortresses. Set sail and get your hands on all those legendary treasures that are just waiting for the picking!   When we created […]"},{"link":"https://nmac.to/blog/magic-number/","image":"https://nmac.to/wp-content/uploads/2016/05/Magic-Number2.png","title":"Magic Number 2.8.8 – Intelligent calculator you will enjoy","content":"Magic Number is an intelligent calculator you will enjoy.   A better calculator in every way. A better view of your calculation. More intuitive to enter and edit. Easier for everyday use. More capable for advanced problems.   Seeing is everything: Your calculation is beautifully and mathematically formatted. Everything is easier to understand. You see […]"},{"link":"https://nmac.to/blog/sharpresize/","image":"https://nmac.to/wp-content/uploads/2018/02/SharpResize.png","title":"SharpResize 2.0.2 – Better quality Web thumbnails quickly and easily","content":"SharpResize prepares better thumbnail images, resized uniformly and with a polished look. It automatically makes 2x and 3x versions of the image plus additional custom sizes. It is lightweight, has convenient controls and shortcuts, and produces a more polished result. Now has batch processing. Many ways to grab your image Grab from clipboard Drag to […]"},{"link":"https://nmac.to/blog/home-behind/","image":"https://nmac.to/wp-content/uploads/2018/02/Home-Behind.png","title":"Home Behind 1.2 – 2D RPG Survival & Adventure Game","content":"In Home Behind, you take on the role of a refugee cast out from your homeland by a band of rebels. Your home and the peace you enjoyed has been destroyed, and your family has disappeared. Can you survive the struggle, famine, and sickness to make it to the safety of Europe?   The thoughts […]"}]