[{"link":"https://nmac.to/blog/simple-screen-shade/","image":"https://nmac.to/wp-content/uploads/2016/02/Simple-Screen-Shade.png","title":"Simple Screen Shade 1.3 – Tints the display to help users with sensitive eyes","content":"If you work in a dark room, or in room lit by the sun, or struggle with eye strain and headache, Simple Screen Shade will dim your displays – this way it will care for your health and comfort.   Simple Screen Shade is designed for maximum simplicity and ease of use.   You can […]"},{"link":"https://nmac.to/blog/parkitect/","image":"https://nmac.to/wp-content/uploads/2018/12/Parkitect.png","title":"Parkitect 1.8e – Building & Management Simulation Game","content":"Welcome to Parkitect, where you build and manage the theme parks of your dreams.   Construct your own coasters, design an efficiently operating park that fully immerses your guests in its theming and play through the campaign.   Build Create the perfect park for your guests! Deform the terrain, place water, build structures! With a […]"},{"link":"https://nmac.to/blog/the-colonists/","image":"https://nmac.to/wp-content/uploads/2020/05/The.Colonists.png","title":"The Colonists 1.5.17.1 – Colony Sim Strategy Game","content":"The Colonists is a relaxing settlement building game inspired by classic titles like The Settlers and the Anno series.   Take on a series of individual missions or build your colony unfettered by any constraints in the sandbox mode.   You take control of a team of self-replicating robots built to simulate human civilisation. After […]"},{"link":"https://nmac.to/blog/dysmantle/","image":"https://nmac.to/wp-content/uploads/2021/12/Dysmantle.png","title":"Dysmantle 1.0.3.12 – Open World Survival Game","content":"As you ascend from your shelter after the long long years, a brave new old world awaits you. A world inhabited with nasty and vile creatures. A world with no other human soul to be seen. A world with nature in reigns now. A world that’s about to get even worse.   You need to […]"},{"link":"https://nmac.to/blog/ai-war-2/","image":"https://nmac.to/wp-content/uploads/2019/12/AI-War-2.png","title":"AI War 2 4.006 – Artificial intelligence space strategy game","content":"AI War 2 is a grand strategy/RTS hybrid against a galaxy that has already been conquered by rogue artificial intelligence. It’s also “a sequel to [Arcen’s] enormo-space RTS AI War, which we called ‘one of this year’s finest strategy games’ back in 2009″ (Tom Sykes, PC Gamer)   The most devious and acclaimed artificial intelligence […]"},{"link":"https://nmac.to/blog/realpolitiks-ii/","image":"https://nmac.to/wp-content/uploads/2021/06/Realpolitiks_II.png","title":"Realpolitiks II 1.08 – A streamlined real-time grand strategy game","content":"Lead your people to glory and write a new chapter of history in Realpolitiks II, a real-time grand strategy game where you lead any contemporary nation in an attempt to secure world dominance. The road to supremacy is filled with modern world issues as you manage your nation’s economy, command armies, conduct diplomatic and espionage […]"},{"link":"https://nmac.to/blog/zfuse-pro/","image":"https://nmac.to/wp-content/uploads/2021/06/zFuse-Pro.png","title":"zFuse Pro 1.6.126 – Edit and curate your video","content":"zFuse allows you to edit and curate your video.   Features: Simultaneously open multiple instances Video rotation, you can watch movies lying down Hardware acceleration Media preview in seeking Built-in audio enhancement Multi Soundtrack selection Embedded/External subtitle-track selection Subtitle synchronization Support for external subtitle font selection 0.5x-2.0x playback speed control 0.5x-5.0x zoom screen Can directly […]"},{"link":"https://nmac.to/blog/dash/","image":"https://nmac.to/wp-content/uploads/2017/07/Dash4.png","title":"Dash 6.2.3 – Instant search and offline access to any API documentation","content":"Dash is an API Documentation Browser and Code Snippet Manager. Dash helps you store snippets of code, as well as instantly search and browse documentation for almost any API you might use (for a full list, see the screenshots).   Documentation Browser Features: Offline Documentation: iOS, OS X, Man Pages, ActionScript, Akka, Android, Angular.js, Appcelerator […]"},{"link":"https://nmac.to/blog/cutter/","image":"https://nmac.to/wp-content/uploads/2022/03/Cutter.png","title":"Cutter – Cut & Crop Video 3.0.0 – Video Trimmer & GIF Maker","content":"Easily cut and crop any videos with the most powerful video software. Cutter is the best tool for cutting video into high-quality GIFs. Cut and filter videos more intuitively and efficiently with an easy-to-use interface. Exporting videos in various formats for any device has never been easier and faster.   Cut videos easily and accurately […]"},{"link":"https://nmac.to/blog/sponsorblock-for-youtube/","image":"https://nmac.to/wp-content/uploads/2022/02/SponsorBlock-for-YouTube.png","title":"SponsorBlock for YouTube 4.2 – Skip sponsorships on YouTube","content":"SponsorBlock lets you skip over sponsors, intros, outros, subscription reminders, and other annoying parts of YouTube videos. SponsorBlock is a crowdsourced browser extension that let’s anyone submit the start and end time’s of sponsored segments and other segments of YouTube videos. Once one person submits this information, everyone else with this extension will skip right […]"}]