[{"link":"https://nmac.to/blog/photogrids-for-instagram/","image":"https://nmac.to/wp-content/uploads/2017/06/PhotoGrids-for-Instagram.png","title":"PhotoGrids for Instagram 1.5.6 – Easy Instagram uploads","content":"PhotoGrids for Instagram (was Uploader for Instagram) makes posting photos, pictures, and videos to Instagram super-easy. It makes sharing easy, and you can view comments added to your photos.   Legal Note: PhotoGrids for Instagram is a 3rd-party app, and is not affiliated with Instagram in any way. Instagram and its logo are trademarks of […]"},{"link":"https://nmac.to/blog/kerio-notes/","image":"https://nmac.to/wp-content/uploads/2017/06/Kerio-Notes.png","title":"Kerio Notes 1.0.4 – Clarify thinking, brainstorm, and visualize concepts","content":"Kerio Notes is a great way to clarify thinking, brainstorm and visualize concepts.   Features Capture your ideas Kerio Notes is the best place to lay down ideas or research for writings–experiment with different tools to create beautiful, hand-crafted notes all in one place; it couldn’t be any more perfect for this use Take solid […]"},{"link":"https://nmac.to/blog/sketches-expert/","image":"https://nmac.to/wp-content/uploads/2017/06/Sketches-Expert.png","title":"Sketches Expert 2.0 – Templates for Pages","content":"Capture your most precious memories and relive the best times with unique scrapbooks by Alungu! The Sketches for Pages collection offers 50 quirky and fun scrapbook templates for Apple’s Pages—a great way to preserve and share your photos or give someone a gorgeous gift.   The 50 templates provide a variety of ways to display […]"},{"link":"https://nmac.to/blog/xpert-bundle/","image":"https://nmac.to/wp-content/uploads/2017/06/Xpert-Bundle.png","title":"Xpert Bundle 3.1 – Templates for MS Office","content":"The ultimate helping hand for users of Microsoft Office, Templates for MS Office – Alungu Designs provides you: 262 designs for Microsoft Word, 30 diverse and practical templates for Microsoft Excel, 10 high-quality designs for Microsoft PowerPoint. Save time and achieve the best results with Templates for Office: Documents, Sheets, Slides! All future updates will […]"},{"link":"https://nmac.to/blog/illustration-expert/","image":"https://nmac.to/wp-content/uploads/2017/06/Illustration-Expert.png","title":"Illustration Expert 3.0 – Cliparts, Icons for Document","content":"The Stills for MS Office collection contains 6 sets of high-quality illustrations: Clipart, Objects 3D, Photos, Photo Items, People Clipart, and Traffic Signs. It is the ultimate set of illustrations suitable for any MS Office document that requires color, texture, and authenticity. You will definitely find the right illustration among the 1633 high-quality images, unique […]"},{"link":"https://nmac.to/blog/any-pdf-converter-pro/","image":"https://nmac.to/wp-content/uploads/2017/06/Any-PDF-Converter-Pro.png","title":"Any PDF Converter Pro 3.1.31 – PDF converting software","content":"Any PDF Converter Pro is the best PDF converting software, which can convert any PDF files to multiple documents and images files. You can use this PDF file conversion app to convert scanned PDF to Word (.doc, .docx), Excel (.xlsx, .xls), PowerPoint (pptx), ePub, Rich Text Format (rtf), HTML, TEXT (txt) and more editable document […]"},{"link":"https://nmac.to/blog/expert-bundle-templates-for-keynote/","image":"https://nmac.to/wp-content/uploads/2017/06/Expert-Bundle-Templates-for-Keynote.png","title":"Expert Bundle 3.0 – Templates for Keynote","content":"Create a Professional Slideshow in minutes with 65 creative, elegant, and polished presentation themes for Keynote. This bundle is suitable for business and personal use.   Suite for Keynote – Templates Guru includes 65 high-quality and precise designs for Keynote presentations.   Each theme comprises 20 different master slides, which allows you to choose the […]"},{"link":"https://nmac.to/blog/templates-for-ms-word/","image":"https://nmac.to/wp-content/uploads/2017/06/Templates-for-MS-Word.png","title":"Templates for MS Word 3.0 – Xpert Designs","content":"The collection of 262 easy-to-use templates for creating business and personal documents with MS Word presents a mix of designs, from business proposals and newsletters to books and menus. Every layout – from the prime elegance of text-only pages to the light-hearted fusion of pictures and slogans in the poster templates – features quality design […]"},{"link":"https://nmac.to/blog/gitbar/","image":"https://nmac.to/wp-content/uploads/2017/02/gitbar.png","title":"GitBar 1.2.3 – The menu bar git repository notifier","content":"GitBar will remind you of uncommitted repository. GitBar will watch your local git repositories and smartly notify when you forgot to commit your work. Use GitBar to check your work before ending the day.   How it works: Once the git repository is added to GitBar, it is watched for modification. The state of the […]"},{"link":"https://nmac.to/blog/expert-designs-for-adobe-photoshop-and-indesign/","image":"https://nmac.to/wp-content/uploads/2017/06/Expert-Designs-for-Adobe-Photoshop-and-InDesign.png","title":"Expert Designs 1.1 – Templates for Adobe Photoshop and InDesign","content":"The perfect tool for publishers and advertisers – Templates for Adobe Photoshop and InDesing app provides 200 high-quality templates for PhotoShop and 50 distinctive designs for InDesign. Just choose a template, add your text and photos, make a few adjustments, and save time for other projects.   The 250 fully editable designs include flyers, brochures, […]"}]