[{"link":"https://nmac.to/blog/spriter-7/","image":"https://nmac.to/wp-content/uploads/2016/04/Spriter.png","title":"Spriter 7 – Create 2D game animations using a technique called Modular Animation","content":"Spriter makes it easy for anyone, regardless of experience, to create 2D game animations using a technique called Modular Animation.   Unlike traditional animation which requires each frame to be hand-drawn, Spriter animations are made of individual sprite pieces; these pieces can be rotated, transformed, and tweened along an animation timeline. This allows you to […]"},{"link":"https://nmac.to/blog/itaskx-3-0-5/","image":"https://nmac.to/wp-content/uploads/2016/04/iTaskX3.png","title":"iTaskX 3.0.5 – Microsoft Project-compatible project-management solution","content":"iTaskX3 is a full-featured, MS Project-compatible project-management tool for OS X. It gives you all the tools that sharpens the big picture or rich details about your project without heavy overload or complexity. Effortlessly capture dates and costs, assign, import, or evaluate resources, vary calendars, anticipate slack time or personalize its look, feel, and functionality. […]"},{"link":"https://nmac.to/blog/ghosttile-1-2-0/","image":"https://nmac.to/wp-content/uploads/2014/11/GhostTile.png","title":"GhostTile 1.2.0 – Hide your running applications from the dock","content":"GhostTile lets you hide running applications from Dock in multiple ways: Drag & Drop xSelect from /Applications folder Click icon on Dock Per app config to hide or add menubar item Notification for added Apps’ Dock activities   GhostTile also has multiple ways to quick switch back: Click on menubar Call out Quick Switch window […]"},{"link":"https://nmac.to/blog/epubor-ultimate-3-0-7-9/","image":"https://nmac.to/wp-content/uploads/2016/03/Epubor.Ultimate.png","title":"Epubor Ultimate 3.0.7.9 – Convert eBook formats and remove DRM","content":"Epubor Ultimate lets you convert and remove DRM from eBooks. The software can decrypt and convert eBooks purchased from: Amazon Kindle, Kobo, Sony, Google Play, Barnes, Noble Nook, Smashwords, and even public libraries.   What’s Unique New eBook conversion core developed by Epubor, 5x faster than others Now supports the Kobo DRM version 3.19, which […]"},{"link":"https://nmac.to/blog/the-hit-list-1-1-21/","image":"https://nmac.to/wp-content/uploads/2015/10/The.Hit_.List_.png","title":"The Hit List 1.1.21 – Advanced reminder application","content":"The Hit List manages the daily chaos of your modern life. It’s easy to learn – it’s as easy as making lists. And it’s powerful enough to let you plan, then forget, then act when the time is right.   Your life is complicated enough as it is. The tool to manage your life shouldn’t […]"},{"link":"https://nmac.to/blog/coolorus-1-3-1/","image":"https://nmac.to/wp-content/uploads/2016/04/Coolorus.png","title":"Coolorus 1.3.1 – Color wheel color picker","content":"Coolorus is a color wheel for all Mac apps that use the native Apple color picker. Coolorus aims to greatly improve users’ color-picking workflow. Reduce the mouse clicks to the minimum and help to master the color relationships and the power of the HSV triangle.   Features: Triangle and Square Color Schemes Color Modes Color […]"},{"link":"https://nmac.to/blog/silent-start-1-1-5/","image":"https://nmac.to/wp-content/uploads/2016/04/Silent.Start_.png","title":"Silent Start 1.1.5 – Silence your Mac’s startup chime","content":"Silent Start silences the startup chime on your Mac. It’s the perfect solution when working in an environment where it’s important to be quiet. Nothing to configure, just run Silent Start and have it always available in the menu bar.   Version 1.1.5: New Updated Sparkle framework to 1.14.0 to resolve potential security risk Using […]"},{"link":"https://nmac.to/blog/peeler-1-0-1/","image":"https://nmac.to/wp-content/uploads/2016/04/Peeler.png","title":"Peeler 1.0.1 – Produce artwork with transparent backgrounds & flawless anit-aliased edges","content":"Peeler is a graphics program that can “peel” logos and illustrations off their backgrounds, producing artwork with transparent backgrounds and flawless anit-aliased edges. It is the evolution of our long-time Adobe Photoshop plug-ins “Peel-Off White” and “Peel-Off Black”. Peeler is ideal for repurposing logos, clip art and illustrations with white or black backgrounds and for […]"},{"link":"https://nmac.to/blog/capturer-0-5/","image":"https://nmac.to/wp-content/uploads/2016/04/Capturer.png","title":"Capturer 0.5 – Fast screen video and microphone audio recorder","content":"Capturer – lightweight and fast screen video and microphone audio recorder.   Features: Lightweight and fast Audio capturing Configurable global hotkeys for start and stop recording   OS X 10.7 or later    "},{"link":"https://nmac.to/blog/designbox-1-08-31/","image":"https://nmac.to/wp-content/uploads/2016/04/DesignBox.png","title":"DesignBox 1.08.31 – Image processing software with multiple effects","content":"DesignBox will place at your disposal many tools to speed up your work. Do you feel frustrated, annoyed? Is success your goal? Then you want to use DesignBox to change your image effects, batch resize, rotate, mix a watermark, convert format, make GIF animations, create iOS icons, generate QR code, or draw your shapes as […]"}]