[{"link":"https://nmac.to/blog/nikon-camera-control-pro/","image":"https://nmac.to/wp-content/uploads/2018/11/Nikon-Camera-Control-Pro.png","title":"Nikon Camera Control Pro 2.28.2 – Simplified remote control of many Nikon digital SLRs","content":"Nikon Camera Control Pro enables simplified remote control of many Nikon digital SLR functions from a personal computer, and includes advanced features such as ‘Viewer’ that provide substantial improvements in operation.   Supported cameras: D3, D700, D300, D2 series (D2H, D2X, D2Hs, D2Xs,) D1-series (D1, D1H, D1X), D200, D100, D90, D80, D70 series, (D70, D70s), […]"},{"link":"https://nmac.to/blog/forgiveness-escape-room/","image":"https://nmac.to/wp-content/uploads/2019/05/Forgiveness.png","title":"Forgiveness: Escape Room 1.0 – A series of 7 escape room adventures","content":"“Forgiveness” is a series of 7 escape room adventures for Windows, Mac or Linux! Take the personality test and find out which sin you are guilty of – the room design, the environment and the trials you’ll go through on your escape to freedom will change accordingly!   Two levels of challenge: Normal and Extreme. […]"},{"link":"https://nmac.to/blog/snakeybus/","image":"https://nmac.to/wp-content/uploads/2019/05/Snakeybus.png","title":"Snakeybus 0.1 – Snake through the city streets and avoid crashing into yourself","content":"Snakeybus is a casual arcade game that requires a balance between reflexes and forethought. Weave through the city streets and pick up as many passengers as you can. Drop your passengers at their destinations to cash in. The more people you drop off, the more your bus grows in length. Play smart and avoid crashing […]"},{"link":"https://nmac.to/blog/photoscissors/","image":"https://nmac.to/wp-content/uploads/2017/08/PhotoScissors4.png","title":"PhotoScissors 6.1 – Easily remove backgrounds from photos","content":"PhotoScissors provides an extremely easy way to cut a background an image. Instead of trying to accurately enclose a region with the Lasso or Magic Wand tools in cumbersome professional graphical editors, you quickly mark areas you want to cut out and areas you would like to preserve, and the program automatically does the rest. […]"},{"link":"https://nmac.to/blog/web-storm/","image":"https://nmac.to/wp-content/uploads/2015/12/WebStorm11.png","title":"WebStorm 2019.1.2 – JavaScript, CSS and HTML IDE for Web Development","content":"WebStorm is the smartest JavaScript IDE with CSS and HTML Editor for Web Development, at your fingertips. Navigate through files easily. Use relevant autocompletion for everything in your code. Get notified about code problems on the fly. Complicated language mixtures with HTML markup or SQL inside a JavaScript? Check how a modern IDE such as […]"},{"link":"https://nmac.to/blog/pycharm/","image":"https://nmac.to/wp-content/uploads/2015/12/PyCharm5.png","title":"PyCharm 2019.1.2 – Python IDE with complete set of tools","content":"PyCharm is a Python IDE with complete set of tools for productive development with the Python programming language. In addition, the IDE provides high-class capabilities for professional Web development with the Django framework.   With the release of version 3, PyCharm has been forked into two paths: a free, Open-Source Community Edition; and the commercial, […]"},{"link":"https://nmac.to/blog/intellij-idea/","image":"https://nmac.to/wp-content/uploads/2017/04/IntelliJ-IDEA.png","title":"IntelliJ IDEA 2019.1.2 – Intelligent Java IDE","content":"    IntelliJ IDEA lets you code without a hitch. It practices a non-intrusive, intuitive approach to help you write, debug, refactor, test and learn your code. Thanks to its deep understanding of languages and technologies, IntelliJ IDEA provides a second pair of hands for you when you need them. Playing the game by your […]"},{"link":"https://nmac.to/blog/adobe-photoshop-lightroom/","image":"https://nmac.to/wp-content/uploads/2017/10/Lightroom-CC1.png","title":"Adobe Lightroom CC 2019 2.3 – Import, develop, and showcase volumes of digital images","content":"Adobe Photoshop Lightroom software helps you bring out the best in your photographs, whether you’re perfecting one image, searching for ten, processing hundreds, or organizing thousands.   Create incredible images that move your audience. Experiment fearlessly with state-of-the-art nondestructive editing tools. Easily manage all your images. And showcase your work in elegant print layouts, slide […]"},{"link":"https://nmac.to/blog/clocker/","image":"https://nmac.to/wp-content/uploads/2019/05/Clocker.png","title":"Clocker 1.1.1 – Story Rich Adventure & Puzzle Game","content":"Clocker is a puzzle game about time. It stages a story between a father and daughter using a dual protagonists technique. By controlling two individual characters in turn, you will gradually solve puzzles, push forward the timeline and the adventure. The game features unique time mechanisms, an artistic hand-drawn sketchy style, thought-provoking puzzles and a […]"},{"link":"https://nmac.to/blog/epitasis/","image":"https://nmac.to/wp-content/uploads/2019/05/Epitasis.png","title":"Epitasis 1.0 – A sci-fi exploration puzzle game","content":"Having discovered an ancient portal, you take a leap of faith and suddenly find yourself amidst the remnants of an ancient alien civilization. Cryptic puzzles, forgotten technologies and treasured relics are riddled among the beautiful wilderness that has engulfed the remains of this fallen race.   If you are to learn their secrets, you must […]"}]