[{"link":"https://nmac.to/blog/hash-generator-pro/","image":"https://nmac.to/wp-content/uploads/2017/12/Hash-Generator-Pro.png","title":"Hash Generator Pro 1.0 – Easy hash generator","content":"Hash Generator Pro lets you easily generate hashes for your strings, as you type. Easy-to-use, intuitive interface. Algorithms supported: MD5, SHA-1, SHA-256, and SHA-512.   Version 1.0: Initial release   Intel, 64-bit processor OS X 10.10 or later    "},{"link":"https://nmac.to/blog/favorite-text/","image":"https://nmac.to/wp-content/uploads/2017/02/Favorite-Text.png","title":"Favorite Text 1.9 – Snippet, clipboard, password, and secret note manager","content":"Favorite Text lets you save time and be more productive. Insert a snippet into another application in one click. Insert login and password in the registration form in one click. Create a new Note and write down important thoughts and ideas. Turn on “Tracking clipboard” and you can always go back to the clipboard history. […]"},{"link":"https://nmac.to/blog/contour/","image":"https://nmac.to/wp-content/uploads/2017/12/Contour.png","title":"Contour 2.1.2 – Story development system streamlines movie outlining process","content":"Contour was developed in collaboration with Emmy Award-nominated Jeffrey Alan Schechter; Contour is a proven, fill-in-the blanks story development system that has generated millions of dollars worth of writing assignments and script sales. The software uses the same character-based structure that most every blockbuster movies uses to create well-written stories from Fade In to Fade […]"},{"link":"https://nmac.to/blog/f-bar/","image":"https://nmac.to/wp-content/uploads/2017/11/F-Bar.png","title":"F-Bar 2.0.2 – Manage Laravel Forge servers","content":"F-Bar lets you manage your Laravel Forge servers from your menu bar.   Version 2.0.2: Fixed Deploy dialog could appear behind the current window Fix an annoying warning Minor bug fixes   Intel, 64-bit processor OS X 10.10 or later Laravel Forge account    "},{"link":"https://nmac.to/blog/disk-sensei/","image":"https://nmac.to/wp-content/uploads/2017/10/Disk-Sensei1.png","title":"Disk Sensei 1.6.3 – Advanced disk-performance tool","content":"Meet Disk Sensei, the most advanced disk performance tool for Mac. We have created a Swiss-Army knife for your Mac, with powerful features to monitor, maintain, and enhance storage performance and utilization. Disk Sensei is the world’s first software of its kind. With a strong focus on clean design and easy-to-use features, it is an […]"},{"link":"https://nmac.to/blog/super265/","image":"https://nmac.to/wp-content/uploads/2017/12/Super265.png","title":"Super265 1.0.9 – Quick video conversion to H265 format","content":"Super265 converts your video to H265. Reduce the file size of your videos without loss of quality: you can easily reduce file size by a factor of 2 or 3 without sacrificing quality Put many more videos on your portable media player Uses all of your computer’s processing power when converting Highest quality converter Extremely […]"},{"link":"https://nmac.to/blog/superstring-pro/","image":"https://nmac.to/wp-content/uploads/2017/01/Superstring-Pro-2.png","title":"Superstring Pro 2.9.81 – Create stunning lyric videos in minutes","content":"Superstring Pro lets you create stunning lyric videos in minutes. It’s never been easier to create a great lyric video.   Get started quickly in a few simple steps: Select a song for which you want to create a lyric video Automatically find lyrics from ID3 tags Align the timing of lyrics by dragging Customize […]"},{"link":"https://nmac.to/blog/acrok-video-converter-ultimate/","image":"https://nmac.to/wp-content/uploads/2017/12/Acrok-Video-Converter-Ultimate.png","title":"Acrok Video Converter Ultimate 5.2.90.903 – Blu-ray/DVD/HD conversion software","content":"Acrok Video Converter Ultimate for Mac is the best and easy-to-use Blu-ray/DVD/HD conversion software. With it, you can easily convert any Blu-ray or DVD disc to all popular video formats like MP4, AVI, MKV, WMV, MOV, FLV, M4V, etc., and Blu-ray/DVD ISO file or folder file is also supported. What’s more, all HD video formats […]"},{"link":"https://nmac.to/blog/publisher-master/","image":"https://nmac.to/wp-content/uploads/2017/04/Publisher-Master.png","title":"Publisher Master 1.4.4 – Easy and powerful graphic design and desktop publishing","content":"Publisher Master is a full-featured and easy-to-use platform for creating any kind of design for your business or home life. With Publisher Master, you can make posters, flyers, menus, brochures, greeting cards, booklets, pamphlets, business cards, and much more. The design possibilities are endless.   Graphic design and page layout don’t need to be complicated […]"},{"link":"https://nmac.to/blog/membrane-pro/","image":"https://nmac.to/wp-content/uploads/2017/01/Membrane-Pro.png","title":"Membrane Pro 1.2.0 – Create your own album artwork","content":"Membrane Pro lets you create your own absolutely beautiful album artwork easily, in just minutes.   Choose a template – Get started quickly with a wide selection of predesigned templates for album artworks. Edit text and graphics – Edit texts and graphics of your template in our easy-to-use tools. It’s all click-and-drag, so anyone can […]"}]