[{"link":"https://nmac.to/blog/tonality-ck-1-4-0/","image":"https://nmac.to/wp-content/uploads/2015/10/Tonality.CK_.png","title":"Tonality CK 1.4.0 – Professional-grade monochrome image editor (was Tonality Pro)","content":"Tonality CK (was Tonality Pro) is the award-winning black-and-white photo software for Mac, and the world’s only monochrome photo editing app, picked as Editor’s Choice by Apple. Tonality CK brings unique, powerful features, and over 150 professional one-click presets that will take your photography to a whole new level of awesomeness. Take advantage of stackable […]"},{"link":"https://nmac.to/blog/snapheal-ck/","image":"https://nmac.to/wp-content/uploads/2015/10/Snapheal.CK_.png","title":"Snapheal CK 1.5 – Remove unwanted objects and people from your photos","content":"Snapheal CK (was Snapheal Pro) is the world’s fastest and easiest tool for the removal of unwanted objects and people from your photos.   For a great price you get amazing tools and features: 3 modes for object removal: Get rid of wires, signs, scratches, trash and any other objects in minutes. Proprietary technology for […]"},{"link":"https://nmac.to/blog/intensify-ck-1-2-0/","image":"https://nmac.to/wp-content/uploads/2015/10/Intensify-CK.png","title":"Intensify CK 1.2.0 – Create clarity and intensity in your photos (was Intensify Pro)","content":"Intensify CK (was Intensify Pro) lets discerning photographers of all skill levels create powerful photographic images with unprecedented drama and detail. Precise control of contrast, structure, detail and sharpening across different tonal ranges delivers high quality results every time.   Special algorithms to prevent image artifacts, image layer stacking with opacity control, dozens of professionally […]"},{"link":"https://nmac.to/blog/seasons-1-3-4/","image":"https://nmac.to/wp-content/uploads/2015/06/Seasons.png","title":"Seasons 1.3.4 – A beautiful app to explore, in a fun way, what to watch in TV","content":"Of course you will want to track your favourite TV programmes too and this app will help you a lot on this. But tracking TV programmes is just the beginning: discover it yourself!   (Soon there will be versions for iPad and iPhone too, so you can automatically synchronise between your devices the TV shows […]"},{"link":"https://nmac.to/blog/designs-for-mail-3-3/","image":"https://nmac.to/wp-content/uploads/2014/11/Designs-for-Mail2.png","title":"Designs for Mail 3.3 – 100+ beautiful templates for Apple’s Mail","content":"Designs for Mail brings you a diverse collection of templates for creating customized email messages in Apple Mail.    Choose a lively seasonal template for a family newsletter. Or select a sharp, sophisticated design for a business proposal. Designs for Mail’s selection is constantly expanding, so you’ll always have access to the latest templates.   […]"},{"link":"https://nmac.to/blog/super-refocus-1-5-1/","image":"https://nmac.to/wp-content/uploads/2015/10/Super.Refocus.png","title":"Super Refocus 1.5.1 – Super Refocus professionally adds focus and depth to your Photos","content":"Super Refocus easily defines a focus area and achieves lens blur, motion blur effects. Super Refocus extends filter and lens functionality beyond your camera and allows you to adjustable controls to add custom focus options to make any photo stand-out. Expensive camera lenses or post-processing software is not required nor are advanced image processing skills. […]"},{"link":"https://nmac.to/blog/milk-2-3-3/","image":"https://nmac.to/wp-content/uploads/2015/08/Milk.png","title":"Milk 2.3.3 – Desktop client for Tumblr","content":"Everything you love about Tumblr, from the comfort of your desktop. Work your way through your dashboard, search tags, post and reblog without any interruptions or contextual switch. Milk offers a distraction-free reading experience to suit to your taste. And it looks great in full screen.   Bird’s Eye View Break through the surface noise […]"},{"link":"https://nmac.to/blog/datum-7-0/","image":"https://nmac.to/wp-content/uploads/2015/05/Datum.png","title":"Datum 7.0 – Full featured SQLite database manager","content":"Datum is a full featured SQLite database manager. It is light weight and blazing fast. It has all the tools to help you be a SQLite master as soon as you launch the app. Instant loading and editing. Fast, powerful, complete. It’s the most powerful SQLite manager in the App Store.   Features include: Easy […]"},{"link":"https://nmac.to/blog/airbeam-pro-2-1/","image":"https://nmac.to/wp-content/uploads/2015/08/AirBeam-Pro.png","title":"AirBeam Pro 2.1 – Monitor cameras on your iPhone or iPad","content":"AirBeam allows you to watch on your Mac what the cameras of your iPhones, iPods or iPads see.It receives high resolution video in realtime and with up to 30 frames per second from any number of iPhones, iPods or iPads with a camera on a WiFi network – even from multiple devices simultaneously.   AirBeam […]"},{"link":"https://nmac.to/blog/tab-launcher-2-8-3/","image":"https://nmac.to/wp-content/uploads/2013/12/Tab-Launcher.png","title":"Tab Launcher 2.8.3 – Clean up and organize the Dock","content":"The idea of Tab Launcher is not to replace the system’s dock, but to help keep it clean, with only the applications that are currently running.   By removing all the application from the dock and organizing them on tabs, you can quickly find and run any application you want.   Apart from that, you […]"}]