[{"link":"https://nmac.to/blog/subethaedit-4-0-2/","image":"https://nmac.to/wp-content/uploads/2014/07/SubEthaEdit.png","title":"SubEthaEdit 4.0.2 – Collaborative text editing using Bonjour","content":"SubEthaEdit… Wouldn’t it be great to edit the same document, live, in realtime, together with everyone in your group? With SubEthaEdit you can. The idea of collaborative editing has been researched for years, with notable results. But now for the first time it has been implemented in a way you actually want to use: While […]"},{"link":"https://nmac.to/blog/gif-animator-1-0/","image":"https://nmac.to/wp-content/uploads/2014/07/GIF-Animator.png","title":"GIF Animator 1.0 – Create animations, avatars, banners and userpics","content":"GIF Animator is Mac user’s best choice for creating amazing animations, avatars, banners and userpics. With this app you can easily convert Video to GIF, or create GIF animation from set of images with a few clicks.   Key features: Compiling animation from imported frames Importing frames from: video files, PSD layers, animated images, static […]"},{"link":"https://nmac.to/blog/subethaedit-4-0-1/","image":"https://nmac.to/wp-content/uploads/2014/07/SubEthaEdit.png","title":"SubEthaEdit 4.0.1 – Collaborative text editing using Bonjour","content":"SubEthaEdit… Wouldn’t it be great to edit the same document, live, in realtime, together with everyone in your group? With SubEthaEdit you can. The idea of collaborative editing has been researched for years, with notable results. But now for the first time it has been implemented in a way you actually want to use: While […]"},{"link":"https://nmac.to/blog/istudiez-pro-1-2-4/","image":"https://nmac.to/wp-content/uploads/2014/06/iStudiez.Pro_.png","title":"iStudiez Pro 1.2.4 – Student planner with iOS syncing","content":"iStudiez Pro is a student planner with iOS syncing.   A student’s life is a dizzying mix of activity and just plain craziness! Take charge of your schedule and put iStudiez Pro to work for you! Take advantage of iStudiez Pro easy navigation and never miss another course, lecture and lab, track tasks and deadlines, […]"},{"link":"https://nmac.to/blog/persona-1-1-1/","image":"https://nmac.to/wp-content/uploads/2014/07/persona.png","title":"Persona 1.1.1 – Tool to help develop characters while writing","content":"Persona is an innovative character development tool for fiction writers. Readers long for engrossing, character-driven narratives, but even the most experienced storytellers struggle to create strong, compelling characters. Persona is a unique and inspiring app that helps you organize and centralize your character data. Categorize characters by archetypes, fill in crucial background data, and more. […]"},{"link":"https://nmac.to/blog/file-buddy-10-0-3/","image":"https://nmac.to/wp-content/uploads/2014/07/File.Buddy_.png","title":"File Buddy 10.0.3 – File management utility","content":"File Buddy is the Swiss Army knife of Mac file utilities. First released in 1993, File Buddy features a wealth of functionality and powerful features that allow you to access that functionality quickly and easily. In addition to File Buddy’s normal functionality it adds several commands to Finder’s Services and contextual menus and allows the […]"},{"link":"https://nmac.to/blog/universal-type-server-4-2-0/","image":"https://nmac.to/wp-content/uploads/2014/07/Universal-Type-Server.png","title":"Universal Type Server 4.2.0 – Large-scale font management","content":"Universal Type Server 4 Centralize, organize, and distribute your entire font library. With the exceptional font access and license compliance of this font server, everyone on your team stays creative and productive.   Sync Your Font Library Across the Team No matter the size of your team, quantity of fonts in your collection, or physical […]"},{"link":"https://nmac.to/blog/print-window-5-1/","image":"https://nmac.to/wp-content/uploads/2014/07/Print.Window.png","title":"Print Window 5.1 – Print folder listings from the Finder","content":"Print Window offers the ability to print a file listing directly from within the Mac OS X Finder. No more taking screenshots of windows or settling for text-only printouts of filenames only. Print Window provides the works: icons, file information, sorting and so much more!   Version 5.1: Added ability to save directly to a […]"},{"link":"https://nmac.to/blog/music-recorder-1-1-2/","image":"https://nmac.to/wp-content/uploads/2014/07/Music-Recorder.png","title":"Music Recorder 1.1.2 – An easy-to-use and beautiful audio recorder","content":"Music Recorder is an easy-to-use and beautiful audio recorder which empowers you the ability to record computer audio, microphone and other audio input device.   Expect Lossless Quality Whatever it is, as long as you can hear online, you could record it in 1:1 quality. Without worrying about waiting for endless buffering, it helps cut […]"},{"link":"https://nmac.to/blog/isonics-1-7-1/","image":"https://nmac.to/wp-content/uploads/2014/04/iSonics.png","title":"iSonics 1.7.1 – Convert audio files between formats","content":"iSonics makes it easy to convert any audio format and CDs to all popular audio formats: MP3, MP2, AAC, FLAC, ALAC, WMA, OGG Vorbis, AC3, and WAV.   It handles metadata with ease and even enables you to change metadata, including automatically downloading cover pictures.   As a bonus you can import CDs and convert […]"}]