[{"link":"https://nmac.to/blog/megapack-for-microsoft-office-3-0/","image":"https://nmac.to/wp-content/uploads/2014/08/MegaPack.for_.Microsoft.Office.png","title":"MegaPack for Microsoft Office 3.0 – Templates for Word Excel Powerpoint","content":"MegaPack for Microsoft Office: Templates for Word Excel Powerpoint is the ultimate bundle package providing creative designs and templates for Microsoft Office® (see technical requirements below).   WORD Get the tools to create great-looking Word documents.   Quickly browse through the template categories, from annual reports and magazines, newspapers and datasheets, business cards and letterhead, […]"},{"link":"https://nmac.to/blog/kings-bounty-the-legend/","image":"https://nmac.to/wp-content/uploads/2014/08/Kings-Bounty-The-Legend.png","title":"King’s Bounty: The Legend 1.7.1 – RPG Strategy Game On Mac","content":"King’s Bounty: The Legend is an adventure RPG with Turn-based Strategy battles. In a fairy tale fantasy world of fearless knights, evil mages, wise kings and beautiful princesses the player controls a hero. Leading their character through the game world, exploring it, commanding armies in battle and accomplishing various quests can mean great reward or […]"},{"link":"https://nmac.to/blog/template-design-for-keynote-1-3/","image":"https://nmac.to/wp-content/uploads/2013/11/Icon.175x175-75.png","title":"Template Design for Keynote 1.3 – Endearing keynote template","content":"Lovely theme template, it is a useful tool.   There are 66 high-quality templates.   Whether you work, study, or entertainment, celebration, this product will bring you convenience and happiness.   We carefully crafted theme templates, quality assurance, but it is certainly affordable price.   We will continue to update and improve the latter. Stay […]"},{"link":"https://nmac.to/blog/stills-2-6/","image":"https://nmac.to/wp-content/uploads/2014/08/Stills.png","title":"Stills 2.6 – Set of more than 1,700 clip art images for presentations","content":"Stills is an ultimate set of 1,733 illustrations appropriate for any Pages or Keynote document that requires color, texture and authenticity. It contains 100 high-quality clip art images, 100 illustrations images, 417 high-quality photos (1024 x 768 pixels), 200 photo items with transparent backgrounds, 300 People clip art, 399 realistic objects rendered in 3D and […]"},{"link":"https://nmac.to/blog/arma-tactics/","image":"https://nmac.to/wp-content/uploads/2014/08/Arma-Tactics.png","title":"Arma Tactics 1.2741 – A turn-based close-combat strategy game","content":"Arma Tactics is a turn-based close-combat strategy game, where you take control of a four-member Special Forces team. There are no given strategies, rails to move on, or paths to follow; it‘s up to you to decide how you will play through both the story-driven missions and generated missions with randomized objectives. Whether using stealth […]"},{"link":"https://nmac.to/blog/youtube-hunter-5-4-8/","image":"https://nmac.to/wp-content/uploads/2014/08/YouTubeHunter.png","title":"YouTube Hunter 5.4.8 – Download and convert YouTube videos","content":"YouTubeHunter is a video downloader and converter.   It takes only seconds to find and download videos from YouTube, Vimeo, DailyMotion, VEVO and others. YouTubeHunter downloads videos 15x faster than real time playing and supports simultaneous downloads. YouTubeHunter has built-in search and preview capabilities. Get video by URL feature is available. YouTubeHunter keeps subtitles for […]"},{"link":"https://nmac.to/blog/spillo-1-1/","image":"https://nmac.to/wp-content/uploads/2014/08/Spillo.png","title":"Spillo 1.1 – Take full control over your bookmarks on Pinboard","content":"Spillo is a powerful, beautiful and amazingly fast Pinboard client. Spillo lets you browse and organize your bookmarks in a stunning modern interface. Spillo also makes creating a bookmark from anywhere on your Mac as convenient as possible.   A beautiful interface Spillo has a beautiful modern interface that feels just right at home on […]"},{"link":"https://nmac.to/blog/youtube-hunter-5-4-7/","image":"https://nmac.to/wp-content/uploads/2014/08/YouTubeHunter.png","title":"YouTube Hunter 5.4.7 – Download and convert YouTube videos","content":"YouTubeHunter is a video downloader and converter.   It takes only seconds to find and download videos from YouTube, Vimeo, DailyMotion, VEVO and others. YouTubeHunter downloads videos 15x faster than real time playing and supports simultaneous downloads. YouTubeHunter has built-in search and preview capabilities. Get video by URL feature is available. YouTubeHunter keeps subtitles for […]"},{"link":"https://nmac.to/blog/speaking-ringtone-maker-1-3-0/","image":"https://nmac.to/wp-content/uploads/2014/08/Speaking.Ringtone.Maker_.png","title":"Speaking Ringtone Maker 1.3.0 – Create custom, spoken ringtones","content":"Speaking Ringtone Maker lets you create custom, spoken ringtones, one for every person in your Contacts app. Imagine your iPhone speaking the name of who’s calling! You’ll always know who’s calling you, even when your iPhone is across the room! Easy to use interface with 3 different options for creating your spoken ringtones. Your whole […]"},{"link":"https://nmac.to/blog/slicy-1-1-7/","image":"https://nmac.to/wp-content/uploads/2013/12/App.175x175-751.png","title":"Slicy 1.1.7 – Turn PSD elements into images for the Web and apps","content":"Slicy (was Layer Cake) turns PSD elements into images for the Web and for Apps, simply name your layer groups once and let Slicy do its magic. Bye bye, “Save for Web/Devices”. Hello, boost in productivity and creativity!   Designers and Developers, rejoice — exporting is no longer a workflow killer. Name layer groups like […]"}]