[{"link":"https://nmac.to/blog/ifoto-hdr-2-6-1124/","image":"https://nmac.to/wp-content/uploads/2016/09/iFoto-HDR.png","title":"iFoto HDR 2.6.1124 – Make HDR Photo Effects with Ease","content":"HDR should be a tricky subject to master for photographers. When you merge the images with different exposure to HDR photographs, how to ensure a creative and natural look? iFoto HDR should be the best answer for you to merge HDR photos. It is a super easy HDR program to make awesome results.   When […]"},{"link":"https://nmac.to/blog/business-templates-for-ms-word-1-0/","image":"https://nmac.to/wp-content/uploads/2017/01/Business-Templates-for-MS-Word.png","title":"Business Templates for MS Word 1.0 – Hundreds of professional MS Word templates","content":"Convince your clients, impress your peers – Business Templates for MS Word by Jumsoft makes creating gripping Microsoft Word documents easier and quicker than ever before! Hundreds of professional templates and near-infinite customization opportunities make it the most powerful tool available to unleash your creativity in business documents.   Business Templates for MS Word offers […]"},{"link":"https://nmac.to/blog/the-uncertain-episode-1-the-last-quiet-day-1-0-7/","image":"https://nmac.to/wp-content/uploads/2017/01/The-Uncertain.png","title":"The Uncertain: Episode 1 – The Last Quiet Day 1.0.7 – Adventure Sci-fi Robots Game","content":"Imagine making moral choices in a world devoid of morality. Logic rules this world, and every decision is just a set of zeros and ones. Most concepts take a whole new meaning, and some get completely abolished. Luckily reasonable beings, even if not human, always have a choice.   The Uncertain: Episode 1 – The […]"},{"link":"https://nmac.to/blog/planets-1-1/","image":"https://nmac.to/wp-content/uploads/2017/01/Planets.png","title":"Planets 1.1 – Live Solar System Wallpaper","content":"Place all planets from our Solar System right on your desktop and enjoy an amazing interactive Solar System with a calendar, clock and iCal task list.   Can you imagine what it looks like to look at the Solar System from Mars or Uranus? Pick and place a planet at the center of the system […]"},{"link":"https://nmac.to/blog/noimgdata-1-4-2/","image":"https://nmac.to/wp-content/uploads/2017/01/NoIMGdata.png","title":"NoIMGdata 1.4.2 – Removes GPS metadata from photos","content":"NoIMGdata lets you protect your privacy!   Did you know most pictures taken with modern cameras and phones also include GPS information? This allows anyone who knows how to view EXIF metadata to accurately pin-point where you were when each picture was taken, and even know what direction you were facing!   This app easily […]"},{"link":"https://nmac.to/blog/dragon-responsive-email-designer-2-48/","image":"https://nmac.to/wp-content/uploads/2017/01/Dragon-Responsive-Email-Designer.png","title":"Dragon Responsive Email Designer 2.48 – Create emails with responsive design","content":"Dragon Responsive Email Designer helps you create beautiful emails for any device! Intuitive drag-and-drop designer with zero coding, fabulous responsive emails made simple.   Features Intuitive drag-and-drop designer: Create and send beautiful responsive emails in minutes. Zero coding required. Simple and powerful: Perfect for both beginners and experienced email designers. Jump start with any of […]"},{"link":"https://nmac.to/blog/alarm-clock-gadget-plus-1-9/","image":"https://nmac.to/wp-content/uploads/2017/01/Alarm.Clock_.Gadget.Plus_.png","title":"Alarm Clock Gadget Plus 1.9 – Clock with Alarm and Calendar","content":"Alarm Clock Gadget+ is a large custom clock widget with a lot of features.   Are you looking for something easy to use yet powerful and beautiful? Alarm Clock Gadget+ is designed for you!   Features: Alarm clock manager and calendar Beautiful and customizable clock faces Information and tasks from iCal Support for multiple calendars Work and […]"},{"link":"https://nmac.to/blog/smoothcursor-2-6-1/","image":"https://nmac.to/wp-content/uploads/2017/01/SmoothCursor.png","title":"SmoothCursor 2.6.1 – Custom mouse and trackpad acceleration","content":"SmoothCursor is a menu-bar application that provides separate controls for customizing the mouse and trackpad accelerations. It is the perfect tool to use in combination with drawing applications and FPS games!   User-definable Hotkey: One of the most relevant features in version 2.0 is the ability to alternate between 2 profiles using an user-definable HotKey, […]"},{"link":"https://nmac.to/blog/deepclock-1-11-2/","image":"https://nmac.to/wp-content/uploads/2017/01/deepClock1.png","title":"deepClock 1.11.2 – Decorate your desktop with this analog clock","content":"deepClock is a magnificent analogue clock which will decorate any desktop. It isn’t just an ordinary clock. It’s a magnificent decoration for any desktop. deepClock doesn’t burden the desktop with unnecessary information. The program just displays a beautiful and unique clock which you can place anywhere.   You can adjust the app as much as […]"},{"link":"https://nmac.to/blog/calcbot-1-0-6/","image":"https://nmac.to/wp-content/uploads/2015/02/Calcbot.png","title":"Calcbot 1.0.6 – Intelligent calculator and unit converter","content":"Calcbot is an intelligent calculator and unit converter for the rest of us. Featuring an easy-to-read history tape, expression view, intuitive conversion, and much more!   Features History Tape – Every calculation you enter gets saved to the history tape and optionally sent to your clipboard for quick pasting. Refer to calculations later or send […]"}]