[{"link":"https://nmac.to/blog/data-rescue-4-2-2/","image":"https://nmac.to/wp-content/uploads/2014/03/Data.Rescue.png","title":"Data Rescue 4.2.2 – Powerful hard drive data recovery solution","content":"Data Rescue is a robust and reliable data recovery solution for your Mac. Data Rescue has a 5-star average rating on the Mac App Store a 4.5 star rating on Amazon, in addition to over 150 industry awards for best-in-class Mac recovery since it’s debut in 2002. Works on all Mac hard drives even if […]"},{"link":"https://nmac.to/blog/quickphotos-for-google-1-0-1/","image":"https://nmac.to/wp-content/uploads/2016/06/QuickPhotos-for-Google.png","title":"QuickPhotos for Google 1.0.1 – Upload, view and download photos on Google cloud","content":"QuickPhotos for Google is a Mac application from where users can upload, view and download photos on Google cloud. This app will give you a faster access to your Google photos inside a compact app layout from where users will be able to upload and download new photos, create and share new albums, make animations […]"},{"link":"https://nmac.to/blog/counter-strike-go/","image":"https://nmac.to/wp-content/uploads/2013/12/steam1.png","title":"Counter-Strike: Global Offensive 1.1 – Action, Shooter Game for mac [FIX]","content":"Counter-Strike: Global Offensive (CS: GO) will expand upon the team-based action gameplay that it pioneered when it was launched 12 years ago. CS: GO features new maps, characters, and weapons and delivers updated versions of the classic CS content (de_dust, etc.). In addition, CS: GO will introduce new gameplay modes, matchmaking, leader boards, and more.   […]"},{"link":"https://nmac.to/blog/enolsoft-epub-creator-2-2-0/","image":"https://nmac.to/wp-content/uploads/2016/06/Enolsoft.EPUB_.Creator.png","title":"Enolsoft EPUB Creator 2.2.0 – Create EPUB from PDF/DOCX/PPTX/ RTF/Text/Image/CHM","content":"Enolsoft EPUB Creator is a powerful yet simple EPUB Converter for you to create EPUB eBooks from your DOCX, HTML, CHM, Images, RTF and PDF documents.   With Enolsoft EPUB Create for Mac you get Create industry standard EPUB format from MS Word (.docx), PDF (even encrypted PDFs), HTML,Text, RTF,RTFD, CHM, and PNG, JPEG, GIF, […]"},{"link":"https://nmac.to/blog/counter-strike-2-0/","image":"https://nmac.to/wp-content/uploads/2016/06/Counter-Strike.png","title":"Counter-Strike 2.0 – Play the world’s No. 1 online action game [WineSkin]","content":"Counter-Strike – Play the world’s number 1 online action game. Engage in an incredibly realistic brand of terrorist warfare in this wildly popular team-based game. Ally with teammates to complete strategic missions. Take out enemy sites. Rescue hostages. Your role affects your team’s success. Your team’s success affects your role.   Version 2.0: Fix El […]"},{"link":"https://nmac.to/blog/contacts-cleaner-1-7-3/","image":"https://nmac.to/wp-content/uploads/2016/06/Contacts.Cleaner.png","title":"Contacts Cleaner 1.7.3 – Fixes Address Book and Apple Sync Services issues","content":"Contacts Cleaner analyzes, reports, and fixes dozens of problems with Address Book and Apple Sync Services problems ranging from the obvious, such as duplicated contacts, to the subtle, such as invalid characters and poorly formatted contact names.   Your contacts are the center of your personal social network, and as such are often synchronized among […]"},{"link":"https://nmac.to/blog/timing-1-7/","image":"https://nmac.to/wp-content/uploads/2014/09/Timing.png","title":"Timing 1.7 – Discover how you spend time on your Mac","content":"Timing is the best way to keep track of the time you spend with your Mac. Find out where your time goes — without ever having to start a timer again!   Timing automatically tracks which documents you are editing, which applications you use, and the domains of the websites you visit. You’ll never have […]"},{"link":"https://nmac.to/blog/hear-1-2-4/","image":"https://nmac.to/wp-content/uploads/2014/05/Hear.png","title":"Hear 1.2.4 – Improves audio quality and adds audio options system-wide","content":"Hear greatly improves audio quality in movies and music throughout all of your Mac OS X applications. With Hear, music is richer, movie sound and dialog is clearer and games will blow you out of your chair!   3D Sound – Like movies? like’em more with virtual cinema quality sound experience. Sound will approach you […]"},{"link":"https://nmac.to/blog/falcon-1-3-1/","image":"https://nmac.to/wp-content/uploads/2016/06/Falcon.png","title":"Falcon 1.3.1 – A simple, markdown based note-taking app","content":"Falconis a simple, markdown based note-taking app.   Features Write notes, journals and research Organise notes in multiple notebooks for various topics Supports adding images to your notes Search notes easily by their title, content or tags Editor-only and Preview-only modes allow to edit and read notes in an uncluttered and focused way. Backup your […]"},{"link":"https://nmac.to/blog/enolsoft-youtube-converter-hd-4-5-0/","image":"https://nmac.to/wp-content/uploads/2014/03/Enolsoft-YouTube-Converter-HD.png","title":"Enolsoft YouTube Converter HD 4.5.0 – Convert YouTube video for iPad, iPhone, ATV on Mac","content":"Enolsoft YouTube Converter HD for Mac is the best YouTube video tool to download and convert YouTube videos iPad, iPhone, Apple TV, Samsung Galaxy Tab, Nexus 7, Kindle Fire, Galaxy S4, Xbox 360 etc on Mac.   Free Download YouTube SD / HD / Ultra HD Videos (1536p, 1080p included) quickly and smoothly on Mac […]"}]