[{"link":"https://nmac.to/blog/evocam-4-2-3/","image":"https://nmac.to/wp-content/uploads/2014/05/EvoCam.png","title":"EvoCam 4.2.3 – Live streaming and security camera software","content":"EvoCam is here! Completely rearchitected, redesigned and reengineered from the ground up as a Cocoa application, EvoCam 4 will set the new standard for the ultimate webcam software.   EvoCam features industry-standard H.264 video and AAC audio streaming. With support for both RTSP over HTTP and HTTP Live Streaming using HTML5, EvoCam can be viewed […]"},{"link":"https://nmac.to/blog/appdelete-4-1-3/","image":"https://nmac.to/wp-content/uploads/2014/03/AppDelete.png","title":"AppDelete 4.1.3 – The speedy and efficient way to delete your unwanted apps","content":"AppDelete is an uninstaller for Macs that will remove not only applications but also widgets, preference panes, plugins, and screensavers along with their associated files. Without AppDelete these associated items will be left behind to take up space and potentially cause issues.   There are several ways to activate AppDelete: Drag items onto main window […]"},{"link":"https://nmac.to/blog/macaw-1-0-10/","image":"https://nmac.to/wp-content/uploads/2014/04/Macaw1.png","title":"Macaw 1.0.10 – The code-savvy web design tool","content":"Stop writing code. Start drawing it.   Macaw provides the same flexibility as your favorite image editor but also writes semantic HTML and remarkably succinct CSS. It’s time to expect more from a web design tool.   Fluid canvas and grid Macaw is engineered for fluid widths. Resize the canvas and your grids and elements […]"},{"link":"https://nmac.to/blog/video-converter-2-5-0/","image":"https://nmac.to/wp-content/uploads/2014/05/Video.Converter.png","title":"Video Converter 2.5.0 – Easily convert video and audio with excellent quality","content":"Leawo Video Converter is a powerful video converter that can easily convert video and audio with excellent quality like MKV to MP4, MKV to AVI, AVI to MP4, FLV to MKV, WMV to MOV, MP4 to MP3, MP4 to AVI, FLV to MP3, etc.   Thus users can freely enjoy video files on PC, YouTube […]"},{"link":"https://nmac.to/blog/sanedesk-2-0/","image":"https://nmac.to/wp-content/uploads/2014/05/SaneDesk.png","title":"SaneDesk 2.0 – OS X desktop/workspace switcher","content":"SaneDesk is a very easy to use OS X Desktop switcher. Desktop icons and wallpaper under total control.   Features: Unlimited number of workspaces. Each workspace can have separate desktop icons. Each workspace can have separate wallpaper. Imagine spaces as one layer that helps you work, SaneDesk as another. They work together nicely. You can […]"},{"link":"https://nmac.to/blog/quick-desktop-1-0-5/","image":"https://nmac.to/wp-content/uploads/2014/05/QuickDesktop.png","title":"Quick Desktop 1.0.5 – Minimize all windows with a keystroke","content":"Quick Desktop is a simple utility to a everyday problem faced by almost all of Mac users – minimising all windows to view the desktop. Quick Desktop as the name says gets you to view the desktop in a single click or a hot key stroke by minimising all the open windows. The app also […]"},{"link":"https://nmac.to/blog/notes-1-0-5/","image":"https://nmac.to/wp-content/uploads/2014/05/Notes+.png","title":"Notes+ 1.0.5 – Note taking app","content":"Notes is a delightful and easy-to-use note taking app. Notes is designed keeping in mind the need for a beautiful, quick and easy way to capture a note, thought, or information.   Beautiful Notes Capture you notes, thoughts or information in style. The minimalistic design helps you to focus on the information that needs to […]"},{"link":"https://nmac.to/blog/delish-2-3/","image":"https://nmac.to/wp-content/uploads/2014/05/Delish.png","title":"Delish 2.3 – del.icio.us client application; view posts as hi-res screenshots","content":"Delish is a del.icio.us client application for OS X. See your posts as hi-res screenshots. Multitouch and bundle support.   Version 2.3: Changed: Tag list view shows counts, along with sorting options Performance improvements with screenshot generation, indexing, tag and bookmark views New URL schemes for interacting with Delish. http://pinepointsoftware.com/delish/url-schemes Menu option to pause screenshot […]"},{"link":"https://nmac.to/blog/play-for-netflix-1-5/","image":"https://nmac.to/wp-content/uploads/2014/05/Play+.for_.Netflix.png","title":"Play+ for Netflix 1.5 – A new Netflix app experience","content":"Play+ for Netflix: A new Netflix app experience   Watch movie trailers and get a sneak peek of a movie before watching it (finally!) Rotten Tomatoes social ratings and Critics reviews display on many movie title covers (NEW FEATURE in version 1.5) Netflix Roulette Can’t figure out what to watch? Simply choose a genre, choose […]"},{"link":"https://nmac.to/blog/life-1-0/","image":"https://nmac.to/wp-content/uploads/2014/05/Life.png","title":"Life 1.0 – Personal journal","content":"Life is a clean, beautiful, awesome journal that helps you to capture life as it happens and view it as a personal timeline. Stunning Design and App Flow   Life is beautiful and the app for capturing it should also be as beautiful. A lot of design and usability thought has gone in to the […]"}]