[{"link":"https://nmac.to/blog/dead-synchronicity-1-0-12/","image":"https://nmac.to/wp-content/uploads/2016/06/Dead-Synchronicity.png","title":"Dead Synchronicity: Tomorrow Comes Today 1.0.12 – Featured Point & Click Adventure Game","content":"Dead Synchronicity stands as a modern adventure classic, telling a dark, sad and brutal tale that will leave you wanting more, but equally satisfied.   80% – Adventure Gamers   Darkness.   And then there was light… but not enough for Michael to find out who he is and what happened to the world out […]"},{"link":"https://nmac.to/blog/blackhole-1-0/","image":"https://nmac.to/wp-content/uploads/2016/06/BLACKHOLE.png","title":"BLACKHOLE 1.0 – An award-winning hardcore platformer game","content":"BLACKHOLE is an award-winning hardcore platformer with over 15 hours of story-driven sci-fi comedy and gravity-twisting puzzles.   When the crew of the spaceship Endera is sucked into a black hole, it seems like the end. Fortunately, the ship crashes on Entity – an unidentified object resembling a planet. After the crash, the first member […]"},{"link":"https://nmac.to/blog/goetia-1-0/","image":"https://nmac.to/wp-content/uploads/2016/06/Goetia.png","title":"Goetia 1.0 – A point & click ghost adventure game","content":"The ruins of any village are the silent testament to its final moments. The ruins of Oakmarsh are no different. Their telling silence, the dust blanketing what was once a quiet village near Coventry.   The name of a manor and the family that lived within. A perverted and mad lineage, a clan whose final […]"},{"link":"https://nmac.to/blog/decay-the-mare-1-0/","image":"https://nmac.to/wp-content/uploads/2016/06/Decay-The-Mare.png","title":"Decay – The Mare 1.0 – A new psychological horror adventure game","content":"Decay – The Mare is a 3D psychological horror adventure and homage to the Resident Evil and Silent Hill games, as well as to horror adventure games like Phantasmagoria, The 11th Hour and Gabriel Knight.   For the first time the compelling, high-tension Adventure is available in one package, including an exclusive third chapter that […]"},{"link":"https://nmac.to/blog/poster-1-6/","image":"https://nmac.to/wp-content/uploads/2016/06/Poster.png","title":"Poster 1.6 – Post photos and video to the Web","content":"Poster enables you to post photos and videos to the web. Poster can send photos and videos to Flickr, SmugMug, Facebook profiles and Facebook pages.   Poster sports a sleek design that lets you see your photos properly and work with them effortlessly. Whether posting to Flickr, Facebook or SmugMug, Poster takes a tailored approach […]"},{"link":"https://nmac.to/blog/phonedirector-1-8-0/","image":"https://nmac.to/wp-content/uploads/2016/06/PhoneDirector.for_.Nokia_.png","title":"PhoneDirector 1.8.0 – Phonebook, SMS, and calendar for Nokia series 40 phones","content":"PhoneDirector gives you control when working with your Nokia phone in Phonebook editing, SMS, Gallery, Calendar, To-Do, Java, WAP, Radio, and Notes.   Main features: phonebook editing, deleting, backup, export and import (extended phonebook with more numbers and texts is supported) SMS reading from the phone, sending, replying, forwarding, deleting, archiving uploading pictures, sounds and […]"},{"link":"https://nmac.to/blog/disk-map-analyzer-1-5/","image":"https://nmac.to/wp-content/uploads/2016/05/Disk-Map-Analyzer.png","title":"Disk Map Analyzer 1.5 – Clean Your Hard Drive Space","content":"Disk Map Analyzer was designed by users just like you, who are trying to free up valuable disk space in the easiest and fastest way possible. We’ve meticulously spent countless hours creating our disk mapping algorithm and optimized our app exclusively for Mac OSX. Our beautiful sunburst disk map is visually intuitive and feels natural. […]"},{"link":"https://nmac.to/blog/comburet-3-2-1/","image":"https://nmac.to/wp-content/uploads/2015/09/Comburet.png","title":"Comburet 3.2.1- Professional disc burning app","content":"Comburet is a professional burning App. You can use Comburet to burn music CD, data, iso and dmg image file,erase rewritable disc,make dmg and iso image file.   Comburet main features: Auto find burning device Supports CD,DVD,HD-DVD and BD Burn music CD with CD-Text:m4a,m4b,m4p,mp3,caf,aiff,au,sd2,wav,snd,amr Burn folder and image file(DMG and ISO) Erase rewritable disc Make […]"},{"link":"https://nmac.to/blog/the-final-take-1-0/","image":"https://nmac.to/wp-content/uploads/2016/06/The.Final_.Take_.png","title":"The Final Take 1.0 – Indie, Adventure & Horror Game","content":"Relive dark footage recorded from the perspective of multiple characters in this unique first person horror. Each character has had an alternate experience in different locations, but they all have something in common which connects them. Take control of a young female and relive these moments through found footage to uncover the sinister link between […]"},{"link":"https://nmac.to/blog/xrevert-3-0/","image":"https://nmac.to/wp-content/uploads/2015/09/XRevert.png","title":"XRevert 3.0 – Reverts icons and UI elements to those of prior OS X versions","content":"XRevert (was YosemiteRevert) changes application icons, system icons (such as the folder icon), menu bar icons, and more, as well as the system font, in OS X 10.10 Yosemite and later back to the way they were in prior versions of OS X. It also makes changes to aesthetics, such as the “traffic light icons” […]"}]