[{"link":"https://nmac.to/blog/the-stanley-parable/","image":"https://nmac.to/wp-content/uploads/2014/07/The.Stanley.Parable.png","title":"The Stanley Parable 1.0 – Exploration story and mystery game","content":"The Stanley Parable is a first person exploration game. You will play as Stanley, and you will not play as Stanley. You will follow a story, you will not follow a story. You will have a choice, you will have no choice. The game will end, the game will never end. Contradiction follows contradiction, the […]"},{"link":"https://nmac.to/blog/riffstation-1-4/","image":"https://nmac.to/wp-content/uploads/2014/07/Riffstation.png","title":"Riffstation 1.4 – Practice and learn songs on the guitar","content":"Riffstation helps guitarists and musicians practice and learn songs from their music collection. Load any song and Riffstation processes the music and displays the chords and rhythm to play.   Help yourself learn: Slow down the music without affecting the pitch or change the pitch without affecting tempo. Transpose the song into any key you […]"},{"link":"https://nmac.to/blog/autopano-video-pro-1-6/","image":"https://nmac.to/wp-content/uploads/2014/07/Autopano-Video-Pro.png","title":"Autopano Video Pro 1.6 – Stitch multiple videos together to create 360º videos","content":"Autopano Video Pro allows users to create immersive 360º video with a simple, accessible workflow while taking advantage of GPU processing for faster rendering times. Simply drag-and-drop source videos for your panorama and let Autopano Video, with the help of Autopano Pro or Autopano Giga, produce a polished video project.   Version 1.6 (161): Release […]"},{"link":"https://nmac.to/blog/aurora-3d-maker-1-42-16/","image":"https://nmac.to/wp-content/uploads/2014/07/Aurora3DMaker.png","title":"Aurora 3D Maker 1.42.16 – Create 3D Text, logos, and icons","content":"Aurora 3D Maker is the easy-to-use 3D text, button, logo-maker software with a wide variety of pre-loaded shapes and text templates. Reflection and texture animation effects will take your 3D creations to the next level of design. A variety of built-in tools make this the perfect 3D builder for beginners and professionals alike.   Freedom […]"},{"link":"https://nmac.to/blog/monochroma/","image":"https://nmac.to/wp-content/uploads/2014/07/Monochroma.png","title":"Monochroma 1.0 – Cinematic puzzle platformer game","content":"Monochroma offers a deeply visual, intellectual and emotional experience. The game has a unique approach to storytelling without using any written or spoken words. Therefore it requires the player to be actively involved to understand the narrative.   The story itself becomes part of the puzzle. Gameplay, visuals and the very limited color palette are […]"},{"link":"https://nmac.to/blog/vssh-1-7-1/","image":"https://nmac.to/wp-content/uploads/2014/04/vSSH.png","title":"vSSH 1.7.1 – SSH protocol connectivity tools","content":"VSSH is advanced customizable SSH and Telnet client with iCloud connections, macros and keys sharing.   Key fetaures: SSH and Telnet protocols Username/password and public/private Keys authentication Multi-sessions with tabbed interface iCloud connections, macros and keys sharing with other vSSH apps (for iPhone, iPad and OS X) Key forwarding Port forwarding (support connection without shell: […]"},{"link":"https://nmac.to/blog/spillo-1-0-1/","image":"https://nmac.to/wp-content/uploads/2014/07/Spillo.png","title":"Spillo 1.0.1 – Take full control over your bookmarks on Pinboard","content":"Spillo is a powerful, beautiful and amazingly fast Pinboard client. Spillo lets you browse and organize your bookmarks in a stunning modern interface. Spillo also makes creating a bookmark from anywhere on your Mac as convenient as possible.   A beautiful interface  Spillo has a beautiful modern interface that feels just right at home on […]"},{"link":"https://nmac.to/blog/media-menu-pro-1-2-1/","image":"https://nmac.to/wp-content/uploads/2014/07/Media.Menu_.Pro_.png","title":"Media Menu Pro 1.2.1 – Movies and TV shows index","content":"Media Menu Pro puts all your movies and TV shows just a click away, you dont even need to leave your current application.   Just tell Media Menu Pro where your media is stored – on your hardrive, on your network, on an external dirve… and an index will be create ready for you to […]"},{"link":"https://nmac.to/blog/tublme-1-1-1/","image":"https://nmac.to/wp-content/uploads/2014/04/Tublme.png","title":"Tublme 1.1.1 – Beautiful Tumblr desktop client","content":"Tublme is a beautiful and powerful, yet easy-to-use, Tumblr desktop client. It makes browsing Tumblr a whole new experience with its minimalistic approach.   Features: Lists – As in Twitter, a list is a selected group of users. Just add people (you don’t even need to be following them) to a new or existing list […]"},{"link":"https://nmac.to/blog/redshift-2-0-1/","image":"https://nmac.to/wp-content/uploads/2014/07/Redshift.png","title":"Redshift 2.0.1 – Astronomy education for exploring our galaxy","content":"Redshift is an educational astronomy application. Perform 3D flights and visit all the planets in our Solar System and their main moons. Detailed surface maps display the objects in a close-up, and once you have arrived at your target object, you can enter into an orbit around the celestial body.   Features: The application goes […]"}]