[{"link":"https://nmac.to/blog/the-print-shop/","image":"https://nmac.to/wp-content/uploads/2018/11/The-Print-Shop4.png","title":"The Print Shop 4.0.1 – Greeting card & CD cover creation kit","content":"The Print Shop provides “desktop publishing for the rest of us” with rulers, guidelines, gridlines and “snap to” functionality. Create CD labels and cases with track names and times imported from your iTunes playlists and templates matching Apple’s iDVD themes. Print directly onto printable CDs with Direct-CD printers. Add your family photos from iPhoto to […]"},{"link":"https://nmac.to/blog/ruby-mine/","image":"https://nmac.to/wp-content/uploads/2016/03/RubyMine8.png","title":"RubyMine 2018.3 – Full-fledged IDE for Ruby on Rails","content":"RubyMine is a full-fledged Ruby on Rails IDE that brings the whole range of essential developers tools for productive Ruby development and Web development with Ruby on Rails.   Key features include: Intelligent Editor: code completion, code snippets and automatic refactorings Project Navigation: wide range of views and one-click jumping between components Error-Free Coding: on-the-fly […]"},{"link":"https://nmac.to/blog/bus-simulator/","image":"https://nmac.to/wp-content/uploads/2018/11/Bus-Simulator-16.png","title":"Bus Simulator 16 Gold Edition 0.0.961 – Open World Driving Simulation Game","content":"A gigantic, freely accessible world is waiting for you in Bus Simulator 16. Transport your passengers to their destinations across five authentic city districts safely and on time. Drive a two-door, three-door, or a true-to-life articulated bus through commuter traffic at rush hour, watch out for emergency vehicles, and take detours around construction sites. Make […]"},{"link":"https://nmac.to/blog/life-is-strange/","image":"https://nmac.to/wp-content/uploads/2016/06/Life-Is-Strange.png","title":"Life Is Strange EP (1-5) 1.0.3 – Investigate the mysterious story of the photographer Max Caulfield","content":"Life Is Strange is a five part episodic game that sets out to revolutionise story based choice and consequence games by allowing the player to rewind time and affect the past, present and future.   You are Max, a photography senior who saves her old friend Chloe by discovering she can rewind time. The pair […]"},{"link":"https://nmac.to/blog/tropico-4-bundle/","image":"https://nmac.to/wp-content/uploads/2013/08/Tropico-4.png","title":"Tropico 4: Collector’s Bundle 1.2 – Build and control your own island","content":"Congratulations! You’re the newly-elected, all-powerful “Presidente” of the proud Caribbean nation of Tropico. Taking the reins for another glorious term on your sunny island is all well and good, but do you have what it takes to become a serious player on the world stage?   Whether you choose to rule as benevolent chairman, clever […]"},{"link":"https://nmac.to/blog/lego-the-incredibles/","image":"https://nmac.to/wp-content/uploads/2018/11/LEGO-The-Incredibles.png","title":"LEGO The Incredibles 1.0 – LEGO Action & Adventure Game","content":"Experience the thrilling adventures of the Parr family as they conquer crime and family life through both Disney-Pixar films The Incredibles and Incredibles 2, in a LEGO world full of fun and humor. LEGO The Incredibles allows players to explore action-packed story levels and an epic hub world – including Municiberg, as they use their unique […]"},{"link":"https://nmac.to/blog/menuminder/","image":"https://nmac.to/wp-content/uploads/2018/11/MenuMinder.png","title":"MenuMinder 4.5.1 – Create reminders right from your menubar","content":"MenuMinder lets you create quick, simple alert, email and SMS Text Message (mobile phone) reminders straight from your menu bar. Quickly create a reminder using the system-wide menu that can be accessed from any application. Never forget anything ever again.   Attach tasks to your reminders. Schedule your computer to play a song, open a […]"},{"link":"https://nmac.to/blog/joyoshare-iphone-data-recovery/","image":"https://nmac.to/wp-content/uploads/2018/08/Joyoshare-iPhone-Data-Recovery.png","title":"Joyoshare iPhone Data Recovery 2.1.0 – Data recovery tool for iOS devices","content":"Joyoshare iPhone Data Recovery is a data recovery software that recovers lost data in scenarios like accidental deletion, system crash or upgrade failure, device broken from iOS devices. Any missing data is possible to be retrieved from iOS devices, iTunes backup or iCloud backup quickly and safely.   Version 2.1.0: Fixed some bugs.   Intel […]"},{"link":"https://nmac.to/blog/videoloupe/","image":"https://nmac.to/wp-content/uploads/2017/04/Videoloupe.png","title":"Videoloupe 1.2.1 – Advanced media player with editing functionality","content":"Videoloupe bridges the gap between free media players and professional editing suites. It offers a unique mix of playback controls, editing tools and export options not found in other video applications.   Features Advanced video playback controls. Side-by-side video comparisons. Playback markers. Multi-video synchronized playback. Color and tone adjustment controls. Watermarking and timing burn-in. Export […]"},{"link":"https://nmac.to/blog/graphics/","image":"https://nmac.to/wp-content/uploads/2016/04/Graphics2.png","title":"Graphics 3.0.1 – Collection of 5 sets and more than 1000 items","content":"The Graphics collection contains 5 sets of high-quality illustrations: Clipart Illustrations Icons People Clipart Traffic Signs   It is the ultimate set of illustrations suitable for any iWork document that requires color, texture, and authenticity. You will definitely find the right illustration among the many high-quality images.   Version 3.0.1: The new version improves compatibility […]"}]