[{"link":"https://nmac.to/blog/subsmarine/","image":"https://nmac.to/wp-content/uploads/2016/04/SubsMarine.png","title":"SubsMarine 1.3 – Find subtitles for videos and TV shows","content":"SubsMarine dives into the Internet to find subtitles for your videos and TV Shows. SubsMarine is a beautifully Mac Application designed to do for you the boring task of searching and downloading subtitles for your Movies or TV Shows In no time, you will have the subtitles for your movies in your computer, ready to […]"},{"link":"https://nmac.to/blog/desktop-clock/","image":"https://nmac.to/wp-content/uploads/2017/10/Desktop-Clock.png","title":"Desktop Clock 2.0.0 – Wallpaper Clock & Live Dock Icon","content":"The “Desktop Clock” app puts a beautiful and practical clock on your Mac’s desktop and Dock. The app offers 23 beautiful designs to choose from depending on your taste and preference.   Clock Designs: Analog Clocks Flip-Clock design Animated Quartz movement for analog clocks   App Features: Adjustable position and clock size Adjustable clock transparency […]"},{"link":"https://nmac.to/blog/direct-message-for-instagram/","image":"https://nmac.to/wp-content/uploads/2017/01/Direct-Message-for-Instagram4.png","title":"Direct Message for Instagram 4.4 – Desktop messaging for Instagram","content":"Direct Message for Instagram lets you send and receive direct messages from your Desktop–the first and only app that can do so!   Features Send texts and photos View and save photos and videos received Option to receive notification in Notification Center when new messages arrive Menu-bar icon for easy access   Version 4.4: Support […]"},{"link":"https://nmac.to/blog/mac-videoripper-pro/","image":"https://nmac.to/wp-content/uploads/2017/08/Mac.VideoRipper.Pro_.png","title":"Mac VideoRipper Pro 1.0.8 – The easiest video downloader for your Mac","content":"Mac VideoRipper Pro is simple to use: just drag & drop the link you want to rip on its main window. You can also copy/paste the link by using the ‘Open Link’ buttom (or the Command-O shortcut). If the video you want to rip is protected by a password, you will be asked for it. […]"},{"link":"https://nmac.to/blog/crossftp/","image":"https://nmac.to/wp-content/uploads/2017/09/CrossFTP1.png","title":"CrossFTP Pro 1.99 – FTP client and synchronization tool","content":"CrossFTP Pro is an FTP, Amazon S3, Amazon Glacier and Google Storage client.   CrossFTP is free. CrossFTP Pro requires a license fee, and further supports SFTP, FXP, WebDav, scheduled transfer, directory sync, compression, encryption, etc. It uses a two-pane interface so that the novice user can master it in minutes.   Features Powerful FTP and […]"},{"link":"https://nmac.to/blog/sftp-client/","image":"https://nmac.to/wp-content/uploads/2018/10/sFTP.Client.png","title":"sFTP Client 3.1.3 – Full-featured FTP/SFTP/FTPIS/FTPES/SSH client","content":"sFTP Client is a full-featured FTP/SFTP/FTPIS/FTPES/SSH client with a modern and easy to use interface.   sFTP Client uses the most modern libraries and uses the latest technologies (after-all who would ever like an out-dated / old fashioned app), thats why we use the latest frameworks and latest modern designs.   Features: Sync Connections Standard […]"},{"link":"https://nmac.to/blog/itools-pro/","image":"https://nmac.to/wp-content/uploads/2016/11/iTools-Pro1.png","title":"iTools Pro 1.8.0.4 – Overall management of your iDevices","content":"iTools Pro  is simple but best alternative option for overall management of your iDevice through Mac OS.   iTools can access any data format and edit them compatible with iPad, iPhones, computer and etc. running Mac. iTools , is the best alternative to iTunes. Download iTools works in every device,no jailbreak required.   Features : […]"},{"link":"https://nmac.to/blog/uxweb/","image":"https://nmac.to/wp-content/uploads/2018/02/UXWeb.png","title":"UXWeb 1.3 – Drag & Drop Website Builder for Mac","content":"Introducing UXWeb – the ultimate website creating, editing and publishing suite, all-in-one. No coding knowledge required.   UXWeb has changed how users build websites on their mobile and tablet devices. Creating a website builder for touch devices wasn’t an easy task, but with the new Drag & Drop feature, in combination with the Grid, it […]"},{"link":"https://nmac.to/blog/artistry-photo-pro/","image":"https://nmac.to/wp-content/uploads/2018/09/Artistry-Photo-Pro.png","title":"Artistry Photo Pro 3.0.1 – Powerful photo editor app","content":"Uncover the hidden potential in your photos with this powerful photo editor. With 100+ effects built-in, over 90 adjustment types to adjust your photos from color manipulation to gamma and tone curve adjustments, our editing tools give users the ability to apply an effect or multiple effects to the entire photo. And with our brush […]"},{"link":"https://nmac.to/blog/decibel/","image":"https://nmac.to/wp-content/uploads/2014/07/Decibel1.png","title":"Decibel 1.3.5 – Audio player tailored to the needs of audiophiles","content":"Decibel is an audio player tailored to the particular needs of audiophiles.   Decibel supports all popular lossless and lossy audio formats including FLAC, Ogg Vorbis, Musepack, WavPack, Monkey’s Audio, Speex, True Audio, Apple Lossless, AAC, MP3, MOD, DSF, DSDIFF, WAVE and AIFF.   For lossless formats such as FLAC and WAVE, and for Ogg […]"}]