[{"link":"https://nmac.to/blog/rough-draft-1-5-1/","image":"https://nmac.to/wp-content/uploads/2016/03/Rough-Draft.png","title":"Rough Draft 1.5.1 – Stylish writing tool","content":"Rough Draft (formerly First Draft) is a writing tool designed to help you focus on your initial ideas and leave revising and editing for later on. The utility applies the same technique one would use when writing with a pen: you simply strikethrough, and move on.   Beautiful writing tool that is focused on the […]"},{"link":"https://nmac.to/blog/moneywiz-2-3/","image":"https://nmac.to/wp-content/uploads/2015/02/MoneyWiz2.png","title":"MoneyWiz 2.3 – Personal finance solution","content":"All your accounts, budgets and bills in one place! With powerful reports, worldwide online banking and instant sync between all your devices!   That’s MoneyWiz – the world’s most powerful and beautiful finance software.   HOW CAN MONEYWIZ HELP YOU? GET OUT OF DEBT : We’ve built MoneyWiz in a way that makes it easy […]"},{"link":"https://nmac.to/blog/desk-pm-2-3/","image":"https://nmac.to/wp-content/uploads/2015/02/Desk.png","title":"Desk PM 2.3 – A Writing, Blogging, and Notetaking App","content":"Desk is a premium writing experience for all types of writers.   Whether you’re a casual enthusiast, the weekend writer, blogger, or digital publishing professional, you’ll find Desk to be a much-needed breath of fresh air.   Designed to marry both function and form, it is the desktop publishing client that you’ve always wanted: Simple, […]"},{"link":"https://nmac.to/blog/vssh-1-11-1/","image":"https://nmac.to/wp-content/uploads/2014/04/vSSH.png","title":"vSSH 1.11.1 – SSH protocol connectivity tools","content":"VSSH is advanced customizable SSH and Telnet client with iCloud connections, macros and keys sharing.   Key fetaures: SSH and Telnet protocols Username/password and public/private Keys authentication Multi-sessions with tabbed interface iCloud connections, macros and keys sharing with other vSSH apps (for iPhone, iPad and OS X) Key forwarding Port forwarding (support connection without shell: […]"},{"link":"https://nmac.to/blog/share-tunes-2-0/","image":"https://nmac.to/wp-content/uploads/2016/03/Share.Tunes_.png","title":"Share Tunes 2.0 – Share what song you are listening to","content":"Share Tunes helps you to share your taste in music on Twitter, Facebook, Sina Weibo, and Tumblr! Music plays an important part in our lives, so why don’t share it with others?   Share Tunes works in the background and lives in your menubar. When you open it, you’ll see the song you’re currently playing […]"},{"link":"https://nmac.to/blog/horcrux-email-backup-2-9-2/","image":"https://nmac.to/wp-content/uploads/2016/03/Horcrux-Email-Backup.png","title":"Horcrux Email Backup 2.9.2 – Automatically backup your IMAP email","content":"Horcrux Email Backup lets you automatically backup your mails from any IMAP supported email accounts with great ease. The best part is, you have an option to restore the backup’ed emails to any other email account, retaining all your tags/folder hierarchy.   Note: This is a background app, it resides on the Mac menu bar […]"},{"link":"https://nmac.to/blog/train-fever/","image":"https://nmac.to/wp-content/uploads/2016/03/Train-Fever.png","title":"Train Fever 2.4.0.11 – Railroad-focused business simulation game","content":"Train Fever is a railroad-focused business simulation game. In other words, it’s a modern-day Transport Tycoon with procedural content and a sophisticated city simulation.   “It’s the year 1850, and there are great times ahead! Establish a transport company and be its manager. Build infrastructure such as railways and stations, purchase transportation vehicles and manage […]"},{"link":"https://nmac.to/blog/uploader-for-instagram-2-0-1/","image":"https://nmac.to/wp-content/uploads/2016/02/Uploader.for_.Instagram.png","title":"Uploader for Instagram 2.0.1 – Post pictures to Instagram","content":"Finally, upload pictures to Instagram from your Mac!   Easily share pictures (with captions!) with this handy app with a simple right-click!   To share pictures, simply right click them, go to “Share to Instagram” from the dropdown menu. It’s that simple!   Add captions to your photos–Emojis are supported! Crop and edit your photos […]"},{"link":"https://nmac.to/blog/dfz2-1-5-1/","image":"https://nmac.to/wp-content/uploads/2016/02/Defense-Zone-2.png","title":"DfZ2 1.5.1 – Tower defense game","content":"The new, engaging levels are even more stunning and impressive in DFZ 2. New weapons have been added, along with new opponents, and even more action and tactics.   The game supports four languages: English, Russian, French and German.   The game settings are balanced to meet the goals of different players. If you want […]"},{"link":"https://nmac.to/blog/cisdem-iphonecleaner-2-1-0/","image":"https://nmac.to/wp-content/uploads/2016/02/Cisdem.iPhoneCleaner.png","title":"Cisdem iPhoneCleaner 2.1.0 – Safely and quickly clean, speed up, and backup your iDevice","content":"Cisdem iPhoneCleaner can help if your iPhone freezes up now and then and becomes unresponsive or if there’s not enough storage space for an update. It can quickly and safely clean and speed up your iPhone, as well as your iPad or iPod. With the detailed scanning analysis report, you can easily remove unnecessary files […]"}]