[{"link":"https://nmac.to/blog/tennis-manager/","image":"https://nmac.to/wp-content/uploads/2021/09/Tennis-Manager-2021.png","title":"Tennis Manager 2021 1.7.1 – Tennis Simulation & Management Game","content":"The rise of tennis academies has started. Their development is on the brink of offering thousands of promising players the chance to grow to the top of the tennis world.   Yet, everything remains to be done. As a manager, it is your opportunity to develop your academy and bring the best out of your […]"},{"link":"https://nmac.to/blog/hollow-knight/","image":"https://nmac.to/wp-content/uploads/2017/04/Hollow-Knight-Hidden-Dreams.png","title":"Hollow Knight 1.5.78 – Brave the Depths of a Forgotten Kingdom","content":"Beneath the fading town of Dirtmouth sleeps an ancient, ruined kingdom. Many are drawn below the surface, searching for riches, or glory, or answers to old secrets.   Hollow Knight is a classically styled 2D action adventure across a vast interconnected world. Explore twisting caverns, ancient cities and deadly wastes; battle tainted creatures and befriend […]"},{"link":"https://nmac.to/blog/american-truck-simulator/","image":"https://nmac.to/wp-content/uploads/2016/02/American.Truck_.Simulator.png","title":"American Truck Simulator 1.42.1 – Highly detailed American Truck simulation game","content":"Experience legendary American trucks and deliver various cargoes across sunny California and sandy Nevada. American Truck Simulator takes you on a journey through the breathtaking landscapes and widely recognized landmarks around the States.   Game mechanics are based on the highly successful model from Euro Truck Simulator 2 and have been expanded with new features, […]"},{"link":"https://nmac.to/blog/black-geyser/","image":"https://nmac.to/wp-content/uploads/2021/11/Black-Geyser-Couriers-of-Darkness.png","title":"Black Geyser: Couriers of Darkness 1.0.22 – An isometric, fantasy RPG game","content":"Black Geyser: Couriers of Darkness. Explore a land plagued by war, pestilence and mysterious abductions, and uncover the hidden legacy of your birth. Recruit powerful allies to your cause; achieve your goals through sorcery, stealth, a silver tongue or brute force; and discover the truth of the Black Geyser.   Developed by a small indie […]"},{"link":"https://nmac.to/blog/euro-truck-simulator-2/","image":"https://nmac.to/wp-content/uploads/2015/02/Euro.Truck_.Simulator.2.png","title":"Euro Truck Simulator 2 1.42.1 – Play with European long haul trucks","content":"Travel across Europe as king of the road, a trucker who delivers important cargo across impressive distances! With dozens of cities to explore from the UK, Belgium, Germany, Italy, the Netherlands, Poland, and many more, your endurance, skill and speed will all be pushed to their limits. If you’ve got what it takes to be […]"},{"link":"https://nmac.to/blog/subnautica/","image":"https://nmac.to/wp-content/uploads/2016/06/Subnautica.png","title":"Subnautica: Below Zero 45391 – Underwater exploration and adventure game","content":"Subnautica is an open world, underwater exploration and adventure game currently under construction at Unknown Worlds, the independent developer behind Natural Selection 2.   Dive Into a Vast Underwater World After crash landing on an alien ocean world, the only way to go is down. Subnautica’s oceans range from sun drenched shallow coral reefs to […]"},{"link":"https://nmac.to/blog/maccleanse/","image":"https://nmac.to/wp-content/uploads/2021/09/MacCleanse_10.png","title":"MacCleanse 10.1 – Selectively erase logs, caches, activity, and more","content":"MacCleanse is the product of thousands of hours of intense research and development. It meticulously scans all of the nooks and crannies of a computer for unnecessary junk that can take up huge amounts of disk space! Because of this, Apps in MacCleanse are also uninstalled correctly, catching the numerous logs, caches, plugins, and other […]"},{"link":"https://nmac.to/blog/blu-ray-player-pro/","image":"https://nmac.to/wp-content/uploads/2017/02/Blu-ray-Player-Pro.png","title":"Blu-ray Player Pro 3.3.21 – Blu-ray media player","content":"Mac Blu-ray Player Pro version is the best entertainment choice for the original Blu-ray Menu, Blu-ray Disc, ISO files, and BDMV folder. The Pro version enhances UHD 4K video viewing experience and original audio quality, and improves player performance with better hardware acceleration. It can be fully compatible with the latest Mac OS 10.12 Sierra. […]"},{"link":"https://nmac.to/blog/runway/","image":"https://nmac.to/wp-content/uploads/2014/12/Runway.png","title":"Runway 2.0 – Full-featured Diagramming app","content":"Runway is a UML Design app for OS X, that is both simple and powerful. Runway gives you all of the most important features you need in a Diagramming app, as well as an easy-to-use Class Diagram tool without all the extra cruft, at an affordable price.   Runway is a full-featured Diagramming app. Currently, […]"},{"link":"https://nmac.to/blog/ssh-config-editor/","image":"https://nmac.to/wp-content/uploads/2020/08/SSH_Config_Editor_2.png","title":"SSH Config Editor 2.3.2 – Handy tool to manage your ssh client configuration file","content":"SSH Config Editor is a handy tool for manage your OpenSSH ssh client configuration file. You can add or edit identity files, port forwardings (with handy graphical preview) and any other ssh config option.   Features Add/change identity files by choosing them in file dialog Add/edit port forwarding options with graphical help Add/edit any supported […]"}]