[{"link":"https://nmac.to/blog/folderssynchronizer/","image":"https://nmac.to/wp-content/uploads/2019/12/FoldersSynchronizer.png","title":"FoldersSynchronizer 5.1.2 – Synchronize or backup files, folders and disks","content":"FoldersSynchronizer is a popular and useful utility that synchronizes and backs-up files, folders, disks and boot disks. On each session you can apply special options like Timers, Multiple Folders, Filters, Exclude Items, Auto-Mount local and remote volumes, launch your own AppleScripts, set how to resolve conflicts, execute an incremental or an exact copy, include locked […]"},{"link":"https://nmac.to/blog/ifinance/","image":"https://nmac.to/wp-content/uploads/2016/10/iFinance-4.png","title":"iFinance 4.5.23 – Comprehensively manage your personal finances","content":"iFinance allows you to keep track of your income and spending — from your lunchbreak coffee to your new car — in the most convenient and fastest way. Clearly arranged transaction lists of all your financial resources from your debit account to your credit card and cash show you exactly what you spend your money […]"},{"link":"https://nmac.to/blog/kingdom-rush-hd/","image":"https://nmac.to/wp-content/uploads/2015/10/Kingdom-Rush-HD.png","title":"Kingdom Rush HD 4.2.15 – 2D tower defense game","content":"Get ready for an epic journey to defend your kingdom against hordes of orcs, trolls, evil wizards and other nasty fiends using a vast arsenal of towers and spells at your command!   Fight on forests, mountains and wastelands, customizing your defensive strategy with different tower upgrades and specializations! Rain fire upon your enemies, summon […]"},{"link":"https://nmac.to/blog/the-jackbox-party-pack-1/","image":"https://nmac.to/wp-content/uploads/2020/08/The-Jackbox-Party-Pack.png","title":"The Jackbox Party Pack 1.1.3 – Local Multiplayer Casual Party Game","content":"For 1-100 players! Your phones or tablets are your controllers! The team behind YOU DON’T KNOW JACK presents FIVE guffaw-inducing party games in one pack!    Games include:  The comedy trivia sensation YOU DON’T KNOW JACK 2015 (1-4 players) with hundreds of all-new questions.  The hilarious bluffing game Fibbage XL (2-8 players), with over 50% […]"},{"link":"https://nmac.to/blog/the-witness/","image":"https://nmac.to/wp-content/uploads/2017/03/The-Witness.png","title":"The Witness 1.0.8 – First-Person Puzzle & Exploration Game","content":"You wake up, alone, on a strange island full of puzzles that will challenge and surprise you.   You don’t remember who you are, and you don’t remember how you got here, but there’s one thing you can do: explore the island in hope of discovering clues, regaining your memory, and somehow finding your way […]"},{"link":"https://nmac.to/blog/gazer/","image":"https://nmac.to/wp-content/uploads/2020/08/Gazer.png","title":"#Gazer 1.0.2 – View your markup-formatted texts","content":"With #Gazer you can quickly and conveniently view your markup-formatted (e.g. Markdown) texts. In addition to many special features to customize the application to your needs, #Gazer also has a Live-Update-feature that automatically updates the view of your document when the file is saved.   Features of #Gazer   Supported Markup Languages #Gazer natively supports […]"},{"link":"https://nmac.to/blog/lux/","image":"https://nmac.to/wp-content/uploads/2020/05/Lux.png","title":"Lux 1.3 – Sunrise & Sunset notification","content":"Have you ever wondered how much time remains before sunrise or sunset? Lux is able to offer this and more.   Make sure you have a WiFi connection to the Internet. At this point the application will detect your geographic location. The display will show the name of the location and the time and hours […]"},{"link":"https://nmac.to/blog/simple-recorder/","image":"https://nmac.to/wp-content/uploads/2018/10/Simple-Recorder1.png","title":"Simple Recorder 1.9 – Menu bar recorder utility","content":"Simple Recorder allows you to find its icon in the right side of your menu bar. Click it to show the menu. You can also find its icon in the dock. Click it to record, and click it again to stop. Right-click (or ⌃-click) the dock bar icon to show the menu.   Version 1.9: […]"},{"link":"https://nmac.to/blog/retro-forth/","image":"https://nmac.to/wp-content/uploads/2020/08/RETRO-FORTH.png","title":"RETRO FORTH 2019.8 – A concatenative programming language with roots in Forth","content":"RETRO FORTH is a concatenative programming language with roots in Forth. Designed to be compact, learnable, and easy to adapt to specific needs, it has been developed and refined through continual use by a small community over more than a decade.   Forth is a stack based programming language created in the late 1960’s by […]"},{"link":"https://nmac.to/blog/live-cryptocurrency-ticker/","image":"https://nmac.to/wp-content/uploads/2020/08/Live-Cryptocurrency-Ticker.png","title":"Live Cryptocurrency Ticker 3.2 – Cryptocurrency ticker for the menu bar","content":"Set it to pull prices and all currency pairs from your favorite coin exchange and get updates at your own pace from real-time to 30 minute in the status bar.   Available exchanges: Bibox Binance Bitfinex Bithumb Bitstamp Bittrex Bit-Z BTCTurk Coincheck Coinone Gate.io Coinbase PRO Huobi.pro Korbit Kraken LBank OKEx Paribu Poloniex UPbit ZB.COM […]"}]