[{"link":"https://nmac.to/blog/flightradar24-2-0-1/","image":"https://nmac.to/wp-content/uploads/2014/01/Flightradar24.png","title":"Flightradar24 2.0.1 – Turns your Mac into an air traffic radar monitor","content":"Flightradar24 turns your Mac into an air traffic radar monitor. See airplane traffic around the world move in real-time. Discover why millions are already using Flightradar24. Please note that coverage will vary. We are rapidly improving Flightradar24’s coverage across the world.   Features: Planes moving in real-time Comprehensive information for each individual plane, including route, […]"},{"link":"https://nmac.to/blog/astropad-1-1/","image":"https://nmac.to/wp-content/uploads/2015/02/Astropad.png","title":"Astropad 1.1 – Transform your ipad into a professional graphics tablet","content":"Use the Mac creative tools you know & love, like Photoshop, with the touch experience of your iPad.   Creating Astropad required innovative new technology we call LIQUID. The result is stunning image quality and responsiveness never before seen in similar tools.   LIQUID is true to your source material with color corrected output and […]"},{"link":"https://nmac.to/blog/hyperpdf-1-1-3/","image":"https://nmac.to/wp-content/uploads/2014/09/HyperPdf.png","title":"HyperPdf 1.1.3 – PDF viewer and note taker","content":"HyperPdf is the new PDF Viewer and note-taker for Mac.   Read PDFs like a book– HyperPDF introduces a unique page-turning interface to read your PDF like real books. Turn pages with swipe gestures. Annotate your files – Add shapes, notes to your PDF. If the text is selectable, you can highlight, underline and strike-through […]"},{"link":"https://nmac.to/blog/chivalry-medieval-warfare-1-0/","image":"https://nmac.to/wp-content/uploads/2015/04/Chivalry.png","title":"Chivalry: Medieval Warfare 1.0 – First-person slasher with a focus on multi-player game","content":"Besiege castles and raid villages in Chivalry: Medieval Warfare is a first-person slasher with a focus on multi-player. Featuring competitive online combat that seeks to capture the experience of truly being on a medieval battlefield. Inspired from the intensity and epicness of swordfighting movies such as 300, Gladiator and Braveheart, Chivalry: Medieval Warfare aims to […]"},{"link":"https://nmac.to/blog/quickpick-2-1-3-2/","image":"https://nmac.to/wp-content/uploads/2015/04/QuickPick.png","title":"QuickPick 2.1.3 – Seamless document launcher","content":"QuickPick is an application and document launcher designed to feel as if it’s part of Mac OS X itself. Just drag and drop any number of applications or documents into the QuickPick window, and they’ll only ever be a mouse click, flick, or key press away.   QuickPick is a great place to store documents […]"},{"link":"https://nmac.to/blog/photo-to-movie-5-3-0-0/","image":"https://nmac.to/wp-content/uploads/2015/04/Photo.to_.Movie_.png","title":"Photo to Movie 5.3.0.0 – Create a movie by zooming/panning over a photo","content":"Photo to Movie enables you to create a movie by zooming and panning over a photo. It presents a simple interface to specify the starting and ending frames and generates full quality QuickTime or DV Stream files (compatible with iMovie).   You can use Photo to Movie to: Graphically select the starting and ending frames […]"},{"link":"https://nmac.to/blog/itriumph-2-0-0/","image":"https://nmac.to/wp-content/uploads/2014/02/iTriumph.png","title":"iTriumph 2.0.0 – Your life organized: calendars, contacts, and journal.","content":"Life happens fast whether it’s personal or business. The best way to stay on top is focus. iTriumph is here to help. iTriumph integrates your calendar, contacts, and journal in a single application to provide you with clarity. Not only will iTriumph help you manage current obligations and relationships, it will help you reflect and […]"},{"link":"https://nmac.to/blog/shadow-warrior-1-0/","image":"https://nmac.to/wp-content/uploads/2015/04/ShadowWarrior.png","title":"Shadow Warrior 1.0 – First-person shooter gameplay with thrilling action","content":"Shadow Warrior is a bold reimagining of the classic 3D Realms’ shooter from independent developer Flying Wild Hog (Hard Reset) starring the legendary and quick-witted warrior Lo Wang. Combine the brute force of overwhelming firepower with the elegant precision of a katana to annihilate the merciless armies of the shadow realm in an exhilarating and […]"},{"link":"https://nmac.to/blog/mymactime-1-8-2/","image":"https://nmac.to/wp-content/uploads/2015/04/myMacTime.png","title":"myMacTime 1.8.2 – Easy time tracking","content":"myMacTime is designed for anyone who wants to keep track of the time spent working on specific tasks with little effort. myMacTime is easy to use and very flexible. Track your time automatically using the Application Tracker or manually. Easily track your time from any application using the status menu. Synchronize your working sessions with […]"},{"link":"https://nmac.to/blog/locko-1-2-1/","image":"https://nmac.to/wp-content/uploads/2015/04/Locko.png","title":"Locko 1.2.1 – Password manager and file vault","content":"Locko is a beautiful and easy-to-use password manager and file vault. You can store confidential information such as web logins, credit card data, computer accounts, software licenses, private pictures and documents, and much more. Locko supports Dropbox, so you can keep your data synchronized across multiple computers while maintaining absolute security.   Features: Super strong […]"}]