[{"link":"https://nmac.to/blog/mailsteward-10-3-1/","image":"https://nmac.to/wp-content/uploads/2014/11/MailStewardPro.png","title":"MailSteward 10.3.1 – Archive your email text in databases","content":"MailSteward will archive all of your email in a database for easy retrieval. Click on the Store Email button and MailSteward will go to work storing copies of all your email text, HTML, attachments, and raw source, into a relational database file. MailSteward has a wealth of features for importing, tagging, saving, and exporting, including […]"},{"link":"https://nmac.to/blog/flickery/","image":"https://nmac.to/wp-content/uploads/2014/11/flickery1.png","title":"Flickery 1.9.43 – Desktop Flickr client","content":"Use flickery to stay in touch with your Family and Friends by the pictures they post. flickery makes it easy to browse everyone’s photostream, their favorites or go through their photosets.   Share. Share your photos with ease. Edit, add effects, tags, titles, descriptions and even locations to your photos and videos.   Organize. Drag’n’drop […]"},{"link":"https://nmac.to/blog/farensius-2-0-4/","image":"https://nmac.to/wp-content/uploads/2014/11/Farensius.png","title":"Farensius 2.0.4 – Display weather in the menu bar","content":"Farensius is a little application that displays the current weather on your menubar.   Base features: Current temperature in Celsius or Fahrenheit in the menu bar. An icon of the current weather condition in the menu bar. Auto-discover location. Auto-detect sunrise/sunset time to toggle between day/night modes. Extended weather report when the mouse cursor hovers […]"},{"link":"https://nmac.to/blog/cleanmyphone-2-0/","image":"https://nmac.to/wp-content/uploads/2014/01/CleanMyPhone.png","title":"CleanMyPhone 2.0 – Keep your iPhone, iPad, or iPod touch clean and well-organized","content":"CleanMyPhone is an ingeniously simple and powerful application that will help you keep your iPhone, iPad, or iPod touch clean and running smoothly. It includes useful tools such as Disk Manager, App Cleaner, Removal of Document and Data, Find Large Files, One-Click-Copy, and more.   Configure, Organize and Manage Files and Apps on Your iOS […]"},{"link":"https://nmac.to/blog/briefly-1-5-2/","image":"https://nmac.to/wp-content/uploads/2014/11/Briefly.png","title":"Briefly 1.5.2 – Still-motion video creator","content":"With Briefly, still-motion videos are a neat and fun way to show hundreds and hundreds of your photos within a few minutes. (Still-motion videos consist of photos that are shown for the fraction of a second – though not to be confused with stop motion where photos necessarily correlate with each other and create the […]"},{"link":"https://nmac.to/blog/wondershare-dr-fone-5-2-0/","image":"https://nmac.to/wp-content/uploads/2014/10/Wondershare-Dr.Fone_.png","title":"Wondershare Dr.Fone 5.2.0 – Mac iphone data recovery","content":"Dr.Fone is the World’s 1st iPhone, iPad & iPod touch Data Recovery Software for Mac. Recover 7 kinds of deleted files by directly scanning iPhone 5/4S, iPad 2, the new iPad, iPod touch 5, iPad with Retina display & iPad mini. Recover 12 kinds of deleted data directly from iPhone 4/3GS, iPod touch 4 and […]"},{"link":"https://nmac.to/blog/weather-live-1-5/","image":"https://nmac.to/wp-content/uploads/2014/06/Weather-Live.png","title":"Weather Live 1.5 – Beautiful weather for multiple locations around the world","content":"Meet Weather Live, the most beautiful weather app. Ever.   Don’t let bad weather take you by surprise! Whether it is cloudy, rainy, snowy, or even stormy outside, Weather Live will provide you with current weather conditions and forecast in your city and multiple locations all around the world. You won’t even have to look […]"},{"link":"https://nmac.to/blog/toau-1-6/","image":"https://nmac.to/wp-content/uploads/2014/10/Toau.png","title":"Toau 1.6 – Convert plain text into audio","content":"Toau helps you convert plain text into an audio file.   To have it speak a language other than the default English, go to “Preferences – System Voice – Customize..”, then choose the new voice you want to download. After the download is finished, set the “System Voice” to the new voice you just downloaded. […]"},{"link":"https://nmac.to/blog/thoughts-1-2-4/","image":"https://nmac.to/wp-content/uploads/2014/03/Thoughts.png","title":"Thoughts 1.2.4 – Information assistant","content":"Thoughts is a complete information assistant which allow you to create rich documents containing notes, links, pictures, tables and lists – in a beautiful interface. Whether you are journalist, storywriter, hobbiest or developer, you will find out that thoughts is just the perfect place to store all your thoughts.   Features: Style your text with […]"},{"link":"https://nmac.to/blog/supremeplayer-1-0/","image":"https://nmac.to/wp-content/uploads/2014/10/SupremePlayer.png","title":"SupremePlayer 1.0 – Media player app","content":"SupremePlayer is a media player app.   The supported formats include: mpg, mpeg, mpeg 2, vob, dat, mp4, m4v, ts, rm, rmvb, wmv, asf, mkv, avi, 3gp, 3g2, flv, mov, h264/x264, 1080p/720p HD video, etc.   Intel, 64-bit processor OS X 10.7 or later                           […]"}]