[{"link":"https://nmac.to/blog/affinity-publisher/","image":"https://nmac.to/wp-content/uploads/2021/01/Affinity_Publisher_1.png","title":"Affinity Publisher 1.10.5 – Professional desktop publishing software","content":"Bring your vision to life with Affinity Publisher, the most advanced professional publishing software from the developers of the award-winning Affinity Designer and Affinity Photo apps.   This incredibly smooth, intuitive app gives you the power to combine your images, graphics and text to make beautiful layouts ready for publication. From magazines, books, brochures, posters, […]"},{"link":"https://nmac.to/blog/affinity-designer/","image":"https://nmac.to/wp-content/uploads/2021/01/Affinity_Designer_1.png","title":"Affinity Designer 1.10.5 – Vector graphic design software","content":"Affinity Designer is an incredibly accurate vector illustrator that feels fast and at home in the hands of creative professionals. It intuitively combines rock solid and crisp vector art with flexible layer management and an impressive range of high quality raster tools for finishing. With accuracy, quality and speed at the heart of every single […]"},{"link":"https://nmac.to/blog/chaos-control/","image":"https://nmac.to/wp-content/uploads/2019/01/Chaos-Control1.png","title":"Chaos Control 1.14 – GTD organizer | To-Do List","content":"Chaos Control was created to help you manage your goals and desired outcomes in both your business and personal life.   People don’t usually achieve impressive results simply by being good at task management. It’s the ability to set legitimate goals that makes the difference. Just write down your desired outcomes to make them real. […]"},{"link":"https://nmac.to/blog/superduper/","image":"https://nmac.to/wp-content/uploads/2017/09/SuperDuper3.png","title":"SuperDuper! 3.6.1 – Advanced disk cloning/recovery utility","content":"SuperDuper is an advanced, yet easy to use disk copying program. It can, of course, make a straight copy, or “clone” — useful when you want to move all your data from one machine to another, or do a simple backup. In moments, you can completely duplicate your boot drive to another drive, partition, or […]"},{"link":"https://nmac.to/blog/bartender/","image":"https://nmac.to/wp-content/uploads/2020/09/Bartender4.png","title":"Bartender 4.1.40 – Organize your menu bar apps","content":"Bartender lets you organize your menu bar apps.   Features Take control of your menu bar – With Bartender you can choose which apps stay in the menu bar, are displayed in the Bartender Bar or are hidden completely. The Bartender Bar – The Bartender Bar can be displayed and hidden as you want, by […]"},{"link":"https://nmac.to/blog/tilt-shift/","image":"https://nmac.to/wp-content/uploads/2022/03/Tilt-Shift.png","title":"Tilt Shift 1.0.3 – Miniature Fx for Photo & Video","content":"Tilt Shift enables you to add a unique miniature effect to photo and video. Add miniature effect to photo and video. Adjust lens blur, lens size, len position and lens shape. Apply beautiful cinematic filters. Crop and rotate.   Version 1.0.3: Minor UI enhancement and bug fix   Intel, 64-bit processor macOS 11.0 or later […]"},{"link":"https://nmac.to/blog/linguist/","image":"https://nmac.to/wp-content/uploads/2017/09/Linguist1.png","title":"Linguist 2.6 – Menu-bar language translator","content":"Linguist lets you quickly translate text from any language, to any other language.   Features Set preferred source and target language Translate between over 103 languages Multiple modes menu bar and window Synonyms for each translation Listen to the pronunciation History of text translation Copy and paste any text   Version 2.6: We fixed bugs […]"},{"link":"https://nmac.to/blog/uk-salary-calculator/","image":"https://nmac.to/wp-content/uploads/2022/03/UK-Salary-Calculator.png","title":"UK Salary Calculator 4.2 – A simple numerical and graphical breakdown of your income","content":"UK Salary Calculator for macOS provides a simple numerical and graphical breakdown of your income. It is intended for use by residents (or prospective residents) of the United Kingdom. Companion iOS app also available.   FEATURES: Yearly, monthly, 4-weekly, weekly, daily and hourly breakdown of income tax (20%, 40% & 45%), national insurance contributions, pension […]"},{"link":"https://nmac.to/blog/davinci-resolve-studio/","image":"https://nmac.to/wp-content/uploads/2017/03/DaVinci-Resolve-Studio.png","title":"DaVinci Resolve Studio 17.4.5 – Professional non-linear editing and color correction","content":"DaVinci Resolve Studio is the color corrector standard in post production since 1984. There are thousands of colorists worldwide who understand the performance, quality and workflow of DaVinci and love it as their trusted partner in creativity. DaVinci is the name behind more feature films, television commercials, documentaries, episodic television production and music videos than […]"},{"link":"https://nmac.to/blog/salt-and-sanctuary/","image":"https://nmac.to/wp-content/uploads/2018/02/Salt-and-Sanctuary.png","title":"Salt and Sanctuary 1.0.0.8 – Stylized 2D action RPG Game","content":"A doomed sailor is shipwrecked on an uncharted island. In fog-shrouded valleys, where grinning, mossy corpses cling to rusted arms, shambling figures begin to stir. Beneath crumbling, salt-worn structures, labyrinthine passageways lead to unspeakable evil, long forgotten by man.   Salt and Sanctuary seamlessly combines fast, brutal, and complex 2D combat with richly developed RPG […]"}]