[{"link":"https://nmac.to/blog/hammer/","image":"https://nmac.to/wp-content/uploads/2013/03/Hammer.png","title":"Hammer 6.9.1 – Great way to build HTML websites","content":"Hammer is a great way of building out HTML websites. With features including HTML includes, SASS, and CoffeeScript parsing and clever paths, Hammer is an indispensable tool! Hammer has some built in features that happen automatically, and some clever functions you use with special hammer tags. HTML Includes – Front-end developers shouldn’t have to run […]"},{"link":"https://nmac.to/blog/tiny-metal/","image":"https://nmac.to/wp-content/uploads/2017/12/TINY-METAL.png","title":"TINY METAL 1.0.7 – A turn-based strategy game","content":"it’s WAR in TINY METAL, the revival of Japanese arcade war gaming!   Outfight the enemy with your own army of foot soldiers, tanks, helicopters, tactical vehicles, and fighter jets. Capture rival territories and extend your military power over the sprawling map of Zipang. Follow the gripping story of Nathan Gries and answer for yourself […]"},{"link":"https://nmac.to/blog/cosmic-brush-pro/","image":"https://nmac.to/wp-content/uploads/2017/12/CosmicBrush.png","title":"Cosmic Brush Pro 2.13.1 – Doodle on a photo or paint a piece of art from scratch","content":"Comic Brush Pro allows you to doodle on a photo or paint a piece of art from scratch. Be as creative as you want with painting tools like 3D-Shaded Brush, Halo Brush, Plasma Chain Brush, and Translucent Brush. You will also find more down-to-earth tools, including a standard brush and an eraser.   Features Full-Screen […]"},{"link":"https://nmac.to/blog/css-condenser/","image":"https://nmac.to/wp-content/uploads/2017/12/CSS-Condenser.png","title":"CSS Condenser 1.3 – Compress CSS to reduce file size","content":"CSS Condenser can quickly and easily compress and condense any CSS code – with just one click! Want faster loading times for your website, with more compact files, a lot smaller in size? CSS Condenser is the right tool for you.   Features Ultra-intuitive, easy-to-use interface Just one click needed Ideal for Web designers / […]"},{"link":"https://nmac.to/blog/proton-weather/","image":"https://nmac.to/wp-content/uploads/2017/12/Proton-Weather.png","title":"Proton Weather 1.0.5 – Clean and elegant weather app","content":"Proton Weather is a breath of fresh air in the realm of weather apps. It is clean, elegant and works smoothly on any given point of time. It loads basic weather statistics on a small yet compact app layout and sends you weather alerts as soon as there is any changes in your local weather. […]"},{"link":"https://nmac.to/blog/transcriva/","image":"https://nmac.to/wp-content/uploads/2017/12/Transcriva.png","title":"Transcriva 2.016 – Manual transcription with automatic transmission","content":"Transcriva is a manual transcription solution with automatic transmission. Whether it’s your meeting minutes, interviews, lectures, home movies, dictation, speeches, or your favorite TV show, Transcriva can help you transcribe them all. You do the typing, Transcriva takes care of the rest. Transcribe media clips on your Mac or on the web. Record media on […]"},{"link":"https://nmac.to/blog/all-audio-converter/","image":"https://nmac.to/wp-content/uploads/2017/12/All-Audio-Converter.png","title":"All Audio Converter 2.4.0 – Convert most media format files to audio","content":"All Audio Converter is one easy use app for converting most media format file to audio, You only need to drag media file or click to add media file, then click the convert button to select the output format to export, the converted file will list in the tableview. double click the select item to […]"},{"link":"https://nmac.to/blog/javascript-condenser/","image":"https://nmac.to/wp-content/uploads/2017/12/JavaScript-Condenser.png","title":"JavaScript Condenser 1.4 – Quickly compress your JavaScript code","content":"JavaScript Condenser allows you to quickly and easily compress and condense any JavaScript code with just one click. JavaSCript Condenser will give you faster loading times on your website.   Features: Ultra-intuitive, easy-to-use interface Just one click needed Ideal for Web Designers / Web Developers Lots of options to tweak the final output   Version […]"},{"link":"https://nmac.to/blog/html-condenser/","image":"https://nmac.to/wp-content/uploads/2017/12/HTML-Condenser.png","title":"HTML Condenser 1.3 – Compress HTML code for smaller file sizes","content":"HTML Condenser can quickly and easily compress and condense any HTML code – with just one click. Want faster loading times for your website, with more compact files, a lot smaller in size? HTML Condenser is the right tool for you.   Features Ultra-intuitive, easy-to-use interface Just one click needed Ideal for Web designers / […]"},{"link":"https://nmac.to/blog/dxo-perspective/","image":"https://nmac.to/wp-content/uploads/2017/12/DxO-Perspective.png","title":"DxO Perspective 1.0.6 – Easily correct perspective errors in your images","content":"With DxO Perspective, you can correct any perspective issues in your images in just a few clicks. A skewed building? A tilted horizon? Simply place the anchor points along the lines you want to fix, and your image instantly achieves a more natural look.   Features Automatically corrects even the most complex perspective problems: Several […]"}]