[{"link":"https://nmac.to/blog/action-legion-1-0/","image":"https://nmac.to/wp-content/uploads/2016/09/Action-Legion.png","title":"Action Legion 1.0 – A mouse-controlled, single-player war game","content":"Action Legion is a mouse-controlled, single-player war game on the PC and Mac with comparable similarities to classics such as Cannon Fodder. Fight your way through waves of enemies using an array of weapons, destroy enemy structures and bases, and defeat tough boss fights in this classical single-player epic!   In Action Legion, you step […]"},{"link":"https://nmac.to/blog/obscuritas-1-2/","image":"https://nmac.to/wp-content/uploads/2016/09/Obscuritas.png","title":"Obscuritas 1.2 – Adventure Horror & Puzzle Game","content":"When Sarah inherits her great-uncle’s old country home, she has no idea about the dark secret she has stumbled upon and into what obscure world it will take her to. Help Sarah solve the mystery and escape the malicious clutches of the old mansion. Fear is a constant companion on your journey. No matter the […]"},{"link":"https://nmac.to/blog/the-descendant-ep-3-3-2/","image":"https://nmac.to/wp-content/uploads/2016/09/The-Descendant.png","title":"The Descendant EP 3 3.2 – The end of the world is only the start","content":"THE DESCENDANT is a five part episodic adventure game series where the end of the world is only the start.   After climate change wrecked the planet, a man-made extinction event wiped humankind off the face of the Earth. Only a few thousand ‘descendants of humanity’ were hand-picked to survive the apocalypse, cryogenically suspended in […]"},{"link":"https://nmac.to/blog/themes-for-ibooks-author-4-5/","image":"https://nmac.to/wp-content/uploads/2016/09/Themes-for-iBooks-Author4.png","title":"Themes for iBooks Author 4.5 – Professionally developed templates for iBooks Author","content":"Themes for iBooks Author is a collection of compelling templates for Apple’s new application for book creation and publishing. Browse the wide range of designs to find the perfect look, add your text and images, and publish your own book to iBookstore!   The available templates cover various book categories, from business and travel, to […]"},{"link":"https://nmac.to/blog/lost-castle-1-0/","image":"https://nmac.to/wp-content/uploads/2016/09/Lost-Castle.png","title":"Lost Castle 1.0 – An Action & Adventure RPG Game","content":"Lost Castle is a super cute, super hard action RPG with roguelike elements and randomized dungeons. Brimming with a host of hand drawn, humorous characters and environments that embrace retro action with modern twists.   Prologue: In its glory days, Castle Harwood was the heart of a happy land governed by wise and virtuous nobles. […]"},{"link":"https://nmac.to/blog/purrfect-memory-1-03/","image":"https://nmac.to/wp-content/uploads/2016/09/Purrfect-Memory.png","title":"Purrfect Memory 1.03 – Memorization and Study Tool","content":"Purrfect Memory is great for memorize anything you can type. A subtle yet powerful menu bar app, Purrfect Memory reminds you to practice and memorize phrases, quotes, facts or verses.   Adaptable: Level up your brain, as Purrfect Memory intelligently gives just enough hints to allow you to recall and reinforce what you are trying […]"},{"link":"https://nmac.to/blog/corporate-packs-for-pages-2-2/","image":"https://nmac.to/wp-content/uploads/2016/09/Corporate-Packs-for-Pages.png","title":"Corporate Packs for Pages 2.2 – Collection of professional Pages templates","content":"Corporate Packs for Pages gives your Pages documents a new look! It features packs with different designs. Each of them contains more than 80 layouts for virtually any type of documents you may need in your office. Give your clients and partners a “wow” moment!   Each pack contains up to 41 different templates, from […]"},{"link":"https://nmac.to/blog/layouts-for-keynote-2-5/","image":"https://nmac.to/wp-content/uploads/2016/09/Layouts-for-Keynote.png","title":"Layouts for Keynote 2.5 – A collection of 79 Keynote themes","content":"Layouts for Keynote is a collection of 79 themes created for your unique slideshows by the Jumsoft design team. Outline your ideas, proposals, contracts, and solutions. Then, enhance them with stylish backgrounds, charts, diagrams, tables, and other data visualization elements to attain all you have been working for.   Each theme contains at least 20 […]"},{"link":"https://nmac.to/blog/falcon-1-4-1/","image":"https://nmac.to/wp-content/uploads/2016/06/Falcon.png","title":"Falcon 1.4.1 – A simple, markdown based note-taking app","content":"Falcon is a simple, markdown based note-taking app.   Features Write notes, journals and research Organise notes in multiple notebooks for various topics Supports adding images to your notes Search notes easily by their title, content or tags Editor-only and Preview-only modes allow to edit and read notes in an uncluttered and focused way. Backup […]"},{"link":"https://nmac.to/blog/cliphouse-1-0-6/","image":"https://nmac.to/wp-content/uploads/2016/09/ClipHouse.png","title":"ClipHouse 1.0.6 – Four rooms for video RAW processing","content":"ClipHouse makes the handling of video RAW material as simple as possible. The ClipHouse workflow is split into four distinct and easy steps: Copy: Checksum-verified Backup Manage: Native playback and easy clip organization Color: Exposure settings and creative grading on RAW images Export: Creation of ProRes and H.264 movies for editorial   ClipHouse helps you […]"}]