[{"link":"https://nmac.to/blog/vsd-viewer/","image":"https://nmac.to/wp-content/uploads/2022/03/VSD-Viewer.png","title":"VSD Viewer 6.15.1 – View Microsoft Visio documents","content":"VSD Viewer is a professional Visio Drawings-viewer for OS X. VSD Viewer opens documents of all Visio drawing formats – binary VSD 2000-2013, and XML-based VDX/VSDX. The app opens complex formatted Visio Drawings, renders all the drawing content including: regular shapes with formatting, rich formatted texts, graphic objects and images, windows metafile images, OLE objects, […]"},{"link":"https://nmac.to/blog/vsdx-annotator/","image":"https://nmac.to/wp-content/uploads/2022/03/VSDX-Annotator.png","title":"VSDX Annotator 1.15.1 – Preview and annotate Vision docs.","content":"VSDX Annotator is a unique tool, designed to let Mac users open, preview, and annotate Visio drawings. It provides a wide range of annotation possibilities, along with the ability to share visual documents in a multi-platform environment. View Visio drawings as a high-quality image. VSDX Annotator renders drawings and diagrams exactly the same way as […]"},{"link":"https://nmac.to/blog/carbon-copy-cloner/","image":"https://nmac.to/wp-content/uploads/2014/01/Carbon-Copy-Cloner.png","title":"Carbon Copy Cloner 6.1.1 – Easy-to-use backup/cloning utility","content":"Carbon Copy Cloner backups are better than ordinary backups. Suppose the unthinkable happens while you’re under deadline to finish a project: your Mac is unresponsive and all you hear is an ominous, repetitive clicking noise coming from its hard drive. With ordinary backups, you’d spend your day rushing out to a store to buy a […]"},{"link":"https://nmac.to/blog/anygo/","image":"https://nmac.to/wp-content/uploads/2021/02/AnyGo.png","title":"AnyGo 5.5.1 – Easily Simulate the GPS Location on Your iPhone/iPad","content":"With AnyGo you can do the following: Spoof to anywhere in LBS(Location Based Service) games without actually moving or walking Easily access any videos, music, movies and services that may be restricted to you based on your location Share a virtual location on social media to trick your friends Easily test LBS and games Easily […]"},{"link":"https://nmac.to/blog/glancecal/","image":"https://nmac.to/wp-content/uploads/2021/05/GlanceCal_1.png","title":"GlanceCal 1.6.2 – Your calendar at a glance","content":"Work more productively on your Mac with GlanceCal and never miss an appointment again. See easily and quickly which appointment is next and get an overview of your day. Overview of your daily calendar entries Highlighting of the current/next appointment Distinguish past, future and current appointment with different markings Displays the date easily visible in […]"},{"link":"https://nmac.to/blog/scrutiny/","image":"https://nmac.to/wp-content/uploads/2017/09/Scrutiny7.png","title":"Scrutiny 10.4.17 – Web optimization tool suite","content":"Scrutiny is a suite of web optimization tools. Version 6 has a rewritten engine which is faster and more efficient. It allows 30 days free and unrestricted use. This is a major update from v5. This is a completely free upgrade for v5 users and there is an upgrade path from v4.   Features Link […]"},{"link":"https://nmac.to/blog/foldor/","image":"https://nmac.to/wp-content/uploads/2021/06/Foldor.png","title":"Foldor 1.2.4 – Design Your Folder Icon","content":"Foldor is a tool for designing and modifying folder icons.   The main function: [Palettes] Preset more than ten kinds of color palettes, support customizing your own color palette [Icons] 19 types, up to 1000 icons for you to choose [Export] You can export the designed icon [Auto Save] You can view the icons you […]"},{"link":"https://nmac.to/blog/tangerinewallpaper/","image":"https://nmac.to/wp-content/uploads/2022/03/TangerineWallpaper.png","title":"TangerineWallpaper 1.4 – Game Animation Two Dimensional","content":"TangerineWallpaper is a set of 4K, rich classification of ultra high definition wallpaper applications, updated 10000 + every day, perfectly adapted to high-definition screen, specially designed for Mac Big Sur, I hope it can bring you the ultimate enjoyment of beauty every day!   Product features:   Massive library, updated daily, everything 4K zone, super […]"},{"link":"https://nmac.to/blog/groupspro/","image":"https://nmac.to/wp-content/uploads/2016/11/GroupsPro.png","title":"GroupsPro 5.2.1 – Manage contacts, contact groups and create mailing lists for mass email","content":"GroupsPro is the best way to create and organize groups of contacts and create mailing lists. A mailing list contains members of groups or individual recipients.   Features: Create and modify groups of address book contacts Assign contacts to groups (single and fast assigning) Create and modify mailing lists for mass emails Search for names, […]"},{"link":"https://nmac.to/blog/ikuka/","image":"https://nmac.to/wp-content/uploads/2022/03/iKuka.png","title":"iKuka 1.5 – Network speed,power,memory,IP","content":"iKuka is a lightweight assistant application that can display your Mac’s network speed, battery, CPU, memory, IP and other information in real time.   iKuka is a lightweight assistant application that can display your Mac’s network speed, battery, CPU, memory, IP and other information in real time.   Features: Display the real-time network speed of […]"}]