[{"link":"https://nmac.to/blog/music-tag-editor/","image":"https://nmac.to/wp-content/uploads/2017/06/Music-Tag-Editor-Pro.png","title":"Music Tag Editor Pro 6.1.2 – Easily edit music tags","content":"Music Tag Editor Pro can help you edit your music-tag info easily and effectively. You can also use it to convert the text encoding of music tags. It can repair the messy code in music tags. You also can download the album image for MP3 files.   Supported music formats: MP3, M4A (Apple lossless), FLAC, […]"},{"link":"https://nmac.to/blog/typeface/","image":"https://nmac.to/wp-content/uploads/2020/01/Typeface_3.png","title":"Typeface 3.5.2 – Preview your fonts","content":"Typeface helps you pick the perfect font from your collection.   Typography can be beautiful and is one of the most important aspects of design. But it is often hard to find the font that conveys just the right emotion, especially if you’re not sure what you’re looking for. With a minimal interface and total […]"},{"link":"https://nmac.to/blog/marked/","image":"https://nmac.to/wp-content/uploads/2021/02/Marked_2.png","title":"Marked 2.6.16 – Open multiple file types as rendered HTML documents","content":"Marked is an app which allows you to preview your Markdown (in any flavor) as you write in your favorite text editor. It tracks your file changes and updates the preview as you go, even automatically scrolling to the point in the file where you’re currently working. Version 1 is a solid application, but version […]"},{"link":"https://nmac.to/blog/sidenotes/","image":"https://nmac.to/wp-content/uploads/2019/11/SideNotes.png","title":"SideNotes 1.4.6 – Note-taking where you put all your buzzing thoughts in a neat","content":"Have you ever had a thought that came to your mind and all you wanted was to write it down quickly? Meet SideNotes! It’s an app for note-taking where you put all your buzzing thoughts in a neat, quick and organized way. Enjoy its non-distractive workflow. With SideNotes you can save your ideas, pictures, task […]"},{"link":"https://nmac.to/blog/disk-space-analyzer-pro/","image":"https://nmac.to/wp-content/uploads/2020/06/Disk-Expert3.png","title":"Disk Space Analyzer Pro 3.7.1 – Space Usage Analyzer & Cleanup Utility","content":"Disk Space Analyzer Pro is the best solution when your Startup Disk is almost full. You will need to check disk space on your Mac, find large files and see what stray data occupies so much valuable Mac hard drive space.   If you have low disk space, don’t panic! Disk Space Analyzer Pro is […]"},{"link":"https://nmac.to/blog/mediainfo/","image":"https://nmac.to/wp-content/uploads/2014/01/MediaInfo.png","title":"MediaInfo 22.03 – Supplies technical and tag information about a video or audio file","content":"MediaInfo provides easy access to technical and tag information about video and audio files.   A non-exhaustive list of the information MediaInfo can retrieve: Container: format, profile, commercial name of the format, duration, overall bit rate, writing application and library, title, author, director, album, track number, date, duration… Video: format, codec id, aspect, frame rate, […]"},{"link":"https://nmac.to/blog/mitti/","image":"https://nmac.to/wp-content/uploads/2021/12/Mitti_2.png","title":"Mitti 2.1.3 – Easy-to-use video-cue solution","content":"Mitti is a modern, feature-packed but easy-to-use pro video cue playback solution for theatre, audiovisual shows, performances, and exhibitions.   Version 2.1.3: Fixes Playhead scrubbing problems with NMC No audio on backup after pause with NMC ESC should cancel editing on text fields Cue Inspector does not refresh after deselecting all Cue with ESC CMD+ESC […]"},{"link":"https://nmac.to/blog/irvue/","image":"https://nmac.to/wp-content/uploads/2018/03/Irvue.png","title":"Irvue 2.7.14 – Gorgeous wallpapers on your Desktop","content":"Irvue (was Unsplash Wallpaper) provides gorgeous wallpapers for your Desktop.   Features Hundreds of high-resolution photos from unsplash.com Collections: Featured and All Shortcuts Scheduling wallpaper update Blacklist Saving wallpaper into Pictures folder   Note: This application contains in-app and/or external module purchases.   Version 2.7.14: Fixed bug where “About photo” doesn’t show any information   […]"},{"link":"https://nmac.to/blog/hyperdock/","image":"https://nmac.to/wp-content/uploads/2017/03/HyperDock1.png","title":"HyperDock 1.8.0.10 – Select windows by moving the mouse over a dock item and more","content":"HyperDock adds long awaited features to your Dock: Select individual application windows & tabs just by moving the mouse on a dock item, use mouse clicks to quickly open new windows and many more.   Window Previews Ever wondered how to activate a single window instead of a whole application? The Window Preview bubble shows […]"},{"link":"https://nmac.to/blog/focusplan-pro/","image":"https://nmac.to/wp-content/uploads/2022/01/Focusplan_Pro_1.png","title":"Focusplan Pro 1.6.13 – Simple mind mapping and brainstorming app","content":"Focusplan is a powerful, yet wonderfully simple mind mapping and brainstorming app. Focusplan helps you to capture, develop, and share your ideas, turning them into a stunning mind map. Focusplan makes mind mapping easy, fast, and stunning. Our most stunning take on mind mapping feature set lets you capture what’s on your mind quickly and […]"}]