[{"link":"https://nmac.to/blog/aimersoft-music-recorder/","image":"https://nmac.to/wp-content/uploads/2018/12/Aimersoft.Music_.Recorder.png","title":"Aimersoft Music Recorder 2.4.3 – Record online music from 10000+ sites","content":"Aimersoft Music Recorder can help you save any audio with absolutely 100% original quality form online radio stations, streaming media player as well as music video sharing sites. Besides, it can intelligently split tracks and filters out ads when recording. What’s more, it will auto-identify music metadata information for the recorded music. Your music enjoyment […]"},{"link":"https://nmac.to/blog/layout-lab/","image":"https://nmac.to/wp-content/uploads/2017/01/Layouts.-for-Keynote3.png","title":"Layout Lab 3.3.3 – Keynote themes with customizable elements","content":"Layout Lab for Keynote is a collection of 100+ themes created for your unique slideshows by the Jumsoft design team. Outline your ideas, proposals, contracts, and solutions. Then, enhance them with stylish backgrounds, charts, diagrams, tables, and other data visualization elements to attain all you have been working for.   Each theme contains at least […]"},{"link":"https://nmac.to/blog/network-speed-monitor/","image":"https://nmac.to/wp-content/uploads/2017/06/Network-Speed-Monitor2.png","title":"Network Speed Monitor 2.4.1 – Monitor the speed of your Internet connection","content":"Network Speed Monitor is a simple and easy-to-use application to display your current network speed in status bar, including the downloading and uploading data.   When your computer connects to the network, you can see your current network speed with Network Speed Monitor.   Network Speed Monitor is a handy application for you to monitor […]"},{"link":"https://nmac.to/blog/demetrios-the-big-cynical-adventure/","image":"https://nmac.to/wp-content/uploads/2019/01/Demetrios.png","title":"Demetrios The BIG Cynical Adventure 1.1.0 – Adventure & puzzles game mixed with silly jokes","content":"Demetrios is a quirky adventure game packed with tons of humor!    Bjorn Thonen, a slob of an antique dealer living in Paris, is robbed one night after coming home drunk. Forced to conduct his own investigation with the help of his neighbor Sandra, he ends up involved in a murky, mysterious affair. Will these […]"},{"link":"https://nmac.to/blog/forgotton-anne/","image":"https://nmac.to/wp-content/uploads/2018/12/Forgotton-Anne.png","title":"Forgotton Anne CE 4.6.4 – Cinematic adventure game focusing on meaningful storytelling","content":"Step into a hand-animated realm of wonder in which everyday objects take on a life of their own. Uncover the Forgotlings’ mysteries & harness magical forces as you embark upon a quest to return home.   Key Features: Discover a beautifully realised world of wonder filled with Forgotlings – charming everyday objects brought to life, […]"},{"link":"https://nmac.to/blog/photo-recovery-guru/","image":"https://nmac.to/wp-content/uploads/2019/01/Photo-Recovery-Guru.png","title":"Photo Recovery Guru 4.3 – Photo recovery utility","content":"Photo Recovery Guru is the most modern, the most technologically advanced, and the easiest to use photo recovery software available.   We would not state that if we could not back it up, but we can — instantly and risk free. Download the Free Demo to be able to quickly see it in action for […]"},{"link":"https://nmac.to/blog/file-extractor/","image":"https://nmac.to/wp-content/uploads/2019/01/File-Extractor.png","title":"File Extractor 1.3 – Scan & extract data from selected files or folders","content":"FileExtractor is a powerful utility that will scan your selected files or folders and extract the individual files, text, and other data contained in them.   It is useful for extracting wanted files out of other files in a variety of circumstances. For example when you have a 3rd party file that you need the […]"},{"link":"https://nmac.to/blog/gitftp-deploy/","image":"https://nmac.to/wp-content/uploads/2017/11/GitFTP-Deploy.png","title":"GitFTP-Deploy 2.7.1 – Simple FTP-deployments for your smaller projects","content":"GitFTP-Deploy provides dead-simple FTP deployments for your smaller projects. While working with smaller sites you sometimes need a convenient way of deploying to a shared host where you don’t have access to SSH. The site is maybe a presentation for a company and does not receive regular updates.   Version 2.7.1: High Sierra rendering issues […]"},{"link":"https://nmac.to/blog/hexels-3/","image":"https://nmac.to/wp-content/uploads/2013/03/Hexels.png","title":"Hexels 3.1.5 – Grid-based painting tool","content":"    Hexels is a grid-based painting tool that lets you effortlessly create brilliant works of art. Whether you’re a pint-sized pierogi, a professional cuddler, or my imaginary friend, Hexels’ shape-shifting personality will captivate you.   Features Animation editor Layers Extensible post-processing system Animated layer transforms Clipping and layer masks Color adjustments Layered PSD export […]"},{"link":"https://nmac.to/blog/wandersong/","image":"https://nmac.to/wp-content/uploads/2019/01/Wandersong.png","title":"Wandersong 1.0.0 – Story Rich Music Adventure Game","content":"A musical adventure where you use singing to save the world! Play as a silly bard who embarks on a globe-trotting journey to learn about the mysterious Earthsong, said to be able to prevent the universe’s imminent end. Along the way there’s a huge cast of characters to meet, puzzles to solve and songs to […]"}]