[{"link":"https://nmac.to/blog/transroad/","image":"https://nmac.to/wp-content/uploads/2018/03/TransRoad-USA.png","title":"TransRoad: USA 1.2.1 – Management Simulation & Strategy Game","content":"In this exciting new management simulation game by Deck13 Hamburg you will start out as the owner of a small logistics company and cleverly employ all of your managerial skills to lead your business to success.   Have you ever wanted to found a company in Kansas City? Or are you more the Vegas type? […]"},{"link":"https://nmac.to/blog/messenger-for-vk/","image":"https://nmac.to/wp-content/uploads/2018/03/Messenger-for-VK.png","title":"Messenger for VK 6.1.1 – Messaging app for VK","content":"Messenger for VK (was VKMessages) best client-messenger for VK. This client allows you to communicate directly from the desktop.   The application has an impressive list of features, including: Forwarding, copying, and deleting messages Search the dialogues and messages Built-in web browser Settings: the ability to disable online show, the transfer of the application in […]"},{"link":"https://nmac.to/blog/compress/","image":"https://nmac.to/wp-content/uploads/2018/02/Compress.png","title":"Compress 1.0.3 – Compress JPG, PNG, and PSD files and preserve quality","content":"Compress allows users to easily and dramatically compress PNG and JPG images on their Mac. Additionally, it allows users to quickly convert PSDs to JPGs without ever having to open Photoshop.   Other features Bulk conversion of files and folders. Custom extensions and removal of metadata Easy compression of images for the web Easy compression […]"},{"link":"https://nmac.to/blog/fotor/","image":"https://nmac.to/wp-content/uploads/2017/10/Fotor-Photo-Editor.png","title":"Fotor Photo Editor 3.5.1 – Powerful photo editor app","content":"Fotor is a mighty photo editor packed with moment-capturing tools. It’s fun, versatile, and ideal for creating picturesque memories.   Tools for editing. Powered by a cutting edge processing engine, Fotor is well-suited for processing high-quality images. Adjust your image’s white balance, exposure, brightness, color contrast, saturation, and sharpness. Or straighten, crop, rotate, and manipulate […]"},{"link":"https://nmac.to/blog/chuchel/","image":"https://nmac.to/wp-content/uploads/2018/03/CHUCHEL.png","title":"CHUCHEL 1.0 – A comedy adventure game","content":"CHUCHEL is a comedy adventure game from the creators of Machinarium, Botanicula and Samorost. Join the hairy hero Chuchel and his rival Kekel as they will be facing numerous puzzles and challenges in their quest to retrieve the precious cherry!   The reward? Cheerful situational humor, wild music and sounds by the band DVA and […]"},{"link":"https://nmac.to/blog/nzbvortex/","image":"https://nmac.to/wp-content/uploads/2016/03/NZBVortex3.png","title":"NZBVortex 3.4.3 – Lightweight Usenet NZB download client","content":"NZBVortex is a small, efficient, and powerful NZB client for OS X, optimized for performance and ease of use–a usenet client which really takes the pain out of usenet downloading the most efficient way.   Please note: You need a subscription to a usenet server or one from your Internet provider.   Features Very efficient […]"},{"link":"https://nmac.to/blog/image-cleaner/","image":"https://nmac.to/wp-content/uploads/2017/09/Image-Cleaner.png","title":"Image Cleaner 1.1.1 – Fix Duplicates","content":"Image Cleaner is the complete solution for finding and removing duplicate image files. If you are a point and shoot photographer, your hard drive will inevitably get filled up with a lot of nearly identical images that will take up a considerable amount of disk space. This is where Image Cleaner comes in with its […]"},{"link":"https://nmac.to/blog/warp/","image":"https://nmac.to/wp-content/uploads/2016/04/Warp.png","title":"Warp 4.0 – Convert and analyze large data sets at light speed","content":"Warp allows you to convert and analyze (very) large databases with ease at the speed of light. In Warp, you work on a small subset of the data, after which Warp repeats your actions on the entire dataset. Unlike most data analysis apps, you do not have to type any codes in Warp. Read data […]"},{"link":"https://nmac.to/blog/tyme-2/","image":"https://nmac.to/wp-content/uploads/2016/03/Tyme2.png","title":"Tyme 2 2018.7 – Effective time-tracking","content":"Tyme 2 is a simple and effective time-tracking tool for anyone who wants to keep an overview of the times they have worked. It is as clean and simple as the previous version, but with powerful new features that will make your life even easier!   Features Everything at a glance – With Tyme, everything […]"},{"link":"https://nmac.to/blog/the-silent-age/","image":"https://nmac.to/wp-content/uploads/2018/03/The-Silent-Age.png","title":"The Silent Age 1.0 – Thrilling point-and-click adventure game","content":"Help Joe as he travels between the groovy present of 1972 and the apocalyptic future of 2012 to discover the truth behind humankind’s extinction—a quest entrusted to him by a dying man from the future. Use your portable time travel device to solve puzzles that bring you closer to answers and saving humanity.   Winner […]"}]