[{"link":"https://nmac.to/blog/appgenome-1-3-2/","image":"https://nmac.to/wp-content/uploads/2016/06/AppGenome.png","title":"AppGenome 1.3.2 – Create your own URL-based apps","content":"AppGenome lets you set your own URL, browser agent type (mobile or desktop), and create your own desktop app that will stay in your menubar, so you can forget about all those “app for” apps.   Features Set your own URL of any web page or web app Manually set your agent type (browser type): […]"},{"link":"https://nmac.to/blog/jack-nicklaus-perfect-golf-1-0/","image":"https://nmac.to/wp-content/uploads/2016/07/Jack.Nicklaus.Perfect.Golf_.png","title":"Jack Nicklaus Perfect Golf 1.0 – Single player and multiplayer golf game","content":"Jack Nicklaus Perfect Golf is a next generation golf game from Perfect Parallel Studios an independent game developer and published by Perfect.Golf Inc.   High resolution visuals, highly accurate ball flight physics developed using state of the art launch monitors, Jack Nicklaus Perfect Golf is the best simulation of golf released to date.   Jack […]"},{"link":"https://nmac.to/blog/windlands/","image":"https://nmac.to/wp-content/uploads/2016/07/Windlands.png","title":"Windlands 1.0.5 – A first person grappling hook exploration game","content":"Soar through the ruins of a fallen world and discover the secrets of the ancients. Windlands has been developed primarily for Virtual Reality headsets, but is also a great experience for those without headsets.   It appeals to those who want to explore the breathtaking vistas at a relaxing pace, while the challenging routes attract […]"},{"link":"https://nmac.to/blog/r-b-i-baseball-16-1-0/","image":"https://nmac.to/wp-content/uploads/2016/07/R.B.I.Baseball-16.png","title":"R.B.I.Baseball 16 1.0 – The legendary Major League Baseball franchise","content":"Make the play with your favorite Major League Baseball team and win the World Series! R.B.I. 16 features enhanced lighting and graphics, revamped defensive AI, an improved batting system, and the ability to sim through games in Season mode. Feel the action with new fielding moves like dives, wall catches, pump-fakes and more! Take your […]"},{"link":"https://nmac.to/blog/gnomes-vs-fairies-1-0/","image":"https://nmac.to/wp-content/uploads/2016/07/Gnomes.Vs_.Fairies.png","title":"Gnomes Vs. Fairies 1.0 – Hack ‘n’ slash-Action RPG platformer","content":"Gnomes vs. Fairies is a PS1/N64 style Hack ‘n’ slash-Action RPG platformer. Upgrade your gnome’s abilities with dozens of items and master the 5 elements of sword magic, it’s a totally unique retro fantasy platformer blending all the best elements of classic 3D titles such as Mario 64, Zelda OoT, Spyro   You are the […]"},{"link":"https://nmac.to/blog/sky-gamblers-storm-raiders/","image":"https://nmac.to/wp-content/uploads/2014/01/Sky-Gamblers_Storm-Raiders.png","title":"Sky Gamblers – Storm Raiders 1.4.0 – Ultimate WWII Air Combat Game","content":"THIS IS THE ULTIMATE WWII AIR COMBAT GAME! You’ll participate in visceral dogfights, protect cities and fleets, bomb enemy structures and even fly through tunnels. Everything is set up in accurately recreated real life locations like Pearl Harbor, Coast of Dover, Midway, Germany and France.   AMAZING QUALITY AND IT’S ON OSX!  Unparalleled visuals, special effects and […]"},{"link":"https://nmac.to/blog/the-hit-list-1-1-25/","image":"https://nmac.to/wp-content/uploads/2015/10/The.Hit_.List_.png","title":"The Hit List 1.1.25 – Advanced reminder application","content":"The Hit List manages the daily chaos of your modern life. It’s easy to learn – it’s as easy as making lists. And it’s powerful enough to let you plan, then forget, then act when the time is right.   Your life is complicated enough as it is. The tool to manage your life shouldn’t […]"},{"link":"https://nmac.to/blog/right-qr-1-2/","image":"https://nmac.to/wp-content/uploads/2016/07/Right.QR_.png","title":"Right QR 1.2 – Scans your Mac’s screen and detects any QR codes","content":"Right QR – Scans your Mac’s screen and detects any QR codes it finds including Bitcoin QRs. Open them in your browser, copy the contents or the QR Code image… with just a few clicks.   Works just like pointing a phone at your screen, except minus the phone, and without getting the URL back […]"},{"link":"https://nmac.to/blog/instastack-3-1-2/","image":"https://nmac.to/wp-content/uploads/2015/03/Instastack.png","title":"Instastack 3.1.2 – Instagram Mac desktop client","content":"Instastack is the most elegant way to browse Instagram on the Mac.   MenuBar Panel InstaStack is a new tool to help you to discover Instagram social media network. if you want to connect your instagram account from menubar on your mac , InstaStack is your tool.   Browse Photo Feeds Browse your Instagram feed, […]"},{"link":"https://nmac.to/blog/daylife-1-0-2/","image":"https://nmac.to/wp-content/uploads/2016/06/Daylife.png","title":"Daylife 1.0.2 – Tell your story, capture your thoughts and rediscover your dreams","content":"Daylife welcomes you with its simple and distraction-free interface so you can focus on your thoughts. Its elegant design makes powerful features unobtrusive so you can zero in on your story.   Quickly add entries at anytime. Click the Quicky Entry icon in the menu bar to quickly and easily add an entry to your […]"}]