[{"link":"https://nmac.to/blog/inpreflight-pro/","image":"https://nmac.to/wp-content/uploads/2017/11/InPreflight-Pro.png","title":"InPreflight Pro 2.11.28 – Preflight and batch packaging for Adobe InDesign","content":"InPreflight Pro is a powerful all-in-one solution to check InDesign documents and prepare them for final output and shipping.   Features Package multiple InDesign documents. InPreflight is the only program that can package multiple documents. It can collect all files into one folder, eliminating the need to collect the same links multiple times for each […]"},{"link":"https://nmac.to/blog/observer/","image":"https://nmac.to/wp-content/uploads/2017/11/Observer.png","title":">observer_ 4.15.2 – A cyberpunk horror game from creators of Layers of Fear","content":"What would you do if your fears were hacked? >observer_ is a cyberpunk horror game from Bloober Team, the creators of Layers of Fear. Discover a dark cyberpunk world beset by plagues, war and squalor. Play as the new front line of neural police as you hack into the jagged minds of the insane.   […]"},{"link":"https://nmac.to/blog/star-wars-knights-of-the-old-republic-ii/","image":"https://nmac.to/wp-content/uploads/2016/01/Star.Wars_.png","title":"Star Wars : Knights of the Old Republic II 1.0.2 – Star Wars journey game","content":"Five years after the events from the award winning Star Wars Knights of the Old Republic, the Sith Lords have hunted the Jedi to the edge of extinction and are on the verge of crushing the Old Republic. With the Jedi Order in ruin, the Republic’s only hope is a lone Jedi struggling to reconnect […]"},{"link":"https://nmac.to/blog/star-wars-knights-of-the-old-republic/","image":"https://nmac.to/wp-content/uploads/2017/11/Star-Wars-Knights-of-the-Old-Republic.png","title":"Star Wars Knights of the Old Republic 1.3.8 – Star Wars journey game","content":"It is four thousand years before the Galactic Empire and hundreds of Jedi Knights have fallen in battle against the ruthless Sith. As the last hope of the Jedi, you must lead a band of freedom fighters in an epic struggle to save the galaxy.   Can you master the awesome power of the Force […]"},{"link":"https://nmac.to/blog/passdirector/","image":"https://nmac.to/wp-content/uploads/2017/11/PassDirector.png","title":"PassDirector 2.5.2 – Encrypted, password-protected database for OS X and iPhone","content":"PassDirector is an encrypted, password-protected database for important personal data: bank accounts credit cards email accounts web passwords serial numbers hardware passwords Internet connection passwords phone numbers any other sensitive information   Version 2.5.2: Compatibility with macOS 10.13 High Sierra   Intel, 64-bit processor OS X 10.7.4 or later    "},{"link":"https://nmac.to/blog/stamp/","image":"https://nmac.to/wp-content/uploads/2017/08/Stamp.png","title":"STAMP 4.7.8 – FREE YOUR MUSIC","content":"Stamp moves tracks and playlists across various services – Apple Music, Spotify, Google Music and others!   Move wherever you want! Apple Music, Spotify, Google Music and others!   Select playlist you want to move to from Apple Music, Spotify, Google Music and others!   Stamp is easy to use. Just wait a few moments […]"},{"link":"https://nmac.to/blog/package-for-pages/","image":"https://nmac.to/wp-content/uploads/2017/11/Package-for-Pages.png","title":"Package for Pages 1.1 – A collection of templates for Pages","content":"Package for Pages Free is a collection of template lines, designed to give a unified, outstanding design to all documents representing your company. Your modern business approach is showcased with eye-catching brochures, invoices, letters, envelopes, and business cards. With Go Templates for Pages Free, you can turn your documents into a part of a successful […]"},{"link":"https://nmac.to/blog/the-last-wind-monk/","image":"https://nmac.to/wp-content/uploads/2017/11/The-Last-Wind-Monk.png","title":"The Last Wind Monk 1.0 – Point & Click Adventure Game","content":"The flute nose dynasty has been watching over Asposia for centuries on end. In secret, they fill the roly-poly world with light and life. Emil, a trader for odds and ends, has led all the Asposians astray, making them believe that the dynasty is in cahoots with dark forces. Seriously, who knows what this weird […]"},{"link":"https://nmac.to/blog/tempodo/","image":"https://nmac.to/wp-content/uploads/2017/11/Tempodo.png","title":"Tempodo 1.8 – Personal task manager","content":"Tempodo is a personal task manager and assists you in getting tasks done in time. The easy-to-use interface and focused design will help you to quickly find your way around. You can manage your tasks more efficiently today!   Tempodo is perfectly integrated into the functions and look and feel of your Mac OS X […]"},{"link":"https://nmac.to/blog/infographics-lab-for-pages/","image":"https://nmac.to/wp-content/uploads/2017/01/Infographics-Lab-for-Pages.png","title":"Infographics Lab for Pages 3.2 – Templates Bundle","content":"Infographics Lab for Pages contains a massive collection of thousands of data visualization tools to illustrate and enhance your Apple Pages documents! Every single item is crafted to perfection to be visually captivating and easily customizable.   Infographics Lab for Pages has items for virtually any occasion, from charts and diagrams to editable city, state, […]"}]