[{"link":"https://nmac.to/blog/trainz-simulator-2-2-0-2/","image":"https://nmac.to/wp-content/uploads/2016/01/Trainz.Simulator.2.png","title":"Trainz Simulator 2 2.0.2 – Best 3D Train Simulator on Mac","content":"Trainz Simulator 2 brings all new driving experiences, spectacular new high detailed content, the best world building tools and now comes with Multiplayer!   Trianz Simulator 2 is the biggest and best 3D Train Simulator on Mac allowing you to Build and operate the railroad of your dreams. You can build a fun layout in […]"},{"link":"https://nmac.to/blog/aerofly-rc-7-0-7/","image":"https://nmac.to/wp-content/uploads/2016/01/aerofly-RC-7.png","title":"aerofly RC 7.0.7 – R/C flight simulator","content":"Learn to fly radio controlled (R/C) models with aerofly RC 7. When it comes to learning and improving R/C flying skills, aerofly RC 7 is the number one choice for R/C pilots. Our state of the art physics simulation gives you a stunning level of realism. Together with our superb model details and awesome scenery […]"},{"link":"https://nmac.to/blog/playonmac-4-2-10/","image":"https://nmac.to/wp-content/uploads/2015/01/PlayOnMac.png","title":"PlayOnMac 4.2.10 – Run Windows apps on your Mac","content":"PlayOnMac is like wineskin, winebottler or crossover a piece of sofware which allows you to easily install and use numerous games and softwares designed to run with Microsoft’s Windows.Interesting points to know: You don’t have to own a Windows license to use PlayOnMac. PlayOnMac is based on Wine, and so profits from all its possibilities […]"},{"link":"https://nmac.to/blog/quick-n-easy-web-builder-3-1-4/","image":"https://nmac.to/wp-content/uploads/2016/01/Quick.n.Easy_.Web_.Builder.png","title":"Quick ‘n Easy Web Builder 3.1.4 – WYSIWYG website builder","content":"Quick ‘n Easy Web Builder is not an HTML editor, but an HTML generator! You can visually (WYSIWYG) create your websites by using drag-and-drop. Place objects (text, lines, images, shapes, slideshows, galleries, forms, etc.) anywhere on the page (pixel-perfect layouts). Now you can create amazing websites without having to learn HTML! It’s like desktop publishing […]"},{"link":"https://nmac.to/blog/goodtimes-1-3-2/","image":"https://nmac.to/wp-content/uploads/2015/02/GoodTimes.png","title":"GoodTimes 1.3.2 – Collage-making app","content":"GoodTimes is a worldwide unique collage solution for all occasions. With other apps a collage is just a collection of pictures, with GoodTimes your photos get a full environment, so the situation can impress even before you look at the first photo. It’s also not just a theme based, app, it brings all the objects, […]"},{"link":"https://nmac.to/blog/app-for-whatsapp-2-1-0/","image":"https://nmac.to/wp-content/uploads/2016/01/App-for-WhatsApp.png","title":"App for WhatsApp 2.1.0 – WhatsApp Messenger to your Mac desktop","content":"App for WhatsApp brings the WhatsApp Messenger to your Mac desktop with seamless integration by using native notifications, drag and drop to send media, full support for emojis and much more.   It is the must have App for any WhatsApp addict with a Mac!   Only with App for WhatsApp: Polished Mac style user […]"},{"link":"https://nmac.to/blog/color-guardians/","image":"https://nmac.to/wp-content/uploads/2016/01/Color.Guardians.png","title":"Color Guardians 1.0 – An exciting fast action side scrolling game","content":"Color Guardians is an exciting fast action side scrolling game that combines quick thinking with frantic gameplay into a hard to master challenge! Switching colors and collecting items, all while avoiding obstacles will surely test your reflexes!   The colorful world of Terra Color has been turned to a dark and sad place by the […]"},{"link":"https://nmac.to/blog/bee-2-3/","image":"https://nmac.to/wp-content/uploads/2015/03/Bee.png","title":"Bee 2.3 – Client for tracking in FogBugz, GitHub, and JIRA","content":"Bee syncs with GitHub Issues, JIRA, and FogBugz. You can also use Bee to keep track of your plain text notes.   Features: Flight Path. Flight Path lives in your menu bar and helps you by intelligently selecting the task you should be working on next. Notifications. Bee uses Notification Center to inform you of […]"},{"link":"https://nmac.to/blog/anime-studio-pro-11-2/","image":"https://nmac.to/wp-content/uploads/2016/01/Anime-Studio-Pro11.png","title":"Anime Studio Pro 11.2 – Complete 2D animation software for professionals","content":"Anime Studio Pro 11 is perfect for professionals looking for a more efficient alternative to tedious frame-by-frame animation. The intuitive and affordable feature set offers a solution to traditional animation tasks that are not available anywhere else at the same price point. With an intuitive interface, a visual content library and powerful features such as […]"},{"link":"https://nmac.to/blog/xrevert-2-1/","image":"https://nmac.to/wp-content/uploads/2015/09/XRevert.png","title":"XRevert 2.1 – Reverts icons and UI elements to those of prior OS X versions","content":"XRevert (was YosemiteRevert) changes application icons, system icons (such as the folder icon), menu bar icons, and more, as well as the system font, in OS X 10.10 Yosemite and later back to the way they were in prior versions of OS X. It also makes changes to aesthetics, such as the “traffic light icons” […]"}]