[{"link":"https://nmac.to/blog/iz-oz/","image":"https://nmac.to/wp-content/uploads/2020/01/Ozone9.png","title":"Ozone 9.0.3 – Creative Mastering Platform","content":"Elevate a good-sounding mix to a professional-sounding master with Ozone. iZotope’s critically acclaimed mastering software has all the tools you need to produce a full and polished sound. With a striking new interface and a modern workflow, Ozone 6 both guides and inspires your creativity at every step.   The Advanced version of Ozone 6 […]"},{"link":"https://nmac.to/blog/enolsoft-pdf-to-word/","image":"https://nmac.to/wp-content/uploads/2020/01/Enolsoft-PDF-to-Word-with-OCR.png","title":"Enolsoft PDF to Word with OCR 6.8.0 – Easily Convert PDF to Editable DOC/DOCX Files","content":"Besides native PDFs, PDF to Word with OCR applies Optical Character Recognition to accurately identify text in scanned PDF or images then convert them to Word quickly. Native/Searchable PDF Scanned/Non-searchable PDF PDFs with restrictions password Images (JPG, PNG, GIF, BMP, TIFF)   Keep Your Business Moving. PDFs are used in our work widely, we may […]"},{"link":"https://nmac.to/blog/divvy/","image":"https://nmac.to/wp-content/uploads/2017/02/Divvy1.png","title":"Divvy 1.5.2 – Create custom workspaces, dividing your screen for efficiency","content":"Divvy is an entirely new way of managing your workspace. It allows you to quickly and efficiently “divvy up” your screen into exact portions.   With Divvy, it is as simple as calling up the interface, clicking and dragging. When you let go, your window will be resized and moved to the relative position on […]"},{"link":"https://nmac.to/blog/audfree-spotify-music-converter/","image":"https://nmac.to/wp-content/uploads/2018/07/AudFree-Spotify-Music-Converter.png","title":"AudFree Spotify Music Converter 1.5.0 – Convert Spotify songs to common audio formats","content":"AudFree Spotify Music Converter can help both free and premium subscribers to easily download and convert any track, album, playlist and artist from Spotify to common audio formats so that you can play the Spotify music offline on any popular device without limit. It works at 5X faster speed while keeping the original ID3 tags […]"},{"link":"https://nmac.to/blog/ghostnote/","image":"https://nmac.to/wp-content/uploads/2016/01/Ghostnote2.png","title":"Ghostnote 2.2.3 – Contextual notes to almost anything on your mac","content":"Ghostnote adds contextual notes to almost anything on your mac. Add notes & todos to folders, applications, open documents, even websites. Think about it as post-it-notes for your OS.   Not everything is a precious quote, your grocery list or your million dollar business ideas. Sometimes you just need to keep some information for a […]"},{"link":"https://nmac.to/blog/fonepaw-android-data-recovery/","image":"https://nmac.to/wp-content/uploads/2017/07/FonePaw-Android-Data-Recovery.png","title":"FonePaw Android Data Recovery 2.8.0 – Easy and Fast Way to Recover Android Files","content":"Recover deleted & lost photos, videos, audios, WhatsApp, text messages, contacts, call logs and documents from your Android devices and SD card easily   For Android users, FonePaw Android Data Recovery with a user-friendly interface is trouble-free and pleasing to navigate in recovering the existing and deleted data from smartphones running Android OS between 2.1 […]"},{"link":"https://nmac.to/blog/new-file-creation/","image":"https://nmac.to/wp-content/uploads/2017/10/New-File-Creation.png","title":"New File Creation 5.9 – Easy & quick document creation app","content":"How many times have you ever wondered how to get all your templates for your documents together in one application? So it would be easy to create quickly a document and start working. Or just a new document in the location that you want.   New File Creation is a small utility that allows you […]"},{"link":"https://nmac.to/blog/juice/","image":"https://nmac.to/wp-content/uploads/2019/08/Juice.png","title":"Juice 1.3.1 – The missing Bluetooth manager for macOS","content":"The missing Bluetooth manager for macOS   Connect and view your devices with ease Have instant access to your favorite devices from  Macbook Pro Touch Bar macOS Notification Center Built-in Control Center in the Menu Bar, launchable with global hotkey   First Useful Touch Bar App… Ever Connect with your devices from anywhere with the […]"},{"link":"https://nmac.to/blog/collage-2/","image":"https://nmac.to/wp-content/uploads/2020/01/Collage2.png","title":"Collage 2.5.0 – RapidWeaver plugin for creating graphical links","content":"Collage is a slick thumbnail gallery for images. With Collage it’s easy to add beautiful frames, slick hover effects, and even an animated slideshow.   Amazing Images for RapidWeaver   An Album with Style Collage isn’t your average photo album. Collage albums are big on style and interactivity. Collage keeps your visitors engaged while still […]"},{"link":"https://nmac.to/blog/hypernap/","image":"https://nmac.to/wp-content/uploads/2020/01/Hypernap.png","title":"Hypernap 1.4.2 – Quick and easy tool for testing web APIs","content":"Hypernap is a quick and easy tool for helping you test your web APIs. Create and run HTTP-requests, and group them in different folders to keep yourself organized. The app is never in your way! It keeps itself hidden in your menubar or dock, depending on how you configure it. You can quickly access your […]"}]