[{"link":"https://nmac.to/blog/citystate/","image":"https://nmac.to/wp-content/uploads/2020/12/Citystate.png","title":"Citystate 1.2.4c – City Builder, Simulation & Strategy Game","content":"Citystate is a city-builder and a political sandbox in which you plan, build and rule a micro nation from scratch. Design your map, your flag, name your State and pass the first policies! Face with a hardcore economic system, experiment with political orientations and city-planning strategies to make your Nation strive toward success!   AN […]"},{"link":"https://nmac.to/blog/the-last-campfire/","image":"https://nmac.to/wp-content/uploads/2020/12/The-Last-Campfire.png","title":"The Last Campfire 1.5 – Help Ember find hope","content":"The Last Campfire is an adventure, a story of a lost ember trapped in a puzzling place, searching for meaning and a way home.   ON A JOURNEY Travel deeper into the lands beyond the dark forest and overcome the adversities before you.   UNCOVER A WORLD Discover beautiful wilderness filled with lost folk, strange […]"},{"link":"https://nmac.to/blog/design-for-numbers/","image":"https://nmac.to/wp-content/uploads/2017/10/DesiGN-Templates-for-Numbers.png","title":"DesiGN for Numbers 5.0.5 – Spreadsheet templates for Apple Numbers","content":"DesiGN for Numbers (was GN Templates for Numbers) is a high-quality collection of diverse and useful templates for Apple’s Numbers. Use them for your business or personal needs. Handle your day-to-day assignments a lot easier. Customize the templates to your requirements: create tables, make calculations, draw diagrams, insert images, thus tackling your job efficiently and […]"},{"link":"https://nmac.to/blog/overpicture/","image":"https://nmac.to/wp-content/uploads/2017/09/OverPicture1.png","title":"OverPicture 1.11 – Play any HTML5 video with the new picture-in-picture mode","content":"OverPicture is a macOS Safari App Extension that allows you to play any HTML5 video with the new picture-in-picture mode.   Press the play/pause button in any web video player in Safari and then in the toolbar PIP button and the video will start playing in picture-in-picture over your windows. And it will even embed […]"},{"link":"https://nmac.to/blog/duplicate-file-finder-remover/","image":"https://nmac.to/wp-content/uploads/2020/12/Duplicate-File-Finder-Remover.png","title":"Duplicate File Finder & Remover 1.2 – File management for local and cloud storage","content":"Duplicate File Finder & Remover simplifies the menial task of finding wasted storage space by locating duplicate files for you, and giving you the option to automatically or manually delete the unwanted ones.   Features find duplicates on the whole drive, scan a single folder or multiple locations – fast and secure batch auto-select duplicates […]"},{"link":"https://nmac.to/blog/aimersoft-dvd-creator/","image":"https://nmac.to/wp-content/uploads/2020/12/Aimersoft-DVD-Creator.png","title":"Aimersoft DVD Creator 6.1.4.1 – Burn Any Video to DVD with Ease","content":"Easy-to-use DVD Creator enables you to burn videos from cameras, iPhone, android devices, or websites in any format like MP4, AVI, MPEG, MOV, WMV to DVD easily.   Create DVD/ Blu-ray Disc With Any Video Supports burning videos in over 150 formats to DVD/DVD folder/Blu-ray DVD folder/ISO/Blu-ray disc, etc, like MP4 to DVD, MKV to […]"},{"link":"https://nmac.to/blog/duplicate-files-sweeper/","image":"https://nmac.to/wp-content/uploads/2020/11/Duplicate-Files-Sweeper.png","title":"Duplicate Files Sweeper 3.0 – Best Duplicate Files Finder","content":"Duplicate Files Sweeper is an ultimate Duplicate Files Cleaner that help you get rid of duplicate files from your Mac easily.   Duplicate Files Sweeper helps you give a thorough scan to your Mac to look for duplicate files, photos, music, videos, archives and even duplicate Apps that may be scattered in various folders on […]"},{"link":"https://nmac.to/blog/smartzipper/","image":"https://nmac.to/wp-content/uploads/2020/06/SmartZipper.png","title":"SmartZipper 1.90 – Compress and decompress zip, 7Z, and rar files.","content":"Smart Zipper is an easy-to-use and efficient compression and decompression tool.   Smart Zipper is designed to handle many more formats than Archive Utility, Supported file formats include RAR, 7z, ISO, CAB, Zip, Lzma, Tar, Gzip, Bzip2, PAX and many other more or less obscure formats.   Features: Opening a compressed package: You can drag […]"},{"link":"https://nmac.to/blog/planet-coaster/","image":"https://nmac.to/wp-content/uploads/2020/12/Planet-Coaster.png","title":"Planet Coaster 1.0 – Coaster Park Building, Simulation & Management Game","content":"Surprise, delight and thrill crowds as you build the theme park of your dreams. Build and design incredible coaster parks with unparalleled attention to detail and manage your park in a truly living world.   Piece-by-Piece Construction: Planet Coaster makes a designer out of everyone. Lay paths, build scenery, customize rides and make everything in […]"},{"link":"https://nmac.to/blog/premium-fonts/","image":"https://nmac.to/wp-content/uploads/2020/12/Premium-Fonts.png","title":"Premium Fonts 7.0 – Over 2000 premium fonts","content":"Tired of the same old looking fonts? Need to change up the text style in a presentation, print project or a graphic design project? Download brand new premium font designs that just came off our development floor. This collection now includes 161 original font families, with a total of 2,018 fonts in all. Each font […]"}]