[{"link":"https://nmac.to/blog/dvdremaster-8-0-3/","image":"https://nmac.to/wp-content/uploads/2015/08/DVDRemaster.png","title":"DVDRemaster 8.0.3 – Duplicate, burn or convert DVD movies to iPod, iPhone or Apple TV","content":"DVDRemaster recompresses large DVDs so they can be burned on a standard DVD or convert them so they can be watched on your video iPod, iPod Touch, iPhone, iPad Apple TV and many other portable devices. DVDRemaster accommodates both novices and experts with its simple but yet powerful interface.   DVDRemaster also allows you to […]"},{"link":"https://nmac.to/blog/xpressive-2-0-0/","image":"https://nmac.to/wp-content/uploads/2015/07/Xpressive2.png","title":"Xpressive 2.0.0 – CSS3 live authoring tool","content":"XPressive is a CSS3 live authoring tool. You can rapidly and easily create Web content. XPressive has many intuitive editing features for HTML5 and CSS3. Edit, tweak, and save coding changes directly while you preview your Web content. Your ideas will become reality as soon as you think of them.   In the past, it […]"},{"link":"https://nmac.to/blog/vipor-crm-1-2/","image":"https://nmac.to/wp-content/uploads/2015/07/Vipor.CRM_.png","title":"Vipor CRM 1.2 – Calendars, Contacts and Tasks – All in one CRM app!","content":"Vipor is a breakthrough, mobile CRM app that makes it simple to track what you did with your clients, organize what you need to do for them, and get things done – so you can build better business relationships and be even more successful.   Vipor manages your calendars, contacts and tasks all in one […]"},{"link":"https://nmac.to/blog/textexpander-5-1/","image":"https://nmac.to/wp-content/uploads/2014/01/TextExpander.png","title":"TextExpander 5.1 – Expand custom keyboard shortcuts into frequently-used text and pictures","content":"TextExpander saves your fingers and your keyboard, expanding custom keyboard shortcuts into frequently-used text and pictures. Type more with less effort!   Here are a few examples for what you can do with TextExpander: Insert standard greetings, phrases, boilerplate paragraphs, and signatures – including formatted text and pictures. Correct typos automatically Organize snippets into groups […]"},{"link":"https://nmac.to/blog/proxy-1-11/","image":"https://nmac.to/wp-content/uploads/2015/07/Proxy.png","title":"Proxy 1.11 – Web Interception Proxy","content":"Proxy is a HTTP, intercepting proxy for Mac OS X. This tool is designed from scratch as a native Mac OS X application, taking advantage of all native features of the Apple’s latest operating system. It is simply the best web proxy tool for Mac OS X.   Proxy.app can be used to intercept HTTP […]"},{"link":"https://nmac.to/blog/iphoto-9-6-1/","image":"https://nmac.to/wp-content/uploads/2015/07/iPhoto.png","title":"iPhoto 9.6.1 – Import, edit, and share your photos","content":"iPhoto lets you do more than you ever thought possible with your photos. It gives you easy ways to find, sort, and rediscover your favorites. Simple but powerful editing tools let you turn good shots into magnificent ones. And you can share your photos in all kinds of great ways, including fun slideshows, Facebook, and […]"},{"link":"https://nmac.to/blog/world-clock-1-2-5/","image":"https://nmac.to/wp-content/uploads/2015/04/World.Clock_.png","title":"World Clock 1.2.5 – International time simplified","content":"World Clock is a simple and powerful world clock.   Features: Add cities and timezones like GMT and UTC with a few key strokes. Convert international time with a drag of a cursor. Schedule international calls and meetings and add them to your calendar. Add Interactive Widget to your Today’s View (OSX Yosemite only): quickly […]"},{"link":"https://nmac.to/blog/words-app-2-2-2/","image":"https://nmac.to/wp-content/uploads/2015/07/Words.App_.png","title":"Words App 2.2.2 – Get all of your news and articles in one inbox","content":"Words App takes all your long-form articles over all your services puts them in one inbox. We aren’t interested in which service you use. We treat them all with the same love. And we sync every article down to your desktop computer, so you can read it even if you haven’t got a working Internet […]"},{"link":"https://nmac.to/blog/seasons-1-3-2/","image":"https://nmac.to/wp-content/uploads/2015/06/Seasons.png","title":"Seasons 1.3.2 – A beautiful app to explore, in a fun way, what to watch in TV","content":"Of course you will want to track your favourite TV programmes too and this app will help you a lot on this. But tracking TV programmes is just the beginning: discover it yourself!   (Soon there will be versions for iPad and iPhone too, so you can automatically synchronise between your devices the TV shows […]"},{"link":"https://nmac.to/blog/runecsv-2-4/","image":"https://nmac.to/wp-content/uploads/2015/07/RuneCSV.png","title":"RuneCSV 2.4 – CSV Editor for mac","content":"CSV files (Comma Separated Values) are a common format used to transfer simple data, it is often used for email lists, spreadsheet exports and for databases.   RuneCSV allows you to edit these CSV files in an easy to use interface.   RuneCSV also makes use of Lion’s FullScreen so you can modify CSV files […]"}]