[{"link":"https://nmac.to/blog/watts-2-0/","image":"https://nmac.to/wp-content/uploads/2016/09/Watts.png","title":"Watts 2.0 – Recalibration tool for laptop batteries","content":"Watts is a MacBook® battery management and calibration assistant tool. It’s a menu bar app that, apart from the usual battery information (power source used, current battery charge and remaining time), provides advanced data to obtain the maximum performance of your MacBook® battery.   Your battery needs to be calibrated from time to time to […]"},{"link":"https://nmac.to/blog/pavilion-1-0/","image":"https://nmac.to/wp-content/uploads/2016/09/Pavilion.png","title":"Pavilion 1.0 – Puzzling adventure Game","content":"Pavilion, the fourth-person puzzling adventure from Visiontrick Media, throws you directly into its mysterious world without any text tutorials or beginning explanations.   It is a puzzle game portrayed through exploration and audio-visual imagery.   By interacting and observing you gradually, bit by bit, learn things about both the puzzling gameplay and the world itself. […]"},{"link":"https://nmac.to/blog/infographics-3-0-1/","image":"https://nmac.to/wp-content/uploads/2015/06/Infographics.png","title":"Infographics 3.0.1 – Visualization graphics for Pages","content":"The Infographics for Pages collection contains a wide range of high-quality designs for illustrating your Pages documents. Whether your content is focused on a specific country, explains intricacies of an industry, or presents annual financial results, Infographics is a go-to selection of quality visualization tools. All images include transparent backgrounds that allow placing them on […]"},{"link":"https://nmac.to/blog/graphic-styles-3-0-2/","image":"https://nmac.to/wp-content/uploads/2016/09/Graphic.Styles3.png","title":"Graphic Styles 3.0.2 – Collection of elements for Keynote presentations","content":"The Graphic Styles set contains a generous selection of high-quality designs to help you create unique Keynote presentations. It is an excellent collection for adding some exclusivity to your slides with original bullets, characters, patterns, and image frames.   All images include transparent backgrounds that allow placing them on various colors and patterned backgrounds. You […]"},{"link":"https://nmac.to/blog/diskkeeper-advanced-cleaner-1-0-10/","image":"https://nmac.to/wp-content/uploads/2016/09/DiskKeeper-Advanced-Cleaner.png","title":"DiskKeeper Advanced Cleaner 1.0.10 – Advanced disk cleaner tool","content":"DiskKeeper Advanced Cleaner will let you clean your junk, logs, cache files with ease in order to boost your computer and free up disk space.   DiskKeeper Advanced Cleaner can clean: Application Caches Application Logs Browser Data Mail Downloads Trash Can User Caches User Logs iPhoto Obsolete Originals All Hidden .DS_Store folders   Advanced cleanup […]"},{"link":"https://nmac.to/blog/command-center-1-1-1/","image":"https://nmac.to/wp-content/uploads/2016/07/Command.Center.png","title":"Command Center 1.1.1 – Minimalist multi-utility app","content":"Command Center (was Control Center) is a new utility app for macOS, inspired by Control Center. We’ve created a beautiful tool designed to let you control and monitor most aspects of your Mac. It is a panel that auto-hides on the side of the screen, and is activated by mouse (like the Dock). The panel […]"},{"link":"https://nmac.to/blog/swift-note/","image":"https://nmac.to/wp-content/uploads/2016/09/Swift-Note2.png","title":"Swift Note 2.1.1 – Notes with time travel and widget for Today panel","content":"Swift Note is the amazing note application with time travel and widget for OS X Notification center!   Features Very fast access to your notes Time travel in your notes Widget for notification center Create unlimited notes Change background colour of your notes iCloud sync   Version 2.1.1: Small improvements   Intel, 64-bit processor OS […]"},{"link":"https://nmac.to/blog/music-tag-edit-3-1-5/","image":"https://nmac.to/wp-content/uploads/2016/05/Music-Tag-Pro.png","title":"Music Tag Edit 3.1.5 – Batch ID3 Edit","content":"Music Tag Pro is a professional application to help you organize your music collection.   With the app you can easily edit information such as a song’s artist, title, album, cover, year, track, disc number, composer, grouping, genre, bpm, rating, comments and lyrics .   Batch edit your music tag, you can apply your editing […]"},{"link":"https://nmac.to/blog/current-for-facebook-1-2/","image":"https://nmac.to/wp-content/uploads/2015/01/Current-for-Facebook.png","title":"Current for Facebook 1.2 – Bring Facebook chat To The Mac Desktop","content":"Current offers THE BEST way to message and browse on Facebook with your Mac! With Current, you can Facebook message friends in their own chat windows and quickly access your inbox, notifications, and online friends right from the menu bar.   Current isn’t just a messaging app. It’s a complete replacement for using Facebook in […]"},{"link":"https://nmac.to/blog/capture-gif-1-4-3/","image":"https://nmac.to/wp-content/uploads/2016/06/Capture.Gif.png","title":"Capture Gif 1.4.3 – Record your screen as an animated GIF","content":"With Capture Gif, you can easily record your entire screen or just an area as an animated GIF image. Capture Gif has support for multiple displays, is Retina-ready, and always generates clear GIF images.   Features Record any connected display Optionally capture the mouse cursor Can record OS X menu bar area (or anywhere on […]"}]