[{"link":"https://nmac.to/blog/site-downloader-1-0/","image":"https://nmac.to/wp-content/uploads/2013/12/SiteDownloader.175x175-75.png","title":"Site Downloader v1.0 – Web Site Downloader and offline browser","content":"Site Downloader can download websites for offline browsing. Websites can be downloaded entirely or partially. While inside WiFi zone just pass the web site address you want to download to Site Downloader and you will be able to browse this site later without network connection. REQUIREMENTS OS X 10.7 or later, 64-bit processor ScreenShots : […]"},{"link":"https://nmac.to/blog/freememory-pro-1-7-2/","image":"https://nmac.to/wp-content/uploads/2013/12/icon.175x175-7510.png","title":"FreeMemory Pro v1.7.2 – Monitor and manage memory usage","content":"FreeMemory Pro can increase your free memory with a simple click. It always monitors your memory usage in your menubar, and provides you with tons of extra features: Menubar information can be easily customized: icon, 2D pie chart, monochrome chart, text, full info, font size selector Usage details can be displayed with an elegant 3D […]"},{"link":"https://nmac.to/blog/face-for-facebook-2-1/","image":"https://nmac.to/wp-content/uploads/2013/12/Face_for_Facebook_icon.175x175-75.png","title":"Face for Facebook v2.1 – Access Facebook from your menu bar","content":"Share and stay connected with your friends with Facebook.Face for Facebook helps you connect with your friends and share on the go. Rest you already know… Please enjoy with Love… WHAT’S NEW Version 2.1: Improved UI and Some important stability issues fixed… REQUIREMENTS OS X 10.6.6 or later ScreenShots :          >>>>> […]"},{"link":"https://nmac.to/blog/bills-1-8-1/","image":"https://nmac.to/wp-content/uploads/2013/03/Bills.png","title":"Bills 1.8.1 – Plan and track your expenses every month","content":"Bills … Plan and track your expenses every month. Brilliant interface will remind you of a real-life office room (check the screenshots). Clear, simple and quick (a MUST HAVE) financial planning! You always need a simple tool to control how much you want to spend this month. Essentially you need a big calendar to track how […]"},{"link":"https://nmac.to/blog/justnotes-1-3/","image":"https://nmac.to/wp-content/uploads/2013/12/icon.175x175-7513.png","title":"Justnotes v1.3 – Simple note taking","content":"Justnotes is a simple, beautiful and powerful notes app. The nice user interface lets you focus on the important things – taking notes. You are a Simplenote user? Just enter your account and your notes get synced instantly. Besides Simplenote, Justnotes lets you also sync your notes with any local folders (e.g. your Dropbox folder). You […]"},{"link":"https://nmac.to/blog/shank-2-1-1/","image":"https://nmac.to/wp-content/uploads/2013/03/Shank-2.png","title":"Shank 2 1.0 – Mac Action Game","content":"The fan-favorite 2D brawler is back as ex-mob hit man Shank returns to action in Shank 2. With those closest to him under attack, Shank is once again forced on the offensive. Now he must put his trusty arsenal of handguns, shotguns, automatic weapons, chainsaws, machetes, grenades, plus all-new weaponry and moves to use in […]"},{"link":"https://nmac.to/blog/microsoft-office-2011-rtm-business/","image":"https://nmac.to/wp-content/uploads/2013/12/7884.png","title":"Microsoft Office 2011 RTM Business – Popular productivity suite","content":"  Microsoft Office 2011 helps you create professional documents and presentations. And since Office for Mac 2011 is compatible with Office for Windows, you can work on documents with virtually anyone, anywhere.   Work well with others. Be on the same page with Office for Mac and Office for Windows, including new features in Office […]"},{"link":"https://nmac.to/blog/freeway-pro-6-0-4/","image":"https://nmac.to/wp-content/uploads/2013/12/128.175x175-75.png","title":"Freeway Pro 6.0.4 – Drag-and-drop Web design solution","content":"Freeway Pro lets you build websites with speed and precision… without writing a line of code! With it’s user-oriented drag-and-drop interface, Freeway Pro helps you piece together the website of your dreams. Add images, audio, video and interactive content — when your masterpiece is complete, Freeway Pro converts it into clean, standards-compliant code at the click […]"},{"link":"https://nmac.to/blog/freeway-express-6-0-4/","image":"https://nmac.to/wp-content/uploads/2013/12/128.175x175-751.png","title":"Freeway Express v6.0.4 – Design Web pages with this WYSIWYG page editor","content":"Freeway Express is the cost-effective way to get your company, group or family on the Web without making sacrifices in quality. With many of the features of its big brother, Freeway Express is the tool-of-choice for casual Web designers. Freeway Express is based on a DTP application, not an HTML editor. This means it works like […]"},{"link":"https://nmac.to/blog/radium-3-0/","image":"https://nmac.to/wp-content/uploads/2013/12/radium.175x175-753.png","title":"Radium v3.0 – Multi-network radio player; supports XM Online, AOL Radio, and more","content":"Radium is an Internet radio player that’s designed from the ground up to be simple, intuitive, and lightweight. With its powerful search, thousands of supported stations (including Sirius/XM and DI.fm/Sky.fm Premium), and the ability to add your own streams, Radium will change the way you listen to Internet radio.   Version 3.0: Release notes were […]"}]