[{"link":"https://nmac.to/blog/torchlight-ii/","image":"https://nmac.to/wp-content/uploads/2015/02/Torchlight.II_.png","title":"Torchlight II 1.25.5.3 – Action role playing game","content":"The award-winning action RPG is back, bigger and better than ever! Torchlight II takes you back into the quirky, fast-paced world of    Torchlight II captures all the flavor and excitement of the original game – while expanding the world and adding the features players wanted most, including online and LAN co-op multiplayer. Torchlight II […]"},{"link":"https://nmac.to/blog/spotlife-2-0/","image":"https://nmac.to/wp-content/uploads/2014/03/Spotlife.png","title":"Spotlife 2.0 – Desktop-based calendar viewer","content":"Spotlife is the fastest, easiest way to view the important happenings in your life.    Spotlife puts your calendar directly on your desktop, so it’s always available to you. Press a keyboard shortcut at any time from any application, and the Desktop Calendar will zoom forward above all other windows — now you’ll truly be […]"},{"link":"https://nmac.to/blog/sofacontrol-2-9-6/","image":"https://nmac.to/wp-content/uploads/2015/02/Sofa.Control.png","title":"SofaControl 2.9.6 – Gives you expanded functionality with your Apple Remote","content":"SofaControl lets you control your applications with the Apple remote control.   Out of the box Sofa Control supports more than 40 popular applications like VLC, Safari, PowerPoint, Democracy, NetNewsWire, Yojimbo and many more.   A specialized Front Row inspired user interface enables the user to access application specific menus or select movies and documents. […]"},{"link":"https://nmac.to/blog/phoneview-2-10-5/","image":"https://nmac.to/wp-content/uploads/2013/12/25347.png","title":"PhoneView 2.10.5 – Use your iPhone for file storage, data syncing, and much more","content":"PhoneView is the Mac companion for iPhone, iPad and iPod Touch. Access voicemail, SMS/MMS, call history, photos, App Store app data, notes, file storage, iTunes media, voice memos and contacts with one click. PhoneView also automatically archives your messages, call history and voicemails, so you can access them even when your iPhone is not available. […]"},{"link":"https://nmac.to/blog/moneywiz-2-0-2/","image":"https://nmac.to/wp-content/uploads/2015/02/MoneyWiz2.png","title":"MoneyWiz 2.0.2 – Personal finance solution","content":"All your accounts, budgets and bills in one place! With powerful reports, worldwide online banking and instant sync between all your devices!   That’s MoneyWiz – the world’s most powerful and beautiful finance software.   HOW CAN MONEYWIZ HELP YOU? GET OUT OF DEBT : We’ve built MoneyWiz in a way that makes it easy […]"},{"link":"https://nmac.to/blog/foxtube-2-2-0/","image":"https://nmac.to/wp-content/uploads/2015/02/FoxTube.png","title":"FoxTube 2.2.0 – Player for YouTube","content":"Play YouTube video continuously without interruption.   FoxTube features:   YouTube account login. Access/Manage YouTube playlists. Access Subscriptions Access Favorites, Likes, Watch Later, Uploads, Watch History. Access Standard Feeds Drag & Drop: add video to favorites, likes and other playlists. reorder videos in playlist.   Easy search (auto-completion, search history) search by relevance, publish date, […]"},{"link":"https://nmac.to/blog/appdelete-4-2/","image":"https://nmac.to/wp-content/uploads/2015/02/AppDelete.png","title":"AppDelete 4.2 – The speedy and efficient way to delete your unwanted apps","content":"AppDelete is an uninstaller for Macs that will remove not only applications but also widgets, preference panes, plugins, and screensavers along with their associated files. Without AppDelete these associated items will be left behind to take up space and potentially cause issues.   There are several ways to activate AppDelete: Drag items onto main window […]"},{"link":"https://nmac.to/blog/two-worlds-ii/","image":"https://nmac.to/wp-content/uploads/2015/02/Two.Worlds.II_.png","title":"Two Worlds II 1.3.5 – Mysterious RPG Game","content":"“TWO WORLDS II” EXPLORES THE NEXT CHAPTER IN THE HISTORY OF ANTALOOR. THE HERO MUST INVESTIGATE HIS MYSTERIOUS ROOTS, DISCOVERING SURPRISING TWISTS AND TURNS IN HIS ADVENTURE. A PERFECT MIX OF STORY, ATMOSPHERE, AND TECHNOLOGY PROMISES A FASCINATING NEW RPG EXPERIENCE.   STORY   After the downfall of Aziraal, God of Fire, the Dark Lord […]"},{"link":"https://nmac.to/blog/calcbot-1-0/","image":"https://nmac.to/wp-content/uploads/2015/02/Calcbot.png","title":"Calcbot 1.0 – Intelligent calculator and unit converter","content":"Calcbot is an intelligent calculator and unit converter for the rest of us. Featuring an easy-to-read history tape, expression view, intuitive conversion, and much more!   Features History Tape – Every calculation you enter gets saved to the history tape and optionally sent to your clipboard for quick pasting. Refer to calculations later or send […]"},{"link":"https://nmac.to/blog/bits-1-0-7/","image":"https://nmac.to/wp-content/uploads/2015/02/Bits.png","title":"Bits 1.0.7 – Diary with photos, tags, and online sharing","content":"Bits does not take much space on your desktop and will allow at any time to save your ideas, thoughts and creativity. In conjunction with cloud synchronization, comfortable images addition, full-text search and integration with your blog will make your journaling as comfortable as possible.   Why you should blog and journal separately, if you […]"}]