[{"link":"https://nmac.to/blog/fastscripts/","image":"https://nmac.to/wp-content/uploads/2020/10/FastScripts_3.png","title":"FastScripts 3.0.6 – Menu item for quickly running AppleScripts","content":"FastScripts is a utility for quickly and elegantly executing AppleScript and shell scripts from within any application. FastScripts is a super-charged replacement for the Apple “Script Menu” menu extra. In addition to the functionality provided by Apple’s Script Menu utility, FastScripts offers a number of compelling improvements: User-definable keyboard shortcuts for any scripts in the […]"},{"link":"https://nmac.to/blog/byword/","image":"https://nmac.to/wp-content/uploads/2015/11/Byword2.png","title":"Byword 2.9.5 – Minimalist typing interface [FIX]","content":"Byword is your minimalist typing interface. Byword starts with a clean full-screen interface that lets you start typing right away-no templates to choose, no type settings to tune, no spacing to adjust. Everything is already prepared for you.   Features: Full-screen interface Focus mode to highlight only the few lines nearby the cursor-you will love […]"},{"link":"https://nmac.to/blog/dmmemu/","image":"https://nmac.to/wp-content/uploads/2021/01/DMmemu.png","title":"DMmenu 1.5 – A Windows-style start menu for Mac","content":"Donemax DMmenu for Mac is designed to manage, optimize and boost Mac systems effectively. The app is full featured and can accomplish many tasks on Mac easily. As a comprehensive Mac management tool, it provides more than 8 main functions and other options for effective management. First, there are many functions in the app to […]"},{"link":"https://nmac.to/blog/tuneskit-video-converter/","image":"https://nmac.to/wp-content/uploads/2020/01/TunesKit-Video-Converter.png","title":"TunesKit Video Converter 2.1.0 – Best Video Converter/DVD Ripper for Mac","content":"A versatile video converter, video editor and DVD ripper that can convert any video to 250+ formats at 60X faster speed with no quality loss. You can also use it to edit the videos or rip any protected or commercial DVD movies to any format on Mac.   Convert almost all popular videos and audios […]"},{"link":"https://nmac.to/blog/keykey/","image":"https://nmac.to/wp-content/uploads/2016/06/KeyKey2.png","title":"KeyKey 2.9 – Typing Tutor App","content":"KeyKey will teach you touch typing with fewer error in QWERTY or DVORAK layouts.   WHAT IS IT FOR To stop struggling with the process of putting together letters and words. When you can type quickly and correctly, you get huge satisfaction in your writing. Few weeks of practice and you will type much faster […]"},{"link":"https://nmac.to/blog/videosolo-screen-recorder/","image":"https://nmac.to/wp-content/uploads/2020/12/VideoSolo-Screen-Recorder.png","title":"VideoSolo Screen Recorder 2.0.50.2658 – Recording computer screen","content":"VideoSolo Screen Recorder is a handy tool you can rely on to record the activity on the computer screen as a video, audio or even image file. And, you can select the recording area on the full screen, window, fixed-region area or customized areas. The program also comes with the advanced support for drawing, making […]"},{"link":"https://nmac.to/blog/sound-grinder-pro/","image":"https://nmac.to/wp-content/uploads/2021/01/Sound-Grinder-Pro.png","title":"Sound Grinder Pro 3.2.2 – Powerful waveform editing and batch-processing of audio files","content":"Sound Grinder Pro provides a powerful set of waveform editing and batch-processing features. Edit audio files in the new waveform editor complete with multi-channel file support, enhanced waveform overview, audio actions, support for loops, markers, and regions, auto-regioning, and more.   Process your files with your favorite AU and VST plug-ins. Batch-process files with enhanced […]"},{"link":"https://nmac.to/blog/library-monkey-pro/","image":"https://nmac.to/wp-content/uploads/2013/12/Library-Monkey-Pro.png","title":"Library Monkey Pro 3.2.2 – Catalog, manage, and process your audio files","content":"Library Monkey Pro provides a complete set of audio tools for today’s fast-paced production environments. Manage countless assets with the enhanced library manager by creating Sets and Smart Sets, recall recent searches, create multiple bins and more. Rip your CD libraries complete with indexes for instant access to what was a cumbersome CD library.   […]"},{"link":"https://nmac.to/blog/master-of-typing/","image":"https://nmac.to/wp-content/uploads/2022/01/Master_of_Typing_Tutor_1.png","title":"Master of Typing Tutor 1.9.5 – Learn touch typing","content":"Besides, touch typing is one of the easiest skills to learn.   You can prove it for yourself. Just try our TOUCH TYPING tutor Master of Typing!   Learn to type using all your 10 FINGERS without watching the keyboard.   Touch typing is a good skill that ALLOWs to: SAVE time when typing texts […]"},{"link":"https://nmac.to/blog/moviesherlock/","image":"https://nmac.to/wp-content/uploads/2018/01/moviesherlock.png","title":"MovieSherlock 6.3.5 – Video Downloader and Converter for Mac","content":"MovieSherlock is a straightforward macOS application that enables you to search, download and convert video from the web.   Handy video browser and downloader for YouTube, Vimeo and DailyMotion users From MovieSherlock’s main window you can search the web for any given video or browse videos based on the given categories. Thus you can discover […]"}]