[{"link":"https://nmac.to/blog/health-check/","image":"https://nmac.to/wp-content/uploads/2021/04/Health-Check.png","title":"Health Check 1.0 – Symptom Checke‪r‬","content":"Keeping a close eye on your health is very important but it is not always an easy task. This is where Health Check comes in with its intuitive interface and advanced algorithm for generating medical diagnoses. All you have to do is input your symptoms together with their intensity and you will be presented with […]"},{"link":"https://nmac.to/blog/creaks/","image":"https://nmac.to/wp-content/uploads/2020/07/Creaks.png","title":"Creaks 1.0.9 – 2D Casual Adventure & Puzzle Game","content":"Meet Your New Neighbours   The ground starts shaking, light bulbs are breaking – and something rather unusual is happening right behind the walls of your very room. Equipped with nothing but wit and courage, you slowly descend into a world inhabited by avian folk and seemingly deadly furniture monsters.   From the creators of […]"},{"link":"https://nmac.to/blog/encodya/","image":"https://nmac.to/wp-content/uploads/2021/01/ENCODYA.png","title":"ENCODYA 1.1 – Point & Click Sci-fi Adventure Game","content":"The Save the World Edition includes ENCODYA, the official ENCODYA soundtrack, a lovingly designed artbook, wallpapers and a Making of Video. In addition, Assemble Entertainment donates 10% of the revenues of this edition to the children’s charity Plan International. This is the best option for all those who would like to support the work of […]"},{"link":"https://nmac.to/blog/screens/","image":"https://nmac.to/wp-content/uploads/2019/11/Screens_4.png","title":"Screens 4.8.6 – Powerful Screen Sharing and VNC client","content":"Screens is a beautiful, yet powerful Screen Sharing and VNC client that lets you connect back to your Mac, Windows or Linux PC from the comfort of your living room, the corner coffee shop or anywhere in the world.   Features   Faster Than Ever Screens now connects a lot quicker and is much snappier. […]"},{"link":"https://nmac.to/blog/blur-n-bokeh/","image":"https://nmac.to/wp-content/uploads/2018/06/Blur-n-Bokeh.png","title":"Blur n Bokeh 3.5 – Blur your images","content":"Blur n Bokeh (was PicFocus) is a tool to give highlight and focus to your images by blurring or editing the background of your image. With PicFocus you can easily apply our great filter effects to the selected area or the background.   Features User have full control to select the area in the image […]"},{"link":"https://nmac.to/blog/splash-n-recolor/","image":"https://nmac.to/wp-content/uploads/2020/07/Splash-n-Recolor.png","title":"Splash n Recolor 4.2 – Transform your photos into black-and-white images with splashes","content":"Splash n Recolor lets you transform your photos into black-and-white images with eye-catching splashes of color with brush strokes. Automatically convert photos to black-and-white.   You will enjoy editing at high resolution, unlike other apps that force you to work with fuzzy images.   Some of the features of Splash n Recolor: Edit in high […]"},{"link":"https://nmac.to/blog/hdr-pro/","image":"https://nmac.to/wp-content/uploads/2021/01/HDR-Pro.png","title":"HDR Pro 3.2 – Bring up the beauty of your images with a single slider","content":"HDR Pro bring up the beauty of your images with a single slider. Tool is powered by Artificial Intelligence and will dramatically improve any of your photos.   HDR Pro is a tool to produce HDR image with extended range of dynamic lighting and detail. Our advance HDR algorithm will take a single picture as […]"},{"link":"https://nmac.to/blog/touch-blur/","image":"https://nmac.to/wp-content/uploads/2020/04/Touch-Blur.png","title":"Touch Blur 3.2 – Smart blur effect tool","content":"Touch Blur is a tool to blur selective area of your image with our simple user interface and edge preserving algorithm to get realistic output.   Some of the features of Touch Blur : User have full control to select the area in the image to blur. Our smart edge-preserving algorithm gives best result to […]"},{"link":"https://nmac.to/blog/mac-restart/","image":"https://nmac.to/wp-content/uploads/2021/04/Mac-Restart.png","title":"Mac Restart 2.3 – Program your Mac to restart when desired","content":"Mac Restart is the modern macOS application to restart the Mac when unattended under different conditions.   Mac restart is able to use ‘Soft Restart’ and ‘Hard Restart’ to restart your Mac. The ‘Soft Restart’ is issued at finder level and ask to all the running app to quit before restart the Mac   The […]"},{"link":"https://nmac.to/blog/macspoof/","image":"https://nmac.to/wp-content/uploads/2021/04/MACSpoof.png","title":"MACSpoof 1.4 – Change the MAC address of the network interfaces of your Mac","content":"Mac MACSpoof is a Mac utility that allows the user to change the MAC address of the network interfaces of your Mac (Ethernet, Wi-Fi and so on) with any custom value.   The utility display a list of all the network interfaces of the Mac and selecting one the user is able to assign the […]"}]