[{"link":"https://nmac.to/blog/breach-clear-deadline/","image":"https://nmac.to/wp-content/uploads/2015/07/Breach.Clear_.Deadline1.png","title":"Breach & Clear: Deadline 1.0 – Exciting tactical strategy game","content":"A deadly new breed of human monster is on the rise, and it’s up to players to stop the infestation before it spreads. Breach & Clear: DEADline is the all-new follow up to Breach & Clear, the critically acclaimed hybrid tactical strategy game. The game gives players real-time control over a squad of four elite […]"},{"link":"https://nmac.to/blog/acronis-true-image-1-0-2/","image":"https://nmac.to/wp-content/uploads/2015/07/Acronis.True_.Image_.png","title":"Acronis True Image 1.0.6725 – Backup and disk management","content":"With Acronis True Image you can assure your Mac is protected by having a full system image backup. Keep all your data safe even if your computer is lost, stolen or damaged. Backup locally or to the cloud, and access your files anytime, anywhere.   Version 1.0.6725: List of fixed issues Compatibility issues with OS […]"},{"link":"https://nmac.to/blog/videomark-2-2/","image":"https://nmac.to/wp-content/uploads/2014/04/VideoMark.png","title":"VideoMark 2.2 – Easily add watermarks to your videos","content":"VideoMark is a fully-featured yet easy-to-use video and movie watermark software which can be used to overlay a digital watermark for video protection or placing a logo for branding your products. VideoMark is the only viable and affordable watermarking solution on the Mac operating system.   VideoMark can help you easily add simple text or […]"},{"link":"https://nmac.to/blog/typed-1-2/","image":"https://nmac.to/wp-content/uploads/2015/01/Typed.png","title":"Typed 1.2 – Stunning word processing with markdown","content":"Typed is the stunning new writing app for the Mac, and the first that improves your focus so you can create great content. Typed makes writing for the web incredibly easy, and its Zen Mode features relaxing soundtracks that help you concentrate.   With stunning typography that makes it a breeze to write structured documents, […]"},{"link":"https://nmac.to/blog/super-mov-converter-6-0-97/","image":"https://nmac.to/wp-content/uploads/2015/07/Super.MOV.Converter.png","title":"Super MOV Converter 6.0.97 – Convert any HD video and common video to MOV format","content":"Super MOV Converter lets you convert any HD video and common video to MOV format for playback on QuickTime, Apple TV, iPhone 6/6 plus/5S/5C/5/4S, iPad Air 2/ Air/mini 3/mini 2/mini/4, iPod with absolutely faultless performance. Converting AVCHD videos (M2TS, MTS), HD videos (TS, HD MP4, HD WMV, HD MPG, HD MPEG), and common videos like […]"},{"link":"https://nmac.to/blog/messenger-for-facebook-1-2/","image":"https://nmac.to/wp-content/uploads/2015/07/Messenger.for_.Facebook.png","title":"Messenger for Facebook 1.2 – The Fastest Messaging App for Facebook","content":"Messenger for Facebook! is the Fastest Messaging App for Facebook.   Now you really do not need to open the browser, just launch the app and start messaging.   Features: Get to all your messages without having to open Facebook. Bring your conversations to life with stickers and send photos privately. Have group conversations and […]"},{"link":"https://nmac.to/blog/mail-stationery-2-0/","image":"https://nmac.to/wp-content/uploads/2015/07/Mail.Stationery2.png","title":"Mail Stationery 2.0 – Top-quality stationery templates for Apple Mail","content":"Once in a while, plain words are just not enough. Give your email a face lift! The beautiful Mail Stationery collection provides 283 top-quality templates for Apple Mail from professional designers who have produced not only visually attractive but also highly functional designs.   Among the ten stationery categories, you will find Greetings, Invitations, Photo, […]"},{"link":"https://nmac.to/blog/let-ter-1-0/","image":"https://nmac.to/wp-content/uploads/2015/07/Let.ter_.png","title":"Let.ter 1.0 – The tiny Markdown powered app just for writing emails","content":"Let.ter is a new approach to email, one that lets you focus on your message without the distractions of your email inbox. No notifications, no inbox zero to achieve, no folders and tags and complexities. Just you and your email.   It’s the focused approach to email we’ve all needed. We think you’ll love it. […]"},{"link":"https://nmac.to/blog/instadown-1-7-1/","image":"https://nmac.to/wp-content/uploads/2015/07/InstaDown.png","title":"InstaDown 1.7.1 – Nice way to save photos from Instagram to your Mac","content":"InstaDown is a very easy to use application that offers a simple and quick way to export all your Instagram photos to your local hard drive.   InstaDown makes the process of downloading images much quicker and easier than downloading them one by one.   InstaDown is an effective tool that lets you back up […]"},{"link":"https://nmac.to/blog/gemba-0-9-8/","image":"https://nmac.to/wp-content/uploads/2015/07/Gemba.png","title":"Gemba 0.9.8 – Update assets in your iOS app, No Xcode or Git required","content":"Drag and drop your exported assets into Gemba and integrate them into Xcode and Git with a simple click.   Designers No more waiting for your developers With Gemba, it’s super easy to update assets yourself, whenever you want.   No Xcode or Git required You just drop in your exported assets. Let Gemba handle […]"}]