[{"link":"https://nmac.to/blog/watermarker-2-0/","image":"https://nmac.to/wp-content/uploads/2015/08/Watermarker.png","title":"Watermarker 2.0 – Branding images with a wide varitey of watermark types","content":"Watermarker is a professional tool for branding images with a wide varitey of watermark types. No stone was left unturned when it came to overhauling the original Watermaker. It was necessary to completely re-write Watermarker from the ground up using the latest technologies to accomplish Watermarker’s ambitious feature set. Thanks to these new technologies, not […]"},{"link":"https://nmac.to/blog/vault-101-1-2/","image":"https://nmac.to/wp-content/uploads/2015/08/Vault.101.png","title":"Vault 101 1.2 – Protect critical data with AES-256 encryption. Optionally share online","content":"Vault 101 will help you keep your data protected via strong AES-256 encryption, 256-bit Advanced Encryption Standard. Password-protect files and folders in 3 easy steps: choose the source folder; set capsule name and password; click “Create”.   Easy Access to Your Encrypted Data Since your capsule is encrypted, it’s not possible for others to read […]"},{"link":"https://nmac.to/blog/plecs-3-7/","image":"https://nmac.to/wp-content/uploads/2015/08/PLECS.png","title":"PLECS 3.7 – Time-domain simulation of power electronic systems","content":"PLECS Standalone is an autonomous software package for time-domain simulation of power electronic systems. If independence from other simulation platforms is important, PLECS Standalone provides the all-in-one solution for modeling complex electrical circuits and sophisticated controls in a single environment.   Due to its optimized engine, PLECS Standalone runs much faster than PLECS Blockset. With […]"},{"link":"https://nmac.to/blog/jumsoft-clipart-2-1/","image":"https://nmac.to/wp-content/uploads/2015/07/Jumsoft.Clipart.png","title":"Jumsoft Clipart 2.1 – Clipart package for presentations, invitations, Web pages, posters, etc","content":"The Jumsoft Clipart package contains a total of 1580 polished clipart pieces to help you compose thrilling text documents. Spice up your presentations, invitations, Web pages, posters, newsletters, and virtually any text content. Make them uniquely yours!   Jumsoft Clipart features transparent backgrounds that allow putting images on various colors and patterns as well as […]"},{"link":"https://nmac.to/blog/gifquickmaker-1-5-0/","image":"https://nmac.to/wp-content/uploads/2015/08/GIFQuickMaker.png","title":"GIFQuickMaker 1.5.0 – Make animated GIFs","content":"GIFQuickMaker allows you to create GIFs, then combine them with TIFF, BMP, PNG and JPEG images.   Version 1.5.0: OS X 10.9 or later   Intel, 64-bit processor OS X 10.6.6 or later                                             "},{"link":"https://nmac.to/blog/travel-journal-1-2-2/","image":"https://nmac.to/wp-content/uploads/2015/08/Travel.Journal.png","title":"Travel Journal 1.2.2 – Keep your memories alive using a Travel Journal","content":"Travel Journal is well organized and structured. The user interface is simple to use and the added features make this modern day journal work of art. You will be proud of your Travel Journal and the simplicity of making entries will ensure that you document all your adventures every day. Traveling is also about sharing […]"},{"link":"https://nmac.to/blog/subtitles-3-2-1/","image":"https://nmac.to/wp-content/uploads/2015/03/Subtitles.png","title":"Subtitles 3.2.1 – Automatically downloads subtitles for your movies and TV shows","content":"Subtitles App is the easiest way to download subtitles, Just drop your videos into Subtitles and let it do its magic. It doesn’t matter if the files don’t have the right name or the format they’re in, Subtitles will always find the right subtitles for your movies and TV shows.   Automatically finds subtitles Just […]"},{"link":"https://nmac.to/blog/stellar-partition-manager-3-0/","image":"https://nmac.to/wp-content/uploads/2014/06/StellarPartitionManager.png","title":"Stellar Partition Manager 3.0 – Partition management utility for Mac OS","content":"Stellar Partition Manager is a reliable disk partition Mac utility to manage your Apple partitions safely. This powerful Mac OS disk utility partition manager optimizes your hard drive performance by helping you create, format, delete, hide/reveal, shift and resize different partitions in your Mac hard drive.   Sometimes, you may find your Mac partition to […]"},{"link":"https://nmac.to/blog/sendoff-1-2-3/","image":"https://nmac.to/wp-content/uploads/2015/08/SendOff.png","title":"SendOff 1.2.3 – Shipping label and USPS postage software for online sellers","content":"SendOff is the Mac shipping software that enables online sellers to print shipping labels with USPS postage for all of their orders from one place, even if they sell on multiple venues.   Using SendOff sellers can import orders from flat files they have downloaded from their selling venues, set the shipping information for each […]"},{"link":"https://nmac.to/blog/freeway-pro-7-1-1/","image":"https://nmac.to/wp-content/uploads/2014/12/Freeway-Pro.png","title":"Freeway Pro 7.1.1 – Drag-and-drop Web design solution","content":"Freeway Pro lets you build websites with speed and precision… without writing a line of code!   With it’s user-oriented drag-and-drop interface, Freeway Pro helps you piece together the website of your dreams. Add images, audio, video and interactive content — when your masterpiece is complete, Freeway Pro converts it into clean, standards-compliant code at […]"}]