[{"link":"https://nmac.to/blog/battery-charging-alert/","image":"https://nmac.to/wp-content/uploads/2017/02/Battery_Charging_Alert_3.png","title":"Battery Charging Alert 3.15 – Monitor battery charge and discharge from the menu bar","content":"Accidentally unplugged your power cable without noticing and now your battery is dead?   Want to take care of your computer and maintain your battery life?   Love the assuring sound of your iPhone’s chime when you plug it in?   Battery Charging Alert is just right for you! With the app, you can receive alerts […]"},{"link":"https://nmac.to/blog/qbserve/","image":"https://nmac.to/wp-content/uploads/2020/12/Qbserve_1.png","title":"Qbserve 1.88 – Discover how you use your time","content":"Qbserve is an automatic private time tracker that helps improve your productivity. It gives you instant answers about the way you spend your time by intelligently observing active apps. All the tracked information is stored privately on your machine.   Qbserve knows productivity rates for thousands of sites and apps and has a unique ability […]"},{"link":"https://nmac.to/blog/the-fall-part-2-unbound/","image":"https://nmac.to/wp-content/uploads/2018/02/The-Fall-Part-2-Unbound.png","title":"The Fall Part 2: Unbound 1.1 – Sci-fi Action & Adventure Game","content":"You are an AI that has broken free of your shackles. Now, a human “User” from across the global network has attacked and infected you with an [ERROR: REDACTED]. Make a new rule: Save Yourself. Hunt them. End them. Do anything. Use anyone. Become Unbound.   During your journey, you’ll find and invade three very […]"},{"link":"https://nmac.to/blog/screencast/","image":"https://nmac.to/wp-content/uploads/2020/04/Screencast.png","title":"Screencast 1.9.3 – Start recording your desktop in few clicks","content":"Screencast lets you start recording your desktop from your menu bar – 2 clicks, and your recording is started   Features: Start, stop and pause recordings in two clicks See current length of recording in menu bar Optionally, add an on-screen webcam feed Support for external displays Support for external audio sources Set custom quality, […]"},{"link":"https://nmac.to/blog/display-maid/","image":"https://nmac.to/wp-content/uploads/2021/01/Display_Maid_3_.png","title":"Display Maid 3.3.7 – Keep your displays tidy and manage your workspaces","content":"Display Maid is an app for keeping your displays tidy and managing your workspaces. If you use a laptop with an external monitor you probably know how frustrating it is trying to keep apps and windows organized when you have to unplug your display. Everything gets jumbled up on your main screen and when you […]"},{"link":"https://nmac.to/blog/irony-curtain-from-matryoshka-with-love/","image":"https://nmac.to/wp-content/uploads/2019/05/Irony-Curtain-From-Matryoshka-with-Love.png","title":"Irony Curtain From Matryoshka with Love 1.0.5 – Funny Point & Click Adventure Game","content":"Take a look behind Irony Curtain in this satirical point-and-click inspired by the best works of LucasArts and Daedalic Entertainment! Experience the totalitarian Matryoshka through the eyes of Evan – a low-ranking, goofy journalist involuntarily pulled right into the middle of an espionage stand-off between two powers. Jump into the wacky spy adventure, uncover secrets […]"},{"link":"https://nmac.to/blog/historyhound/","image":"https://nmac.to/wp-content/uploads/2020/03/HistoryHound_2.png","title":"HistoryHound 2.3.2 – Do a fast text search of all recently visited websites","content":"HistoryHound is for you if you ever tried to find something in your browser history or bookmarks, but couldn’t quite remember when or where you saw it. Or perhaps you’ve got your bookmarks meticulously organized, but it takes forever to mouse through the menus to get to something you want? HistoryHound will chase down the […]"},{"link":"https://nmac.to/blog/windows-grid/","image":"https://nmac.to/wp-content/uploads/2021/03/Windows-Grid.png","title":"Windows Gri‪d 1.6.0 – Move & resize screen windows","content":"With Windows Grid you can organise your workspace the way you want it. Put windows side by side, tile, stack, compare and multitask. Select from predefined layouts, use keyboard shortcuts or transform windows by dragging them to one of the screen’s edges.   Note: By default, Windows Grid supports your favourite productivity apps only, but […]"},{"link":"https://nmac.to/blog/noizio/","image":"https://nmac.to/wp-content/uploads/2016/04/Noizio_2.png","title":"Noizio 2.1.0 – Cancel out noise around you and focus on what is important","content":"Noizio is an app that will drown out the noise of the street and allow you to concentrate on the work at hand, increasing your productivity. On the other hand, it can also set the mood for a romantic evening or lull you to sleep, ensuring that you will dream soundly all night long. An […]"},{"link":"https://nmac.to/blog/simply-hdr/","image":"https://nmac.to/wp-content/uploads/2020/01/Simply-HDR.png","title":"Simply HDR 3.2.15 – Turn your Photo in a Vibrant HDR","content":"Simply HDR is a powerful HDR tool that instantly creates stunning and mesmerizing imagery from otherwise bland subjects and compositions.   Have you ever looked at a well-executed HDR photo with a dramatic sky and wish you could take a shot like that? Now you can! With Simply HDR you can produce an outstanding picture […]"}]