[{"link":"https://nmac.to/blog/business-card-maker-for-pages-1-0/","image":"https://nmac.to/wp-content/uploads/2016/07/Business.Card_.Maker_.for_.Pages.png","title":"Business Card Maker for Pages 1.0 – Professional business cards templates","content":"Business Card Maker for Pages will help you create impressive and professional business cards – no design skills required! Stand out from the rest, look professional and present yourself like never before.   Top Features:   Choose from 80 amazing designs With a large number of business card templates, you will find one that will […]"},{"link":"https://nmac.to/blog/mechrunner-1-0/","image":"https://nmac.to/wp-content/uploads/2016/07/MechRunner.png","title":"MechRunner 1.0 – An endless robotic action game","content":"MechRunner is an endless action game that casts you as a powerful mech in stunning cinematic battles against a relentless robotic army.   Game Story On June 30th, 1908 a mysterious explosion took place over the Tunguska River in Siberia, Russia that wiped out trees and wildlife for over 800 square miles. To this day […]"},{"link":"https://nmac.to/blog/bohemian-killing-1-0/","image":"https://nmac.to/wp-content/uploads/2016/07/Bohemian-Killing.png","title":"Bohemian Killing 1.0 – First Person Adventure, Drama & Mystery Game","content":"Nonlinear first person courtroom drama set in the streets of 19th century steampunk Paris!    You find yourself on trial, accused of a brutal murder How far will you go to exonerate yourself? Will you lie, seek evidence to prop your testimony or, perhaps, pretend to be insane? Your imagination is the limit!   Bohemian […]"},{"link":"https://nmac.to/blog/the-creator-7-0/","image":"https://nmac.to/wp-content/uploads/2016/07/The.Creator.png","title":"The Creator 7.0 – Create your own logos, page headers, and more","content":"The Creator (was The Logo Creator), by Laughingbird Software, creates logos that look like a Photoshop guru spent hours laboring over them! It starts you off by showing you over 200 creative templates! No extra work on your part. So now your landing pages, sales pages, and membership sites will all look stunning! Super-easy editing […]"},{"link":"https://nmac.to/blog/paintcode-for-sketch-1-0-2/","image":"https://nmac.to/wp-content/uploads/2016/06/PaintCode-for-Sketch.png","title":"PaintCode for Sketch 1.0.2 – Code Generator Plugin for Sketch","content":"PaintCode Plugin for Sketch makes it really easy to export your drawings into Swift or Objective-C.   Integrating the generated code into your Xcode projects is simple and straightforward.   By using code, you can make your apps truly resolution-independent. No more 1x, 2x and 3x images.   Version 1.0.2: Release notes were unavailable when […]"},{"link":"https://nmac.to/blog/adware-removal-1-0-1/","image":"https://nmac.to/wp-content/uploads/2016/07/Adware-Removal.png","title":"Adware Removal 1.0.1 – Remove Adware, Malware, and Restore Browser","content":"Adware Removal is the professional version of Adware Doctor. By choosing Adware Removal, you’re offered with the following powerful features:   Real-Time Adware/Malware Protection Remove Adwares/Malware Stop pop-up scams from Adware/Malware Restore your web browser back to normal All extensions, cookies and caches will be removed Bookmarks and navigation history will be kept.   Version […]"},{"link":"https://nmac.to/blog/yemuzip-2-4-8/","image":"https://nmac.to/wp-content/uploads/2016/07/YemuZip.png","title":"YemuZip 2.4.8 – Easy-to-use Zip compression utility","content":"YemuZip is a simple, no-frills, easy-to-use application for making ZIP files. Unlike the built-in compress function, YemuZip lets you choose between preserving Mac specific metadata and making clean PC-friendly ZIP files. YemuZip also includes convenience like the ability to zip straight into a new email.   Version 2.4.8: Updated the app icon for Retina Display. […]"},{"link":"https://nmac.to/blog/tab-for-google-photos-1-1/","image":"https://nmac.to/wp-content/uploads/2016/07/Tab-for-Google-Photos.png","title":"Tab for Google Photos 1.1 – Access Google Photos anywhere","content":"Tab for Google Photos allows you to access Google Photos anywhere. Just click the icon in the menu bar and get started.   Features: Instant access to Google Photos via the menu bar Seamless design Drag and drop functionality Starts on startup (optional) Multiple sizes Light and dark mode   Version 1.1: Automatic hiding option […]"},{"link":"https://nmac.to/blog/call-recorder-for-skype-2-0-3/","image":"https://nmac.to/wp-content/uploads/2016/07/Call-Recorder-for-Skype2.png","title":"Call Recorder for Skype 2.0.3 – Record Conversations and Interviews","content":"“Call Recorder for Skype” is an easy to use application with handy interface which will definitely save you time and effort. Supposably you have an important Skype call where every word matters and you don’t want to miss anything. For example a conference call with the client, or an interview with a potential employee.   […]"},{"link":"https://nmac.to/blog/sizzlingkeys-5-1-4/","image":"https://nmac.to/wp-content/uploads/2014/06/SizzlingKeys.png","title":"SizzlingKeys 5.1.4 – iTunes controller","content":"SizzlingKeys Lets you control iTunes without leaving your current application. Control all aspects of iTunes with hot keys that are fully-customizable via an intuitive user interface.   Version 5.1.4: Toggle Shuffle now works correctly with iTunes 12.   Intel, 64-bit processor OS X 10.7 or later iTunes 11.2.2 or later    "}]