[{"link":"https://nmac.to/blog/macjournal-607/","image":"https://nmac.to/wp-content/uploads/2013/12/MacJournal.175x175-75.jpg","title":"MacJournal 6.0.8 – Create personal logs and diary entries","content":"MacJournal is the world’s most popular journaling software for the Mac. MacJournal 6 adds a calendar mode that show entries from any journal, geolocation, word count, and progress tracking, as well as additional blogging support. A Timeline mode has been added to give the journaler the ability to see their writing activity in chronological order. […]"},{"link":"https://nmac.to/blog/mysms/","image":"https://nmac.to/wp-content/uploads/2013/12/icon.175x175-7516.jpg","title":"mysms 2.2 – Text anywhere","content":"Send & receive all your messages on your notebook, computer and tablet – just like on your smartphone.Install mysms and you’ll be able to:* Send and receive messages on your computer * Automatically sync all the messages on your smartphone, tablet and computer * Text other mysms users for free Why you should be using […]"},{"link":"https://nmac.to/blog/ntfs-for-mac-10-0-2/","image":"https://nmac.to/wp-content/uploads/2013/12/26288.jpg","title":"NTFS for Mac 10.1.78 – Provides full read and write access to NTFS volumes","content":"NTFS breaks down the barriers between Windows and OS X. Effectively solves the communication problems between the Mac system and NTFS, providing full read and write access to Windows NTFS partitions under OS X. Excellent solution for end users, SOHO, and enterprise, supports all NTFS versions from Windows NT 3.1 to Windows 8 (NTFS versions […]"},{"link":"https://nmac.to/blog/vidconvert-1-4-2/","image":"https://nmac.to/wp-content/uploads/2013/12/VidConvert.175x175-75.jpg","title":"VidConvert 1.4.5 – Simple and easy video/audio converter","content":"VidConvert is a video converter designed to make converting your videos simple and easy. VidConvert will convert just about any type of video into one of the many popular formats of today. Creating videos for your iPhone or iPad, for your Mac or TV, or formats such as DivX and MPEG are just a click […]"},{"link":"https://nmac.to/blog/totals-2-2-1/","image":"https://nmac.to/wp-content/uploads/2013/12/logo.175x175-752.jpg","title":"Totals 2.2.9 – Create stylish invoices and more","content":"Totals is a full-featured invoice application for SOHO or business users. It has been designed from scratch to use the power and beauty of the Mac OS, while making life as easy as possible for its users.   Very simple to use. Totals is the combination of powerful features behind a simple user interface. Every […]"},{"link":"https://nmac.to/blog/dombratuner/","image":"https://nmac.to/wp-content/uploads/2013/12/DombraTuner.175x175-75.jpg","title":"DombraTuner 1.1 – Kazakh Dombra tune","content":"Very easy tool to tune the Kazakh Dombra. Just click on the button and tune the dombra with the sound of the tuned string! WHAT’S NEWVersion 1.1: Retina display improvements Automatic repeating of the playing sounds Wikipedia information and buying hints 10 new pitches modes: + Baroque + Scientific + France1859 + New Philharmonic + […]"},{"link":"https://nmac.to/blog/sid-meiers-civilization-iv-colonization/","image":"https://nmac.to/wp-content/uploads/2013/12/mzi.tajtmnec.175x175-75.png","title":"Sid Meier’s Civilization IV: Colonization 3.18 – Popular Strategy Game","content":"Sid Meier’s Civilization IV: Colonization is the fifth offering in the award winning Civilization IV series for the Macintosh. A re-imagining of the classic Colonization strategy game Sid Meier created in 1994, this provides a new game experience in which you lead a European nation on a quest to colonize the thrive in the New World. […]"},{"link":"https://nmac.to/blog/gangstar-miami-vindication/","image":"https://nmac.to/wp-content/uploads/2013/12/mzi.drblypbr.175x175-75.png","title":"Gangstar: Miami Vindication 1.0 – Full-3D crime simulation game","content":"Gangstar: Miami Vindication has a new, unique feel that delivers a deep storyline of revenge: plunge into Miami gang life and live a fast-paced adventure to liberate your little brother who has been kidnapped by the Armada gang for unknown reasons…   WELCOME TO MIAMI A long lifespan, with more than 75 varied missions: infiltrate […]"},{"link":"https://nmac.to/blog/fast-five-the-movie-official-game/","image":"https://nmac.to/wp-content/uploads/2013/12/mzi.paytwihb.175x175-75.png","title":"Fast Five the Movie: Official Game 1.0 – Mac Racing Game","content":"The explosive franchise built on speed is back with Fast Five, and this model comes fully loaded! Play as Brian O’Conner on the wrong side of the law and assemble an elite team of top racers. Get behind the wheel of your dream car to battle opponents in the ultimate high-stakes racing game that follows […]"},{"link":"https://nmac.to/blog/hardwaregrowler/","image":"https://nmac.to/wp-content/uploads/2013/12/HWGrowler.175x175-75.jpg","title":"HardwareGrowler 2.1 – Notification for hardware status changes","content":"HardwareGrowler is the best way to find out when hardware status changes on the Mac. If you need to know what’s going on with your Mac, then you need HardwareGrowler.   When your power cable unplugs, HardwareGrowler will spring into action and lets you know about it. Plug in a device like a keyboard, thumb […]"}]