[{"link":"https://nmac.to/blog/multibrowser-1-1-0/","image":"https://nmac.to/wp-content/uploads/2013/12/MultiBrowser1.175x175-75.png","title":"MultiBrowser1 1.1.0 – Surf multi website at the same time","content":"With MultiBrowser you can load and use multiple websites at the same time! View 4 videos on Youtube, chat with Facebook Messanger and read your newest emails – all at the same time!   Version 1.1.0: It’s now possible to change the size of the several webpages. All loaded webpages are saved now, so if […]"},{"link":"https://nmac.to/blog/omnigraphsketcher/","image":"https://nmac.to/wp-content/uploads/2013/03/18796.png","title":"OmniGraphSketcher 1.2.4 – Create elegant and precise graphs easily","content":"OmniGraphSketcher (formerly Graph Sketcher) helps you make elegant and precise graphs in seconds, simply by sketching what you want. Specifically designed for reports, presentations, and problem sets where you need to produce sharp-looking graphs on the fly, OmniGraphSketcher combines the data plotting power of charting applications with the ease of a basic drawing program.   […]"},{"link":"https://nmac.to/blog/xteam-3-0-9/","image":"https://nmac.to/wp-content/uploads/2013/12/xTimeIcon.175x175-75.png","title":"xTeam v3.0.9 – Manage the people of your organization (was FlexTeam)","content":"xTeam (was FlexTeam) is an incredibly useful tool to manage the working schedule of people in your group or organization. Our goal is always to make the user’s experience as intuitive and task oriented as possible. xTeam is a really powerful schedule management tool that is visually appealing. It helps you share information, work jointly on […]"},{"link":"https://nmac.to/blog/wren-1-6-1/","image":"https://nmac.to/wp-content/uploads/2013/12/feather.175x175-75.png","title":"Wren v1.6.1 – Distraction-free work environment with saved-draft tweeting","content":"Wren is a distraction-free work environment with saved-draft tweeting. You want to get things done and be productive during your day, so you close Mail and Twitter. But how will you post that funny thing your coworker just said, that awesome link to a new site or that screenshot of the project you’re working on? […]"},{"link":"https://nmac.to/blog/tab-for-facebook-1-0/","image":"https://nmac.to/wp-content/uploads/2013/12/icons.175x175-753.png","title":"Tab for Facebook v1.0 – Access Facebook quickly from menu bar","content":"Tab for Facebook is a delightful and easy way to check Facebook. It’s the perfect companion for everything you want to accomplish on Facebook, offering a great balance between ease of use and powerful features. FEATURES :When you start using Tab for Facebook, you’ll be surprised how easy it is to post a status update […]"},{"link":"https://nmac.to/blog/lucid-1-0-16/","image":"https://nmac.to/wp-content/uploads/2013/12/lucid.175x175-751.png","title":"Lucid v1.0.16 – Add advanced capabilities to your webpages","content":"Lucid lets you add sleek animation and other advanced capabilities to your website. Bring your site to life by adding simple menu transitions, Google Maps, JSON requests and so much more! Lucid is like JavaScript building-blocks for your site — add features and functionality using interlocking pieces, not complicated code. Lucid requires no knowledge of JavaScript, […]"},{"link":"https://nmac.to/blog/icona-folder-1-0/","image":"https://nmac.to/wp-content/uploads/2013/12/Icona_Folder.175x175-75.png","title":"Icona Folder v1.0 – Customize You Folder Shape","content":"Icona Folder is an App that allows you to customize the common boring blu folder. You can add a picture with a simple Drag&Drop. Is very easy to use. Drag an image into the window and then drag the folder you want to change. Creating icons has never been so easy. Icona Folder will improve your […]"},{"link":"https://nmac.to/blog/easy-invoice-1-0/","image":"https://nmac.to/wp-content/uploads/2013/12/icon.175x175-7516.png","title":"Easy Invoice v1.0 – Simple and flexible invoicing app","content":"It is the perfect companion for freelancers and professionals who don’t need to spend a lot of time on creating invoices. If you send a limited number of invoices every month, and don’t want to spend a lot of time with complex invoicing applications, Simply Invoice is the solution! It is quick and easy to […]"},{"link":"https://nmac.to/blog/wondershare-fantashow-2-0-1/","image":"https://nmac.to/wp-content/uploads/2013/02/Wondershare-Fantashow.png","title":"Wondershare Fantashow 2.0.1 – Simple slideshow builder","content":"    Fantashow is the digital slideshow builder that lets anyone at home achieve a professional-looking movie in no time. Just drag in your photos, video and music, drop in a few of the array of built-in themes and your memories are transformed into Hollywood-style movies you can share on DVD, YouTube, Facebook, Mac HD, […]"},{"link":"https://nmac.to/blog/praise-1-0-3/","image":"https://nmac.to/wp-content/uploads/2013/12/praiseIcon.175x175-75.png","title":"Praise v1.0.3 – Facebook and Twitter Share","content":"Praise is an menu tab app that is running your Facebook and Twitter in the menu tab for check your friends post quickly. – Shortcut key to share a post.– URL sharing when you are watching webpage at Safari/Chrome.– Shortcut key customization.– Share URL or Post message to Facebook & Twitter at the same Time. WHAT’S […]"}]