[{"link":"https://nmac.to/blog/ishowu-studio/","image":"https://nmac.to/wp-content/uploads/2016/12/iShowU-Studio-2.png","title":"iShowU Studio 2.3.6 – Screen capture with full post-recording editing","content":"iShowU Studio, built from day one with a single core idea: easy screen recording and editing on your Mac — so that it’s easy to capture what you need; edit; and then share where you want to. It’s easy to add text, annotations, transitions, pointers, and highlights, and then to share your result. Features you’ve […]"},{"link":"https://nmac.to/blog/chrono-plus/","image":"https://nmac.to/wp-content/uploads/2016/04/Chrono-Plus.png","title":"Chrono Plus 1.5.1 – Time Tracker & Timesheet with Billing, Invoicing, and Reporting","content":"Chrono Plus is a convenient task manager and time tracking tool with a host of handy features. Chrono Plus is suitable for anyone who needs to manage time and tasks more effectively and efficiently. A must-have for any freelancer or professional paid by the hour, it features a sleek, intuitive interface for management of tasks, […]"},{"link":"https://nmac.to/blog/netshred-x/","image":"https://nmac.to/wp-content/uploads/2016/03/NetShred-X5.png","title":"NetShred X 5.7.1 – Erase your browser data – cache, cookies, history, and more","content":"NetShred X is the easy-to-use Internet cache eraser for OS X that securely erases cache files your browser and email programs leave behind. NetShred X is the Internet privacy software that is easy, fast, and cleaner. Easy because it runs automatically – you don’t have to remember to use it. Fast because it runs in […]"},{"link":"https://nmac.to/blog/pdf-printer/","image":"https://nmac.to/wp-content/uploads/2021/02/PDF-Printer.png","title":"PDF Printer 3.3.3 – Create PDFs from Mac, iPhone, or iPad","content":"PDF Printer lets you transform any file into a PDF document whenever you need it. PDF Printer runs as an virtual PDF printer, so you can add it to your Mac in the System Preferences, then print any documents directly to PDF. You can double-click to open any document, then tap “Print”, select “PDF Printer” […]"},{"link":"https://nmac.to/blog/newsflow/","image":"https://nmac.to/wp-content/uploads/2019/11/Newsflow_1.png","title":"Newsflow 1.5 – News from all of your favorite websites on your desktop","content":"Newsflow brings news from all of your favorite websites right to your desktop. Enjoy your articles in a fast, fluent and highly customizable news reader.   Features Feedly sync / Feedbin sync / Feed Wrangler sync / Standalone RSS engine Save to Buffer, Evernote, Pocket, Readability, Instapaper Beautiful themes (including night mode) and fully customizable […]"},{"link":"https://nmac.to/blog/leaf/","image":"https://nmac.to/wp-content/uploads/2016/10/Leaf5.png","title":"Leaf 5.2.2 – News reader with preview, sharing, and search capabilities","content":"Leaf is an amazing news reader for your Mac. Preview, share, star and search your articles by using a smooth, clean and intuitive interface.   Highlighted features Enhanced for Retina display Quick and clean article preview with a sharing button Hide articles and notifications for subscriptions Synchronized read and starring with Google Reader Alerts/banners for […]"},{"link":"https://nmac.to/blog/wise-menu/","image":"https://nmac.to/wp-content/uploads/2020/11/Wise-Menu.png","title":"Wise Menu 2.1 – Useful Context Menu Extensions","content":"Wise Menu is an ultra light Finder extension that adds useful actions to the context menu that appears on right clicking any item in Finder. The additional menu items that are added on installing this extension makes it quick and super easy to do certain things which are not available by default in the context […]"},{"link":"https://nmac.to/blog/cisdem-windowmanager/","image":"https://nmac.to/wp-content/uploads/2016/02/Cisdem.WindowManager.png","title":"Cisdem WindowManager 3.3.0 – Move, resize, and arrange windows with ease","content":"Cisdem WindowManager is an easy-to-use desktop window manager for moving, resizing, and arranging windows with ease. After installation, you can easily control windows in the following 3 ways: dragging windows to the edges or corners of your screen, the windows will be auto-resized; with innovative grid system to select the area that the windows should […]"},{"link":"https://nmac.to/blog/cisdem-unarchiver/","image":"https://nmac.to/wp-content/uploads/2016/02/BetterUnarchiver.png","title":"Cisdem Unarchiver 3.1.0 – Unzip partially or entirely, preview, and compress files","content":"Cisdem Unarchiver is not only an unarchiver, but also a compressor or an archiver. It allows you to entirely or partially unzip and open Zip, 7z, rar, ISO, tar, cab, Wim, xz, CHM, com, HFS, NSIS, and UDF files. You can also preview archive contents without decompressing. Besides, you can even archive or create password-protected […]"},{"link":"https://nmac.to/blog/expandrive/","image":"https://nmac.to/wp-content/uploads/2017/06/ExpanDrive6.png","title":"ExpanDrive 2021.8.3 – Access remote files over SSH/SFTP in Finder","content":"ExpanDrive builds cloud storage in every application, acts just like a USB drive plugged into your Mac. With ExpanDrive, you can securely access any remote file server directly from the Finder or even the terminal.   ExpanDrive supports: SFTP/FTP/FTPS Amazon S3 Dropbox WebDAV Rackspace Cloud Files Openstack Swift Dreamhost DreamObjects Google Drive OneDrive Box.com Copy.com […]"}]