[{"link":"https://nmac.to/blog/paintmee-12/","image":"https://nmac.to/wp-content/uploads/2013/12/pmee.jpg","title":"PaintMee 1.2 – Automatic painting generator","content":"PaintMee is the world’s most advanced automatic painting generator. Unlike any other software, paintings are actually PAINTED stroke by stroke, smoothly animated, starting with an empty canvas reaching incredible results. UNIQUE FEATURES PaintMee shares many powerful features with its forerunner, SketchMee, which was ALSO selected by Apple as a worldwide, major front page feature app […]"},{"link":"https://nmac.to/blog/clear-102/","image":"https://nmac.to/wp-content/uploads/2013/12/Icon.175x175-754.jpg","title":"Clear 1.0.2 – Popular to-do list manager","content":"With Clear, to-do list management is clean and simple. Life is messy. Keep it together with Clear, the amazing app for list-keeping that is unbelievably simple, quick and satisfying to use.   Clear for Mac stores your lists in iCloud so you can use them on your Mac, or on the go using Clear for […]"},{"link":"https://nmac.to/blog/xruler-101/","image":"https://nmac.to/wp-content/uploads/2013/12/icon.175x175-7524.jpg","title":"xRuler 1.01 – Ruler for your desktop","content":"xRuler is a tiny screen pixel ruler for your Mac. Features:Horizontal ruler & Vertical ruler, Show pixel point, Launch at Login WHAT’S NEW Version 1.01: Add a option to show or hide mouse position. REQUIREMENTS OS X 10.6.6 or later ScreenShots :          Uploaded          Depositfiles         Filefactory    […]"},{"link":"https://nmac.to/blog/icollage-pro-12/","image":"https://nmac.to/wp-content/uploads/2013/12/icollagepro.175x175-75.jpg","title":"iCollage Pro 1.2 – Stylish collage creation","content":"iCollage Pro allows you to easily create collages on your Mac! You can bring together your best pictures of your fondest memories in one stunning image! iCollage Pro allows you to have complete creative control of your collage! After choosing the pictures you want to collage, you have several editing options. You have the ability to […]"},{"link":"https://nmac.to/blog/convertr-10/","image":"https://nmac.to/wp-content/uploads/2013/12/convertr.175x175-75.jpg","title":"Convertr 1.0 – New video converter app","content":"Convertr is your goto app for converting all types of movie files. It easily allows you to convert your favorite videos to the proper format for your favorite device.Features:– Choose from many video types including .mov, wmv, mpeg, mpgmkv, avi, and more…– Output to you favorite device such as the iPad, iPhone 5, and many […]"},{"link":"https://nmac.to/blog/film-noir-111/","image":"https://nmac.to/wp-content/uploads/2013/12/IDnoir.175x175-75.jpg","title":"Film Noir 1.1.1 – Professional looking black & white photos","content":"When photography was first introduced, the photographers had to shoot black and white photos, simply because technology didn’t allow them to do color photography yet. Then, as color photography was invented in the 30’s, black and white photography became a form of art, with a large following. Film Noir photography is a style of photography […]"},{"link":"https://nmac.to/blog/inspiration-set-26/","image":"https://nmac.to/wp-content/uploads/2013/12/inspiration.175x175-75.jpg","title":"Inspiration Set 2.6 – Unique page-template designs","content":"Inspiration Set includes 250 templates, providing a wide selection of documents, from business cards and jewel case covers to brochures and books.Inspiration Set gives an ample selection of documents, from business cards and jewel case covers to brochures and books. Some templates contain multiple different sections, so, the package supplies a lavish array of over […]"},{"link":"https://nmac.to/blog/tree-190/","image":"https://nmac.to/wp-content/uploads/2013/12/appIcon.175x175-751.jpg","title":"Tree 1.9.0 – Store ideas and organize info","content":"Tree is an outliner featuring a horizontally expandable tree view. Tree assists you in organizing your information, sketching plans and brainstorming new ideas. Tree allows you to store your ideas and keywords in segments that you can sort, re-arrange and constantly refine. Tree is designed to be a lightweight application that lets you concentrate on […]"},{"link":"https://nmac.to/blog/photostudio-600138/","image":"https://nmac.to/wp-content/uploads/2013/12/mzi.nokwiiho.175x175-75.jpg","title":"PhotoStudio 6.0.0.138 – Powerful image editing for users of all skill levels","content":"ArcSoft PhotoStudio for Mac offers an array of advanced editing tools, provides more than 40 photo filters, 3 convenient ways for you to capture images on your computer screen etc., which meet all levels of users’ needs. PhotoStudio 6 fully supports all popular photo file formats, it also supports 48-bit image and large image files, […]"},{"link":"https://nmac.to/blog/atv-flash-black-23/","image":"https://nmac.to/wp-content/uploads/2013/12/40852.jpg","title":"aTV Flash (black) 2.3 – Supercharge your second-generation Apple TV","content":"aTV Flash (black) supercharges your 2nd generation Apple TV, empowering it to do things you never thought possible! All new features are installed alongside the normal Apple TV features, so things like movie rentals, Netflix, and AirPlay will remain unchanged.   Installing aTV Flash (black) requires that you first jailbreak your 2nd Gen. Apple TV […]"}]