[{"link":"https://nmac.to/blog/facefilter-pro-3-04/","image":"https://nmac.to/wp-content/uploads/2014/04/FaceFilter3-Pro.png","title":"FaceFilter Pro 3.04 – The Ultimate Beauty Kit For Your Photos","content":"FaceFilter is a versatile photo retouching and beautifying toolkit that allows you to reveal the true beauty of your photos. Utilize natural skin smoothing and blemish removal tools along with a comprehensive multi-layer makeup system complete with hundreds of templates for one-click application, not to mention morphing tools and DSLR post-effects.   On top of […]"},{"link":"https://nmac.to/blog/writer-pro-1-1/","image":"https://nmac.to/wp-content/uploads/2014/01/Writer-Pro.png","title":"Writer Pro 1.1 – Professional writing suite","content":"Writer Pro is a professional writing suite that gives you full control over your notes, drafts and edits.    Workflow: Note – Write – Edit – Read. Each stage has a task-specific typeface and color. Syntax Control scans the syntax of English, French, German, Italian, and Spanish text and highlights your adjectives, nouns, verbs, adverbs, […]"},{"link":"https://nmac.to/blog/smartday-3-1-1/","image":"https://nmac.to/wp-content/uploads/2013/12/SmartDay.png","title":"SmartDay 3.1.1 – Integrated organizer with automatic scheduling","content":"SmartDay is an integrated organizer that automatically schedules tasks into the free time in your calendar. SmartDay uses adaptive logic to organize your projects, tasks, appointments and check-lists. The included Cloud hub (free) keeps you connected across all of your Macs and PC’s, and syncs with our iPad organizer, SmartPad.   Beauty in Simplicity… SmartDay […]"},{"link":"https://nmac.to/blog/myphotostream-1-0-5/","image":"https://nmac.to/wp-content/uploads/2014/04/MyPhotostream.png","title":"MyPhotostream 1.0.5 – Desktop app for easily viewing Photo Stream","content":"MyPhotostream is a desktop app that allows you to easily view photos in your Photo Stream on iCloud without having to launch iPhoto.   Version 1.0.5: New: Via the menu you can now set up MyPhotostream to always scale photos to fit the entire view. Fix: Fixed a database problem which sometimes can lead to […]"},{"link":"https://nmac.to/blog/mashup-2-0-1/","image":"https://nmac.to/wp-content/uploads/2014/04/Mashup.png","title":"Mashup 2.0.1 – Professional-quality remixing","content":"Mashup lets you create your own mashups and remixes. Experiment with your favorite music, and discover combinations that sound perfect together. Developed by the award-winning Mixed In Key team with 100,000+ fans on Facebook. With Mashup, you can mix as many songs as you want from your music collection to make a perfect mashup.   […]"},{"link":"https://nmac.to/blog/macaw-1-0-1/","image":"https://nmac.to/wp-content/uploads/2014/04/Macaw1.png","title":"Macaw 1.0.1 – The code-savvy web design tool","content":"Stop writing code. Start drawing it.   Macaw provides the same flexibility as your favorite image editor but also writes semantic HTML and remarkably succinct CSS. It’s time to expect more from a web design tool.   Fluid canvas and grid Macaw is engineered for fluid widths. Resize the canvas and your grids and elements […]"},{"link":"https://nmac.to/blog/vssh-1-6/","image":"https://nmac.to/wp-content/uploads/2014/04/vSSH.png","title":"vSSH 1.6 – SSH protocol connectivity tools","content":"VSSH is advanced customizable SSH and Telnet client with iCloud connections, macros and keys sharing.   Key fetaures: SSH and Telnet protocols Username/password and public/private Keys authentication Multi-sessions with tabbed interface iCloud connections, macros and keys sharing with other vSSH apps (for iPhone, iPad and OS X) Key forwarding Port forwarding (support connection without shell: […]"},{"link":"https://nmac.to/blog/deckadance-2-3-0/","image":"https://nmac.to/wp-content/uploads/2014/04/Deckadance.png","title":"Deckadance 2.3.0 – DJ mixing application","content":"Deckadance is a DJ mixing application that works either as a standalone program OR as a VSTi plugin inside your favourite host. Deckadance itself can also host any VST compliant softsynth or effect.   You can control Deckadance using most (if not all) existing midi controllers & timecoded vinyl and CD systems.   Deckadance is […]"},{"link":"https://nmac.to/blog/picturesque-2-4-5/","image":"https://nmac.to/wp-content/uploads/2014/01/Picturesque.png","title":"Picturesque 2.4.5 – Make images look gorgeous for the web","content":"Picturesque is an award-winning application designed to make images look gorgeous for the web.    With an animated “drag and drop” style interface, Picturesque makes images gorgeous with tasteful effects like 3D perspective, reflection, glow, shadow, curve, and stroke in less time than it takes to open Photoshop.   Picturesque can also beautify images in […]"},{"link":"https://nmac.to/blog/multibrowser1-1-2-1/","image":"https://nmac.to/wp-content/uploads/2014/04/MultiBrowser1.png","title":"MultiBrowser1 1.2.1 – View multiple URL’s in one browser window","content":"With MultiBrowser1 you can load and use multiple websites at the same time! View 4 videos on Youtube, chat with Facebook Messenger, and read your newest emails – all at the same time!   Version 1.2.1: minor improvements   Intel, OS X 10.6.6 or later   Usersfiles          Uploaded         1fichier  […]"}]