[{"link":"https://nmac.to/blog/call-of-duty-4-modern-warfare/","image":"https://nmac.to/wp-content/uploads/2018/07/Call-of-Duty-4.png","title":"Call of Duty 4: Modern Warfare 1.7.2 – Save the world in its darkest hour","content":"Featuring a tense storyline, filled with plot twists, Call of Duty 4 thrusts players into battle like never before. With amazing special effects, including rim-lighting, depth of field, texture streaming and character self-shadowing, players are enlisted into one of the most photo-realistic gaming experiences imaginable.   The community-oriented Call of Duty 4 multiplayer gameplay features […]"},{"link":"https://nmac.to/blog/world-of-where/","image":"https://nmac.to/wp-content/uploads/2018/07/World-of-Where.png","title":"World of Where 4.0.0 – Learn the countries and capital cities of the world","content":"World of Where is the easiest way to learn the countries, capital cities, flags, provinces and physical features of the world.   Navigate ‘atlas style’ to one of the many colorful political maps or stunning physical maps within World of Where and click test to begin a customisable quiz of the countries, cities, flags or […]"},{"link":"https://nmac.to/blog/istat-view/","image":"https://nmac.to/wp-content/uploads/2016/10/iStat.png","title":"iStat View 3.04 – Monitor Macs, PCs and servers from anywhere in the world","content":"iStat View is a highly detailed remote monitoring app, letting you check the vital stats for Macs, PCs and servers from anywhere in the world.   To get started, please install iStat on your Mac, and install iStat Server on the computer you would like to monitor.   Stats, stats, stats iStat displays a huge range […]"},{"link":"https://nmac.to/blog/photostage/","image":"https://nmac.to/wp-content/uploads/2018/01/PhotoStage.png","title":"PhotoStage 5.01 – Easy slideshow maker","content":"PhotoStage is fast and easy slideshow software. Just drag-and-drop images, or use the Quick Create feature on a folder of images. Add music, narration, video clips, or subtitles. Add special effects such as crop, zoom, fade, crossfade, and more. Share your slideshow on the Web, on portable devices, or burn to DVD. Supports a wide […]"},{"link":"https://nmac.to/blog/mailplane/","image":"https://nmac.to/wp-content/uploads/2017/08/Mailplane3.png","title":"Mailplane 3.8.2 – Bring Gmail to your Mac desktop","content":"Mailplane brings Gmail to your Mac desktop. Mailplane combines Gmail’s spam protection, endless storage, global access, and unique user interface with great Mac features:   Attach files: Drag ‘n’ drop your files and folders to Mailplane and watch them being attached to the message and automatically uploaded.   Send optimized photos: Pictures get automatically resized […]"},{"link":"https://nmac.to/blog/swivik/","image":"https://nmac.to/wp-content/uploads/2018/06/Swivik.png","title":"Swivik 0.2.13 – Command+Tab switcher for individual windows","content":"Swivik is a replacement for the built-in Command+Tab that lets you switch between windows individually. And it helps you find the window you’re looking for with up-to-date previews as you cycle through.   Version 0.2.13: Release notes were unavailable when this listing was updated.   Intel, 64-bit processor OS X 10.11 or later    "},{"link":"https://nmac.to/blog/stock-pro/","image":"https://nmac.to/wp-content/uploads/2016/03/Stock-3.png","title":"Stock + Pro 3.8.5 – The easiest way to watch and track your investments","content":"Stock + Pro is the most popular investment app for OS X. Designed to be easy to pick up for beginners while packing advanced tools for seasoned veterans, Stock + Pro helps you know exactly what is going on with your portfolio.   The clean and organized interface makes it easy to focus on analyzing […]"},{"link":"https://nmac.to/blog/dxo-opticspro-for-photos/","image":"https://nmac.to/wp-content/uploads/2016/11/DxO.OpticsPro.for_.Photos.png","title":"DxO OpticsPro for Photos 1.4.4 – Image processing workflow for Photographers","content":"DxO OpticsPro for Photos is designed to provide a seamless image processing workflow for Photographers who are on a Mac, and use OS X Photos as their primary photo application. DxO image processing for supported cameras can now be accessed directly from within the editing mode of OS X Photos, with DxO OpticsPro acting as […]"},{"link":"https://nmac.to/blog/aurora-blu-ray-player/","image":"https://nmac.to/wp-content/uploads/2015/03/Aurora.Blu-ray.Player..png","title":"Aurora Blu-ray Player 2.19.2 – Software Blu-ray player with DTS 7.1","content":"Aurora Blu-ray Player was specifically designed for trouble-free viewing of protected Blu-ray movies, ISO, and online resources. This Blu-ray player software can be used not only as a viewer for Blu-ray movie discs, standard Blu-ray folders, and Blu-ray ISO’s, but also as a DVD player, media player, audio player, and photo viewer. The latest support […]"},{"link":"https://nmac.to/blog/ondesoft-audiobook-converter/","image":"https://nmac.to/wp-content/uploads/2018/07/Ondesoft-AudioBook-Converter.png","title":"Ondesoft AudioBook Converter 3.0.2 – Convert your audio books to MP3 or AAC","content":"Ondesoft AudioBook Converter is an AA converter that can batch convert purchased Audio books or AA flies from iTunes or Audible on OS X to MP3 or AAC format. Then DRM protections on audio book will be removed. The conversion with CD output quality is at up to 16x speeds!   Features Convert purchased audio […]"}]