[{"link":"https://nmac.to/blog/blueprint-2-0-1/","image":"https://nmac.to/wp-content/uploads/2015/03/Blueprint.png","title":"Blueprint 2.0.1 – Organizational app with several functions (was Nokumo)","content":"Blueprint (was Nokumo) is an app for small businesses which combines a wealth of organizational functions in just one app.   Feature Highlights: Managing projects – track progress and see related contacts, linked tasks and notes Having a full overview of contacts – see all contact details as well as the received and sent emails, […]"},{"link":"https://nmac.to/blog/ssh-tunnel-15-03/","image":"https://nmac.to/wp-content/uploads/2015/03/SSH.Tunnel.png","title":"SSH Tunnel 15.03 – Easily manage and control ssh tunnels","content":"SSH Tunnel allows you to easily manage and precisely control your ssh tunnels.   SSH Tunnel is able to remember the ssh login password and save it to OS X’s keychain. Furthermore, SSH Tunnel is designed to automatically reconnect when your Mac is waking up from sleep.   Notable Features: Auto launch when log in […]"},{"link":"https://nmac.to/blog/hear-1-2-3/","image":"https://nmac.to/wp-content/uploads/2014/05/Hear.png","title":"Hear 1.2.3 – Improves audio quality and adds audio options system-wide","content":"Hear greatly improves audio quality in movies and music throughout all of your Mac OS X applications. With Hear, music is richer, movie sound and dialog is clearer and games will blow you out of your chair!   3D Sound – Like movies? like’em more with virtual cinema quality sound experience. Sound will approach you […]"},{"link":"https://nmac.to/blog/bee-2-0-3/","image":"https://nmac.to/wp-content/uploads/2015/03/Bee.png","title":"Bee 2.0.3 – Client for tracking in FogBugz, GitHub, and JIRA","content":"Bee syncs with GitHub Issues, JIRA, and FogBugz. You can also use Bee to keep track of your plain text notes.   Features: Flight Path. Flight Path lives in your menu bar and helps you by intelligently selecting the task you should be working on next. Notifications. Bee uses Notification Center to inform you of […]"},{"link":"https://nmac.to/blog/pdf-converter-3-1-0/","image":"https://nmac.to/wp-content/uploads/2015/03/PDF-Converter.png","title":"PDF-Converter 3.1.0 – Convert Normal PDF to Word, PPT, Html, etc","content":"Powerful, easy-to-use, fast and accurate! Enolsoft PDF-Converter is an all-in-one application that converts native PDF files(scanned PDFs not included) to Microsoft Word(.docx), PowerPoint(.pptx), iWork formats(Keynote, Pages),ePub, RTFD, Text, HTML, Images and more! Handling PDF tasks has never been easier when you can convert it to any format you need!   10-in-1 PDF Converter  Convert PDF […]"},{"link":"https://nmac.to/blog/hektor/","image":"https://nmac.to/wp-content/uploads/2015/03/Hektor.png","title":"Hektor 1.0 – A psychological horror game","content":"HEKTOR is a first-person, psychological horror game where nothing ever stays the same for long. Explore a world that literally moves with your every twist and turn, as corridors shift and change before your eyes. Uncover cryptic clues to help you find your way and elude the horrors that only madness can conjure.   You […]"},{"link":"https://nmac.to/blog/code-snippet-1-0-2/","image":"https://nmac.to/wp-content/uploads/2015/03/Code-Snippet.png","title":"Code Snippet 1.0.2 – Code-snippet organizer","content":"Code Snippet supports many different language syntaxes, with code suggestions: abap, actionscript, ada, apache_conf, applescript, asciidoc, assembly_x86, autohotkey, batchfile, c_cpp, c9search, cirru, clojure, cobol, coffee, coldfusion, csharp, css, curly, d, dart, diff, django, dockerfile, dot, eiffel, ejs, elixir, elm, erlang, forth, ftl, gcode, gherkin, gitignore, glsl, golang, groovy, haml, handlebars, haskell, haxe, html_ruby, html, ini, […]"},{"link":"https://nmac.to/blog/continu-1-5/","image":"https://nmac.to/wp-content/uploads/2015/03/Continu.png","title":"Continu 1.5 – Make sure that one or more applications will always be running on your Mac","content":"Continu is a small and simple to use OS X menu bar based app that makes sure that one or more applications will always be running on your Mac. If they crash or should accidentally be closed, Continu.app will automatically launch them again, either giving them focus or opening them in the background.   Continu.app […]"},{"link":"https://nmac.to/blog/boinxtv-1-9-11/","image":"https://nmac.to/wp-content/uploads/2015/03/BoinxTV.png","title":"BoinxTV 1.9.11 – Live-production software for video podcasters","content":"BoinxTV is the pioneering live-production software for video podcasters that turns any recent Mac into a TV studio “for the rest of us”.   Record stunning studio shows, podcasts, sports events, concerts, interviews, sermons, seminars and more using your Mac, multiple cameras, microphones and other footage. With its innovative user interface, BoinxTV makes it easy […]"},{"link":"https://nmac.to/blog/1keyboard-2-0/","image":"https://nmac.to/wp-content/uploads/2015/03/1Keyboard.png","title":"1Keyboard 2.0 – Use your Mac’s keyboard on all your devices","content":"1Keyboard lets you type on your iPhone, iPad, or Apple TV using your Mac’s keyboard. It turns your Mac into a Bluetooth keyboard that works with all of your devices.   Features: Use keyboard shortcuts to start typing on devices. Copy-paste text into your device. Minimal menubar app that stays out of sight until you […]"}]