[{"link":"https://nmac.to/blog/kona/","image":"https://nmac.to/wp-content/uploads/2017/03/Kona.png","title":"Kona 1.0 – First-Person Adventure & Survival Game","content":"    Northern Canada, 1970. A strange blizzard ravages Atamipek Lake. Step into the shoes of a detective to explore the eerie village, investigate surreal events, and battle the elements to survive. Kona is a chilly, narrative-driven interactive tale you won’t soon forget.   Setting October 1970. W. Hamilton, a rich industrialist who owns a […]"},{"link":"https://nmac.to/blog/themes-for-keynote-4-8/","image":"https://nmac.to/wp-content/uploads/2016/08/Themes-for-Keynote.png","title":"Themes for Keynote 4.8 – Professional themes for Apple Keynote","content":"Themes for Keynote lets you start a new presentation and focus on the content – the design is already there.   Themes for Keynote consists of high-quality designs for Keynote presentations. These are more than just beautiful backgrounds – each one of them includes up to 20 different master slides, which lets you choose the […]"},{"link":"https://nmac.to/blog/patch-viewer-1-0-9/","image":"https://nmac.to/wp-content/uploads/2017/03/Patch-Viewer.png","title":"Patch Viewer 1.0.9 – A handy application that allows you to view patch files","content":"Patch Viewer allows you to view patch files (or the output from diff-like command-line tool) using your existing third-party graphical file comparison tool such as Xcode’s FileMerge.   Diff output in traditional, context and unified formats from a range of command-line source control tools such as Git, Subversion, Mercurial and CVS (to name a few) […]"},{"link":"https://nmac.to/blog/desktop-ghost-pro-1-5-2/","image":"https://nmac.to/wp-content/uploads/2016/02/Desktop.Ghost_.png","title":"Desktop Ghost Pro 1.5.2 – Instantly hide and show desktop icons","content":"Desktop Ghost Pro instantly hides or shows all files, folders, and app icons on your messy desktop. You don’t need to move all the files on your desktop to take a screen recording or a screenshot anymore! Temporarily hide your messy desktop with Desktop Ghost and unhide it when you’re ready!   Features Instantly hide […]"},{"link":"https://nmac.to/blog/newsletters-templates-for-pages-1-2/","image":"https://nmac.to/wp-content/uploads/2016/11/Newsletters-Templates-for-Pages.png","title":"Newsletters Templates for Pages 1.2 – 90 great newsletters templates for pages","content":"Don’t spend your time making newsletters, make news! Newsletters Templates for Pages is your ultimate assistant for creating captivating newsletters in mere minutes. Choose from a growing collection of professionally-crafted, customizable newsletter templates for any kind of news.   Newsletters Templates for Pages features over 90 great templates in a variety of styles to match […]"},{"link":"https://nmac.to/blog/desktopr-1-82/","image":"https://nmac.to/wp-content/uploads/2016/04/Desktopr.png","title":"Desktopr 1.82 – Create dynamic desktops","content":"Desktopr is simple way to extend your desktop with any content you can even imagine.   With Desktopr you can set any website, quartz composition, flash movie or other content as your desktop background.   Imagine your Facebook, Gmail, Twitter or favorite blog or magazine as a background of your desktop. You can switch currently […]"},{"link":"https://nmac.to/blog/browser-care-4-0/","image":"https://nmac.to/wp-content/uploads/2016/07/Browser-Care3.png","title":"Browser Care 4.0 – Browser maintenance app","content":"Browser Care is a powerful application that allows you to keep your browsers clean and under control since navigating accumulates files on your Mac.   Features Care. A button for everything. Take Care of your browser to recover space on your Mac. Simple presets. Convenient presets that are fast and easy (even for beginners). Items […]"},{"link":"https://nmac.to/blog/3d-lut-creator-1-33/","image":"https://nmac.to/wp-content/uploads/2017/03/3D-Lut-Creator.png","title":"3D Lut Creator 1.33 – Software for professional color correction","content":"3D LUT Creator is the latest program with unique tools for professional color grading of digital images and video and creating 3DLUT-files that can be imported into many programs such as Adobe Photoshop, Adobe After Effects, Adobe Premiere Pro, DaVinci Resolve, FinalCut Pro.   Color correction in 3D LUT Creator was made by bending grid tied to the color […]"},{"link":"https://nmac.to/blog/file-sumo-1-1-1/","image":"https://nmac.to/wp-content/uploads/2017/02/FileSumo.png","title":"File Sumo 1.1.1 – Find And Delete Huge Files","content":"File Sumo is an awesome utility app which helps you to discover and handle huge files that are cluttering and slowing down your Mac space.   Find and Delete Top 10 / 50 /100 Large Files File Sumo provides the list of top 10/50/100 Large files and their sizes along with the options to view […]"},{"link":"https://nmac.to/blog/batman-arkham-asylum-goty/","image":"https://nmac.to/wp-content/uploads/2017/03/Batman-Arkham-Asylum-GOTY.png","title":"Batman: Arkham Asylum GOTY 1.1 – Award-winning action game, starring the Dark Knight","content":"    Critically acclaimed Batman: Arkham Asylum returns with a remastered Game of the Year Edition, featuring 4 extra Challenge Maps. The additional Challenge Maps are Crime Alley; Scarecrow Nightmare; Totally Insane and Nocturnal Hunter (both from the Insane Night Map Pack).   Utilize the unique FreeFlow™ combat system to chain together unlimited combos seamlessly […]"}]