[{"link":"https://nmac.to/blog/cdock/","image":"https://nmac.to/wp-content/uploads/2020/09/cDock_4.png","title":"cDock 4.6.3 – Customize your dock","content":"cDock will unleash your Dock with a variety of custimzations. There are several dock styles included and users can also create their own custom docks.   Version 4.6.3: Release notes were unavailable when this listing was updated.   Intel, 64-bit processor macOS 10.14 or later    "},{"link":"https://nmac.to/blog/trickster/","image":"https://nmac.to/wp-content/uploads/2017/02/Trickster2.png","title":"Trickster 3.8.1 – Quickly access recently used files [FIX]","content":"Trickster (was Blast) is a productivity booster application that places all recently used files at the user’s fingertips, providing fast and easy access to them.   Trickster keeps track of all of the recently used files on your Mac. With Trickster, all of these documents are just one click away. Files are accessible at anytime […]"},{"link":"https://nmac.to/blog/black-out/","image":"https://nmac.to/wp-content/uploads/2020/07/Black_Out_2.png","title":"Black Out 2.0.4 – Hide sensitive parts of an image","content":"Black Out lets you quickly hide sensitive parts of an image. This can be useful when you want to post a screenshot or photo on the web that contains some information you don’t want revealed.   It also removes all metadata, like when and where a photo was captured.   Black Out is intentionally simple. […]"},{"link":"https://nmac.to/blog/backgrounds/","image":"https://nmac.to/wp-content/uploads/2020/06/Backgrounds_9.png","title":"Backgrounds 10.0 – Dynamic desktop wallpapers","content":"Backgrounds makes your desktop dynamic with 6 themes: iTunes, Parallax, Quartz, Video, System and Time. It is designed for Mac users who want to make the backgrounds of their computer screens more attractive, stylish, and dynamic. This can be done by adding brand new features and helpful widgets to your screen to achieve an exquisite […]"},{"link":"https://nmac.to/blog/living-earth/","image":"https://nmac.to/wp-content/uploads/2014/08/Living-Earth-HD.png","title":"Living Earth 1.29 – Desktop Weather & World Clock [FIX]","content":"Living Earth is the best and most beautiful world clock and weather app for your Mac! The award winning app for iPhone and iPad is now available with a single click from your Mac menu bar offering easily accessible world times and weather for millions of cities around the world. Real-time global cloud cover, live […]"},{"link":"https://nmac.to/blog/eplayer-pro/","image":"https://nmac.to/wp-content/uploads/2021/11/ePlayer-Pro.png","title":"ePlayer Pro 5.2.6 – A professional video playback","content":"ePlayer Pro is a professional video playback tool. ePlayer Pro plays all multimedia files as well as DVDs, Audio CDs, VCDs, various streaming protocols, 4K/ultra HD video files, and plays them with high-definition.   Stunning, beautifully crafted ePlayer Pro packed with powerful features.It is the best video player fulfil all your media player needs and […]"},{"link":"https://nmac.to/blog/cleverfiles-duplicates-finder/","image":"https://nmac.to/wp-content/uploads/2021/11/CleverFiles-Duplicates-Finder.png","title":"CleverFiles Duplicates Finder 2.0 – Find and remove duplicate files","content":"Find and remove duplicate files and folders on your drives and cloud accounts fast.   “Where’s that file? Ah, I’ll just download it again. I need a copy of my photo album to edit it tomorrow. What are all these files here? Let me back them up now and deal with them later.” Yes, we […]"},{"link":"https://nmac.to/blog/kite-compositor/","image":"https://nmac.to/wp-content/uploads/2020/03/Kite_2.png","title":"Kite 2.1 – Animation and prototyping for macOS and iOS","content":"Kite Compositor lets you visually drag-and-drop layers to build complex interfaces on a WYSIWYG canvas. Add animations and tune them with the integrated timeline. Use the built-in JavaScript scripting environment to enhance the detail of each interaction. Incorporate custom logic and behavior to achieve exactly what you need.   Features Timeline – The integrated smart […]"},{"link":"https://nmac.to/blog/dropdmg/","image":"https://nmac.to/wp-content/uploads/2020/10/dropdmg3.png","title":"DropDMG 3.6.3 – Quickly create disk image (dmg) archives","content":"DropDMG allows users to quickly create .dmg archives.   Disk images pack entire folders or disks into a single compressed file, either for transport across the Internet or simply for backup. They are Apple’s preferred format for distributing Mac software. Disk images are also the only archive format whose contents you can directly access in […]"},{"link":"https://nmac.to/blog/iflicks/","image":"https://nmac.to/wp-content/uploads/2016/02/iFlicks2.png","title":"iFlicks 3.8.1 – Easily import your video collection into iTunes","content":"Use iFlicks to add your video files to iTunes and iOS devices. Add metadata to Movies and TV Shows to make your video library look awesome. Managing your video collection on your Mac has never been this easy.   iFlicks is all about Movie and TV Show Metadata. It helps you make your iTunes Library […]"}]