[{"link":"https://nmac.to/blog/root-of-evil-the-tailor-1-0/","image":"https://nmac.to/wp-content/uploads/2017/03/Root-Of-Evil.png","title":"Root Of Evil: The Tailor 1.0 – Horror, Adventure & Action Game","content":"The story is about a case happened 20 years ago!A family consisting of a married couple were killed and they left their child who was recently born. Police had investigated and said that this was a suicide and the case was closed. The child, then, was sent to an orphanage.   After the case ended, […]"},{"link":"https://nmac.to/blog/greenwood-the-last-ritual-1-0/","image":"https://nmac.to/wp-content/uploads/2017/03/Greenwood.png","title":"Greenwood The Last Ritual 1.0 – An adventure game with isometric viewpoint","content":"Greenwood The Last Ritual is an adventure game with isometric viewpoint where you will play as an envoy of Vatican. Use magic of pentagrams to break the Curse on the Valley. At the same time you will have to try to resist that Curse yourself and make it out alive.   The game takes place […]"},{"link":"https://nmac.to/blog/share-tunes-2-1-4/","image":"https://nmac.to/wp-content/uploads/2016/03/Share.Tunes_.png","title":"Share Tunes 2.1.4 – Share what song you are listening to","content":"Share Tunes helps you to share your taste in music on Twitter, Facebook, Sina Weibo, and Tumblr! Music plays an important part in our lives, so why don’t share it with others?   Share Tunes works in the background and lives in your menubar. When you open it, you’ll see the song you’re currently playing […]"},{"link":"https://nmac.to/blog/red-barton-and-the-sky-pirates-1-0/","image":"https://nmac.to/wp-content/uploads/2017/03/Red.Barton.and_.The_.Sky_.Pirates.png","title":"Red Barton and The Sky Pirates 1.0 – An exciting 3rd person arcade combat flight shooter","content":"Red Barton and the Sky Pirates is an exciting 3rd person arcade combat flight shooter reminiscent of games like Star Fox back on the classic N64 and the legendary “After Burner” arcade. It is set in an imaginative and original cartoon style steampunk world with superb hand-drawn illustration quality in-game graphics. The player plays the […]"},{"link":"https://nmac.to/blog/print-window-5-3/","image":"https://nmac.to/wp-content/uploads/2015/11/Print-Window5.png","title":"Print Window 5.3 – Print folder listings from the Finder","content":"Print Window offers the ability to print a file listing directly from within the Mac OS X Finder. No more taking screenshots of windows or settling for text-only printouts of filenames only. Print Window provides the works: icons, file information, sorting and so much more!   The Standard edition is free but does not have […]"},{"link":"https://nmac.to/blog/precious-disk-1-1-0/","image":"https://nmac.to/wp-content/uploads/2017/03/Precious-Disk.png","title":"Precious Disk 1.1.0 – Scan your hard drive to display where your largest files","content":"Precious Disk can help you recover gigabytes of free space.   Do you need more disk space? Do you always forget to remove old and heavy files? Do you need to find where are your unwanted files?   If one of your answer is yes, try Precious Disk!   PreciousDisk efficiently carries out this unpleasant […]"},{"link":"https://nmac.to/blog/on1-photo-10-5-2/","image":"https://nmac.to/wp-content/uploads/2015/11/On1.Photo_.png","title":"ON1 Photo 10.5.2 – Collection of ON1 digital photo products for Photoshop and more","content":"ON1 Photo 10 is a full-featured photo editor that works as a plug-in to Adobe Photoshop and Lightroom, or as a standalone application. Browse and manage your photos where they are stored; local, external, and network drives or cloud service. Version 10 includes the necessary tools to manage and edit your photos with non-destructive Smart […]"},{"link":"https://nmac.to/blog/langoth-1-1-0/","image":"https://nmac.to/wp-content/uploads/2017/03/Langoth.png","title":"Langoth 1.1.0 – Multi-Level Action & Adventure Game","content":"The world around you is not real – it’s only a high-quality multi-level simulation. Due to a virus attack on the basic simulator system, the program was corrupted and all living entities disappeared from the world and have been replaced with virus cells, eating the remains of the matter.   Hope fades by the minute, […]"},{"link":"https://nmac.to/blog/cyberline-racing-1-0/","image":"https://nmac.to/wp-content/uploads/2017/03/Cyberline-Racing.png","title":"Cyberline Racing 1.0 – Competitive racing and shooting game","content":"Cyberline Racing combines action packed shooting with adrenaline pumped races, delivering an explosive experience. Load your car with guns and put your driving skills to the ultimate test as you dodge missiles, destroy enemy cars, and race to the top of the online rankings!   STORYLINE In the late 21st century the world has been […]"},{"link":"https://nmac.to/blog/ascender-1-0/","image":"https://nmac.to/wp-content/uploads/2017/03/Ascender.png","title":"Ascender 1.0 – 2D explorative puzzle platformer game","content":"Ascender is a 2D explorative puzzle platformer. The game is set in the open world of GOA’s districts, and the player will face many unique puzzles to solve. Warning!! This game will truly challenge your puzzle and platforming skill 😀   The story follows the enigmatic journey of Sky, an explorative artificial intelligence made by […]"}]