[{"link":"https://nmac.to/blog/videobox-v3-9/","image":"https://nmac.to/wp-content/uploads/2013/12/24405.png","title":"Videobox 3.9 – Download Flash video through your browser","content":"Videobox allows you to quickly and easily download Flash video from most all of the popular video sites on the internet. Videobox will convert the video into a native Quicktime format so it’s ready to view on your Mac, iPod, iPhone or iTunes.   Version 3.9: The delay after which the mini-browser shows-up if no […]"},{"link":"https://nmac.to/blog/remoter-v1-2-4/","image":"https://nmac.to/wp-content/uploads/2013/12/46561.png","title":"Remoter v1.2.4 – All-in-one remote desktop utility","content":"Remoter, the best remote desktop client for iOS, makes its way into the desktop! Connect to all your VNC (Screen Sharing), RDP (Windows Remote Desktop), SSH and Telnet sessions from one app. Supports audio streaming for OSX and RDP. Multi-Monitor support for Lion requires RemoterFusion (free download) Remoter is intuitive and very easy to use!. […]"},{"link":"https://nmac.to/blog/paintsupreme-v1-50/","image":"https://nmac.to/wp-content/uploads/2013/12/PaintSupreme.175x175-75.png","title":"PaintSupreme v1.50 – Create, edit and polish images","content":"PaintSupreme allows you to create, edit and polish images in a fun way. An easy-to-use and fun user interface paired with professional-quality tools makes PaintSupreme a hard to beat package for the price. Features: Create, edit and polish images with an easy-to-use and fun user interface. Layer-based editing with an unlimited amount of layers. Lots […]"},{"link":"https://nmac.to/blog/tcpblock-v2-10/","image":"https://nmac.to/wp-content/uploads/2013/12/tcpblock.png","title":"TCPBlock 2.10 – Block outgoing connection for any application ( little snitch alternative )","content":"TCPBlock is a lightweight and fast application firewall for Mac OS X 10.5 or later developed by delantis.com. The Mac OS X firewall protects you from connections that come from outside of your computer. But what about the software from your computer that opens new connections to the internet? With TCPBlock you can prevent selected […]"},{"link":"https://nmac.to/blog/menuweather-v4-2-4/","image":"https://nmac.to/wp-content/uploads/2013/12/MenuWeather.175x175-75.png","title":"MenuWeather v4.2.4 – Find out the weather at your current location","content":"MenuWeather is a simple, yet powerful, menu bar weather client. – Super-accurate weather data from CustomWeather.com – Automatically determines your location – Quick access to any number of days or hours of weather right in your menu bar – 15 day forecast – 2 day hourly forecast – Radar maps – Severe weather alerts (U.S. […]"},{"link":"https://nmac.to/blog/autopano-giga-v3-0-2/","image":"https://nmac.to/wp-content/uploads/2013/12/40123.png","title":"Autopano Giga v3.0.2 – Stitch multiple images","content":"Autopano Giga allows you to stitch 2, 20, or 2,000 images. New interface: Autopano Giga 2.5 has a new look! Dark gray predominates, allowing you to enhance your images like never before. Changes have also been made in the user interface. Multi-platform, multi-lingual: Autopano Giga runs on Windows, Mac and Linux. It is available in […]"},{"link":"https://nmac.to/blog/vistaclock-v1-5-4/","image":"https://nmac.to/wp-content/uploads/2013/12/VistaClock.175x175-75.png","title":"VistaClock v1.5.4 – Useful clock for for your status bar and desktop","content":"VistaClock is a replacement for the Mac OSX build in menu bar clock. VistaClock not only gives you the time and optional week number icon display, but when you click on it, a dialog with calendar and analog clock opens up. Optionally you can add additional clocks with time zones.You can quickly see the date […]"},{"link":"https://nmac.to/blog/keycard-v1-0/","image":"https://nmac.to/wp-content/uploads/2013/12/Keycard.175x175-752.png","title":"Keycard v1.0 – Secure your Mac with an iOS device","content":"Keycard is undoubtedly the easiest way to keep your Mac secure when you’re not around. Using Bluetooth®, Keycard locks your Mac using your iOS device when it detects you are leaving your computer. When you come back, it unlocks it for you. Leaving your desk for 10 minutes? Grabbing a coffee in the library? Take your […]"},{"link":"https://nmac.to/blog/iconator-v1-3-2/","image":"https://nmac.to/wp-content/uploads/2013/12/Iconator.175x175-75.png","title":"Iconator v1.3.2 – Easy create icons for all platforms","content":"Ever wanted to create icons to your iOS app without going through the pain of manually resizing a big image? Ever wanted to create a new icon to your Mac app, but didn’t want to go through the hassle of converting it manually? This is the app for you. Iconator takes a single image, and […]"},{"link":"https://nmac.to/blog/allaboutfiles-v1-8/","image":"https://nmac.to/wp-content/uploads/2013/12/allaboutfiles.175x175-75.png","title":"AllAboutFiles v1.8 – Scan thousands of files per second on a modern Mac","content":"AllAboutFiles is a fast file counter and more. It’s able to scan thousands of files per second on a modern Mac. It lets you easily find out where large numbers of files exist, and where your disk space is being used. Point AllAboutFiles to a directory on you Mac and it will scan that directory […]"}]