[{"link":"https://nmac.to/blog/amnesia-the-dark-descent/","image":"https://nmac.to/wp-content/uploads/2015/03/Amnesia-The.Dark_.Descent.png","title":"Amnesia: The Dark Descent 1.3.1 – First-person survival horror","content":"Amnesia: The Dark Descent… A first person survival horror. A game about immersion, discovery and living through a nightmare. An experience that will chill you to the core.   Amnesia: The Dark Descent puts you in the shoes of Daniel as he wakes up in a desolate castle, barely remembering anything about his past. Exploring […]"},{"link":"https://nmac.to/blog/weather-live-1-7-1/","image":"https://nmac.to/wp-content/uploads/2014/06/Weather-Live.png","title":"Weather Live 1.7.1 – Beautiful weather for multiple locations around the world","content":"Meet Weather Live, the most beautiful weather app. Ever.   Don’t let bad weather take you by surprise! Whether it is cloudy, rainy, snowy, or even stormy outside, Weather Live will provide you with current weather conditions and forecast in your city and multiple locations all around the world. You won’t even have to look […]"},{"link":"https://nmac.to/blog/typed-1-1/","image":"https://nmac.to/wp-content/uploads/2015/01/Typed.png","title":"Typed 1.1 – Stunning word processing with markdown","content":"Typed is the stunning new writing app for the Mac, and the first that improves your focus so you can create great content. Typed makes writing for the web incredibly easy, and its Zen Mode features relaxing soundtracks that help you concentrate.   With stunning typography that makes it a breeze to write structured documents, […]"},{"link":"https://nmac.to/blog/tickets-2-5/","image":"https://nmac.to/wp-content/uploads/2015/03/33301.png","title":"Tickets 2.5 – Create FogBugz tickets","content":"Tickets is the fastest way to manage FogBugz tickets. Tickets features screen shot capture and other file attachments. Tickets 2 supports drag-and-drop case management, integrated email, and SpotLight/QuickLook integration.   Version 2.5: NEW: Drag files to the Dock icon to create new case with attachments. IMPROVED: Updated artwork with full retina support! IMPROVED: Deleted projects/milestones […]"},{"link":"https://nmac.to/blog/the-incredible-adv-van-helsing/","image":"https://nmac.to/wp-content/uploads/2015/03/The-Incredible-Adventures-of-Van-Helsing.png","title":"The Incredible Adventures of Van Helsing 1.0 – RPG, Action & Adventure game","content":"    Put on your wide-brimmed hat, grab your weapons and embark on an incredible adventure in the gothic-noir world of Borgovia, where mad science threatens the fragile peace between monster and mortal. Be Van Helsing, monster-hunter extraordinaire and save the day with your charming and beautiful companion, Lady Katarina (who happens to be a […]"},{"link":"https://nmac.to/blog/t-raider/","image":"https://nmac.to/wp-content/uploads/2015/03/Tomb.Raider.png","title":"Tomb Raider 1.0 – Intense, classic action game","content":"When a young Lara Croft is shipwrecked on an uncharted island, she enters a fight for survival armed with nothing but her instincts. Help Lara perfect her natural gifts as she embarks on a perilous journey to save her friends and escape the island’s murderous inhabitants.   Scavenge vital resources, upgrade Lara’s gear and improve […]"},{"link":"https://nmac.to/blog/tomb-raider-underworld/","image":"https://nmac.to/wp-content/uploads/2015/03/Tomb.Raider.Underworld.png","title":"Tomb Raider Underworld 1.0 – Action-adventure game starring archaeologist-adventurer","content":"In Tomb Raider: Underworld, explore everything. Stop at nothing.   Archaeologist-adventurer Lara Croft embarks on a daring expedition to find a sunken world deep beneath the Arctic Sea. From the crystalline waters of coastal Thailand to the rain-lashed jungles of Mexico and beyond, Lara won’t stop until she has opened its secret gates.   Her […]"},{"link":"https://nmac.to/blog/reformator-1-1-0/","image":"https://nmac.to/wp-content/uploads/2014/09/Reformator.png","title":"Reformator 1.1.0 – Multi-functional batch photo converter","content":"Reformator helps you convert a bulk of images into the most popular image formats, give your files meaningful names, watermark with text and image, adjust photos (brightness/saturation/exposure/grayscale/etc.), fit geometry (scale/crop/trim/etc.), remove private metadata, add your own copyrights, and much more. Also, Reformator is a great tool to browse your photos with an up-to-date photo Browser, […]"},{"link":"https://nmac.to/blog/instastack-1-7/","image":"https://nmac.to/wp-content/uploads/2015/03/Instastack.png","title":"Instastack 1.7 – Instagram Mac desktop client","content":"Instastack is the most elegant way to browse Instagram on the Mac.   MenuBar Panel InstaStack is a new tool to help you to discover Instagram social media network. if you want to connect your instagram account from menubar on your mac , InstaStack is your tool.   Browse Photo Feeds Browse your Instagram feed, […]"},{"link":"https://nmac.to/blog/hopper-disassembler-3-7-9/","image":"https://nmac.to/wp-content/uploads/2014/02/Hopper.Disassembler.png","title":"Hopper Disassembler 3.7.9 – Binary disassembler, decompiler, and debugger","content":"Hopper Disassembler is a binary disassembler, decompiler, and debugger for 32-bit and 64-bit executables.    This tool will let you disassemble any binary you want, and provide you all the information about its content, like imported symbols, or the control flow graph! Hopper can retrieve procedural information about the disassembled code like the stack variables, […]"}]