[{"link":"https://nmac.to/blog/ifoto-converter-2-6/","image":"https://nmac.to/wp-content/uploads/2016/10/iFoto-Converter.png","title":"iFoto Converter 2.6 – Batch Conversion","content":"iFoto Converter is the ultimate photo converter for most of the formats.   The excellent batch conversion can transform one image or an entire folder of mixed format images to single file format. The advanced algorithm let you instant preview watermarks and captions added to all the photos. What’s more, when you convert RAW to […]"},{"link":"https://nmac.to/blog/responsive-photo-grid-2-60-1/","image":"https://nmac.to/wp-content/uploads/2016/10/Responsive-Photo-Grid.png","title":"Responsive Photo Grid 2.60.1 – Web photo-gallery maker","content":"Responsive Photo Grid is a web-gallery designer. It helps you create amazing lightbox photo galleries. This app is designed for both everyday users and advanced web designers.   Key Features efficiently searches input folder for photo files integrated with the Bootstrap frame to create mobile friendly responsive photo galleries divides large galleries into multiple page […]"},{"link":"https://nmac.to/blog/dr-os-disk-cleaner-3-9/","image":"https://nmac.to/wp-content/uploads/2017/02/Dr.Duplicate-Cleaner.png","title":"Dr.OS Disk Cleaner 3.9 – Clean your hard drive","content":"Clean, optimize, and maintain your Mac. Just two click to scan your system and removes gigabytes of junk.   Main Feature Disk Clean (In App Purchase) Fast scan-engine and advanced junk detection technology safely cleans unnecessary junk files, caches and logs, etc that gorge over your hard drive space and rage your Mac seed down […]"},{"link":"https://nmac.to/blog/ssh-copy-17-03-1/","image":"https://nmac.to/wp-content/uploads/2017/01/SSH-Copy.png","title":"SSH Copy 17.03.1 – Secure File Transfer Client App","content":"SSH Copy is an intuitive SFTP (Secure File Transfer Protocol) client lets you manage remote files as in Finder.   Notable Features: Uploading / downloading your remote files or folders by drag and drop Holds multiple SFTP sessions for different servers Switch between SFTP sessions using swipe gestures with Trackpad or Magic Mouse Automatically reconnect […]"},{"link":"https://nmac.to/blog/ifoto-stitcher-2-17-1060/","image":"https://nmac.to/wp-content/uploads/2016/10/iFoto-Stitcher.png","title":"iFoto Stitcher 2.17.1060 – Make Panorama Photo with Ease","content":"Make stunning panoramas with high-resolution images taken by camera, scanner or smartphone, the automatic panorama maker for Mac should be the initial choice.   Auto-Select by Group and auto-stitch make it easy to align images without manually messing around moving photos, automatic exposure leveling and lens shading correction, automatic cropping algorithm to create a stunning […]"},{"link":"https://nmac.to/blog/wmf-converter-pro-3-4-2/","image":"https://nmac.to/wp-content/uploads/2017/03/WMF-Converter-Pro.png","title":"WMF Converter Pro 3.4.2 – Work with WMF images on your Mac","content":"WMF Converter Pro allows users to work with WMF images on Macs easily. It lets you render and convert single or multiple WMF files, preview them, change colors in vector based WMF files, and save either all of them, or selected ones as Mac native images in one of 10 file formats, including vector formats […]"},{"link":"https://nmac.to/blog/surgeon-simulator/","image":"https://nmac.to/wp-content/uploads/2017/03/Surgeon.Simulator.AE_.png","title":"Surgeon Simulator Anniversary Edition 1.0.107 – Life-saving surgical on passive patients","content":"Surgeon Simulator is a darkly humorous over-the-top operation sim game where players become Nigel Burke, a would be surgeon taking life into his own shaky hands, performing life-saving surgical manoeuvres on passive patients.   The original prototype – developed in just 48 hours at the 2013 Global Game Jam in January – challenged players to complete […]"},{"link":"https://nmac.to/blog/formentry-2-4-4/","image":"https://nmac.to/wp-content/uploads/2017/03/FormEntry.png","title":"FormEntry 2.4.4 – Create native form-based apps for iOS devices","content":"FormEntry is the only development toolkit you need to build productive, great-looking applications for the iPad, iPhone, or iPod touch.   Not everyone has the patience to learn software development, however anyone can be an app developer with FormEntry. Designed from the ground up to be easy-to-use Mac software, FormEntry can turn anyone into an […]"},{"link":"https://nmac.to/blog/lara-croft-go-1-0/","image":"https://nmac.to/wp-content/uploads/2017/03/Lara.Croft_.GO_.png","title":"Lara Croft GO 1.0 – A turn based puzzle-adventure set in a long-forgotten world","content":"Lara Croft GO is a turn based puzzle-adventure set in a long-forgotten world. Explore the ruins of an ancient civilization, discover well-kept secrets and face deadly challenges as you uncover the myth of the Queen of Venom.   Following the award-winning Hitman GO, Square Enix Montréal brings yet another beloved franchise to consoles with this […]"},{"link":"https://nmac.to/blog/emoji-2-1-1/","image":"https://nmac.to/wp-content/uploads/2017/03/Emoji.png","title":"Emoji 2.1.1 – Fast and fun way to share emoji icons","content":"Have you ever seen people using funny Emoji images in short text messages, emails, Facebook, Twitter and other iPhone/iPad applications? Yes! Millions of people are already using them on they iOS devices!   Now you too can express yourself in creative and fun ways with Emoji on your Mac!   Install this app and instantly […]"}]