[{"link":"https://nmac.to/blog/spellcaster-university/","image":"https://nmac.to/wp-content/uploads/2021/03/Spellcaster-University.png","title":"Spellcaster University 1.02a – Simulation & Strategy Game","content":"Spellcaster University is an early access game. It is regularly updated and we are listening to your feedback. Do not hesitate to share your opinions and suggestions with us!   In Spellcaster University, you take on the role of the director of a magic university in a colourful world of heroic fantasy. Build your school, […]"},{"link":"https://nmac.to/blog/the-sims-2/","image":"https://nmac.to/wp-content/uploads/2015/12/The-Sims-2.png","title":"The Sims 2: Super Collection 1.2.4 – The ground breaking classic returns to the Mac","content":"In The Sims™ 2: Super Collection, take your Sim from cradle to grave through life’s greatest moments. Create your own houses, neighborhoods, Sims, and even family dynasties—then watch it all come to life! You may choose to manage your Sims so they experience the rewards of a life well lived. Of course, you may also […]"},{"link":"https://nmac.to/blog/zombie-rollerz-pinball-heroes/","image":"https://nmac.to/wp-content/uploads/2021/12/Zombie-Rollerz.png","title":"Zombie Rollerz Pinball Heroes 1.4.1 – Pinball Meets Tower Defense","content":"Slam giant, super powered pinballs into waves of adorkable zombies – it’s a new hot-take on Classic Pinball fused with Tower Defense! Grab your copy today to see for yourself the hot new game that is making a name for itself on Apple Arcade!   KEY FEATURES Fight adorkable zombies in a cartoon world A […]"},{"link":"https://nmac.to/blog/workspaces/","image":"https://nmac.to/wp-content/uploads/2020/07/Workspaces_2.png","title":"Workspaces 2.0.3 – Organize your work [FIX]","content":"Workspaces is an app that remembers your project resources, so you can quickly open them. Just drop files, folders, websites, applications and important e-mails into the application, then select the ones you wish to automatically launch. You can then run all the selected items at once by clicking the START button, instantly recreating your working […]"},{"link":"https://nmac.to/blog/dslr-assistant/","image":"https://nmac.to/wp-content/uploads/2020/08/DSLR-Assistant.png","title":"DSLR Assistant 3.9.0 – Tethered shooting for Canon","content":"Operate a Canon camera tethered to a Mac, efficiently capture digital images, automatically perform various photo tasks and maintain the high quality of images throughout your workflow.   WHY SHOOT TETHERED? Save Time. Perform you photo tasks faster, better and more easily. Reduce the amount of post processing workflow. Enhance Image Quality. Make sure that […]"},{"link":"https://nmac.to/blog/metadata/","image":"https://nmac.to/wp-content/uploads/2021/12/Metadata.png","title":"Metadata 1.7 – Learn more about your photos","content":"Metadata is an image metadata viewer for creative professionals on the go.   Simply choose an image from your photo library and view the image metadata in a beautiful card based layout. Wether you shoot on your phone, DSLR or create images in your favourite photo editing application, Metadata will show you your image measurements, […]"},{"link":"https://nmac.to/blog/blocks/","image":"https://nmac.to/wp-content/uploads/2016/06/Blocks.png","title":"Blocks 3.6.0 – RapidWeaver plug-in; divide Web content into blocks","content":"Blocks is a plugin for RapidWeaver. It allows you to place blocks of text, graphics, and even raw HTML onto your page wherever you like. Drag blocks around, resize them, and even overlap content. All in a plugin that is as easy to use as RapidWeaver itself.   Blocks 3.0 brings great ways to reuse […]"},{"link":"https://nmac.to/blog/onesafe/","image":"https://nmac.to/wp-content/uploads/2015/11/oneSafe2.png","title":"oneSafe 2.4.0 – Password management and synchronization","content":"oneSafe not only securely stores all your passwords and other confidential information, it also synchronizes all that data between your Mac, iPhone, and iPad so you can have it at your fingertips wherever you happen to find yourself!   oneSafe is a super-secure password-management app that lets you store all your confidential information, including secret […]"},{"link":"https://nmac.to/blog/codijy-recoloring/","image":"https://nmac.to/wp-content/uploads/2021/06/CODIJY-Recoloring.png","title":"CODIJY Recoloring 4.2.0 – Recolor B&W Photos with Ease","content":"Recolor your most-admired B&W photos with surprising ease. Draw smile strokes and contours to add, protect and remove photo colors! Master your skills with guides, tutorials, lessons and examples.   CODIJY enables 130 000 hobbyists and pros to professionally recolor: Family portraits Iconic historical scenes & personalities Local history images Frames from the black and […]"},{"link":"https://nmac.to/blog/timemator/","image":"https://nmac.to/wp-content/uploads/2020/05/Timemator_2.png","title":"Timemator 2.8.5 – Automate your time-tracking based on your activities on the Mac","content":"Timemator lets you fully automate your time-tracking based on your activities on the Mac. Just tell Timemator what files, applications or websites you use for your work and it will start the timer for you. Automatically!   Features: Auto-tracking Traditional timer Flexible tasks structure Quick access from the menu bar Track billable hours and your […]"}]