[{"link":"https://nmac.to/blog/macdraft-pro-6-1-1/","image":"https://nmac.to/wp-content/uploads/2016/02/MacDraft.Pro_.png","title":"MacDraft Pro 6.1.1 – 2D design, drafting and illustration tool","content":"Microspot MacDraft Pro, designed for CAD users of all levels, offers a full complement of drawing tools as well as both ANSI and international standard dimensioning capabilities. Its multi-layered, scaled drawing environment supports both feet/inches and metric dimensions. In addition, Microspot MacDraft offers linked dimensioning to automatically update dimensions as you modify components.   Perfect […]"},{"link":"https://nmac.to/blog/squidoo-1-0-4/","image":"https://nmac.to/wp-content/uploads/2015/12/Squidoo.png","title":"Squidoo 1.0.4 – Control iTunes, Spotify, and Rdio from the menu bar","content":"Squidoo (was Music Control) is a simple and powerful app for finding and controlling music from your menu bar.   With Squidoo you can: Manage playback of popular music applications, including iTunes, Spotify and Rdio, all from your Mac menu bar Broadcast and control music from any local network Mac Search for your favorite albums […]"},{"link":"https://nmac.to/blog/super-mov-converter-6-1-9/","image":"https://nmac.to/wp-content/uploads/2015/07/Super.MOV.Converter.png","title":"Super MOV Converter 6.1.9 – Convert any HD video and common video to MOV format","content":"Super MOV Converter lets you convert any HD video and common video to MOV format for playback on QuickTime, Apple TV, iPhone 6/6 plus/5S/5C/5/4S, iPad Air 2/ Air/mini 3/mini 2/mini/4, iPod with absolutely faultless performance. Converting AVCHD videos (M2TS, MTS), HD videos (TS, HD MP4, HD WMV, HD MPG, HD MPEG), and common videos like […]"},{"link":"https://nmac.to/blog/livenow-2-5/","image":"https://nmac.to/wp-content/uploads/2016/01/LiveNow.png","title":"LiveNow 2.5 – Watch Twitch streams without Flash","content":"LiveNow (was MenuTab for Twitch, then it was WatchNow) lets you track your favorite Twitch streams easily and watch live broadcasts without Flash.   Features Track your favorite Twitch streams Watch Twitch streams in source, high, medium, low quality without Flash No ads. Browse top games and channels Menu bar app for quick access   […]"},{"link":"https://nmac.to/blog/comments-1-1/","image":"https://nmac.to/wp-content/uploads/2016/01/Comments.png","title":"Comments 1.1 – The best way to glance at your WordPress blogs’ comments!","content":"Bored of getting your inbox filled with comments from your WordPress Blog? Want’s to see those comments in the Notification Center on your Mac? Wants to see how many unread (and total!) comments are on your blog at a glance? Comments.app is your new friend, it’ll let you know, and one click later, you’re approving, […]"},{"link":"https://nmac.to/blog/chocolat-3-2-1/","image":"https://nmac.to/wp-content/uploads/2014/12/Chocolat3.png","title":"Chocolat 3.2.1 – Native Cocoa text editor","content":"Chocolat is a new text editor that combines native Cocoa with powerful text editing tools.    Features: Split editing Code completion Live errors Folding Symbol list Blockedit Vim mode Jump to definition Project find Go to file Web preview Documentation   Version 3.2.1: Added Support for ES6 code completion and symbol list Updated Rust and […]"},{"link":"https://nmac.to/blog/appdelete-4-2-3/","image":"https://nmac.to/wp-content/uploads/2015/02/AppDelete.png","title":"AppDelete 4.2.3 – The speedy and efficient way to delete your unwanted apps","content":"AppDelete is an uninstaller for Macs that will remove not only applications but also widgets, preference panes, plugins, and screensavers along with their associated files. Without AppDelete these associated items will be left behind to take up space and potentially cause issues.   There are several ways to activate AppDelete: Drag items onto main window […]"},{"link":"https://nmac.to/blog/desk-nt-1-2/","image":"https://nmac.to/wp-content/uploads/2015/11/DeskNT.png","title":"Desk NT 1.2 – A Writing and Notetaking App","content":"Desk NT is a writing and notetaking app for anyone who needs to capture their thoughts in a simple and elegant way.   Based on the award-winning “Best App of 2014” (Desk PM), it was created for those that didn’t need blog publishing features but instead wanted to focus on their ability to create and […]"},{"link":"https://nmac.to/blog/construction-simulator-2015-1-02/","image":"https://nmac.to/wp-content/uploads/2016/01/Construction.Simulator.2015.png","title":"Construction Simulator 2015 1.02 – Complete construction site challenge game","content":"In Construction Simulator 2015, you take the controls of 19 realistic construction machines made by LIEBHERR, STILL and MAN with high-quality 3D graphics. Excavate the foundation of a house with realistic machines, pour concrete into the wall panels of a factory with an enormous concrete pump, or test the steadiness of your hands by placing […]"},{"link":"https://nmac.to/blog/coast-guard-1-0/","image":"https://nmac.to/wp-content/uploads/2016/01/Coast-Guard.png","title":"COAST GUARD 1.0 – Simulation of coast guard officer life","content":"Experience the extraordinary life of coast guard officer Finn Asdair in COAST GUARD. Life at sea is fraught with adversity and danger.   Take on responsibility under the motto “Honor – Respect – Duty” and pursue dangerous criminals on the wide open sea. Recover decisive evidence, rescue people from burning and sinking ships, interrogate nefarious […]"}]