[{"link":"https://nmac.to/blog/macupdater/","image":"https://nmac.to/wp-content/uploads/2018/05/MacUpdater.png","title":"MacUpdater 1.3.5 – Keep all your apps up-to-date effortlessly","content":"MacUpdater can automatically track the latest updates of all applications installed on your Mac. Launch MacUpdater to see at a glance which of your apps are out-of-date. And with a simple click you can update any outdated app. Don’t waste any more time manually searching for updates, downloading, installing and cleaning up. Let MacUpdater take […]"},{"link":"https://nmac.to/blog/lightcapture/","image":"https://nmac.to/wp-content/uploads/2017/10/LightCapture.png","title":"LightCapture 1.0.7 – Streamlined way to take screenshots","content":"LightCapture is a streamlined way to take screenshots.   Features Take screenshots with one click – With LightCapture, taking a screenshot has never been easier – they’re only a click away. Copy screenshots to your clipboard – Take screenshots and immediately copy them to your clipboard – all without saving them to a folder. Say […]"},{"link":"https://nmac.to/blog/chronoburn/","image":"https://nmac.to/wp-content/uploads/2017/09/ChronoBurn.png","title":"ChronoBurn 2.4.6 – Calorie Counter App","content":"ChronoBurn is a new way for you to control your calorie intake.   It displays your calorie usage in real time, and at a glance ChronoBurn will show you how much to eat every day.   ChronoBurn is very easy to understand – It works like a calorie chronometer. Calories from food will be added […]"},{"link":"https://nmac.to/blog/this-is-the-police-2/","image":"https://nmac.to/wp-content/uploads/2018/10/This-Is-the-Police-2.png","title":"This Is the Police 2 1.0.6 – Singleplayer Strategy & Adventure Game","content":"Interpret the law as you see fit in This Is the Police 2, sequel to the acclaimed noir drama This Is the Police! Run the sheriff’s department, manage your cops, investigate, interrogate, and incarcerate. Make tough decisions – and try to keep out of prison yourself! – in this story-driven mixture of adventure, strategy, and […]"},{"link":"https://nmac.to/blog/chatmate-for-facebook/","image":"https://nmac.to/wp-content/uploads/2017/10/ChatMate-for-Facebook.png","title":"ChatMate for Facebook 4.3.1 – Powerful client for Facebook Messenger","content":"ChatMate for Facebook is a powerful client for Facebook Messenger. Unique features to be found only in ChatMate for Facebook: Send and receive text messages, voice messages, photos, videos, documents, and emojis Record videos and photos directly in app and share them with your friends Dark Mode: With a beautiful layout dominated by dark colors […]"},{"link":"https://nmac.to/blog/mysql-optimizer/","image":"https://nmac.to/wp-content/uploads/2016/10/MySQL-and-MariaDB-Optimizer.png","title":"MySQL Optimizer 1.9.1 – Database tuning","content":"MySQL Optimizer (was MySQL and MariaDB Optimizer) is an effective app that gives you recommendations for optimization of MySQL databases. The app provides a graphical interface to simplify the process of viewing performance metrics, apply changes based on our recommendations, and all MySQL slow-query logs, which are grouped by occurrence number.   Things to consider […]"},{"link":"https://nmac.to/blog/supertab/","image":"https://nmac.to/wp-content/uploads/2016/03/SuperTab3.png","title":"SuperTab 3.0.4 – Supercharges your Mac’s app switcher","content":"SuperTab allows you to fully customize the Mac’s built- in Command-Tab app switcher. Before SuperTab, the app switcher only gave you access to your currently active apps. With SuperTab installed, you now have access to a whole lot more when pressing Command-Tab, such as: Active apps Recent apps Recent documents Dock items Folder contents Application […]"},{"link":"https://nmac.to/blog/dmg-conversion/","image":"https://nmac.to/wp-content/uploads/2018/10/DMG-Conversion.png","title":"DMG Conversion 1.0 – Convert your DMG files to ISO","content":"Convert your DMG files to ISO and vice-versa with a few mouse clicks, easy as pie!!!   Just drag and drop one or more DMG or ISO files to the application, select the files you want to convert, select the conversion option and press “Convert it!!” button, you can also reorder the files before converting […]"},{"link":"https://nmac.to/blog/capturer/","image":"https://nmac.to/wp-content/uploads/2017/02/Capturer.png","title":"Capturer 1.0.5 – Automated screen captures","content":"Capturer is a simple menu-bar app which automatically takes screenshots of the screen or of the apps you choose. Taking screenshots is completely unnoticeable by the user.   You can set: what apps it captures or just take screenshot of the full screen how often – from 1 minute up to 1 hour the location […]"},{"link":"https://nmac.to/blog/igif-creator/","image":"https://nmac.to/wp-content/uploads/2016/07/iGif-Creator4.png","title":"iGif Creator 4.2.0 – Creator GIFs form Video, Photo, GIF on Mac OS X","content":"iGif Creator is one best GIF creator for Video, Photo, GIF on Mac OS X. You can create our GIF from your video clips, pictures and GIF with different text layer on each GIF frames.   Features: Convert video clips to GIF. Convert photos into GIF. Convert GIF to new GIF ( Edit GIF ). […]"}]