[{"link":"https://nmac.to/blog/g-dis/","image":"https://nmac.to/wp-content/uploads/2021/11/G-dis.png","title":"G-dis 6.8.12 – Gui client for Redis","content":"Redis Client Tool developed by pure swift language with most stability. Especial Feature: limited results returned with fast speed by scan.   Support most popular data types in Redis: String, Set, List, Hash, SortedSet. Support Base64 encoded binary key & Base64 encoded binary value. Support multi-languages charsets for connection. Support multi-languages charset switch for returned […]"},{"link":"https://nmac.to/blog/clicker-for-hulu/","image":"https://nmac.to/wp-content/uploads/2020/12/Clicker-for-Hulu.png","title":"Clicker for Hulu 1.6 – The best standalone Hulu player for Mac","content":"No more switching between browser tabs. Simply launch Clicker for Hulu straight from your dock and get your binge on.   Plus, with InstantStart technology, you will pick up right where you left off the last time you were watching. Hunting to find your show again is so early 2000s.   Features  Launch Hulu right […]"},{"link":"https://nmac.to/blog/clearview-x/","image":"https://nmac.to/wp-content/uploads/2021/12/Clearview-X.png","title":"Clearview X 3.0.4 – Easy-to-use ebook reader","content":"Easy-to-use ebook reader, equipped with library shelf, supports popular ebook formats as PDF, EPUB (DRM free), CHM, MOBI, FB2 and comic books(CBR, CBZ). You can make annotations, insert bookmarks, and do searching freely, and access your notes, bookmarks and book collections across multiple devices.   What’s special with Clearview reader?   Easy and intuitive books […]"},{"link":"https://nmac.to/blog/wifispoof/","image":"https://nmac.to/wp-content/uploads/2020/01/WiFiSpoof_3.png","title":"WiFiSpoof 3.8.4 – Change your WiFi MAC address","content":"WiFiSpoof is the ultimate system network tool giving a quick overview of the current state of your Mac’s network devices.   Quickly inspect your current network setup including: Easily see all available network interfaces Current MAC Address System hardware MAC Address Current Wi-Fi connection BSSID, SSID, Security, Channel, RSSI, Noise, Tx Rate and MCS Index […]"},{"link":"https://nmac.to/blog/magic-hider/","image":"https://nmac.to/wp-content/uploads/2016/10/Magic-Hider.png","title":"Magic Hider 1.4.3 – Easily hide any part of an image","content":"New level of hiding of any part of an image, this “smart” application will automatically find parts to hide.   Just choose what you need to filter – faces or text*, than drag and drop image and it will be done at once.   Also, you can add, remove and edit areas manually.   Features: […]"},{"link":"https://nmac.to/blog/desktop-lens-pro/","image":"https://nmac.to/wp-content/uploads/2022/01/Desktop-Lens-PRO.png","title":"Desktop Lens PRO 4.0.8 – Scalable desktop zoom app","content":"You need zoom? We got some! Desktop Lens PRO is a premium version of the application to work with small fonts and hi-res images.   Features: Scalable zoom; Smooting; Always on top; Change color theme; Show/hide; 3D-effect; Shadow.   Version 4.0.8: Preservation of smoothing state; Internal changes; Icon change. Apple Silicon support   Intel, 64-bit […]"},{"link":"https://nmac.to/blog/alpha-blender-pro/","image":"https://nmac.to/wp-content/uploads/2022/01/Alpha-Blender-PRO.png","title":"Alpha Blender PRO 1.1.1 – Cut shapes or background from images","content":"Fast and simple application to cut shapes or background from images.   You can use the resulting images for web design, collages, etc.   Features: You can tune intensity, hardness and size of brush Cut any shapes you need Save result to PNG Use zoom to work with details You can use hotkeys for more […]"},{"link":"https://nmac.to/blog/super-u-plan/","image":"https://nmac.to/wp-content/uploads/2021/11/Super-U-Plan.png","title":"Super U Plan 16.8.4 – Make your plan in Gantt chart","content":"A useful project progress management software, Support Merging, Support Exporting to Excel, Synchronized Releasing Windows 10 version, Ubuntu version and Mac OS version. Graphical display of your project progress; Real time display of your changes; Automatic calculate tasks duration and start time, end time, only need to input ‘Planning Days’ and ‘Prev Task No(s)’; Automatic […]"},{"link":"https://nmac.to/blog/air-calendar/","image":"https://nmac.to/wp-content/uploads/2022/01/Air-Calendar.png","title":"Air Calendar 1.7 – Menu Bar Calendar & Events","content":"Air Calendar is a menu bar application that integrates clock, calendar and events. It supports Google, Outlook and all calendar services that the macOS’s Calendar supports. It presents you a beautiful and clean calendar with your meetings, appointments, holidays and all agendas to you in the fastest and most convenient way.   Air Calendar is […]"},{"link":"https://nmac.to/blog/nimble-click/","image":"https://nmac.to/wp-content/uploads/2022/01/Nimble-Click.png","title":"Nimble Click 1.9 – Click up to 50 times a second","content":"If you have a disability that makes it difficult or impossible to click your mouse, Nimble Click can help. Nimble Click helps click your mouse for you at a set rate. You can even use a custom keyboard shortcut to click for you. You can choose between a variety of options to help customize your […]"}]