[{"link":"https://nmac.to/blog/control-center-2-0-2/","image":"https://nmac.to/wp-content/uploads/2014/07/Control.Center.png","title":"Control Center 2.0.2 – The ultimate mac OSX utility","content":"Control Center offers a wide range of easily accessible widgets for monitoring and controlling your Mac.   Control Center is an advanced system monitor, awesome music controller, minimalistic task manager, and much much more.   The current range of widgets include: iTunes/Spotify/Radium/Rdio controls CPU Monitor RAM Monitor Network Monitor Battery Monitor Display controls Startup disk […]"},{"link":"https://nmac.to/blog/megapack-for-iwork-2013-2-0/","image":"https://nmac.to/wp-content/uploads/2014/07/Megapack.for_.iWork_.png","title":"Megapack for iWork 2013 2.0 – Ultimate package templates for Pages Numbers Keynote","content":"Megapack for iWork 2013: Templates for Pages Numbers Keynote is the ultimate home and office package providing creative designs, themes, and templates for the latest edition of Pages, Numbers, and Keynote.   PAGES From simple letters and invites, to media-rich newsletters, brochures, and reports, Megapack for iWork 2013 will have you building full documents in […]"},{"link":"https://nmac.to/blog/itriumph-1-0-4/","image":"https://nmac.to/wp-content/uploads/2014/02/iTriumph.png","title":"iTriumph 1.0.4 – Your life organized: calendars, contacts, and journal.","content":"Life happens fast whether it’s personal or business. The best way to stay on top is focus. iTriumph is here to help. iTriumph integrates your calendar, contacts, and journal in a single application to provide you with clarity. Not only will iTriumph help you manage current obligations and relationships, it will help you reflect and […]"},{"link":"https://nmac.to/blog/fuel-for-powerpoint-1-0-2/","image":"https://nmac.to/wp-content/uploads/2014/07/Fuel.for_.PowerPoint.png","title":"Fuel for PowerPoint 1.0.2 – handmade themes for your perfect presentation","content":"Fuel for PowerPoint contains 31 theme with multiple layouts. Each theme has 32 layouts, so you will always find the perfect slide.   Presentation themes come in 2 sizes – Standard and Wide.   *Fuel for PowerPoint requires latest PowerPoint app.   Version 1.0.2: Template opening bug fix   OS X 10.7 or later, 64-bit […]"},{"link":"https://nmac.to/blog/textexpander-4-3-2/","image":"https://nmac.to/wp-content/uploads/2014/01/TextExpander.png","title":"TextExpander 4.3.2 – Expand custom keyboard shortcuts into frequently-used text and pictures","content":"TextExpander saves your fingers and your keyboard, expanding custom keyboard shortcuts into frequently-used text and pictures. Type more with less effort!   Here are a few examples for what you can do with TextExpander: Insert standard greetings, phrases, boilerplate paragraphs, and signatures – including formatted text and pictures. Correct typos automatically Organize snippets into groups […]"},{"link":"https://nmac.to/blog/motioncomposer-1-8/","image":"https://nmac.to/wp-content/uploads/2014/07/MotionComposer.png","title":"MotionComposer 1.8 – Create animated and interactive Web content","content":"With MotionComposer, create engaging Web content and run it anywhere!   Make it universal. MotionComposer empowers you to create engrossing animations and interactive content that will run on any platform, from your desktop to your tablet to your phone. Finally, you have the flexibility to deliver content to devices of all shapes and sizes — […]"},{"link":"https://nmac.to/blog/iscrapbox-1-3-0/","image":"https://nmac.to/wp-content/uploads/2014/07/iScrapBox.png","title":"iScrapBox 1.3.0 – Manage your digital art scrapbook","content":"iScrapBox makes managing your digital scrapbooking artwork easier than you ever thought possible. Use iScrapBox to quickly browse and search your collection of iScrapKit artwork for the perfect image. Then add the image to your scrapbook page with a single click. iScrapBox works with popular scrapbooking software like iScrapbook and with popular graphics-editing software like […]"},{"link":"https://nmac.to/blog/diskaid-6-7-4/","image":"https://nmac.to/wp-content/uploads/2014/01/DiskAid.png","title":"DiskAid 6.7.4 – Use your iOS device as an external disk and more","content":"DiskAid is the ultimate transfer tool for accessing the iPod, iPhone or iPad directly from the desktop. Access data such as: music, video, photos, contacts, notes, call history, text messages (SMS), voicemail, and voice memos. With DiskAid you can also transfer files and folders betwen your iPhone, iPad or iPod touch and your computer and […]"},{"link":"https://nmac.to/blog/card4call-1-2/","image":"https://nmac.to/wp-content/uploads/2014/05/Card4Call.png","title":"Card4Call 1.2 – Easily create your own business cards","content":"Card4Call is a simple application that lets you easily create your own business cards (size 8.5 x 5.5 cm).    Features: choose from 2360 icons and 140 textures; set the background (texture or color); insert an image, an icon and text; set the font, size and color of the text; apply the shadow; apply an […]"},{"link":"https://nmac.to/blog/sibelius-7-5-0/","image":"https://nmac.to/wp-content/uploads/2014/07/Sibelius.png","title":"Sibelius 7.5.0 – Music notation solution","content":"Sibelius is the world’s best-selling music notation software for Mac. It is as intuitive to use as a pen, yet so powerful that it does most things in less than the blink of an eye. The demo includes example scores and a demo user guide summarizing the main features of the program.   Version 7.5.0: […]"}]