[{"link":"https://nmac.to/blog/the-drone-racing-league-simulator/","image":"https://nmac.to/wp-content/uploads/2020/06/The.Drone_.Racing.League.Simulator.png","title":"The Drone Racing League Simulator 3.6 – 3D Drone Simulation & Racing Game","content":"Home to the fastest drones on the planet, the Drone Racing League is proud to offer players the most electrifying FPV drone racing experience ever: the DRL Simulator!   RACE KILLER TRACKS Race on supercharged tracks, designed by the pros, for the pros, and master the skills that could take you to the big leagues! […]"},{"link":"https://nmac.to/blog/itunes-converter/","image":"https://nmac.to/wp-content/uploads/2016/04/iTunes.Converter.png","title":"iTunes Converter 2.5.4 – Convert DRM protected music to unprotected formats","content":"iTunes Converter can easily convert DRM-protected music and various audio files to unprotected MP3, AAC formats playable on any iPod, iPod Touch, iPhone, Zune, PSP, Creative Zen, and other MP3 players at high speed and CD quality. Convert M4P to MP3, AA to MP3 or AAC in 5X-fast speed, with ID tags preserved. iTunes M4P-to-MP3 […]"},{"link":"https://nmac.to/blog/human-fall-flat/","image":"https://nmac.to/wp-content/uploads/2018/03/Human-Fall-Flat.png","title":"Human: Fall Flat 1074461 – Open-ended physics-based puzzle and exploration game","content":"Bob is just a normal human with no superpowers, but given the right tools he can do a lot. Misuse the tools and he can do even more!   The world of Human: Fall Flat features advanced physics and innovative controls that cater for a wide range of challenges. Bob’s dreams of falling are riddled […]"},{"link":"https://nmac.to/blog/total-war-shogun-2/","image":"https://nmac.to/wp-content/uploads/2019/01/Total.War_.SHOGUN.2.png","title":"Total War: SHOGUN 2 1.5 – Turn-Based Strategy & Historical Game","content":"In the darkest age of Japan, endless war leaves a country divided. It is the middle of the 16th Century in Feudal Japan. The country, once ruled by a unified government, is now split into many warring clans. Ten legendary warlords strive for supremacy as conspiracies and conflicts wither the empire. Only one will rise […]"},{"link":"https://nmac.to/blog/life-is-strange-2/","image":"https://nmac.to/wp-content/uploads/2020/06/Life-is-Strange-2.png","title":"Life is Strange 2 Include DLCs EP1-5 1.0.2 – One Journey. Many Paths","content":"The award-winning Life is Strange series continues with an all-new story from DONTNOD Entertainment.   After a tragic incident, brothers Sean and Daniel Diaz run away from home. Fearing the police, and dealing with Daniel’s newly manifested telekinetic power – the power to move objects with your mind – the boys decide to travel to […]"},{"link":"https://nmac.to/blog/omni-remover/","image":"https://nmac.to/wp-content/uploads/2019/11/Omni-Remover.png","title":"Omni Remover 3.3.8 – App uninstaller","content":"Omni Remover is all-in-one package to keep your Mac in fit. It can clean uninstall malicious and stubborn apps, purge 32-bit, orphaned apps leftover and put on-demand storage optimization on macOS Catalina.   Features: Mac Clean – the new Omni Remover comes to offer a wealth of Mac cleaning tools that were beautifully designed to […]"},{"link":"https://nmac.to/blog/antivirus-one/","image":"https://nmac.to/wp-content/uploads/2019/12/Antivirus-One.png","title":"Antivirus One 3.4.4 – Virus Cleaner","content":"Keep your digital wallets and keychains safe with Antivirus One, your personal cyber security expert.   Antivirus One offers live antivirus monitoring to protect your Mac from adware, ransomware, spyware and all kinds of malware attacks.   Download now and say goodbye to pop-up scams, spyware and viruses!   Developed exclusively by the world’s largest […]"},{"link":"https://nmac.to/blog/conduct-deluxe/","image":"https://nmac.to/wp-content/uploads/2020/06/Conduct-Deluxe.png","title":"Conduct Deluxe 1.1.3 – The Definitive Railroad Action","content":"Conduct DELUXE! is an addictive game of explosive railway action that will challenge your inner conductor. Set in a stunning world, with incredibly simple controls you race against time to bring passengers safely to their destination by commanding trains, switching tracks and avoiding collisions in increasingly challenging action-puzzles.   As you progress through demanding levels […]"},{"link":"https://nmac.to/blog/table-edit/","image":"https://nmac.to/wp-content/uploads/2017/03/TableEdit.png","title":"TableEdit 1.4.6 – Simple, clean, and elegant spreadsheet editor","content":"TableEdit is a simple, clean, and elegant spreadsheet application designed specifically for OS X. TableEdit features a minimalistic yet intuitive interface and has convenient features like functions and seamless CSV import/export as well as exhaustive cell styling options.   Note: This application contains in-app and/or external module purchases.   Version 1.4.6: Fixed problem with Excel […]"},{"link":"https://nmac.to/blog/poly-bridge-2/","image":"https://nmac.to/wp-content/uploads/2020/06/Poly-Bridge-2.png","title":"Poly Bridge 2 1.01 – Bridge Building, Crafting & Simulation Game","content":"The acclaimed bridge-building simulator is back and better than ever!   New levels, new mechanics, a custom physics engine, workshop campaigns, and much more! Rediscover your engineering creativity with even more hours of puzzling fun!   New Soundtrack Adrian Talens returns with a new full-length Soundtrack! Relax to the soothing and critically acclaimed music with […]"}]