[{"link":"https://nmac.to/blog/textexpander-5-1-2/","image":"https://nmac.to/wp-content/uploads/2014/01/TextExpander.png","title":"TextExpander 5.1.2 – Expand custom keyboard shortcuts into frequently-used text and pictures","content":"TextExpander saves your fingers and your keyboard, expanding custom keyboard shortcuts into frequently-used text and pictures. Type more with less effort!   Here are a few examples for what you can do with TextExpander: Insert standard greetings, phrases, boilerplate paragraphs, and signatures – including formatted text and pictures. Correct typos automatically Organize snippets into groups […]"},{"link":"https://nmac.to/blog/graphic-3-0/","image":"https://nmac.to/wp-content/uploads/2015/10/Graphic.png","title":"Graphic 3.0 – Powerful vector drawing and illustration tool","content":"Graphic (was iDraw) has all of the tools you need to create everything from detailed technical illustrations to beautiful works of art. Create intricate designs quickly and easily, and continue working on the go with Graphic for the iPad.   Create resolution-independent illustrations that can be pasted into Pages documents, included in Keynote presentations, or […]"},{"link":"https://nmac.to/blog/better-window-manager-1-13/","image":"https://nmac.to/wp-content/uploads/2015/05/Better-Window-Manager.png","title":"Better Window Manager 1.13 – Move and position your windows where you want","content":"Better Window Manager is a utility for power users who like having application windows in specific locations and sizes. It allows you to save a window state (position and size), and apply that window state to a window with a keyboard shortcut of your choice.   Version 1.13: Added support for using the same window-state […]"},{"link":"https://nmac.to/blog/virusbarrier-x6-10-6-24/","image":"https://nmac.to/wp-content/uploads/2015/10/VirusBarrierX6.png","title":"VirusBarrier X6 10.6.24 – Robust anti-virus software","content":"Intego VirusBarrier X6 provides realtime signature-based and behavior-based scanning for Mac malware and on-demand scanning for Windows-based malware. This not only keeps your Mac computer virus-free, it also guards against your inadvertently passing malware on to your Windows friends. VirusBarrier X6 includes:   Antivirus  realtime scheduled archives advanced quarantine management   Firewall  two-wayfirewall trojan protection […]"},{"link":"https://nmac.to/blog/command-conquer-generals-deluxe-edition/","image":"https://nmac.to/wp-content/uploads/2014/02/Generals.png","title":"Command & Conquer : Generals Deluxe Edition 1.1.0 – Most Wanted strategy game","content":"The genre defining Command & Conquer: Generals Deluxe Edition returns to the Mac!   In a time of modern war, recent military aggressions around the globe have many nations worried. Between the United States, China, and the Global Liberation Army, tensions run high. Their leaders profess no interest in escalating the situation, but words ring […]"},{"link":"https://nmac.to/blog/doom-3-1-3-1/","image":"https://nmac.to/wp-content/uploads/2015/10/Doom.3.png","title":"Doom 3 1.3.1 – First-person shooter action game","content":"Doom 3… The ruins of an ancient Martian civilization have unlocked the secrets to teleportation, and the UAC will stop at nothing to harness this world-altering technology. As part of a marine detachment sent to protect the facility, your duty seemed simple enough – until the invasion. Now, in an epic clash against pure evil […]"},{"link":"https://nmac.to/blog/strokes-maker-2-0/","image":"https://nmac.to/wp-content/uploads/2015/10/StrokesMaker.png","title":"Strokes Maker 2.0 – Convert raster images into vector image","content":"Strokes Maker is a unique software product intended for creation of vector engravings and artistic vectorization of raster images.   The software uses original algorithms for calculation of vector strokes based on initial raster images. It renders halftones and image relief. Thousands of strokes interrupt and intersect under different angles, turn from continuous to dotted […]"},{"link":"https://nmac.to/blog/mailsteward-11-0/","image":"https://nmac.to/wp-content/uploads/2015/10/MailSteward.Pro_.png","title":"MailSteward 11.0 – Archive your email text in databases","content":"MailSteward will archive all of your email in a database for easy retrieval. Click on the Store Email button and MailSteward will go to work storing copies of all your email text, HTML, attachments, and raw source, into a relational database file. MailSteward has a wealth of features for importing, tagging, saving, and exporting, including […]"},{"link":"https://nmac.to/blog/intensify-1-1-1/","image":"https://nmac.to/wp-content/uploads/2014/05/Intensify.png","title":"Intensify 1.1.1 – Create clarity and intensity in your photos","content":"Intensify lets discerning photographers of all skill levels create powerful photographic images with unprecedented drama and detail. Precise control of contrast, structure, detail and sharpening across different tonal ranges delivers high quality results every time.   Special algorithms to prevent image artifacts, image layer stacking with opacity control, dozens of professionally created presets, adjustment brushes, RAW […]"},{"link":"https://nmac.to/blog/messenger-0-1-4/","image":"https://nmac.to/wp-content/uploads/2015/10/Messenger.png","title":"Messenger 0.1.4 – A native Mac app wrapper for Facebook’s Messenger","content":"Messenger is A Mac app wrapper around Facebook’s Messenger client, Web Messenger   Version 0.1.4: Fixes a bug where right-clicking on certain elements (like messages) would not show the custom context menu provided by messenger.com, but instead a standard context menu. To show the standard menu, which includes an option to inspect an element, simply hold down the […]"}]