[{"link":"https://nmac.to/blog/bomber-crew/","image":"https://nmac.to/wp-content/uploads/2019/07/Bomber-Crew.png","title":"Bomber Crew 6092 – A strategic simulation game","content":"Prepare your crew for their most dangerous mission yet and go chocks away for a sky-bound expedition in this strategic survival sim, Bomber Crew.   Choose your Crew! Train and personalise your own Bomber Crew. Procedurally-generated names, skills and back stories means a unique experience for everyone, but be careful, as death is permanent.   […]"},{"link":"https://nmac.to/blog/printworks/","image":"https://nmac.to/wp-content/uploads/2017/08/Printworks2.png","title":"Printworks 2.0.8 – All-purpose desktop publishing","content":"Printworks is a super intuitive, all-purpose page layout and desktop publishing app. It doesn’t matter what kind of document you need to layout and print. From brochures and calendars to CD labels and beautiful, professional business cards, Printworks covers it all. Just choose and customize a template or design a document from scratch! Printworks handles […]"},{"link":"https://nmac.to/blog/dictionaries/","image":"https://nmac.to/wp-content/uploads/2017/10/Dictionaries.png","title":"Dictionaries 1.3.3 – Translation and spelling dictionaries","content":"Dictionaries overcomes the Mac’s support for only a few languages, installing language support and deeply integrating it into macOS. The dictionaries work exactly like Apple’s own and are available everywhere: in all your apps, in Look Up, and in Spotlight. Everywhere you type text.   That’s the best part about it: you don’t have to […]"},{"link":"https://nmac.to/blog/discobrick-pro/","image":"https://nmac.to/wp-content/uploads/2013/01/DiscoBrickPRO.png","title":"DiscoBrick PRO 2.16 – Concert-quality visualization tool","content":"DiscoBrick is a concert-quality, highly optimized visualization tool that has the raw rendering power you need to pump out pixels to high-resolution screen during parties, concerts or at home!   Features: Blazingly fast OpenGl-based on 2D and 3D rendering with maps The App works with music and voice or rumors Interactive cameras, Webcams and, of […]"},{"link":"https://nmac.to/blog/windowmizer/","image":"https://nmac.to/wp-content/uploads/2016/11/WindowMizer5.png","title":"WindowMizer 5.0.6 – Roll-up windows like a windowshade","content":"WindowMizer is an application that will “roll-up” a window like a windowshade.   When you double-click the title bar of a window, WindowMizer minimizes the window to the Dock and leaves a placeholder title bar on the screen. When you want to get back to what you were doing, simply double-click the placeholder title bar […]"},{"link":"https://nmac.to/blog/batchphoto/","image":"https://nmac.to/wp-content/uploads/2015/12/BatchPhoto.png","title":"BatchPhoto 4.4 – Manipulate groups of images at the same time","content":"BatchPhoto is a powerful all-in-one photo manipulation program for Mac and PC that lets photographers, Web designers, business people, and families enhance photos quickly and efficiently.   Do you have hundreds of photos on your Mac waiting to be sorted out and edited? With BatchPhoto Pro, it doesn’t matter if you have just a few […]"},{"link":"https://nmac.to/blog/chook-sosig-walk-the-plank/","image":"https://nmac.to/wp-content/uploads/2019/06/Chook.And_.Sosig_.Walk_.The_.Plank_.png","title":"Chook & Sosig: Walk the Plank 1.95 – Point & Click Adventure Game","content":"Chook & Sosig: Walk the Plank is a mischievous, charming and character-driven adventure.   Along with a few friends, Chook & Sosig get creative while roleplaying as pirates. When you need to hunt for fabled treasure, you need some weird pals to join your quest! Join a ghostly chicken and a wobbly spaghetti cat as […]"},{"link":"https://nmac.to/blog/smartmemorycleaner/","image":"https://nmac.to/wp-content/uploads/2019/05/SmartMemoryCleaner.png","title":"SmartMemoryCleaner 2.3.0 – Automatic Memory Cleaner","content":"SmartMemoryCleaner – it’s not just a simple app for cleaning memory on your Mac. This is a smart tool that totally automates this process!   Features: Functionality Informational content Flexible configuration   Advantages: Ability to perform automatic cleaning based on tracking the application states More information about the state of system and virtual memory Optimal […]"},{"link":"https://nmac.to/blog/jutoh/","image":"https://nmac.to/wp-content/uploads/2016/10/Jutoh.png","title":"Jutoh 2.90 – Create e-books in formats for sale on Kindle and iBooks","content":"Jutoh makes it easy to create ebooks in popular formats that you can sell on many ebook sites, including Amazon’s Kindle and Apple’s iBooks.   Create your project in seconds from existing files using the New Project Wizard; or create your book from scratch using the built-in styled text editor.   Select a book cover […]"},{"link":"https://nmac.to/blog/boxshot/","image":"https://nmac.to/wp-content/uploads/2018/08/Boxshot5.png","title":"Boxshot 5.0.8 – Realistic 3D mockups made easy","content":"Boxshot features a large selection of customizable shapes: software boxes, books, CD, DVD, and Blu-ray boxes, cards, cans, mugs, bags, and much more. Almost all the shapes are customizable so you can adjust them for your design.   If you need more shapes, simply load them! Boxshot supports loading of FBX, 3DS, and Collada (DAE) […]"}]