[{"link":"https://nmac.to/blog/voice-candy-1-1-4/","image":"https://nmac.to/wp-content/uploads/2016/03/Voice-candy.png","title":"Voice Candy 1.1.4 – Recorder with 8 different effects","content":"Voice Candy is a fun and useful recorder for the Mac. It does for the microphone what Apple’s Photo Booth does for the webcam. Voice Candy makes recording enjoyable by providing eight different effects, such as Vader and Chipmunk, to alter the speaker’s voice. Once you have made the recording, you can use it to […]"},{"link":"https://nmac.to/blog/textexpander-5-1-4/","image":"https://nmac.to/wp-content/uploads/2014/01/TextExpander.png","title":"TextExpander 5.1.4 – Expand custom keyboard shortcuts into freq-used text and pictures","content":"TextExpander saves your fingers and your keyboard, expanding custom keyboard shortcuts into frequently-used text and pictures. Type more with less effort!   Here are a few examples for what you can do with TextExpander: Insert standard greetings, phrases, boilerplate paragraphs, and signatures – including formatted text and pictures. Correct typos automatically Organize snippets into groups […]"},{"link":"https://nmac.to/blog/sentenza-desktop-1-2/","image":"https://nmac.to/wp-content/uploads/2016/03/Sentenza-Desktop.png","title":"Sentenza Desktop 1.2 – Develop native OS X applications using modern web languages","content":"With Sentenza Desktop, build Mac OS X applications with HTML5, CSS3 and JavaScript. Use the APIs library to add advanced features to your project. You will be able to build standalone web applications for Mac OS X (from Snow Leopard to Mountain Lion) and deploy them on the Mac App Store or sell them in […]"},{"link":"https://nmac.to/blog/roadmap-planner-1-5/","image":"https://nmac.to/wp-content/uploads/2016/03/Roadmap-Planner.png","title":"Roadmap Planner 1.5 – Technology for planning business and life","content":"Roadmap Planner is your strategic communication tool to build your marketing, business development and product vision roadmap, and show off it to your team and stakeholders at a glance. It will take you where you want to be in one, five, or 10 years.   In our busy environment, every minute counts. You can continue […]"},{"link":"https://nmac.to/blog/feist/","image":"https://nmac.to/wp-content/uploads/2016/03/Feist.png","title":"FEIST 1.1.2 – Survival game full of stunning visuals, dynamic creatures, and a haunting","content":"A desperate, savage survival experience full of stunning visuals, dynamic creatures, and a haunting soundtrack. Follow strange beasts through lonely forests, hazardous mountains, dark caves, and glowing swamps. Watch out for dangerous creatures that react to your movements and decisions, and cleverly concealed traps that will test your ability to survive. Over six years in […]"},{"link":"https://nmac.to/blog/travel-journal-1-2-4/","image":"https://nmac.to/wp-content/uploads/2015/08/Travel.Journal.png","title":"Travel Journal 1.2.4 – Keep your memories alive using a Travel Journal","content":"Travel Journal is well organized and structured. The user interface is simple to use and the added features make this modern day journal work of art. You will be proud of your Travel Journal and the simplicity of making entries will ensure that you document all your adventures every day. Traveling is also about sharing […]"},{"link":"https://nmac.to/blog/thumbtack-2-2-1/","image":"https://nmac.to/wp-content/uploads/2015/08/Thumbtack2.png","title":"Thumbtack 2.2.1 – Easy access to your Pinboard bookmarks","content":"Thumbtack is a menu-bar utility that provides quick and easy access to the most recently saved bookmarks in your Pinboard account. It was developed around one core feature, allowing it be polished, reliable, and extremely efficient.   You don’t have to be a Pinboard power-user to enjoy the benefits of having a Pinboard account. The […]"},{"link":"https://nmac.to/blog/object2vr-3-1-0/","image":"https://nmac.to/wp-content/uploads/2016/03/Object2VR.png","title":"Object2VR 3.1.0 – Create HTML5, Flash, or QTVR object movies","content":"Object2VR can build your object movie from start to finish. Use it to control the turntable and to load the image right into the Light Table from the camera. Then, use the image-processing tools to make the image perfect, and finally output the object movie for playback on websites, devices, and kiosks.   Version 3.1.0: […]"},{"link":"https://nmac.to/blog/epublr-1-2-1/","image":"https://nmac.to/wp-content/uploads/2016/03/ePublr.png","title":"ePublr 1.2.1 – Convert PDF, FB2, DOC, and TXT books or documents to epub files","content":"ePublr converts all your books or documents into epubs for comfortable reading. It is extremely easy to use. It not only creates copies of your books in a different format, but also optimizes layout, text, and images. All converted books can be easily opened with iBooks for syncing and reading. And for convenience, ePublr contains […]"},{"link":"https://nmac.to/blog/duplicate-windows-1-1-1/","image":"https://nmac.to/wp-content/uploads/2016/03/Duplicate-Windows.png","title":"Duplicate Windows 1.1.1 – Mirror individual windows on your display","content":"Duplicate Windows visually copies any window in OS X live and on-the-fly. It’s like display mirroring for individual windows! Duplicate any window. Select any window on your Mac, and get an instant resizable copy that stays up to date with the original. Monitor anything. Don’t disrupt your workflow. Watch videos. Watch a sports game. Monitor […]"}]