[{"link":"https://nmac.to/blog/roadmovie-2-7-2/","image":"https://nmac.to/wp-content/uploads/2014/12/RoadMovie.png","title":"RoadMovie 2.7.2 – Subtitle, batch-encode and upload your movies","content":"RoadMovie helps get your videos subtitled, metadata tagged, chapterized, encoded and uploaded to your portable device or website. RoadMovie 2 brings you “video-encoding-super-powers” in a friendly and easy to use interface. Now you can finally create professionally encoded videos without using several apps for each task. All you need comes in this one app. Easy […]"},{"link":"https://nmac.to/blog/clone-x-4-3-1/","image":"https://nmac.to/wp-content/uploads/2014/12/Clone-X.png","title":"Clone X 4.3.1 – Create a copy of your system installation and much more","content":"Clone X is specially designed to create a copy of your system, to duplicate it on other disks or computers, and to repair and reinstall the system in case of problems (damaged system, errors during installation, etc.)   With OS X, the system is now a very complex construction. It is no longer confined within […]"},{"link":"https://nmac.to/blog/copyless-1-8-4/","image":"https://nmac.to/wp-content/uploads/2014/12/CopyLess.png","title":"CopyLess 1.8.4 – Store and access up to 100 clipboard items","content":"CopyLess is an advanced and flexible clipboard manager.   Unlike the system clipboard CopyLess can store up to 100 items to which you have instant access at any time. With CopyLess is no longer necessary to switch constantly between different applications or windows just to copy and paste several different items. Everything can now be […]"},{"link":"https://nmac.to/blog/airfile-2-8-2/","image":"https://nmac.to/wp-content/uploads/2014/03/AirFile.png","title":"AirFile 2.8.2 – Manage and access all your clouds in one place","content":"AirFile for iOS now comes to Mac! It lets you manage and access all your clouds in one place. You don’t need to use each application for each cloud. It provides you a unified access to all your clouds. Are you looking for an app that allows for accessing multiple Dropbox, multiple Box, multiple Google […]"},{"link":"https://nmac.to/blog/youtube-hunter-5-5-3/","image":"https://nmac.to/wp-content/uploads/2014/08/YouTubeHunter.png","title":"YouTube Hunter 5.5.3 – Download and convert YouTube videos","content":"YouTubeHunter is a video downloader and converter.   It takes only seconds to find and download videos from YouTube, Vimeo, DailyMotion, VEVO and others. YouTubeHunter downloads videos 15x faster than real time playing and supports simultaneous downloads. YouTubeHunter has built-in search and preview capabilities. Get video by URL feature is available. YouTubeHunter keeps subtitles for […]"},{"link":"https://nmac.to/blog/skeletal-system-pro-iii-3-8/","image":"https://nmac.to/wp-content/uploads/2014/11/Skeletal-System-Pro-III.png","title":"Skeletal System Pro III 3.8 – 3D View of skull and pelvis bones","content":"This is a major upgrade and contains 94 movement animations, 596 audio pronunciations and color mapping of the skull and pelvis bones.   Skeleton System Pro III contains hundreds of improvements – here are a few: 360 horizontal degree rotation of any body part – all easily controlled with your mouse. Rotate vertically for inferior […]"},{"link":"https://nmac.to/blog/shoulder-pro-iii-3-8/","image":"https://nmac.to/wp-content/uploads/2014/11/Shoulder-Pro-III.png","title":"Shoulder Pro III 3.8 – Cut, zoom, rotate & depth look into the man’s shoulder","content":"Shoulder Pro III gives users an in depth look into the body region and allows them to cut, zoom & rotate the shoulder. Shoulder Pro III provides multiple cross sections (Sagittal, Coronal and Transverse) as well as the ability to cut away different layers revealing the muscles, blood vessels, nerves and connective tissue down to […]"},{"link":"https://nmac.to/blog/muscle-system-pro-iii-3-8/","image":"https://nmac.to/wp-content/uploads/2014/11/Muscle-System-Pro-III.png","title":"Muscle System Pro III 3.8 – 3D visuals of human muscles","content":"Muscle System Pro III is a cutting edge app built on our NOVA technology. It is a completely new app, every detail has been re-designed from the photo-realistic 3D model to the quick navigation. There are thousands of changes – including the most in-depth 3D muscle system ever developed, the ability to rotate, cut away […]"},{"link":"https://nmac.to/blog/knee-pro-iii-3-8/","image":"https://nmac.to/wp-content/uploads/2014/11/Knee.Pro_.III_.with_.Animations.png","title":"Knee Pro III 3.8 – Cut, zoom, rotate & depth look into the man’s knee","content":"Knee Pro III gives users an in depth look into the body region and allows them to cut, zoom & rotate the knee. Knee Pro III provides multiple cross sections (Sagittal, Coronal and Transverse) as well as the ability to cut away different layers revealing the muscles, blood vessels, nerves and connective tissue down to […]"},{"link":"https://nmac.to/blog/hand-wrist-pro-iii-3-8/","image":"https://nmac.to/wp-content/uploads/2014/11/Hand..Wrist_.Pro_.III_.with_.Animations.png","title":"Hand & Wrist Pro III 3.8 – Cut, zoom, rotate & depth look into the man’s hand & wrist","content":"Hand & Wrist Pro III gives users an in depth look and allows them to cut, zoom and rotate the hand & wrist. Hand & Wrist Pro III provides multiple cross sections (Sagittal, Coronal and Transverse) as well as the ability to cut away different layers revealing the muscles, blood vessels, nerves and connective tissue […]"}]