[{"link":"https://nmac.to/blog/piccure-2-5-0-64/","image":"https://nmac.to/wp-content/uploads/2014/12/Piccure.png","title":"Piccure+ 2.5.0.64 – Correct optical aberrations like never before","content":"piccure+ is a new software program capable of correcting optical aberrations that cause a lack of sharpness in your images.   piccure+ uses a new method that essentially inverts the optical processes that cause images to look blurry. With the help of piccure+, your equipment can now be upgraded with a mouse click. It is […]"},{"link":"https://nmac.to/blog/pdf-studio-10-4-0/","image":"https://nmac.to/wp-content/uploads/2016/04/PDF.Studio.png","title":"PDF Studio 10.4.0 – Utility for working with PDF documents","content":"PDF Studio is an easy-to-use yet powerful program for working with PDF documents. View and Print: Open any PDF document and send it to the printer. Documents will be automatically resized to fit the paper size. PDF Studio supports all types of PDF fonts. PDF Interactive Forms: Fill any PDF form and save it locally. […]"},{"link":"https://nmac.to/blog/capture-365-journal/","image":"https://nmac.to/wp-content/uploads/2016/04/Capture.365.Journal.png","title":"Capture 365 Journal 1.5.6 – Daily journal with photo support and iCloud syncing","content":"Capture 365 Journal is a beautiful and easy to use diary/journal. You will have complete access to your journals all the time, allowing you capture your thoughts and special moments throughout the day.   Features Sync with iCloud, Dropbox, or 365 Direct Sync. Sync with Capture 365 Journal iOS. Location support. Multiple photos and videos. […]"},{"link":"https://nmac.to/blog/warden-melody-of-the-undergrowth/","image":"https://nmac.to/wp-content/uploads/2016/04/Warden.png","title":"Warden: Melody of the Undergrowth 1.0 – Third-person action-adventure game","content":"Warden: Melody of the Undergrowth is a third-person action-adventure game inspired by the genre classics of the N64-era.   Trapped in an ancient forest, a young prince searches for a lost god. Here he befriends the spirit of a young girl and a volatile child, and they quickly find their destinies intertwined.   Players control […]"},{"link":"https://nmac.to/blog/garageband-10-1-1/","image":"https://nmac.to/wp-content/uploads/2015/07/GarageBand10.png","title":"GarageBand 10.1.1 – Complete recording studio and more","content":"The new GarageBand is a whole music creation studio right inside your Mac — complete with keyboard, synths, orchestral and percussion instruments, presets for guitar and voice, an entirely redesigned sound library, and virtual session drummers. A beautiful and intuitive interface makes it easy to learn, play, record, and create great-sounding songs. And you can […]"},{"link":"https://nmac.to/blog/world-of-tanks-blitz-2-8-0/","image":"https://nmac.to/wp-content/uploads/2016/03/World-of-Tanks-Blitz.png","title":"World of Tanks Blitz 2.8.0 – MMO action game dedicated to fierce tank combat","content":"World of Tanks Blitz is a team-based MMO action game dedicated to fierce tank combat. The game derives its best traits from the original World of Tanks PC version and puts an energetic twist on its dynamic combat. World of Tanks Blitz lets you control over 200 legendary armored vehicles, while deep mechanics and realistic […]"},{"link":"https://nmac.to/blog/bitwig-studio-1-3-8/","image":"https://nmac.to/wp-content/uploads/2016/03/Bitwig-Studio.png","title":"Bitwig Studio 1.3.8 – Highly customizable audio DAW","content":"Bitwig Studio is a dynamic software solution for music creation and performance to realize all of your musical ideas in every stage of production.   From sound design to music creation, discover the new standard in customized workflow. Bitwig Studio inspires you to take greater control of your productions, giving you access to every aspect […]"},{"link":"https://nmac.to/blog/republique-remastered/","image":"https://nmac.to/wp-content/uploads/2015/03/Republique.png","title":"Republique Remastered ( Ep 5 ) 1.0 – Top thrilling and topical stealth-action game","content":"You receive a call from Hope, a woman trapped inside a mysterious totalitarian state. Hacking into an elaborate surveillance network, you guide Hope through a web of danger and deception across five thrilling episodes.   Developed over five years by industry veterans (Metal Gear Solid 4, Halo 4, F.E.A.R., Black & White 2, SOCOM) and […]"},{"link":"https://nmac.to/blog/appdelete-4-2-5/","image":"https://nmac.to/wp-content/uploads/2015/02/AppDelete.png","title":"AppDelete 4.2.5 – The speedy and efficient way to delete your unwanted apps","content":"AppDelete is an uninstaller for Macs that will remove not only applications but also widgets, preference panes, plugins, and screensavers along with their associated files. Without AppDelete these associated items will be left behind to take up space and potentially cause issues.   There are several ways to activate AppDelete: Drag items onto main window […]"},{"link":"https://nmac.to/blog/left-4-dead-2/","image":"https://nmac.to/wp-content/uploads/2016/04/Left-4-Dead-2.png","title":"Left 4 Dead 2 1.0 – Highly anticipated sequel to the award-winning game ( WineSkin )","content":"    Set in the zombie apocalypse, Left 4 Dead 2 (L4D2) is the highly anticipated sequel to the award-winning Left 4 Dead, the #1 co-op game of 2008.   This co-operative action horror FPS takes you and your friends through the cities, swamps and cemeteries of the Deep South, from Savannah to New Orleans […]"}]