[{"link":"https://nmac.to/blog/degrees-4-0-1/","image":"https://nmac.to/wp-content/uploads/2015/01/Degrees.png","title":"Degrees 4.0.1 – Get basic weather info in your menu bar","content":"Degrees is a simple app that shows current weather conditions in the menu bar, where you can always easily see them.   Features: Automatically detects where you are using Apple Core Location Option to manually enter a location you’d like to see weather data for Automatically refreshes every 15 minutes and after your Mac wakes […]"},{"link":"https://nmac.to/blog/stellar-phoenix-mac-data-recovery-6-0/","image":"https://nmac.to/wp-content/uploads/2015/01/Stellar.Phoenix.Mac_.Data_.Recovery.png","title":"Stellar Phoenix Mac Data Recovery 6.0 – Data Recovery Tool","content":"Stellar Phoenix Mac Data Recovery Software is designed to recover deleted files with original file names, recovers lost data, photo, audio and video files lost due to logical crashes. The software recovers and restores lost data from corrupt, damaged, deleted volumes of Mac OS X hard drive. The optimized fast scanning process finds all files/folders […]"},{"link":"https://nmac.to/blog/call-recorder-for-skype-2-5-12/","image":"https://nmac.to/wp-content/uploads/2015/01/Call.Recorder.for_.Skype_.png","title":"Call Recorder for Skype 2.5.12 – Record Skype audio and video calls","content":"Call Recorder for Skype is an add-on for Skype which automatically transforms your audio and video calls into recordings. It’s great for lessons, interviews, podcasts, or just having fun.   Features: Manually start/stop/pause, or record automatically. Control file size and quality. Widescreen HD video format. State-of-the-art H.264 and AAC file formats save space. Convert your […]"},{"link":"https://nmac.to/blog/cardiograph-1-2/","image":"https://nmac.to/wp-content/uploads/2015/01/Cardiograph.png","title":"Cardiograph 1.2 – Heart Rate Meter","content":"Cardiograph is an application which measures your heart rate. You can save your results for future reference, keep track of multiple people with individual profiles, add notes and locations, and even print out your measurements for sharing or safe keeping.   Cardiograph uses your Mac’s built-in camera to take pictures of your fingertip and calculate […]"},{"link":"https://nmac.to/blog/appbolish-1-0-3/","image":"https://nmac.to/wp-content/uploads/2014/09/AppBolish.png","title":"AppBolish 1.0.3 – Thoroughly uninstall apps","content":"AppBolish is a thorough app uninstallation solution.   Dragging apps to the Trash can leave numerous caches, logs, and support files littered all over the hard drive. This clogs up valuable disk space! Every app is analyzed, after which AppBolish begins to deeply scan the computer for all related items and presents a final list […]"},{"link":"https://nmac.to/blog/aurora-3d-maker-1-45-21/","image":"https://nmac.to/wp-content/uploads/2014/07/Aurora3DMaker.png","title":"Aurora 3D Maker 1.45.21 – Create 3D Text, logos, and icons","content":"Aurora 3D Maker is the easy-to-use 3D text, button, logo-maker software with a wide variety of pre-loaded shapes and text templates. Reflection and texture animation effects will take your 3D creations to the next level of design. A variety of built-in tools make this the perfect 3D builder for beginners and professionals alike.   Freedom […]"},{"link":"https://nmac.to/blog/aurora-3d-animation-maker-1-45-21/","image":"https://nmac.to/wp-content/uploads/2015/01/Aurora3DAnimation.png","title":"Aurora 3D Animation Maker 1.45.21 – Create 3D title animations","content":"Aurora 3D Animation Maker is the easy-to-use 3D title animation software that will let you create beautiful 3D animations that will take your text or logos to a whole new level of awesomeness! Using just a single timeline, you’ll be able to control all aspects of your animation, including the length and the speed of […]"},{"link":"https://nmac.to/blog/desk-1-1/","image":"https://nmac.to/wp-content/uploads/2014/12/Desk.png","title":"Desk 1.1 – Free writing environments app","content":"Desk is a premium writing experience for all types of writers.   Whether you’re a casual enthusiast, the weekend writer, blogger, or digital publishing professional, you’ll find Desk to be a much-needed breath of fresh air.   Designed to marry both function and form, it is the desktop publishing client that you’ve always wanted: Simple, […]"},{"link":"https://nmac.to/blog/deadcore/","image":"https://nmac.to/wp-content/uploads/2015/01/DeadCore.png","title":"DeadCore 1.0.1 – A Platformer-FPS blending exploration and speedrun","content":"After an endless fall through powerful magnetic storms… you awaken.   Your memory erased, you start exploring the world around you. Someone or something is pushing you higher and higher. Suddenly, you spot the most gigantic Tower emerging from the mists. You soon understand that to get the answers to your questions… you have to […]"},{"link":"https://nmac.to/blog/playonmac-4-1/","image":"https://nmac.to/wp-content/uploads/2015/01/PlayOnMac.png","title":"PlayOnMac 4.1 – Run Windows apps on your Mac","content":"PlayOnMac is like wineskin, winebottler or crossover a piece of sofware which allows you to easily install and use numerous games and softwares designed to run with Microsoft’s Windows.Interesting points to know: You don’t have to own a Windows license to use PlayOnMac. PlayOnMac is based on Wine, and so profits from all its possibilities […]"}]