[{"link":"https://nmac.to/blog/photopresenter-416/","image":"https://nmac.to/wp-content/uploads/2013/12/mzi.jxrgcsrx.175x175-75.jpg","title":"PhotoPresenter 4.1.6 – Slideshow viewer for your iPhoto library","content":"PhotoPresenter is an award-winning, easy-to-use and powerful slideshow viewer. It allows you to quickly present all your pictures and movies, and to create amazing presentations in just a snap. Have you ever been upset by the fact that movies you capture with your digital camera just can’t be viewed as easily as still pictures? Or […]"},{"link":"https://nmac.to/blog/rename-it-141/","image":"https://nmac.to/wp-content/uploads/2013/12/icon.175x175-7526.jpg","title":"Rename It 1.4.1 – Renaming tool that saves you time and energy","content":"Rename It is an easy-to-use batch file renaming tool that saves you time and energy.Notable Features: • A simple to use interface makes renaming your files easy. • Save your customized renaming schemes for future use.• A handy preview window allows you to see the original file names as well as a live preview of […]"},{"link":"https://nmac.to/blog/spotify-09157/","image":"https://nmac.to/wp-content/uploads/2013/12/33033.jpg","title":"Spotify 0.9.1.57 – Stream music, create playlists and more","content":"Spotify is a new way to enjoy music. Simply download and install, before you know it you’ll be singing along to the genre, artist or song of your choice. With Spotify you are never far away from the song you want. There are no restrictions in terms of what you can listen to or when. Forget […]"},{"link":"https://nmac.to/blog/analyst-13/","image":"https://nmac.to/wp-content/uploads/2013/12/analyst.175x175-75.jpg","title":"Analyst 1.3 – Track your Google Analytics metrics right from your menu bar","content":"Analyst helps you track your statistics in realtime, it allows you to compare your today metrics with the ones from the previous week, and therefore keep an eye on your website evolution. Analyst shows you beautiful graph of your website metrics change, you can even move your mouse over it, in order to compare the selected […]"},{"link":"https://nmac.to/blog/cubemen-2/","image":"https://nmac.to/wp-content/uploads/2013/07/Cubemen.2.png","title":"Cubemen 2 1.12 – Tower defense game","content":"Cubemen 2 is a fast paced, action packed, original 3D Strategy game where you use your little Cubemen units to defend and attack enemies in a range of awesome game modes including CTF, Skirmish, Territory and more.   For the multi-player enthusiasts, you can compete in up to 6 player online Solo or Team battles […]"},{"link":"https://nmac.to/blog/mischief-10/","image":"https://nmac.to/wp-content/uploads/2013/12/MischiefIcon.jpg","title":"Mischief 1.0 – Feels Like Pixels, Works Like Vectors","content":"Oh man, does Mischief ever look amazing. It’s a Mac drawing app which feels like it uses pixels, but stores your strokes as vectors. This means that you can daub away with your favorite pressure-sensitive stylus, but enjoy the infinite zooming and tiny file sizes of vectors. Adobe Ideas does something similar on iOS, but […]"},{"link":"https://nmac.to/blog/tunespan-111/","image":"https://nmac.to/wp-content/uploads/2013/07/TuneSpan.png","title":"TuneSpan 1.1.1 – Effortless iTunes media library management","content":"TuneSpan allows you to browse and span your iTunes Library. Span (verb): to distribute the media files in your iTunes Library across multiple drives.   What does TuneSpan do? TuneSpan helps you easily move the media files (Music, Movies, etc.) in your iTunes Library to multiple drives, avoiding the pitfalls of moving files manually. TuneSpan […]"},{"link":"https://nmac.to/blog/graphic-styles-12/","image":"https://nmac.to/wp-content/uploads/2013/12/Graphic_Styles.175x175-75.jpg","title":"Graphic Styles 1.2 – High-quality designs for Keynote presentations","content":"The Graphic Styles set contains a generous selection of high-quality designs to help you create unique Keynote presentations. It is an excellent collection for adding some exclusivity to your slides with original bullets, characters, patterns, and image frames.   : 7 bullet categories (147 bullet styles in total) 15 character styles 59 frame styles (72 […]"},{"link":"https://nmac.to/blog/batchinpaint-20/","image":"https://nmac.to/wp-content/uploads/2013/12/40788.jpg","title":"BatchInpaint 2.0 – Batch image editor","content":"BatchInpaint is a batch version of a popular software Inpaint. Now you can remove watermarks, date stamps and other unwanted objects in a batch mode.   Version 2.0: New BatchInpaint Look Added support 8-Bit Grayscale images Added support for EXIF data. EXIF data is retained on saving. Undo/Redo for Mask Modified zoom function to center […]"},{"link":"https://nmac.to/blog/mixtab-pro-101/","image":"https://nmac.to/wp-content/uploads/2013/12/mac-icon.175x175-75.jpg","title":"Mixtab Pro 1.0.1 – Beautiful, easy-to-use RSS Reader","content":"We created Mixtab Pro, because we believe in RSS as an open standard, and that there is plenty of innovation left in the RSS space.   Easy import from Google Reader – Supports OPML file RSS import – Add all your RSS feeds from one OPML file ( Add feed > Upload OPML ) – […]"}]