[{"link":"https://nmac.to/blog/soho-print-essentials-v507-designprint/","image":"https://nmac.to/wp-content/uploads/2013/12/HCApp1.png","title":"SOHO Print Essentials 5.0.7 – Design/print labels, envelopes, letterheads, and more","content":"SOHO Print Essentials is the easiest way to design and print labels, envelopes, letterhead, fax cover sheets, invoices, address books, etc. It integrates seamlessly with both the Mac OS X Address Book and SOHO Contacts so users’ contacts are always at their fingertips. Mail merge is a snap and its amazing design tools make customizing […]"},{"link":"https://nmac.to/blog/soho-organizer-v931-includes-soho/","image":"https://nmac.to/wp-content/uploads/2013/12/OC1.png","title":"SOHO Organizer v9.3.1 – Personal Organizer and Group Organizer","content":"SOHO Organizer is the official successor to Personal Organizer and Group Organizer and represents a 100% Cocoa rewrite of the former products. This means SOHO Organizer presents a first-class Mac OS X experience complete with all the features Mac OS X users expect: Aqua interface, Unicode compliance, built-in spell checking, Service support, etc. Finally, the […]"},{"link":"https://nmac.to/blog/soho-notes-v931-premier-digital-note/","image":"https://nmac.to/wp-content/uploads/2013/12/SOHONotes1.png","title":"SOHO Notes v9.3.1 – Premier digital note-taking application","content":"SOHO Notes is the premier digital note-taking application for Mac. Use it to capture, organize, and share all of your personal and workgroup information. It can store rich text, PDF’s, images, files, movies, audio, bookmarks, and Web archives. Synchronize notes between multiple computers, iPod’s, and Palm handhelds.  Single And Multi-User Capable – SOHO Notes is […]"},{"link":"https://nmac.to/blog/picturesque-v243-make-images-look/","image":"https://nmac.to/wp-content/uploads/2013/12/picturesque.png","title":"Picturesque v2.4.3 – Make images look gorgeous for the web","content":"Picturesque is an award-winning application designed to make images look gorgeous for the web.   With an animated “drag and drop” style interface, Picturesque makes images gorgeous with tasteful effects like 3D perspective, reflection, glow, shadow, curve, and stroke in less time than it takes to open Photoshop.   Picturesque can also beautify images in […]"},{"link":"https://nmac.to/blog/routebuddy-v40-gps-mapping-application/","image":"https://nmac.to/wp-content/uploads/2013/12/RouteBuddy1.png","title":"RouteBuddy v4.0 – GPS mapping application","content":"RouteBuddy is a mapping application that can be used as an alternative to the software that shipped with your GPS device. All the essential functions of your GPS device are supported; all you need is a Mac, a GPS, and of course RouteBuddy. – Supports road and topographic maps – Supports USGlobalSat, Garmin, TomTom, and […]"},{"link":"https://nmac.to/blog/fun-greetings-deluxe-v10-make-beautiful/","image":"https://nmac.to/wp-content/uploads/2013/12/Fun_Greetings.png","title":"Fun Greetings Deluxe v1.0 – Make beautiful greeting cards","content":"Fun Greetings Deluxe is a complete redesign of the #1 best selling Photo Greeting Card software for Mac.  – Nearly 200 1-Click Styles. – Brand New Card Editor with far more control. – 15 Photo Effects. – Print Cards in many sizes (including custom sizes). – Ecard, Facebook, Flickr & Twitter sharing built-in. – Full […]"},{"link":"https://nmac.to/blog/mango-irc-v21-chat-client/","image":"https://nmac.to/wp-content/uploads/2013/12/mango.png","title":"Mango IRC v2.1 – Chat client","content":"Internet Relay Chat (IRC) is a form of real-time Internet text messaging (chat) or synchronous conferencing. It is mainly designed for group communication in discussion forums, called channels, but also allows one-to-one communication via private messages. Mango IRC is a completely redesigned chat client for your Mac OS X and with Mango IRC and Mango […]"},{"link":"https://nmac.to/blog/instadesk-v202-instagram-client-for/","image":"https://nmac.to/wp-content/uploads/2013/12/insta.png","title":"InstaDesk v2.0.2 – Instagram client for photo sharing","content":"InstaDesk is an Instagram client for the Mac. InstaDesk lets you not only browse your or your friends Instagram pictures, but easily explore the social graph and find new people to follow. Instead, with InstaDesk you can browse beautiful pictures, newest uploads of your friends, or interesting people to follow. Furthermore, you can comment on […]"},{"link":"https://nmac.to/blog/blue-planet-v12-shows-satellite-images/","image":"https://nmac.to/wp-content/uploads/2013/12/BluePlanetIcon1.png","title":"Blue Planet v1.2 – Shows satellite images of earth as wallpaper","content":"Blue Planet shows you wonderful satellite images of the Earth as your desktop background. The map changes in real-time as the sun travels across the sky, illuminating different parts of the world and leaving others in the shadow of the night. Features: – Choose from four gorgeous maps. – Use Apple’s Core Location technology to […]"},{"link":"https://nmac.to/blog/snapz-pro-x-v250-powerful-screenshot/","image":"https://nmac.to/wp-content/uploads/2013/12/snapzprox.png","title":"Snapz Pro X v2.5.0 – Powerful screenshot and video capture utility","content":"Once Snapz Pro X is installed, a single keystroke can immediately save anything visible on screen in a wide variety of image file formats. Using Snapz Pro X, you don’t have to tell people about how cool a game is or how to use a particular program . you can just take a picture or […]"}]