[{"link":"https://nmac.to/blog/vector/","image":"https://nmac.to/wp-content/uploads/2019/08/Vector3.png","title":"Vector 3.5 – Audio recorder and editor with built-in effects","content":"Vector is the swiss army knife of digital audio. Record audio, edit existing audio files, convert your music between the most common audio file formats, digitize your old vinyl records or record internet radio stations (requires installation of the free Soundflower driver). Whatever you need to get done – if it has something to do […]"},{"link":"https://nmac.to/blog/telling-lies/","image":"https://nmac.to/wp-content/uploads/2019/08/Telling-Lies.png","title":"Telling Lies 1.1 – Story Rich Mystery & Investigation Game","content":"Telling Lies is the new video game from Sam Barlow, creator of Her Story and Silent Hill: Shattered Memories. An investigative thriller game with non-linear storytelling, Telling Lies revolves around a cache of secretly recorded video conversations. It stars Logan Marshall-Green, Alexandra Shipp, Kerry Bishé and Angela Sarafyan.   How does it work? Telling Lies […]"},{"link":"https://nmac.to/blog/photoeraser-inpaint/","image":"https://nmac.to/wp-content/uploads/2019/08/PhotoEraser-Inpaint.png","title":"PhotoEraser Inpaint 1.6 – Remove unwanted objects or people from your photos","content":"PhotoEraser Inpaint easily help you remove unwanted objects or people from your photos! You can also use it to remove watermark in the photo.   Main Reasons to use Photo Inpaint: Remove unwanted objects from photo, like garbage bins, cars, etc., Remove unwanted people from photo, like tourists in the landscape Repair old photos, remove […]"},{"link":"https://nmac.to/blog/amarra/","image":"https://nmac.to/wp-content/uploads/2017/03/Amarra4.png","title":"Amarra Luxe 4.3.510 – High resolution music player for audiophiles","content":"Amarra is a high resolution music player designed for the discriminating ears of audiophiles and professionals.   Deep, analog, natural, and musical; these are words , our customers use when describing their Amarra listening experiences.   You’ll have many “oh wow!” moments even with tracks you’ve listened to for years. That’s because it enables your […]"},{"link":"https://nmac.to/blog/democracy-3/","image":"https://nmac.to/wp-content/uploads/2014/02/Democracy3.png","title":"Democracy 3 1.30.2 – Simulation of Country Control Game","content":"Have you ever wanted to be president? or prime-minister? Convinced you could do a better job of running the country? Let’s face it, you could hardly do a worse job than our current political leaders. Crime, Unemployment, National Debt, Terrorism, Climate Change…Have you got the answers to the problems that face western industrialized nations? Here […]"},{"link":"https://nmac.to/blog/world-of-goo/","image":"https://nmac.to/wp-content/uploads/2019/08/World-of-Goo.png","title":"World of Goo 1.53 – Award-winning physics-based puzzle/construction game","content":"Beautiful and surprising, the millions of Goo Balls who live in the World of Goo are curious to explore – but they don’t know that they are in a game, or that they are extremely delicious.   Drag and drop living, squirming, talking, globs of goo to build structures, bridges, cannonballs, zeppelins, and giant tongues. […]"},{"link":"https://nmac.to/blog/we-the-revolution/","image":"https://nmac.to/wp-content/uploads/2019/03/We-The-Revolution.png","title":"We. The Revolution 1.3.0 – Historical & Strategy Game","content":"We. The Revolution is a unique game with a singular art style set in the blood-soaked and paranoid world of the French Revolution, where often you could not tell a friend from an enemy. As a judge of the Revolutionary Tribunal, you will have to trudge through this setting passing sentences, playing a dangerous political […]"},{"link":"https://nmac.to/blog/easy-video-converter-pro/","image":"https://nmac.to/wp-content/uploads/2017/11/Easy-Video-Converter-Pro2.png","title":"Easy-Video-Converter Pro 2.4.0 – Best video converter tool","content":"Easy Video Converter Pro is a video converter tool. It can handles almost all audio and video formats to playable format on Apple’s devices.Just drag your file into easy video converter, select an output preset and click convert. No other options to choose, no professional skills required though, It can intelligently analyzes the import file, […]"},{"link":"https://nmac.to/blog/breeze/","image":"https://nmac.to/wp-content/uploads/2014/02/Breeze1.png","title":"Breeze 1.6 – Simple window manager","content":"Breeze gives you simple window management on Mac OS X through a concept called “window states”.   When you save a window state, Breeze remembers the relative size and position of the focused window.   At any point, you can apply that state (size and position) like a template to any other focused window.   […]"},{"link":"https://nmac.to/blog/creo/","image":"https://nmac.to/wp-content/uploads/2018/12/Creo2.png","title":"Creo 2.1.1 – Combine Design and Development processes","content":"Creo is a MacOS tool which aims to combine the Design and Development process into a single easy to use application. Traditional mobile app creation process is split between the design process and the development process, Creo merges the two separated steps into a single tool which enables you to focus on what makes your […]"}]