[{"link":"https://nmac.to/blog/mind-symphony/","image":"https://nmac.to/wp-content/uploads/2021/05/Mind-Symphony.png","title":"Mind Symphony 1.6.7 – Music & Action for Your Mind","content":"Make music and games impact your state of mind.   Experience Music and Gameplay that emotionally and mentally impacts you. Mind Symphony sets unique gameplay to mesh with musical tracks to create an experience that make you feel better.   Release mode engages players in a “shmup” style game where enemies and attacks are timed […]"},{"link":"https://nmac.to/blog/down-in-bermuda/","image":"https://nmac.to/wp-content/uploads/2021/01/Down-in-Bermuda.png","title":"Down in Bermuda 1.6.7 – Point & Click Puzzle & Adventure Game","content":"An unnatural storm leaves an adventurous aviator stranded for decades within the infamous Bermuda. Overcome creatures of the deep and unravel the islands secrets in search for a way back home.   Down in Bermuda is a quirky adventure filled with puzzles to solve and mysteries to uncover. Our adventurous aviator Milton finds himself trapped […]"},{"link":"https://nmac.to/blog/speed-demons/","image":"https://nmac.to/wp-content/uploads/2020/12/Speed-Demons.png","title":"Speed Demons 1.5.2 – Highway racing + crazy crashes","content":"Speed Demons is the ultimate highway racing simulator, with breakneck speeds, amazing physics-based crashes and the most intense TRAFFIC ever seen in a videogame. Featuring hundreds of events, tons of varied vehicles, endless highways and 8 gameplay modes, this is the top-down, physics-based racing game the world has been waiting for.   Whether you want […]"},{"link":"https://nmac.to/blog/stela/","image":"https://nmac.to/wp-content/uploads/2021/05/Stela.png","title":"Stela 3.1.0 – Journey to the end of a world","content":"Play Stela with Apple Arcade, a game subscription service with 100+ groundbreaking new games.   Stela is a cinematic, atmospheric platformer about a young woman witnessing the final days of a mysterious ancient world.   Overcome daunting challenges, treacherous terrain, and gargantuan beasts while traversing a decaying land. Manipulate the environment to solve elaborate puzzles […]"},{"link":"https://nmac.to/blog/focus-matrix/","image":"https://nmac.to/wp-content/uploads/2016/08/Focus-Matrix.png","title":"Focus Matrix 1.5 – Task Manager based on the Eisenhower Method","content":"Focus Matrix is a smart personal organizer based on the so-called Eisenhower box, a personal productivity strategy created by Dwight Eisenhower, the 34th President of the United States. The principle uses a special priority matrix that helps break your tasks into several groups depending on their urgency and importance, and work your way through your […]"},{"link":"https://nmac.to/blog/hazel/","image":"https://nmac.to/wp-content/uploads/2018/03/Hazel_5.png","title":"Hazel 5.0.7 – Create rules for organizing and cleaning folders","content":"Hazel is your personal housekeeper, organizing and cleaning folders based on rules you define. Hazel can also manage your trash and uninstall your applications.   Organize your files using a familiar rule interface. Filter on the file’s name, type, date, the site or email address it came from and more. And do more than just […]"},{"link":"https://nmac.to/blog/bookmarks-menu/","image":"https://nmac.to/wp-content/uploads/2021/01/Bookmarks-Menu.png","title":"Bookmarks Menu 2.7 – Access all of your Safari bookmarks from a system wide menu","content":"Bookmarks Menu allows you to access all of your Safari bookmarks from a system wide menu.   There is no need to have Safari open as Bookmarks Menu has an integrated web browser. You can of course open the bookmark in Safari if you’d like.   You can also easily search the web by using […]"},{"link":"https://nmac.to/blog/stats-panel/","image":"https://nmac.to/wp-content/uploads/2021/05/Stats-Panel.png","title":"Stats Panel 1.2.1 – Menubar stats system monitor","content":"A macOS system monitor on your menubar. Stats Panel is a great control panel for your Mac. Monitor your system, review battery health, processor, memory, network and disk activity.   Simple A system monitor on your menubar. No complicated menus or configuration.   Lightweight Stats Panel uses very little system resources and reports own memory […]"},{"link":"https://nmac.to/blog/itimetable/","image":"https://nmac.to/wp-content/uploads/2021/05/iTimeTable-2.png","title":"iTimeTable 2 1.1.1 – Count the time until a lesson end for you","content":"Tired of carrying around a paper timetable? Well, your problem is solved! Let iTimetable calculate everything for you and receive notifications before the end of a lesson and a break! iTimeTable is a simple application made for those attending primary school, secondary school, college or university, supporting up to 4 different weeks you can switch […]"},{"link":"https://nmac.to/blog/perfectly-clear/","image":"https://nmac.to/wp-content/uploads/2019/04/Perfectly.Clear_.Complete.png","title":"Perfectly Clear Complete 3.11.3.1980 – AI-powered photo editing and batch processing solution","content":"Perfectly Clear for Photoshop and Lightroom helps you save time by unlocking the details in every image—automatically.  It includes ALL of our award-winning corrections and 40 professionally created presets, all in a single plug-in.   Plus, you get a license to our Perfect Eyes, Perfect Skin and Perfect Exposure plug-ins.  Perfectly Clear Complete is ideal for […]"}]