[{"link":"https://nmac.to/blog/photoreflector/","image":"https://nmac.to/wp-content/uploads/2017/07/PhotoReflector.png","title":"PhotoReflector 1.1 – Easily add reflections to photos and icons","content":"PhotoReflector lets you easily add stunning reflections to your photos and text, adding depth and dimension to enhance their appearance.   Features Reflect photos to simulate standing them on a mirrored surface in 3D Perspectively warp reflected photos to simulate viewing them sideways in 3D Enter, edit and image rich text, and reflect it just […]"},{"link":"https://nmac.to/blog/video-memoires/","image":"https://nmac.to/wp-content/uploads/2020/08/Video-Memoires.png","title":"Video Memoires 2.2.3 – Video diary software [FIX]","content":"Video Mémoires is video diary software for Mac. Record your today’s diary entry in seconds by clicking on a button. Browse the calendar and watch your previous entries, or use quick search to find your past videos.   Version 2.2.3: Fixed incorrect days of week in the calendar.   Intel, 64-bit processor OS X 10.11 […]"},{"link":"https://nmac.to/blog/paletter/","image":"https://nmac.to/wp-content/uploads/2021/03/Paletter.png","title":"Paletter 4.3 – Color Picker and Schemer","content":"The hardest thing in design might just be choosing colors. Paletter is here to make your life easier by helping you discover and create beautiful color combinations.   Get Back to the Core of Color Theory Triad Tetrad Analogous Monochromatic Complementary Split complementary Shades Tones Tints Insanely Handy Click on a color to set it […]"},{"link":"https://nmac.to/blog/magic-media-marker/","image":"https://nmac.to/wp-content/uploads/2021/01/Magic-Media-Marker.png","title":"Magic Media Marker 3.3 – Automate video file processing [FIX]","content":"Magic Media Marker’s main purpose is to process video files and make them pretty in iTunes and on your Apple Devices. Feed Magic Media Marker a video file and it will automatically determine if the file is a TV Show or a Movie by it’s file name and download the appropriate meta data and artwork […]"},{"link":"https://nmac.to/blog/pdf-squeezer-pdf-toolbox/","image":"https://nmac.to/wp-content/uploads/2021/06/PDF-Squeezer-PDF-Toolbox.png","title":"PDF Squeezer – PDF Toolbox 6.2.4 – PDF squeezer & PDF splitter","content":"PDF Squeezer – PDF Toolbox is designed for operating PDF files and contains almost all operations you can imagine, such as: compress, merge, split, extract, insert, extract image, convert image, extract text, sequence, encrypt, etc. If you are worried about operating PDF files, download it, it’s so fantastic!   FEATURES:   1. Merge You can […]"},{"link":"https://nmac.to/blog/appzapper/","image":"https://nmac.to/wp-content/uploads/2013/02/AppZapper2.png","title":"AppZapper 2.0.3 – Confidently uninstall virtually any application [FIX]","content":"AppZapper allows you to confidently uninstall virtually any application as easily as it was installed — just drag and drop. Drag one or more unwanted apps onto AppZapper and watch as it finds all the extra files and lets you delete them with a single click. A slick safety system remembers which apps you want […]"},{"link":"https://nmac.to/blog/folder-factory/","image":"https://nmac.to/wp-content/uploads/2017/05/Folder-Factory.png","title":"Folder-Factory 5.9.2 – Customize, design and enhance your folder icons","content":"Folder-Factory is a basic icon tool for OS X which help you to customize, design and enhance your folder icons. With it you can combine folder icon with images, text, sketch, and shape. This will improve your system’s appearance, keep your Mac organized and improve your working productivity. You’ll no longer need to read folder […]"},{"link":"https://nmac.to/blog/pdf-merge-pdf-splitter/","image":"https://nmac.to/wp-content/uploads/2020/12/PDF-Merge-PDF-Splitter.png","title":"PDF Merge & PDF Splitter + 6.3.3 – Split & merge pdf files","content":"PDF Merge and PDF Splitter + is a very easy-to-use app that allows you to quickly merge multiple PDFs into one PDF or split specified pages into a new PDF.   Key Features: Merge multiple PDF files into one PDF. Merge password-protected PDF files, but you must know the password. Support drag and drop. Support […]"},{"link":"https://nmac.to/blog/terratech/","image":"https://nmac.to/wp-content/uploads/2021/12/TerraTech.png","title":"TerraTech 1.4.14 – An open-world, sandbox adventure game","content":"TerraTech is an open-world, sandbox adventure game, where you design and build your own creations through a mix of crafting, combat and discovery. Design cars, tanks and planes from a huge library of blocks. Scavenge, craft and buy new parts in order to survive and become the ultimate planetary prospector.   Start your career as […]"},{"link":"https://nmac.to/blog/fonelab-video-converter-ultimate/","image":"https://nmac.to/wp-content/uploads/2021/05/FoneLab-Video-Converter-Ultimate.png","title":"FoneLab Video Converter Ultimate 9.2.8 – Convert, Edit, Enhance Video or Audio Files","content":"Do you want to get video converted to MP4? Are you still searching for an MP3 converter? Do you need a video enhancer to improve your video quality? Here Video Converter Ultimate is a perfect companion to meet all your needs.   Apart from being a high-range compatible media file player, Video Converter Ultimate is […]"}]