[{"link":"https://nmac.to/blog/instatab-pro-instagram-1-01/","image":"https://nmac.to/wp-content/uploads/2014/01/InstaTab-Pro-for-Instagram.png","title":"InstaTab Pro for Instagram 1.01 – Access Instagram directly from your mac desktop","content":"InstaTab Pro for Instagram is new way to access your Instagram. Doesn’t have enough space for a menubar app? Not a problem. We introduce InstaTab Pro that will stick on edges of your screen.   InstaTab Pro for Instagram with these Charming features:   Access your Instagram with “1 click” from your menubar，red camera icon […]"},{"link":"https://nmac.to/blog/connect-1-1/","image":"https://nmac.to/wp-content/uploads/2014/01/Connect.png","title":"Connect 1.1 – Phone calls using Bluetooth connection","content":"Connect lets you connect with your friends by allowing you to place phone calls and receive phone calls from your Mac using a Bluetooth connection to your phone. You may also press the keys 0-9 * # during a call, to use the dialer.   WHAT’S NEW Version 1.1: Fixed a minimum version compatibility issue. […]"},{"link":"https://nmac.to/blog/pulpmotion-advanced-3-5/","image":"https://nmac.to/wp-content/uploads/2014/01/PulpMotion-Advanced.png","title":"PulpMotion Advanced 3.5 – Create animations using your own pictures, videos, music","content":"PulpMotion Advanced is the next generation slideshow and animation software for your media.    PulpMotion Advanced creates slideshow based on highly customizable themes. It allows you to present your pictures as well as your video in a single animation you can share as video, screensaver or executable player.   PulpMotion Advanced makes your pictures come […]"},{"link":"https://nmac.to/blog/astro-1-5/","image":"https://nmac.to/wp-content/uploads/2014/01/Astro.png","title":"Astro 1.5 – Facebook Messenger on Mac","content":"Astro is the best Facebook Messenger app on Mac. For the first time, you can use lightening fast FB chat, just like iMessage on Mac   (1) Super fast interface, just like iMessage (2) The only app that supports group chat (3) Drag & Drop to send files (4) Shortcut to make screenshot (5) Background […]"},{"link":"https://nmac.to/blog/manycam-pro-2-0-38/","image":"https://nmac.to/wp-content/uploads/2014/01/ManyCam.png","title":"ManyCam Pro 2.0.38 – Use a single iSight or other webcam with multiple applications","content":"What is ManyCam? Use your webcam with multiple programs simultaneously. Add text to your webcam video window with any application. Add cool animations to your video window. Show your local day and date in your video window. Add live CGI graphics like fire and water effects. You can even make it appear as if it […]"},{"link":"https://nmac.to/blog/tuba-1-5/","image":"https://nmac.to/wp-content/uploads/2014/01/Tuba.png","title":"Tuba 1.5 – Super fast and elegantly designed YouTube app","content":"Tuba is a super fast and elegantly designed YouTube app for your beloved Mac   Why use Tuba app instead of youtube.com? 1) The app is blazing fast compare with the website.Everything is much faster. 2) Better design: more content, no clutter. 3) Save 50% battery. Tuba only uses half the power compare with youtube.com, […]"},{"link":"https://nmac.to/blog/dragthing-5-9-12/","image":"https://nmac.to/wp-content/uploads/2014/01/DragThing.png","title":"DragThing 5.9.12 – Desktop launcher utility","content":"DragThing is a desktop launcher utility that can launch applications, open documents and folders, store text and picture clippings, and do many other customizable actions with a single click or keystroke.   WHAT’S NEW Version 5.9.12: Added support for OS X 10.9 Mavericks. Reduced the size of dock files significantly, and improved loading times. The […]"},{"link":"https://nmac.to/blog/taskdeck-1-0-8/","image":"https://nmac.to/wp-content/uploads/2014/01/Taskdeck.png","title":"Taskdeck 1.0.8 – Versatile task management in the menu bar","content":"Taskdeck is quick-and-easy task and to-do management. Organize Group related tasks into lists. A badge indicates the number of open, due, or overdue tasks in each list. Prioritize Drag tasks up or down the list to prioritize. Important stuff goes to the top, less important issues to the bottom. Find Quickly locate tasks by typing […]"},{"link":"https://nmac.to/blog/bike-baron/","image":"https://nmac.to/wp-content/uploads/2014/01/Bike-Baron.png","title":"Bike Baron 1.4 – Ultimate Bike Mac Game","content":"What happens when you put the developers of Minigore, Ice Rage, Death Rally and Aqua Globs together with the composer of Angry Birds and Trine 2? PURE MAGIC. Bike Baron is a ride you will never forget!   MASTER over 100 different tracks, beat more than 300 unbelievable challenges and learn the secrets of the […]"},{"link":"https://nmac.to/blog/ringer-2-0-1/","image":"https://nmac.to/wp-content/uploads/2014/01/Ringer.png","title":"Ringer 2.0.1 – Create iPhone ringtones","content":"Ringer allows you to create iPhone ringtones.    Choose any non-protected file from your iTunes library or any media file on your system and turn it into a custom ringtone for your iPhone. Make as many as you want, there is no limit to the number of ringtones you can make with Ringer.   Easily […]"}]