[{"link":"https://nmac.to/blog/airborne-kingdom/","image":"https://nmac.to/wp-content/uploads/2021/01/Airborne-Kingdom.png","title":"Airborne Kingdom 1.0.2 – The sky city builder game","content":"Airborne Kingdom – the sky city builder. Grow your unique town among the clouds, and fly it across a wide-open landscape. Explore the skies to restore serenity to the world below   Build Your Domain Construct a unique sky city. Build housing, satisfy needs, and grow your clan. Maintain lift, balance weight, and be careful […]"},{"link":"https://nmac.to/blog/chromatic-edges/","image":"https://nmac.to/wp-content/uploads/2019/09/Chromatic-Edges.png","title":"Chromatic Edges 1.0.24 – Unlimited edges to make your photography pop","content":"JixiPix takes vintage to a whole new extreme. Gone are the days of having a few tiny choices when it comes to adding flare to your imagery. Chromatic Edges brings back the subtle magic of photo processing with glass, silver and paper plates all with a few taps and your unique photo.   It’s all […]"},{"link":"https://nmac.to/blog/watercolor-studio/","image":"https://nmac.to/wp-content/uploads/2017/09/Watercolor-Studio.png","title":"Watercolor Studio 1.4.11 – An Automated Photo to Watercolor Software","content":"Watercolor Studio creates fluid, liquidy, translucent watercolors with paint that flows naturally. Built on-top of an incredible rendering system that uses real-world techniques, this application does the initial work, producing a watercolor instantly, then allows you to customize your paintings using an array of Sliders, Layers, Brushes, Color Washes and Artistic finishes. The end result—print […]"},{"link":"https://nmac.to/blog/pastello/","image":"https://nmac.to/wp-content/uploads/2016/02/Pastello.png","title":"Pastello 1.1.16 – Transform photos into a fine art drawing","content":"Introducing Pastello, a brand-new companion app to JixiPix’s Impresso Pro. Pastello takes you back in time to the 15th century. Away from brushes and large strokes and into the realm of dry media with color that is both brilliant and subtle. The “Dry color method” made famous by Leonardo da Vinci is so powerful in […]"},{"link":"https://nmac.to/blog/rip-studio/","image":"https://nmac.to/wp-content/uploads/2016/07/Rip-Studio.png","title":"Rip Studio 1.1.14 – Photography and collaging app","content":"2 years in development, 3 years prototyping, and thousands of hours in the art department, Rip Studio redefines everything you know about a photography and collaging app. It offers super realistic ripped and cut borders, tape, creased and folded images, curled edges with fully 3D shadowing. All with an incredible interface that seamlessly handles layers […]"},{"link":"https://nmac.to/blog/photo-formation-pro/","image":"https://nmac.to/wp-content/uploads/2018/05/Photo.Formation.png","title":"Photo Formation Pro 1.0.16 – Transforms images into super creative paper formations","content":"Photo Formation is a photo effect that auto-transforms images into super creative paper formations while a 3D light engine casts ultra cool shadows with loads of dimension. Use it to fragment, join, weave, rip and fold photos into fascinating eye-catching pieces, with all the subtle creases, curls and bends as if painstakingly assembled by hand. […]"},{"link":"https://nmac.to/blog/puzzipix-pro/","image":"https://nmac.to/wp-content/uploads/2017/12/PuzziPix-Pro.png","title":"PuzziPix Pro 1.0.14 – Transform any image into a jigsaw puzzle","content":"Look how easy it is to turn any photo into a jigsaw puzzle! If you’re looking to add dimension to your photo creation, PUZZiPiX will leave a lasting impression.   PUZZiPiX combines photos with perfectly fitting puzzle components for great composition and storytelling. In advertising, contexts and connotations can be in high demand for designers, […]"},{"link":"https://nmac.to/blog/artista-impresso/","image":"https://nmac.to/wp-content/uploads/2020/02/Artista-Impresso.png","title":"Artista Impresso Pro 1.8.16 – Transform your snapshot into a stroke-filled Impressionist masterpiece","content":"Impresso photo app transforms Flower Show snapshots into stroke filled impressionist masterpieces.  Designed with the user in mind, Artista Impresso allows visitors to customize their image from a host of impressionist styles. The app will be available to purchase for 99 cents, for a limited time only during the Flower Show’s run.    Artista Impresso — […]"},{"link":"https://nmac.to/blog/hand-tint-pro/","image":"https://nmac.to/wp-content/uploads/2015/08/Hand-Tint-Pro1.png","title":"Hand Tint Pro 1.0.17 – Colorize your photo with Tint, Tone and Color","content":"Hand Tint Pro supplies everything you need—color palettes, paper and smart brushes—for creating beautiful and timeless hand painted photography.   Like all art forms, preparing a good base for hand coloring is like stretching a canvas for painting, so every imaged placed in the app is stripped of color and transformed into a classic Black […]"},{"link":"https://nmac.to/blog/secret-folder/","image":"https://nmac.to/wp-content/uploads/2018/02/Secret-Folder.png","title":"Secret Folder 10.5 – Protect your information on folder-by-folder basis","content":"Secret Folder is a Mac OS X program that provides an easy and fast way to protect personal documents and avoid them being seen, modified, or erased by other users. It allows users to hide folders and their contents. Files and folders can be added by means of a single click on a choose dialog […]"}]