[{"link":"https://nmac.to/blog/tuneskit-m4v-converter/","image":"https://nmac.to/wp-content/uploads/2018/05/M4VConverter.png","title":"TunesKit M4V Converter 5.0.0.20 – A complete DRM removal tool","content":"A complete DRM removal tool that empowers you to remove DRM protection and convert iTunes M4V rentals and purchases and non-DRM videos to universal MP4, MOV, M4V, MPG, AVI, FLV, MP3, etc. with lossless 5.1 audio tracks, subtitles preserved for playing on any device.   Remove DRM decryption from iTunes movie rentals and purchases Get […]"},{"link":"https://nmac.to/blog/instaradio/","image":"https://nmac.to/wp-content/uploads/2017/05/Instaradio.png","title":"Instaradio 8.0.1 – Listen to your favorite radio stations","content":"Instaradio is a fast and could be the radio player you have been waiting for. Try the app thousands of people rely on for listening to radio.   Features: Listen to radio from all around the world View info about songs, artist and radio program, along with album art Add your own URLs as radio […]"},{"link":"https://nmac.to/blog/theme-lab/","image":"https://nmac.to/wp-content/uploads/2017/06/Theme-Lab.png","title":"Theme Lab 5.4.3 – Templates for Keynote","content":"Create outstanding presentations quickly and efficiently! Theme Lab for Keynote makes presenting your ideas easier than ever. With over 100 professionally-designed and structured themes, you get unparalleled freedom to turn your ideas into winning presentations!   All themes inside Theme Lab for Keynote have at least 32 master slides, offering a comprehensive selection between text- […]"},{"link":"https://nmac.to/blog/neon-chrome/","image":"https://nmac.to/wp-content/uploads/2019/02/Neon-Chrome.png","title":"Neon Chrome 1.1.14 – Twin-Stick Top-Down Shooter Game","content":"Neon Chrome is a ruthless twin-stick top-down shooter with procedurally generated levels and destructible environment. Completely destructible environment Persistent character development using loot from your runs Enemies ranging from security guards to massive boss hover tanks Perk system in the form of cybernetic enhancements Procedurally generated levels – endless replayability Over a dozen weapons Discover […]"},{"link":"https://nmac.to/blog/the-long-journey-home/","image":"https://nmac.to/wp-content/uploads/2019/02/The.Long_.Journey.Home_.png","title":"The Long Journey Home 1.46 – 2D Space Strategy & RPG Game","content":"It was supposed to be a short test run – a quick flight to Alpha Centauri and back. But when mankind’s first experimental jump drive goes wrong, you and your crew find yourselves trapped on the wrong side of the galaxy. Now, you are entirely on your own – and the only way back leads […]"},{"link":"https://nmac.to/blog/dex/","image":"https://nmac.to/wp-content/uploads/2019/02/Dex.png","title":"Dex 6.0.0.0 – A 2D, side-scrolling, open-world cyberpunk RPG Game","content":"Explore, fight, talk and hack your way through a rich cyberpunk world in this 2D action-RPG!   Wanted dead by a mysterious and far-reaching organization, you will traverse the futuristic city of Harbor Prime and make unexpected allies on your quest to bring down the system! In this cyberpunk adventure inspired by Blade Runner and […]"},{"link":"https://nmac.to/blog/invisible-inc/","image":"https://nmac.to/wp-content/uploads/2019/02/InvisibleInc.png","title":"Invisible, Inc. 1.0 – Turn-Based Strategy Game","content":"Take control of Invisible’s agents in the field and infiltrate the world’s most dangerous corporations. Stealth, precision, and teamwork are essential in high-stakes, high-profit missions, where every move may cost an agent their life.    Klei Entertainment, the independent studio behind the hit games Mark of the Ninja and Don’t Starve, presents: Invisible, Inc.   […]"},{"link":"https://nmac.to/blog/crookz-the-big-heist/","image":"https://nmac.to/wp-content/uploads/2015/08/Crookz.png","title":"Crookz – The Big Heist 1.0 – Tactical strategy game set in the funky 1970’s","content":"It’s the 1970’s: the era of Funk, flared jeans and disco-fueled Saturday nights. A crack team of expert thieves turn Grand Larceny into an art-form by using their many talents to break into the richest homes and steal the finest jewelry – all to finance their hedonistic lifestyles. That is until a lucrative museum heist […]"},{"link":"https://nmac.to/blog/hard-west/","image":"https://nmac.to/wp-content/uploads/2016/03/Hard-West1.png","title":"Hard West 1.5 – Fight and survive through turn-based combat missions","content":"Welcome to the Wild West like you’ve never seen it before. When a tragic turn of events sets one man down a path of supernatural chaos and revenge, he must brutally hunt down all those who wronged him. Follow Warren on his descent into the darkest recesses of the human soul, and try to survive […]"},{"link":"https://nmac.to/blog/movie-explorer/","image":"https://nmac.to/wp-content/uploads/2018/12/Movie-Explorer2.png","title":"Movie Explorer 2.0.2 – Movie and TV show catalog app","content":"Movie Explorer scans all your internal, external and network drives for digital movie files like MKV, M4V, AVI and MP4 and saves them in a movie catalog for off line browsing and searching. The app can be used as a convenient starting point for playing your movie files by using the ‘Play’ and ‘Play with’ […]"}]