[{"link":"https://nmac.to/blog/m4v-converter-4-1-0/","image":"https://nmac.to/wp-content/uploads/2015/06/M4VConverter.png","title":"M4V Converter 4.1.0 – Convert M4V files to a variety of formats","content":"M4V Converter is Powerful M4V video format converter which can convert purchased m4v videos to QuickTime MOV, MP4, iPod, iPhone, AppleTV, or audio format in high speed and great quality. It has been designed for ripping DRM M4V to unprotected formats. It can also convert any video on your iTunes libary. Kigo M4V converter supports […]"},{"link":"https://nmac.to/blog/flip4mac-wmv-studio-pro-hd-3-3-5-6/","image":"https://nmac.to/wp-content/uploads/2015/06/Flip4Mac.Studio.Pro_.HD_.png","title":"Flip4Mac WMV Studio Pro HD 3.3.5.6 – Import and playback WMV in QuickTime","content":"Flip4Mac WMV Studio Pro HD lets you import, export and play Windows Media file in QuickTime applications.   WMV Player Features: Playback Windows Media Video 7,8,9 SD and HD, and Windows Media Video 9 Advanced in QuickTime Player directly WMV Player Pro Features: Import Windows Media Video 7,8,9 and Windows Media Video 9 Advanced Convert […]"},{"link":"https://nmac.to/blog/cognition-an-erica-reed-thriller/","image":"https://nmac.to/wp-content/uploads/2015/06/Cognition.An_.Erica_.Reed_.Thriller.png","title":"Cognition: An Erica Reed Thriller 1.0 – Adventure and murder investigation game","content":"FBI agent Erica Reed has an uncanny talent: she can see the past and piece together how a crime unfolded. But not even this sixth sense could save her younger brother, Scott, from a brutal serial killer. Three years later, the investigation into Scott’s murder has gone cold — but Erica’s work has only just […]"},{"link":"https://nmac.to/blog/subtitles-3-0-2/","image":"https://nmac.to/wp-content/uploads/2015/03/Subtitles.png","title":"Subtitles 3.0.2 – Automatically downloads subtitles for your movies and TV shows","content":"Subtitles App is the easiest way to download subtitles, Just drop your videos into Subtitles and let it do its magic. It doesn’t matter if the files don’t have the right name or the format they’re in, Subtitles will always find the right subtitles for your movies and TV shows.   Automatically finds subtitles Just […]"},{"link":"https://nmac.to/blog/snapheal-pro-1-4/","image":"https://nmac.to/wp-content/uploads/2013/12/Snapheal-Pro.png","title":"Snapheal Pro 1.4 – Professional-quality image enhancement utility","content":"SnapHeal Pro offers a fast and easy way to enhance and remove objects from photos.    Features: Easily erase unwanted objects Quickly and easily remove distracting objects like wires, people, signs, scratches, and more to make your favorite images better. Proprietary CleanPics technology Get our most powerful engine ever for removing unwanted objects, skin blemishes, […]"},{"link":"https://nmac.to/blog/radium-3-1-2/","image":"https://nmac.to/wp-content/uploads/2014/03/Radium.png","title":"Radium 3.1.2 – Multi-network radio player","content":"Radium is an Internet radio player that’s designed from the ground up to be simple, intuitive, and lightweight. With its powerful search, thousands of supported stations (including Sirius/XM and DI.fm/Sky.fm Premium), and the ability to add your own streams, Radium will change the way you listen to Internet radio.   Version 3.1.2: Album art is […]"},{"link":"https://nmac.to/blog/mailbar-1-2-5/","image":"https://nmac.to/wp-content/uploads/2015/02/MailBar.png","title":"MailBar 1.2.5 – Manage your Mail.app inbox from the menu bar","content":"MailBar enables you to check your inbox and manage your emails directly from your Mac’s status bar.   The light and discreet application is designed to run in the background and display the number of new emails next to its menu bar icon. Thanks to MailBar, you can monitor and manage up to four different […]"},{"link":"https://nmac.to/blog/entry-1-0/","image":"https://nmac.to/wp-content/uploads/2015/06/Entry.png","title":"Entry 1.0 – easily join a Google Hangout attached to an event created with Google Calendar","content":"Entry allows you to easily join a Google Hangout attached to an event created with Google Calendar. No need to open each meeting in the Google Calendar web interface to use the Hangout link anymore! Upcoming Hangouts are available quickly from the Mac menu bar. Joining any scheduled Hangout becomes as easy as one click. […]"},{"link":"https://nmac.to/blog/current-for-facebook-1-1/","image":"https://nmac.to/wp-content/uploads/2015/01/Current-for-Facebook.png","title":"Current for Facebook 1.1 – Bring Facebook To The Mac Desktop","content":"Current offers THE BEST way to message and browse on Facebook with your Mac! With Current, you can Facebook message friends in their own chat windows and quickly access your inbox, notifications, and online friends right from the menu bar.   Current isn’t just a messaging app. It’s a complete replacement for using Facebook in […]"},{"link":"https://nmac.to/blog/iteleport-6-1-8/","image":"https://nmac.to/wp-content/uploads/2015/06/iTeleport.png","title":"iTeleport 6.1.8 – Access your Mac from anywhere in the world","content":"iTeleport is a magical app that lets you access your computer from anywhere in the world.   Supports Mac, Windows, Linux, and all VNC servers. See your computer screen and control its keyboard/mouse from anywhere: a few feet away, or halfway around the world.   Teleport yourself to your computer from anywhere in the world. […]"}]