[{"link":"https://nmac.to/blog/desktop-groups-v13-group-related-files/","image":"https://nmac.to/wp-content/uploads/2013/12/group1.png","title":"Desktop Groups 1.3 – Group related files on your desktop","content":"Desktop Groups keeps the chaos off of your desktop. Keep related files in groups.The app lets you create groups of related files on your desktop. You can freely move groups of files around on your desktop and add or remove files via drag & drop.   Each group has a title so that you can […]"},{"link":"https://nmac.to/blog/dejumble-v231-create-and-organize-tasks/","image":"https://nmac.to/wp-content/uploads/2013/12/dejumble.png","title":"Dejumble v2.3.1 – Create and organize tasks in the menubar","content":"Dejumble offers a fast and simple way to create and organize tasks and notes. It sits nicely in the menubar for easy access, so tasks are presented in an efficient way without interrupting the users workflow.Dejumble offers keyword tagging for additional categorization of large lists. Users may easily search by title or keyword tags with […]"},{"link":"https://nmac.to/blog/coursenotes-v302-take-notes-during/","image":"https://nmac.to/wp-content/uploads/2013/12/coursenotes.png","title":"CourseNotes v3.0.2 – Take notes during classes or meetings","content":"CourseNotes lets you take notes during classes or meetings, and keep them organized by subject! Review your notes later and search through multiple class meetings and notes all at once. You can also keep ToDo lists and track assignments. CourseNotes for Mac also syncs over WiFi with CourseNotes for the iPad, so you can take […]"},{"link":"https://nmac.to/blog/mango-irc-v205-chat-client/","image":"https://nmac.to/wp-content/uploads/2013/12/mango5.png","title":"Mango IRC v2.0.5 – Chat client","content":"Internet Relay Chat (IRC) is a form of real-time Internet text messaging (chat) or synchronous conferencing. It is mainly designed for group communication in discussion forums, called channels, but also allows one-to-one communication via private messages.Mango IRC is a completely redesigned chat client for your Mac OS X and with Mango IRC and Mango IRC […]"},{"link":"https://nmac.to/blog/free-v103-clean-and-clutter-free-text/","image":"https://nmac.to/wp-content/uploads/2013/12/FreeIcon.png","title":"Free v1.0.3 – Clean and clutter-free text editor","content":"Free is all you need to write. Truly write. Simple. Uncluttered. Sophisticated. Dropbox enabled. Retina-aware. “Less is more”, as minimalist architect Mies van der Rohe says. Not only is this aphorism true in architecture, it’s true in writing as well. No mess, no fuss. With All you need to write. Truly write., you don’t need to […]"},{"link":"https://nmac.to/blog/egis-v107-visualizes-all-connections/","image":"https://nmac.to/wp-content/uploads/2013/12/Egis1.png","title":"Egis v1.0.7 – Visualizes all connections established","content":"Egis works like Zeus’ shield: it visualizes all connections established in your Mac so that you always know the sites your app is connected. If you think an app is suspicious, you can terminate it with one-click. Highlights: – List all established connections.– List all listening connections.– TCP and UDP support.– IPv4 and IPv6 support. […]"},{"link":"https://nmac.to/blog/wi-fi-crack-v103-os-x-gui-for-aircrack/","image":"https://nmac.to/wp-content/uploads/2013/12/wificrack.png","title":"Wi-Fi Crack v1.03 – OS X GUI for Aircrack-NG","content":"Wi-Fi Crack is a GUI for the Aircrack-ng wireless security cracking command-line tool. With KisMac broken since OS X 10.7, most Mac users don’t wanna reboot to a Linux distro just for one command-line tool that’s available through MacPorts. Wi-Fi Crack gives you a GUI to select the command-line arguments that you normally type to […]"},{"link":"https://nmac.to/blog/pandabar-v128-play-pandora-music-from/","image":"https://nmac.to/wp-content/uploads/2013/12/panda_app_icons1.png","title":"PandaBar v1.2.8 – Play Pandora music from the menu bar","content":"PandaBar is a native Mac app that lets you play and control your Pandora radio stations from the comfort of your Mac OS menu bar. – Control song playback (play/pause/next song) – Give your songs thumbs up/down ratings – All the radio stations you’ve created on Pandora.com can be played directly from PandaBar – Global […]"},{"link":"https://nmac.to/blog/osxfuse-v254-extend-native-file/","image":"https://nmac.to/wp-content/uploads/2013/12/498a.png","title":"OSXFUSE v2.5.4 – Extend native file-handling in Mac OS X","content":"OSXFUSE allows you to extend Mac OS X’s native file handling capabilities via third-party file systems. It is a successor to MacFUSE, which is no longer being maintained.  As a user, installing the OSXFUSE software package will let you use any third-party file system written atop OSXFUSE or MacFUSE, if you choose to install the […]"},{"link":"https://nmac.to/blog/icon-creator-v10-icns-and-iconset/","image":"https://nmac.to/wp-content/uploads/2013/12/icon22.png","title":"Icon Creator v1.0 – ICNS and IconSet Composer","content":"Icon Creator for Developers using Xcode to build their Mac OS X and iOS apps. Since original Icon Composer has been removed from the latest versions of Xcode, many developers are missing it. So here is the new Icon Composer, the Icon Creator. It supports OS X and iOS icons for both Regular and Retina […]"}]