[{"link":"https://nmac.to/blog/dateline-1-4-1/","image":"https://nmac.to/wp-content/uploads/2013/12/mzi.ksyxpndn.175x175-75.jpg","title":"DateLine 1.4.1 – Desktop calendar with access to iCal","content":"DateLine is a small, simple app which displays a linear calendar on your desktop in a transparent window. It provides easy access to iCal by double clicking on a day. The background element colour is customisable with support for transparency. WHAT’S NEW Version 1.4.1: Bugfixes: Prevented iCal from launching at DateLine startup Removed Desktop Icons […]"},{"link":"https://nmac.to/blog/keycard-v1-2/","image":"https://nmac.to/wp-content/uploads/2013/12/Keycard.175x175-75.png","title":"Keycard v1.2 – Secure your Mac with an iOS device","content":"Keycard is undoubtedly the easiest way to keep your Mac secure when you’re not around. Using Bluetooth®, Keycard locks your Mac using your iOS device when it detects you are leaving your computer. When you come back, it unlocks it for you. Leaving your desk for 10 minutes? Grabbing a coffee in the library? Take your […]"},{"link":"https://nmac.to/blog/dailydo-v1-2-8/","image":"https://nmac.to/wp-content/uploads/2013/12/DailyDo.175x175-751.jpg","title":"DailyDo v1.2.8 – Simple task manager","content":"DailyDo is your answer to other complex and expensive todo apps. DailyDo brings you a fantastic todo and task manager. You can write your tasks on the beautiful notepad. When you are done just check the box and your tasks will appear on menu bar with Todo Pad. Todo Pad is an easy way to […]"},{"link":"https://nmac.to/blog/antetype-v1-2-0/","image":"https://nmac.to/wp-content/uploads/2013/12/36837.jpg","title":"Antetype v1.2.0 – Interface design tool","content":"Antetype UI designer is a brand new, ground-breaking design application that supports user-interface designers at every step of their work. Design beautiful interfaces, invent new widgets, style them, and put it all together in an interactive prototype!   Features: Multiple Looks and Feels: Looks and feels are stored globally in the shared library and can […]"},{"link":"https://nmac.to/blog/spotify-v0-9-0-117/","image":"https://nmac.to/wp-content/uploads/2013/12/330331.jpg","title":"Spotify v0.9.0.117 – Stream music, create playlists and more","content":"Spotify is a new way to enjoy music. Simply download and install, before you know it you’ll be singing along to the genre, artist or song of your choice. With Spotify you are never far away from the song you want. There are no restrictions in terms of what you can listen to or when. Forget […]"},{"link":"https://nmac.to/blog/fake-1-8-9-1/","image":"https://nmac.to/wp-content/uploads/2013/12/34438.jpg","title":"Fake 1.8.9.1 – Browser that simplifies Web automation","content":"Fake is a new browser for Mac OS X that makes web automation simple. Fake allows you to drag discrete browser Actions into a graphical Workflow that can be run again and again without human interaction. The Fake Workflows you create can be saved, reopened, and shared.   Inspired by Apple’s Automator application, Fake looks […]"},{"link":"https://nmac.to/blog/movie-chapterizer-5-1/","image":"https://nmac.to/wp-content/uploads/2013/12/233221.png","title":"Movie Chapterizer v5.1 – Add chapter names to your movies","content":"MovieChapterizer provides an easy way to add chapter names into movies you can view with QuickTime Player. Use MovieChapterizer to add chapter names to numerous points in your movies by simply moving the playhead slider and entering chapter names wherever you want. Then open the movie in QuickTime Player and the chapter popup button allows you […]"},{"link":"https://nmac.to/blog/spotlife-1-0-5/","image":"https://nmac.to/wp-content/uploads/2013/12/DesktopCalApp.175x175-751.jpg","title":"Spotlife 1.0.5 – Desktop-based calendar viewer","content":"Spotlife is the fastest, easiest way to view the important happenings in your life.   Spotlife puts your calendar directly on your desktop, so it’s always available to you. Press a keyboard shortcut at any time from any application, and the Desktop Calendar will zoom forward above all other windows — now you’ll truly be […]"},{"link":"https://nmac.to/blog/scania-truck-driving-simulator/","image":"https://nmac.to/wp-content/uploads/2013/04/Scania-Truck-Driving-Simulator.png","title":"Scania Truck Driving Simulator 1.5.2 – Highly detailed Scania R-series simulation","content":"Get behind the wheel of one of the most iconic trucks on the road with this highly detailed Scania R-series simulation. Simulation reality is pushed to the extreme, in this unique mix of video game and simulation, designed to have mass appeal to anyone who loves trucking!   The simulation features a beautifully 3D rendered […]"},{"link":"https://nmac.to/blog/robopostman-1-2-4/","image":"https://nmac.to/wp-content/uploads/2013/12/RoboPostman.175x175-75.jpg","title":"RoboPostman 1.2.4 – Simplify the process of customizing email messages","content":"RoboPostman lets you create a personal look and feel to every message you send out, without the extra effort! RoboPostman allows you to custom tailor messages to include dynamic content specific to each recipient. Include birthdays, custom notes, links with rotating affiliate codes, and more. Use the “Visual” editor to create brilliant messages with fonts, […]"}]