[{"link":"https://nmac.to/blog/fileunhider/","image":"https://nmac.to/wp-content/uploads/2020/12/FileUnhider.png","title":"FileUnhider 3.0 – Quickly show hidden files","content":"FileUnhider allows you to show and hide files. Do you simply want to be able to see all your hidden files without the fuss of going through Terminal? Do you want to be able to do it with a single click? Or–even better–with a single… keyboard shortcut? Look no further!   Easy-to-use FileUnhider sleeps unobtrusively […]"},{"link":"https://nmac.to/blog/passpartout-the-starving-artist/","image":"https://nmac.to/wp-content/uploads/2020/12/Passpartout-The-Starving-Artist.png","title":"Passpartout: The Starving Artist 1.7.2 – Experience the life of a starving artist!","content":"Passpartout puts you into the shoes of a French artist trying to navigate the beautifully confusing art scene. Paint and sell your own art to survive your expensive wine and baguette addiction.   Features Paint your own masterpieces! Even you can become the next Van Gogh! Battle with subjectivity and try to charm a variety […]"},{"link":"https://nmac.to/blog/chuchu-rocket-universe/","image":"https://nmac.to/wp-content/uploads/2020/12/ChuChu-Rocket-Universe.png","title":"ChuChu Rocket Universe 1.2.1 – A Mind Blowing 3D Puzzle Game","content":"ChuChu Rocket! is back. Enjoy the revived SEGA hit game as it scurries its way into a series of mind-blowing 3D puzzles. With a quirky art style, cat and mouse pathfinding puzzles, and a universe full of strange and wonderful planets to explore and solve, ChuChu Rocket! Universe is a whole new take on the […]"},{"link":"https://nmac.to/blog/the-collage-atlas/","image":"https://nmac.to/wp-content/uploads/2020/12/The-Collage-Atlas.png","title":"The Collage Atlas 1.0.3 – A Unique Pen & Ink Adventure","content":"The Collage Atlas invites you on a journey through an entirely hand-drawn picture-book dream-world.   From the grass beneath your feet, to the butterflies dancing in the air, to the floating islands drifting overhead – every little detail has been lovingly-crafted with pen & ink on paper.   The result is a world the likes […]"},{"link":"https://nmac.to/blog/fledgling-heroes/","image":"https://nmac.to/wp-content/uploads/2020/12/Fledgling-Heroes.png","title":"Fledgling Heroes 1.1.0563 – Takeoff and take on the world","content":"Leap from the nest into a fun-filled adventure! Meet cute feathered friends, each with their own wondrous story to tell, as they dodge dastardly pirate lizARRrds, dash through frozen forests, dive under sunken temples, and flap their way from fledglings to a fully-fledged heroes!   It’s dangerous to go alone – play with a friend! […]"},{"link":"https://nmac.to/blog/super-impossible-road/","image":"https://nmac.to/wp-content/uploads/2020/12/Super-Impossible-Road.png","title":"Super Impossible Road 1.3.2 – Winning is Cheating","content":"In the future, you’ve got to play a little dirty if you want to win races. Master hairpin turns across dangerous courses that twist and coil over beautiful galactic backdrops. Knock opponents into the void of space. Kick into hyperdrive with temporary speed boosts. And use every opportunity to jump off the paths of the […]"},{"link":"https://nmac.to/blog/kiwi-for-gmail/","image":"https://nmac.to/wp-content/uploads/2016/11/Kiwi-for-Gmail.png","title":"Kiwi for Gmail 2.0.40 – Turns Gmail into a full-powered Desktop client","content":"Kiwi for Gmail (formerly Gmail for Mac) turns Gmail into a full-powered desktop email client. No one wants to use Gmail in the browser on their phone, and we felt they shouldn’t have to on the Mac either. 2 years in the making from a seasoned team with Apple, Bose, and iRobot experience. Like Gmail’s […]"},{"link":"https://nmac.to/blog/icarefone-for-whatsapp-transfer/","image":"https://nmac.to/wp-content/uploads/2020/08/iCareFone-for-WhatsApp-Transfer.png","title":"iCareFone for WhatsApp Transfer 2.5.0 – WhatsApp Transfer, Back up & Restore","content":"The Quickest Way to Transfer, Backup & Restore Your WhatsApp Data Easily transfer WhatsApp data from iPhone/iPad to iPad/iPhone. Simply move WhatsApp data from Android to Android. Flexibly transfer WhatsApp from Android to iPhone or from iPhone to Android. Quickly back up & Restore WhatsApp, Kik, LINE, Viber and WeChat on Mac with ease. Fully […]"},{"link":"https://nmac.to/blog/base64-coder/","image":"https://nmac.to/wp-content/uploads/2020/12/Base64-Coder.png","title":"Base64 Coder 2.1.0 – Convert files to a Base64 format","content":"Base64 Coder is a fast and easy converter files to a Base64 format.   Features: Fast work; Automatically string copy; Drag & Drop; MIME prefix support; Save result to file; Result formatting   Version 2.1.0: Apple Silicon support   Intel, 64-bit processor OS X 10.10 or later    "},{"link":"https://nmac.to/blog/photo-editor-movavi/","image":"https://nmac.to/wp-content/uploads/2016/01/Photo.Editor.Movavi.png","title":"Photo Editor Movavi 6.7.1 – Remove Objects & Enhance","content":"Photo Editor Movavi is the fastest way to turn good photos into spectacular shots. Remove any unnecessary element from your images, improve quality, and edit your photos in just a few easy steps.   Easily remove random bystanders, inconvenient fences and ugly power lines from your travel panoramas with a single action: just select the […]"}]