[{"link":"https://nmac.to/blog/vexlio/","image":"https://nmac.to/wp-content/uploads/2017/09/Vexlio.png","title":"Vexlio 1.1.2 – Intelligent technical diagrams sketcher","content":"Vexlio’s lightning-fast and precise diagramming with native LaTeX equation editing, a Lua-based “program mode,” a powerful auto-snapping system, a “prefab” shape library and much more, now on your Mac.   SNAPPING Automatic snapping guides eliminate guesswork, and allow you to easily align objects in your diagrams. Spend more time illustrating your content rather than worrying […]"},{"link":"https://nmac.to/blog/minecraft-story-mode/","image":"https://nmac.to/wp-content/uploads/2016/09/Minecraft-Story-Mode-s2.png","title":"Minecraft: Story Mode – S2 Ep 3 1.0.390 – The adventure of a lifetime in the world of Minecraft","content":"Now that Jesse and the gang have vanquished the Wither Storm, saved the world, and become totally super famous heroes, life has gotten a bit more…complicated. With more responsibilities and less time for adventure, old friendships have started to fade — at least until Jesse’s hand gets stuck in a creepy gauntlet that belongs to […]"},{"link":"https://nmac.to/blog/orion-flyer-maker-pro/","image":"https://nmac.to/wp-content/uploads/2016/11/Orion-Flyer-Maker-Pro.png","title":"Orion Flyer Maker Pro 3.10 – Drag-and-drop flyer design","content":"Orion Flyer Maker lets you create beautiful, professional-looking flyers in minutes!   Features True drag-and-drop editor allows you to easily add text box, photos, tear-away strips, table grids, shapes, lines, and arrows Comes with dozens of professionally designed flyer templates Over 500 gorgeous colors and shades to choose from Hundreds of font styles Freeform layout […]"},{"link":"https://nmac.to/blog/bp-business-card-designer/","image":"https://nmac.to/wp-content/uploads/2016/12/Blue-Penguin-Business-Card-Designer.png","title":"BP Business Card Designer 3.0 – Design and print your own business cards","content":"BP Business Card Designer features an easy-to-use drag-and-drop designer, with multiple print modes, beautiful templates, and tons of formatting options.   Features Drag-and-drop to add text, company logos, photos and shapes Easily adjust font style, font size, colors, and background colors Supports home printing within the app, as well as export to high-resolution image format […]"},{"link":"https://nmac.to/blog/orion-greeting-card-designer/","image":"https://nmac.to/wp-content/uploads/2017/01/Orion-Greeting-Card-Designer.png","title":"Orion Greeting Card Designer 3.0 – Design and print folded greeting cards","content":"Orion Greeting Card Designer lets you design and print beautiful folded greeting cards!   Features Print and fold them however you like – supports half fold and quarter fold cards; supports both vertical oriented as well as horizontal oriented folding cards Easy to personalize and format – intuitive drag-and-drop designer; simple and gorgeous special effects […]"},{"link":"https://nmac.to/blog/xcom-2/","image":"https://nmac.to/wp-content/uploads/2017/09/XCOM.2.png","title":"XCOM 2 1.0 – Aliens Turn-Based, Strategy & Tactical Game","content":"XCOM 2 is the sequel to XCOM: Enemy Unknown, the 2012 award-winning strategy game of the year.   Earth has changed. Twenty years have passed since world leaders offered an unconditional surrender to alien forces. XCOM, the planet’s last line of defense, was left decimated and scattered. Now, in XCOM 2, the aliens rule Earth, […]"},{"link":"https://nmac.to/blog/linkbuilder/","image":"https://nmac.to/wp-content/uploads/2017/09/LinkBuilder.png","title":"LinkBuilder 2.1 – Helps you generate PayPal payment URL links","content":"Need to email customers a PayPal payment link on a regular basis? Do you find manually stringing together complex URL parameters a chore? Link Builder is for you!   Link Builder is a time-saving utility designed to take the blood, sweat and tears out of generating PayPal payment links, especially for use in emails.   […]"},{"link":"https://nmac.to/blog/pixate-studio/","image":"https://nmac.to/wp-content/uploads/2015/04/Pixate.Studio.png","title":"Pixate Studio 2.0.1 – The next generation of mobile interaction design","content":"Pixate empowers you to create sophisticated animations and interactions that come to life through 100% real, native iOS and Android prototypes—from design to prototype, without the code.   With Pixate, building prototypes is simple and visual No complex animation frameworks. No clunky simulation tools. Simply an intuitive design tool that empowers you to communicate and […]"},{"link":"https://nmac.to/blog/library-inspector/","image":"https://nmac.to/wp-content/uploads/2017/09/Library-Inspector.png","title":"Library Inspector 2.1 – Inspect the contents of compiled object code","content":"Library Inspector is a simple tool for inspecting the contents of compiled object code, archives, dynamic libraries (dylib), frameworks and applications. There are two main components, the Library Inspector application, and the Library Inspector Quick Look plugin. Quickly display local and exported symbols using colors to visually represent the type of symbol. Flexible filtering search […]"},{"link":"https://nmac.to/blog/trytomp3/","image":"https://nmac.to/wp-content/uploads/2016/07/TryToMp3.png","title":"TryToMp3 4.1.0 – Convert other format to MP3","content":"TryToMp3 which makes It’s easy and smart to try convert other format to MP3.   Features   support some popular audio format like: 8SVX exponential 8SVX fibonacci AAC+ AAC AC-3s ADPCM 4X Movie ADPCM CDROM XA ADPCM Creative Technology ADPCM Electronic Arts ADPCM Electronic Arts Maxis CDROM XS ADPCM Electronic Arts R1 ADPCM Electronic Arts […]"}]