[{"link":"https://nmac.to/blog/heliborne/","image":"https://nmac.to/wp-content/uploads/2017/10/heliborne.png","title":"Heliborne 1.0 – Tactical Flight Combat Game","content":"Get behind the cockpits of the best helicopters in the world – from the classic machines of the 1950s to the modern gunships of the 21st century. Play missions with your friends and compete with players from all around the world in various multiplayer modes! You will be able to take part in a dynamic […]"},{"link":"https://nmac.to/blog/tap/","image":"https://nmac.to/wp-content/uploads/2016/10/Tap.png","title":"Tap 1.5.11 – Just Tap and make your Mac secured","content":"Tap is unique, interesting unlock utility.   You can unlock your Mac using multi-touch and drawing simple gestures on Trackpad or Magic Trackpad.   The number of finger becomes a character of password.   Also you can draw gesture and it also becomes a character of password.   One gesture = A character of password. […]"},{"link":"https://nmac.to/blog/timerik/","image":"https://nmac.to/wp-content/uploads/2017/02/Timerik.png","title":"Timerik 1.4.1 – Beautiful app for setting a timer","content":"Timirik is a beautiful, handy and easy to use tool that allows to set a timer for some action.   Features: Small and huge at the same time Quick set up: save a default action and use the +/- 30 min. buttons for time adjusting Automatic installation of the default actions: Shutdown, Restart, Sleep, Log […]"},{"link":"https://nmac.to/blog/sdspeed/","image":"https://nmac.to/wp-content/uploads/2016/12/sdspeed.png","title":"sdspeed 3.2.2 – Verify the integrity of an SD card or USB device","content":"sdspeed lets you verify the integrity of a flash SD card or USB device. You can test not only SD (secure digital) cards, but also USB flash drives, even hard drives that are connected via USB. It also provides benchmarks, such as the speed of a memory card, an SD card speed test, a flash […]"},{"link":"https://nmac.to/blog/liquid-database/","image":"https://nmac.to/wp-content/uploads/2017/08/Liquid-Database.png","title":"Liquid Database 1.10 – Manage your collection of liquids","content":"Liquid Database helps you manage your personal collection of liquids (liquid receipts), flavours, bases and distributors and keep track of your storage. Just enter your flavours, bases, and distributors once, and use them to manage your liquids and your personal liquid receipts. For each item, you can store additional information, such as up to 5 […]"},{"link":"https://nmac.to/blog/wordweb-pro/","image":"https://nmac.to/wp-content/uploads/2017/10/WordWeb-Pro.png","title":"WordWeb Pro 3.5 – Comprehensive thesaurus and dictionary","content":"WordWeb Pro is a comprehensive international English thesaurus and dictionary, with definitions, synonyms and many related words. It includes pronunciations and usage examples, and has helpful spelling and sounds-like links. WordWeb does much more than a paper dictionary or thesaurus: WordWeb is truly a Word Web – each definition is linked to sets other related […]"},{"link":"https://nmac.to/blog/music-tag/","image":"https://nmac.to/wp-content/uploads/2017/10/Music-Tag.png","title":"Music Tag 2.07 – Automatic MP3 tagger and tag editor","content":"Music Tag analyzes your music library and downloads missing artwork and track data directly to your music files. It is not uncommon to have music files with missing or incomplete tag data. It can often make identifying tracks harder especially as media players use this data to apply sorting and group tracks by artist, album […]"},{"link":"https://nmac.to/blog/disk-cleaner-movavi/","image":"https://nmac.to/wp-content/uploads/2017/10/Disk-Cleaner-Movavi.png","title":"Disk Cleaner Movavi 1.0 – Delete Duplicates & Big Files","content":"Save disk space by getting rid of large and/or duplicate files!   Large, old, and duplicate files stored on your Mac often take up the most space and, over the course of time, they can significantly slow down your system.   Disk Cleaner Movavi lets you clean your Mac of duplicates and oversize files, so […]"},{"link":"https://nmac.to/blog/dm1/","image":"https://nmac.to/wp-content/uploads/2017/09/DM13.png","title":"DM1 3.1 – Advanced drum machine","content":"DM1 is an advanced Drum Machine. It turns your computer into a fun and creative beat making machine. Easy and fast to use, loaded with 86 superb electronic drum kits and beautiful hyper-realistic graphics, DM1 has been designed for a lot of instant fun.   With Midi In & out, DM1 is ready to fit […]"},{"link":"https://nmac.to/blog/project-nimbus/","image":"https://nmac.to/wp-content/uploads/2017/10/Project-Nimbus.png","title":"Project Nimbus 1.0 – A high speed mech action game","content":"Project Nimbus is a high speed mech action game set in a post apocalyptic world. Players control ‘BattleFrames’ – humanoid battles suits armed with an arsenal of weapons.   This is a mech game that lets you fly freely in the sky, dodge and intercept incoming missiles with machine guns, fight armies of hostiles with […]"}]