[{"link":"https://nmac.to/blog/x-mirage-1-05-2/","image":"https://nmac.to/wp-content/uploads/2014/04/X-Mirage.png","title":"X-Mirage 1.05.2 – Mirror your iOS devices on your Mac","content":"X-Mirage allows users to wirelessly mirror iOS devices on a Mac using AirPlay. X-Mirage supports mirroring multiple iOS devices to one Mac, as well as the ability to record the mirrored devices’ screens.   Version 1.05.2: Fix the audio-out-of-sync issue in recorded videos   Intel OS X 10.6 or later iPhone 4S (or later), iPad […]"},{"link":"https://nmac.to/blog/writer-pro-1-1-1/","image":"https://nmac.to/wp-content/uploads/2014/01/Writer-Pro.png","title":"Writer Pro 1.1.1 – Professional writing suite","content":"Writer Pro is a professional writing suite that gives you full control over your notes, drafts and edits.    Workflow: Note – Write – Edit – Read. Each stage has a task-specific typeface and color. Syntax Control scans the syntax of English, French, German, Italian, and Spanish text and highlights your adjectives, nouns, verbs, adverbs, […]"},{"link":"https://nmac.to/blog/lens-blur-1-2-0/","image":"https://nmac.to/wp-content/uploads/2014/04/LensBlur.png","title":"Lens Blur 1.2.0 – True out-of-focus bokeh lens effect","content":"Let Lens Blur transform your existing photo into true SLR-quality out-of-focus bokeh effect! Everyone needs a gorgeous personalized background for a social profile, blog, Web/UI design, presentation, or wallpaper, right? So equip yourself with this easy-to-use app and transform your photos with this blurred effect!   Bokeh is the pleasing or aesthetic quality of out-of-focus […]"},{"link":"https://nmac.to/blog/moneywiz-1-5-5/","image":"https://nmac.to/wp-content/uploads/2014/01/MoneyWiz.png","title":"MoneyWiz 1.5.5 – Personal finance solution","content":"MoneyWiz lets you do more with your money. View all your accounts, budgets and bills in one place. Experience reports on a whole new level. Sync Everything across devices!   Meet MoneyWiz – the personal finance assistant that just works!   HOW IS MONEYWIZ BETTER? Automatically keeps data consistent across multiple devices Gives you beautiful […]"},{"link":"https://nmac.to/blog/ghostlab-1-2-4/","image":"https://nmac.to/wp-content/uploads/2014/04/Ghostlab.png","title":"Ghostlab 1.2.4 – Synchronized testing for web and mobile","content":"Whether you want it or not, your site is going mobile – every day. Use Ghostlab to make sure all your users get the same neat experience – whatever operating system, browser or smart phone they are using.   Ghostlab synchronizes scrolls, clicks, reloads and form input across all connected clients. This means what you’re […]"},{"link":"https://nmac.to/blog/film-noir-1-3-2/","image":"https://nmac.to/wp-content/uploads/2014/04/Film-Noir.png","title":"Film Noir 1.3.2 – Professional looking black & white photos","content":"When photography was first introduced, the photographers had to shoot black and white photos, simply because technology didn’t allow them to do color photography yet. Then, as color photography was invented in the 30’s, black and white photography became a form of art, with a large following. Film Noir photography is a style of photography […]"},{"link":"https://nmac.to/blog/filmconvert-pro-1-216/","image":"https://nmac.to/wp-content/uploads/2014/04/FilmConvert.png","title":"FilmConvert Pro 1.216 – The best Film Stock Emulator you’ve ever seen","content":"FilmConvert Pro Gives Digital camera footage the color and grain of your favorite film stocks   What is FilmConvert?   Ever since the introduction of Digital Cameras, digital evangelists have been saying how Film would eventually be superceeded and replaced. After several decades, this is finally happening. However, for many people, the look of the […]"},{"link":"https://nmac.to/blog/xilisoft-video-cutter-2-0-1/","image":"https://nmac.to/wp-content/uploads/2014/04/Xilisoft-Video-Cutter.png","title":"Xilisoft Video Cutter 2.0.1 – The easiest video cutter software","content":"Xilisoft Video Cutter is making video editing simple for everyone to create and share amazing movies. With one-click video-cutting software, friendly interface and fast processing capabilities, you can cut any video clips and turn them into polished movies in just minutes.   Almost all popular video formats are applicable, including AVI, MPEG, WMV, MP4, FLV, […]"},{"link":"https://nmac.to/blog/videomark-2-0/","image":"https://nmac.to/wp-content/uploads/2014/04/VideoMark.png","title":"VideoMark 2.0 – Easily add watermarks to your videos","content":"VideoMark is a fully-featured yet easy-to-use video and movie watermark software which can be used to overlay a digital watermark for video protection or placing a logo for branding your products. VideoMark is the only viable and affordable watermarking solution on the Mac operating system.   VideoMark can help you easily add simple text or […]"},{"link":"https://nmac.to/blog/videobox-4-0-6/","image":"https://nmac.to/wp-content/uploads/2014/04/Videobox.png","title":"Videobox 4.0.6 – Download Flash video through your browser","content":"Videobox allows you to quickly and easily download Flash video from most all of the popular video sites on the internet. Videobox will convert the video into a native Quicktime format so it’s ready to view on your Mac, iPod, iPhone or iTunes.   Version 4.0.6: [NEW] Videobox will now detect all youtube embedded videos. […]"}]