[{"link":"https://nmac.to/blog/investoscope-2-3-6/","image":"https://nmac.to/wp-content/uploads/2014/02/Investoscope.png","title":"Investoscope 2.3.6 – Portfolio tracker for the individual investor","content":"Investoscope is a portfolio tracker for the individual investor. With a compelling and intuitive one window user interface, Investoscope lets you monitor the performance of your investments in stocks, bonds, mutual funds, and other securities.   FEATURES : Automatically downloads latest quote prices from free sources on the internet. Keep up-to-date with the latest news. […]"},{"link":"https://nmac.to/blog/ibank-5-1-1/","image":"https://nmac.to/wp-content/uploads/2014/02/iBank.png","title":"iBank 5.1.1 – Intuitive personal finance manager, widget available","content":"iBank is a new standard for Mac money management.    With its intuitive user interface and a full set of money management features, iBank 5 is the most complete software available for Mac personal finance. iBank 5 lets you enter and edit your transactions with ease, pay bills online and on time, download your online […]"},{"link":"https://nmac.to/blog/boinxtv-1-9-8/","image":"https://nmac.to/wp-content/uploads/2014/03/BoinxTV.png","title":"BoinxTV 1.9.8 – Live-production software for video podcasters","content":"BoinxTV is the pioneering live-production software for video podcasters that turns any recent Mac into a TV studio “for the rest of us”.   Record stunning studio shows, podcasts, sports events, concerts, interviews, sermons, seminars and more using your Mac, multiple cameras, microphones and other footage. With its innovative user interface, BoinxTV makes it easy […]"},{"link":"https://nmac.to/blog/tublme-1-1/","image":"https://nmac.to/wp-content/uploads/2014/04/Tublme.png","title":"Tublme 1.1 – Beautiful Tumblr desktop client","content":"Tublme is a beautiful and powerful, yet easy-to-use, Tumblr desktop client. It makes browsing Tumblr a whole new experience with its minimalistic approach.   Features: Lists – As in Twitter, a list is a selected group of users. Just add people (you don’t even need to be following them) to a new or existing list […]"},{"link":"https://nmac.to/blog/adobe-speedgrade-cc-2014/","image":"https://nmac.to/wp-content/uploads/2014/06/ADOBE.SPEEDGRADE.CC.png","title":"Adobe SpeedGrade CC 2014 – Color grading software","content":"Adobe SpeedGrade CC lets you deliver balanced color and distinctive, vibrant looks for any type of video production. Grade faster with more connected tools, over a dozen powerful new features, and a redesigned interface that’s both intuitive and familiar for Adobe Premiere Pro users. SpeedGrade CC gives you access to ongoing updates as soon as […]"},{"link":"https://nmac.to/blog/adobe-flash-professional-cc-2014/","image":"https://nmac.to/wp-content/uploads/2014/06/ADOBE-FLASH-PRO-CC.png","title":"Adobe Flash Professional CC 2014 – Creating advanced interactive content","content":"Flash Professional CC lets you share work directly from within the application and get access to new features the moment they’re released. Your entire creative world, together in one place. Work faster than ever before with a 64-bit architecture, a new streamlined user interface, and more connected tools. Create HTML content and export high-definition video […]"},{"link":"https://nmac.to/blog/macaw-1-0-13/","image":"https://nmac.to/wp-content/uploads/2014/04/Macaw1.png","title":"Macaw 1.0.13 – The code-savvy web design tool","content":"Stop writing code. Start drawing it.   Macaw provides the same flexibility as your favorite image editor but also writes semantic HTML and remarkably succinct CSS. It’s time to expect more from a web design tool.   Fluid canvas and grid Macaw is engineered for fluid widths. Resize the canvas and your grids and elements […]"},{"link":"https://nmac.to/blog/clear-1-1-2/","image":"https://nmac.to/wp-content/uploads/2014/05/Clear.png","title":"Clear 1.1.2 – Popular to-do list manager","content":"Clear is the revolutionary to-do and reminders app that makes you more productive. Just start typing to add to-dos, and once you start organizing your life with Clear you’ll wonder how you ever managed without it.   Simple gestural design that allows you to focus on your to-dos. Designed for the Magic Trackpad, but works […]"},{"link":"https://nmac.to/blog/pimp-your-screen-2-0/","image":"https://nmac.to/wp-content/uploads/2014/06/Pimp-Your-Screen.png","title":"Pimp Your Screen 2.0 – Custom desktop wallpapers","content":"Pimp Your Screen is here to customize the look of your desktop by giving you an exclusive selection of specially designed background images and wallpapers arranged in categories. Choose from a variety of minimalistic images, abstract backgrounds and truly unique wallpapers that will bring even more beauty to your Mac. Pimp Your Screen is a […]"},{"link":"https://nmac.to/blog/intermission-1-1-0/","image":"https://nmac.to/wp-content/uploads/2014/03/Intermission.png","title":"Intermission 1.1.0 – Pause and rewind live audio on your Mac","content":"Intermission allows you to pause and rewind live audio from any application on your Mac. Intermission will buffer up to 3 hours of audio, allowing users to skip through any assortment of audio content.   Version 1.1.0: Intermission has been heavily optimized, and its energy usage has been drastically reduced. Mother Earth thanks you for […]"}]