[{"link":"https://nmac.to/blog/emergency-20/","image":"https://nmac.to/wp-content/uploads/2018/04/Emergency20.png","title":"Emergency 20 4.1.0 – An exciting real-time rescue missions","content":"EMERGENCY 20 brings 10 of the best missions from 20 years of EMERGENCY to your PC using current technology! Additionally it features EMERGENCY 5, EMERGENCY 2016 and EMERGENCY 2017 with all the campaigns, multiplayer maps and freeplay modes.   Keep your cool and coordinate rescue workers in exciting real-time missions from an illegal street race […]"},{"link":"https://nmac.to/blog/igif-builder/","image":"https://nmac.to/wp-content/uploads/2018/04/iGIF-Builder.png","title":"iGIF Builder 1.1.6 – Video to GIF Tool","content":"iGIF Builder – Video to GIF Tool, with perfect filters, pretty text layer nesting in GIF. We can create GIF from local video clips, webcam (capture your countenance from camera), screen recording (capture video clips from web playing).   Features & Functionality: Make GIF from Local Video Clips. Make GIF from Camera (Maximum duration 30s). […]"},{"link":"https://nmac.to/blog/file-peek/","image":"https://nmac.to/wp-content/uploads/2018/04/File-Peek.png","title":"File Peek 1.0.3 – Powerful, flexible file editor","content":"File Peek gives you a quick and easy look into your files. Use the built-in hex editor; get MD5, SHA1, and SHA256 hashes, and Base64 with one click; or even change the modification and creation dates. The built-in hex editor supports find/replace for easy modification, or for finding strings inside a file. Use the one-click […]"},{"link":"https://nmac.to/blog/total-adware-doctor/","image":"https://nmac.to/wp-content/uploads/2018/04/Total-Adware-Doctor.png","title":"Total Adware Doctor 1.1.3 – Web browsers cleaning utility","content":"Total Adware Doctor lets you quickly remove all cookies, caches, extensions and reset the home page for all major web browsers. If you have annoying popups or your browser is behaving strangely, you can fix it directly from this app!   Features: Quickly select the cleaning options you want. Support for 4 major web browsers. […]"},{"link":"https://nmac.to/blog/ken-folletts-the-pillars-of-the-earth/","image":"https://nmac.to/wp-content/uploads/2017/08/Ken-Folletts-The-Pillars-of-the-Earth.png","title":"Ken Follett’s The Pillars of the Earth Book 3 1.1.703 – Adventure, Casual & Violent Game","content":"    Based on Ken Follett’s world-bestseller, ‘The Pillars of the Earth’ retells the story of the village of Kingsbridge in a whole new interactive way. Play as Jack, Aliena and Philip and change the events of the book through exploration, decision-making and dialogues. This interactive novel is released in three ‘books’, containing 7 chapters […]"},{"link":"https://nmac.to/blog/pins/","image":"https://nmac.to/wp-content/uploads/2015/12/Pins2.png","title":"Pins 2.1.4 – Simple and elegant bookmark manager","content":"Pins keeps all your bookmarks in one place!    Pins is the easy and beautiful bookmarks manager your Mac: it is the organized, taggable, searchable, syncable, shareable, visual library for all your needs.   With Pins you can: Manage a complete library of bookmarks with folders and tags Have a graphical thumbnail and a preview […]"},{"link":"https://nmac.to/blog/airparrot/","image":"https://nmac.to/wp-content/uploads/2017/01/AirParrot2.png","title":"AirParrot 2.7.3 – Mirror your Mac’s display on your Apple TV","content":"AirParrot delivers a mirroring experience that can’t be matched by built-in AirPlay mirroring. Mirror the entire screen or just a specific application. In most cases, AirParrot is much faster than the native option. It doesn’t distract while adjusting your display settings and mirrors your screen the way you want. Quickly connect and mirror to Apple […]"},{"link":"https://nmac.to/blog/reflector/","image":"https://nmac.to/wp-content/uploads/2017/01/Reflector3.png","title":"Reflector 3.0.2 – AirPlay your iOS device to your Mac","content":"Reflector allows you to AirPlay mirror your iPhone or iPad to your Mac.   Features Easily demo iOS apps on any Mac running OS X Lion using AirPlay Mirroring on iOS 5. Enable an iPhone or iPad wrapper and more. Features? You got ’em. Kick back and play any iOS game on your Mac’s screen. […]"},{"link":"https://nmac.to/blog/labelist/","image":"https://nmac.to/wp-content/uploads/2016/02/Labelist.png","title":"Labelist 10.0.2 – Design and print labels, envelopes, letterheads","content":"Labelist includes everything needed to design and print professional labels, envelopes, and letterhead.   It comes with: hundreds of templates; a stunning collection of matching label, envelope, and letterhead sets; 100+ super-masks; and an amazing collection of artwork.   Labelist is compatible with over 2,500 popular label, DVD/CD label, and envelope stocks including those from […]"},{"link":"https://nmac.to/blog/drifter/","image":"https://nmac.to/wp-content/uploads/2018/04/Drifter.png","title":"Drifter 0.8.4 – Space Simulation & Action Game","content":"Drifter is an open-world sandbox space trading game with a procedurally-generated galaxy 100,000 light years across made up of tens of thousands of star systems to explore and features an original soundtrack by composer Danny Baranowsky. Take on the role of a spaceship captain attempting to eke out a living among the stars by trading […]"}]