[{"link":"https://nmac.to/blog/juicer-3-90/","image":"https://nmac.to/wp-content/uploads/2013/12/Juicer3_icon_for_mac.png","title":"JUICER 3.90 – Browse, process, preview & convert content","content":"The JUICER is a free media management and conversion utility that supports all current Digital Juice products including all animation, sound effects/music, film/video clips and still graphics. The Juicer lets you browse, preview, search and sort the tens of thousands of clips that make up the Digital Juice media library and then copies and converts […]"},{"link":"https://nmac.to/blog/iphoto-9-5-1/","image":"https://nmac.to/wp-content/uploads/2013/12/NSApplicationIcon.175x175-751.jpg","title":"iPhoto 9.5.1 – Import, edit, and share your photos","content":"iPhoto lets you do more than you ever thought possible with your photos. It gives you easy ways to find, sort, and rediscover your favorites. Simple but powerful editing tools let you turn good shots into magnificent ones. And you can share your photos in all kinds of great ways, including fun slideshows, Facebook, and […]"},{"link":"https://nmac.to/blog/blazevideo-video-converter-pro-2-0-0/","image":"https://nmac.to/wp-content/uploads/2013/12/converter-pro.png","title":"BlazeVideo Video Converter pro 2.0.0 – Convert and Transfer ALL Videos Kinds","content":"BlazeVideo Video Converter Pro offers an ultimate video conversion solution in Mac OS. With BlazeVideo Mac Video Converter , you can easily convert all common video formats into the proper formats like video to MP4, video to 3GP, video to AVI, video to ASF, video to FLV, video to MPG, video to MVA, video to […]"},{"link":"https://nmac.to/blog/radium-3-0-5/","image":"https://nmac.to/wp-content/uploads/2013/12/radium.175x175-75.png","title":"Radium 3.0.5 – Multi-network radio player; supports XM Online, AOL Radio, and more","content":"Radium is an Internet radio player that’s designed from the ground up to be simple, intuitive, and lightweight. With its powerful search, thousands of supported stations (including Sirius/XM and DI.fm/Sky.fm Premium), and the ability to add your own streams, Radium will change the way you listen to Internet radio.   WHAT’S NEW Version 3.0.5: AirPlay […]"},{"link":"https://nmac.to/blog/arcsoft-photo-2-5-90116/","image":"https://nmac.to/wp-content/uploads/2013/12/app.175x175-75.jpg","title":"ArcSoft Photo+ 2.5.90116 – Smart Photo Viewer","content":"Smart Photo Viewer for Mac. Click one photo in Finder to display all photos in the same folder without importing them. Easily browse through photos and zoom photos using track pad gestures or the keyboard. Auto rotate your vertical photos. Crop, rotate and delete your photos while browsing. Easily pick your favorite photos for displaying […]"},{"link":"https://nmac.to/blog/sidewriter-1-2-0/","image":"https://nmac.to/wp-content/uploads/2013/12/SideWriter.png","title":"SideWriter 1.2.0 – Quickly jot down small snippets of text","content":"SideWriter is easily accessible by hiding on the edge of your screen. It slides out as soon as you touch the edge of your screen where it hides.   SideWriter allows you to quickly write down small snippets of text. Or use SideWriter to make notes while working on a project.   SideWriter automatically saves […]"},{"link":"https://nmac.to/blog/you-need-budget-4-3-351/","image":"https://nmac.to/wp-content/uploads/2013/12/You-Need-a-Budget-4.png","title":"You Need a Budget 4.3.351 – Gain Total Control of Your Money","content":"Stop living paycheck to paycheck, get out of debt, and save money faster with YNAB.   Never heard of YNAB?  It’s easy-to-use budget software paired with a powerful methodology. For more info and free live classes, visit: YouNeedABudget.com   Praised across the internet as the “best budgeting software”, You Need A Budget (YNAB) cuts to […]"},{"link":"https://nmac.to/blog/proview-pdf-editor-1-5-1/","image":"https://nmac.to/wp-content/uploads/2013/12/proview.175x175-75.png","title":"Proview PDF Editor 1.5.1 – PDF Editor for Mac OS X","content":"Proview PDF Editor allows you to merge and split files, rotate flip and scale individual pages, or all pages, crop pages and modify the document information. Visual drag and drop preview for adding text Edit page labels for page ranges or individual pages Rearrange PDF pages with drag and drop Drag and drop pages between documents […]"},{"link":"https://nmac.to/blog/grappler-1-0-9/","image":"https://nmac.to/wp-content/uploads/2013/12/36146.png","title":"Grappler 1.0.9 – Download videos and music from anywhere on the web","content":"Use Grappler to download music, videos and more from anywhere on the web. Grappler integrates with iTunes to enable direct downloading from flash, html5, and many other formats of video directly into your library while converting it into the media format of your choice. Download videos into iTunes for future viewing on your iPod, iPhone, […]"},{"link":"https://nmac.to/blog/grappler-1-0-8/","image":"https://nmac.to/wp-content/uploads/2013/12/36146.png","title":"Grappler 1.0.8 – Download videos and music from anywhere on the web","content":"Use Grappler to download music, videos and more from anywhere on the web. Grappler integrates with iTunes to enable direct downloading from flash, html5, and many other formats of video directly into your library while converting it into the media format of your choice. Download videos into iTunes for future viewing on your iPod, iPhone, […]"}]