[{"link":"https://nmac.to/blog/stellar-phoenix-mac-data-recovery-7-0/","image":"https://nmac.to/wp-content/uploads/2015/01/Stellar.Phoenix.Mac_.Data_.Recovery.png","title":"Stellar Phoenix Mac Data Recovery 7.0 – Data Recovery Tool","content":"Stellar Phoenix Mac Data Recovery Software is designed to recover deleted files with original file names, recovers lost data, photo, audio and video files lost due to logical crashes. The software recovers and restores lost data from corrupt, damaged, deleted volumes of Mac OS X hard drive. The optimized fast scanning process finds all files/folders […]"},{"link":"https://nmac.to/blog/seasons-1-1/","image":"https://nmac.to/wp-content/uploads/2015/06/Seasons.png","title":"Seasons 1.1 – A beautiful app to explore, in a fun way, what to watch in TV","content":"Of course you will want to track your favourite TV programmes too and this app will help you a lot on this. But tracking TV programmes is just the beginning: discover it yourself!   (Soon there will be versions for iPad and iPhone too, so you can automatically synchronise between your devices the TV shows […]"},{"link":"https://nmac.to/blog/social-collage-pro-1-3-1/","image":"https://nmac.to/wp-content/uploads/2015/06/SocialCollage.Pro_.png","title":"Social Collage Pro 1.3.1 – for Instagram and Facebook","content":"Create Photo Collages, Posters & Cards from Instagram & Facebook Images. One-click import. 84 beautiful templates.   Social Collage is a fantastic new Mac OS X app that allows you to take images from Instagram, Facebook, or your harddisk and automatically generate collages or life posters out of them.   You have all these great […]"},{"link":"https://nmac.to/blog/iphone-care-pro-2-0-0-1/","image":"https://nmac.to/wp-content/uploads/2015/06/iPhone.Care_.Pro_.png","title":"iPhone Care Pro 2.0.0.1 – Fix all iOS Problems and Tuneup iPhone, iPad and iPod","content":"You can easily transfer files on your iPhone, iPad and iPod to PC for free. Simply connect your device with PC and all the rest can be done within several clicks.   Manage 8 types of files: Contacts, Notes, Calendar, APP, Video, Bookmark, Photo and Music. Directly add items to iOS devices. Detect & delete […]"},{"link":"https://nmac.to/blog/tonality-pro-1-2-0/","image":"https://nmac.to/wp-content/uploads/2014/08/Tonality-Pro.png","title":"Tonality Pro 1.2.0 – Professional-grade monochrome image editor","content":"Tonality Pro gives you the power to create stunning and dramatic black & white images. This is a complete monochrome image editor with more than 150 one-click style presets, totally unique creativity tools, stackable layers, adjustable brushes, RAW file support and so much more will blow you away.   Features: Professional image quality with a […]"},{"link":"https://nmac.to/blog/due-1-4-1/","image":"https://nmac.to/wp-content/uploads/2014/05/Due.png","title":"Due 1.4.1 – Set reminders in your own words","content":"Due lets you type “Make dinner reservation at 9am tomorrow” and your reminder is set for 9 AM tomorrow.    “Cancel subscription in 1 month” and you get a buzz a month later.   Just tell Due in your own words what you’d like to do, and when you’d like to be reminded.   There […]"},{"link":"https://nmac.to/blog/antetype-1-7-1/","image":"https://nmac.to/wp-content/uploads/2014/09/Antetype.png","title":"Antetype 1.7.1 – Interface design tool","content":"Antetype UI designer is a brand new, ground-breaking design application that supports user-interface designers at every step of their work. Design beautiful interfaces, invent new widgets, style them, and put it all together in an interactive prototype!   Features: Multiple Looks and Feels: Looks and feels are stored globally in the shared library and can […]"},{"link":"https://nmac.to/blog/addism-1-2-2/","image":"https://nmac.to/wp-content/uploads/2015/02/Addism.png","title":"Addism 1.2.2 – A great calculator for your Mac.","content":"Addism comes with a clean, intuitive user interface and lots of features.   Addism displays the whole calculation and the result as you are typing, to serve you a complete overview over your calculation.   You can use both mouse as well as your keyboard to calculate. Addism supports keyboard shortcuts for every function.   […]"},{"link":"https://nmac.to/blog/squish-1-0/","image":"https://nmac.to/wp-content/uploads/2015/06/Squish.png","title":"Squish 1.0 – Easily compress and optimize images and photos","content":"Squish is a super-simple app for compressing your images for lower filesize! Don’t lose quality, or end up with grainy or horrible images.   Squish maintains their existing resolution and quality, and just reduces the filesize! Whatever your reason, Squish is great for optimizing images for: Reducing filesize for sending as email attachments. Saving space […]"},{"link":"https://nmac.to/blog/merlin-project-3-0-10/","image":"https://nmac.to/wp-content/uploads/2015/06/Merlin.Project.png","title":"Merlin Project 3.0.10 – Project management software (was Merlin)","content":"Merlin Project is for those of you who are responsible for complex projects. Simple lists of tasks won’t suffice.   Good planning raises questions about the dependencies of activities on each other, the impact of delays on the project completion date, and budget planning. Here, a spreadsheet quickly runs up against its limitations.   These […]"}]