[{"link":"https://nmac.to/blog/clear-1-1-7/","image":"https://nmac.to/wp-content/uploads/2014/10/Clear2.png","title":"Clear 1.1.7 – Popular to-do list manager","content":"With Clear, to-do list management is clean and simple.   Life is messy. Keep it together with Clear, the amazing app for list-keeping that is unbelievably simple, quick and satisfying to use.   Clear for Mac stores your lists in iCloud so you can use them on your Mac, or on the go using Clear […]"},{"link":"https://nmac.to/blog/sothink-swf-decompiler-7-4/","image":"https://nmac.to/wp-content/uploads/2015/08/SWF.Decompiler.png","title":"Sothink SWF Decompiler 7.4 – Convert SWF to FLA and extract elements","content":"Sothink SWF Decompiler is a comprehensive solution for Flash fans to use as: Mac SWF to FLA converter, Mac SWF to FLEX converter and Mac SWF elements extractor.   You can easily convert SWF to FLA or FLEX project, and extract Flash resources in batch mode. Almost all SWF elements can be extracted, such as […]"},{"link":"https://nmac.to/blog/speedy-4-0-4/","image":"https://nmac.to/wp-content/uploads/2015/08/Speedy.png","title":"Speedy 4.0.4 – Fast and efficient Spotlight alternative","content":"Speedy Mac is a little strip that brings you the power to quickly find everything you need for your everyday work: documents, folders, applications, and sites. Speedy Mac also sports multiple text Clipboard capability.   Recent documents, recent folders and recent applications: Open Speedy Mac’s menu: you will be pleasantly surprised to find listed there […]"},{"link":"https://nmac.to/blog/rocket-video-player-1-3/","image":"https://nmac.to/wp-content/uploads/2015/08/Rocket.Video_.Player.png","title":"Rocket Video Player 1.3 – Multiformat video player","content":"Rocket Player is a multiformat video player with support for AVI, MKV, XVID and much more.   All formats supported: 3gp, 3gp, 3gp2, 3gpp, amv, asf, avi, axv, divx, dv, flv, f4v, gvi, gxf, m1v, m2p, m2t, m2ts, m2v, m4v, mks, mkv, moov, mov, mp2v, mp4, mpeg, mpeg1, mpeg2, mpeg4, mpg, mpv, mt2s, mts, mxf, […]"},{"link":"https://nmac.to/blog/irip-2-1-8/","image":"https://nmac.to/wp-content/uploads/2014/08/iRip.png","title":"iRip 2.1.8 – Transfer songs, videos, contacts, and more from your iOS device to your Mac","content":"iRip (was iPodRip) is the definitive iPod companion application. iRip allows you to get the most out of your iPod, iPhone and iPad — you can transfer music, videos, and books from your iOS device back to your iTunes Library, listen to music directly on your iPod (allowing you to save valuable disk space) and […]"},{"link":"https://nmac.to/blog/graphical-network-monitor-1-0-5/","image":"https://nmac.to/wp-content/uploads/2015/08/Graphical.Network.Monitor.png","title":"Graphical Network Monitor 1.0.5 – See all of your computer’s connections plotted on a map","content":"Use Graphical Network Monitor to see all of your computer’s connections plotted on a map. Watch your download and upload speeds on your local network and Internet connection. Explore and understand network and Internet usage for each program running on your computer.   Where in the world is your computer connecting?   Find out which […]"},{"link":"https://nmac.to/blog/noiseless-pro-1-1-0/","image":"https://nmac.to/wp-content/uploads/2015/04/Noiseless.Pro_.png","title":"Noiseless Pro 1.1.0 – Remove luma and chroma noise from photos","content":"Noiseless Pro breathes new life into every photo! When taking photos in low light situations, every smartphone, compact camera, or DSLR creates “noise”, small color or light speckles that can ruin an otherwise cool photo. Noiseless Pro cleans up digital noise fast, with advanced technology to retain sharp details, with one-click operation, and at an […]"},{"link":"https://nmac.to/blog/fallen-a2p-protocol/","image":"https://nmac.to/wp-content/uploads/2015/08/Fallen-A2P-Protocol.png","title":"Fallen: A2P Protocol 1.0 – Turn based, tactical combat and strategy game","content":"A post-apocalyptic, turn based, tactical combat and strategy game where you lead your caravan on a quest for revenge.   In a World saved and destroyed by a new energy source, a quest for revenge will unveil the deepest secret on how it all began to fall apart.   Key Features Deep turn based tactical […]"},{"link":"https://nmac.to/blog/acronis-true-image-2016-2-0-5531/","image":"https://nmac.to/wp-content/uploads/2015/07/Acronis.True_.Image_.png","title":"Acronis True Image 2016 2.0.5531 – Backup and disk management","content":"With Acronis True Image 2016 you can assure your Mac is protected by having a full system image backup. Keep all your data safe even if your computer is lost, stolen or damaged. Backup locally or to the cloud, and access your files anytime, anywhere.   Version 2.0.5531: Modernized Look and Feel Archiving. Free up […]"},{"link":"https://nmac.to/blog/chitchat-1-2-0/","image":"https://nmac.to/wp-content/uploads/2015/08/ChitChat.png","title":"ChitChat 1.2.0 – A native Mac app wrapper for WhatsApp Web","content":"ChitChat is A Mac app wrapper around WhatsApp’s web client, WhatsApp Web.   Requires WhatsApp Web compatible device (ie. not an iPhone unfortunately, unless you’re jailbroken)   Allows you to receive notification center notifications for new messages, and adds some useful keyboard shortcuts: Start a new conversation ⌘N Search past conversations ⌘F Jump to your […]"}]