[{"link":"https://nmac.to/blog/dialogue-1-2-1/","image":"https://nmac.to/wp-content/uploads/2014/01/Dialogue.png","title":"Dialogue 1.2.1 – Connect your Mac to your phone via Bluetooth","content":"Dialogue is a simple Mac application that uses Bluetooth to connect your Mac with your phone. It allows you to answer and make normal phone calls over your Mac. It’s as simple as that. After connecting your phone, Dialogue warns you of incoming calls. You can also search a contact from your address book, or […]"},{"link":"https://nmac.to/blog/spotify-0-9-8-150/","image":"https://nmac.to/wp-content/uploads/2014/01/Spotify.png","title":"Spotify 0.9.8.150 – Stream music, create playlists and more","content":"Spotify is a streaming music service that gives you on-demand access to millions of songs.    Whether you like driving rock, silky R&B, or grandiose classical music, Spotify’s massive catalogue puts all your favorites within your reach. No streaming service offers a larger, more varied catalogue.   The music you love, whenever you want it […]"},{"link":"https://nmac.to/blog/choco-2-2/","image":"https://nmac.to/wp-content/uploads/2014/01/Choco.png","title":"Choco 2.2 – Design photo collages","content":"Choco is the ultimate photo collage designer, loaded with more than 100 helpful templates, layout generators, frames, shadows, and built-in effects to bring your images to life.   Endless template options. Get started with more than 100 pre-built templates, in three helpful categories: Classic. Create classic collages with a clean-and-simple grid layout, featuring fixed numbers […]"},{"link":"https://nmac.to/blog/brain-pro-1-0/","image":"https://nmac.to/wp-content/uploads/2014/01/Brain-Pro.png","title":"Brain Pro 1.0 – Anatomical medical knowledge App","content":"The Brain Pro – Mac edition (Nova Series) has been designed specifically for the Mac. It is a must have app for anyone studying anatomy and is aimed at students with a basic to advanced level of anatomical medical knowledge as well as medical professionals. In this Nova Series the user can manipulate the Brain […]"},{"link":"https://nmac.to/blog/igreetingcard-holidays-1-0-1/","image":"https://nmac.to/wp-content/uploads/2014/01/iGreetingCard-Holidays.png","title":"iGreetingCard Holidays 1.0.1 – Electronic greeting cards making","content":"iGreetingCard Holidays is an electronic greeting cards making app to help you create stunning greeting cards. With iGreetingCard, you will find it’s an easy yet funny job to turn any normal photo into a prominent artwork. Neither a professional designer nor a complicated designed work is required; you can simply make beautiful greeting cards. You […]"},{"link":"https://nmac.to/blog/greeting-card-shop-1-0-6/","image":"https://nmac.to/wp-content/uploads/2014/01/Greeting-Card-Shop.png","title":"Greeting Card Shop 1.0.6 – Create cards for life’s special moments","content":"Greeting Card Shop helps you create cards for life’s special moments. Whether you’re sending an invitation for a birthday, or sharing your sympathies, the software makes it easy to stay close to those who are important to you. The fastest, easiest way to create greeting cards and invitations!   WHAT’S NEW Version 1.0.6: Improved printing/exporting […]"},{"link":"https://nmac.to/blog/sign-pdf-2-1-0/","image":"https://nmac.to/wp-content/uploads/2014/01/Sign-PDF.png","title":"Sign PDF 2.1.0 – Sign PDF’s electronically","content":"Sign PDF makes PDF signing simple and efficient. No more printing. No more paper. Sign electronically in three different ways. Write your signature using trackpad or mouse. Insert any existing digital signature image from your local disk. Type your signature, with custom font style, color, etc.   And Sign PDF does more, too: Fill Any […]"},{"link":"https://nmac.to/blog/atv-flash-black-2-4/","image":"https://nmac.to/wp-content/uploads/2014/01/aTV-Flash-black.png","title":"aTV Flash (black) 2.4 – Supercharge your second-generation Apple TV","content":"aTV Flash (black) supercharges your 2nd generation Apple TV, empowering it to do things you never thought possible! All new features are installed alongside the normal Apple TV features, so things like movie rentals, Netflix, and AirPlay will remain unchanged.   Installing aTV Flash (black) requires that you first jailbreak your 2nd Gen. Apple TV […]"},{"link":"https://nmac.to/blog/pingo-hd-1-0/","image":"https://nmac.to/wp-content/uploads/2014/01/Pingo-HD.png","title":"Pingo HD 1.0 – Essential app for browsing your network","content":"With Pingo you can check for network devices and use the IP to connect to them. Pingo HD is a useful utility that allows you to find out whether the device is online, idle or offline.   You can search for airports, printers, and other computers on your network.   Pingo HD has a clean, […]"},{"link":"https://nmac.to/blog/diskaid-6-5-2/","image":"https://nmac.to/wp-content/uploads/2014/01/DiskAid.png","title":"DiskAid 6.5.2 – Use your iOS device as an external disk and more","content":"DiskAid is the ultimate transfer tool for accessing the iPod, iPhone or iPad directly from the desktop. Access data such as: music, video, photos, contacts, notes, call history, text messages (SMS), voicemail, and voice memos. With DiskAid you can also transfer files and folders betwen your iPhone, iPad or iPod touch and your computer and […]"}]