[{"link":"https://nmac.to/blog/stationery-greeting-cards-3-0-1/","image":"https://nmac.to/wp-content/uploads/2014/12/Stationery-Greeting-Cards.png","title":"Stationery Greeting Cards 3.0.1 – Beautiful seasonal holiday email templates for Apple Mail","content":"Get our free Greeting Cards App and choose from different greeting cards packs and collections via In-App purchase: From multi-purpose Stationery Packs for Mail to greeting cards collections for specific topics to send with Apple Mail. A collection of basic templates is included – additional Packs are available for in-app purchase.   Send Greeting Cards […]"},{"link":"https://nmac.to/blog/macfort-4-9-4/","image":"https://nmac.to/wp-content/uploads/2014/12/MacFort.png","title":"MacFort 4.9.4 – Encrypt application data with password protection","content":"MacFort is an innovative utility which gives you the ability to easily encrypt and password protect individual files and folders, applications and their associated files. With just 2 clicks, MacFort lets you password protect several built-in applications data on your Mac (Ex: Dropbox, Apple Mail, iPhoto Library, Outlook for Mac, Evernote, browser history, Contacts, chat […]"},{"link":"https://nmac.to/blog/intensify-pro-1-0-4/","image":"https://nmac.to/wp-content/uploads/2014/12/Intensify-Pro.png","title":"Intensify Pro 1.0.4 – Create clarity and intensity in your photos","content":"Intensify Pro lets discerning photographers of all skill levels create powerful photographic images with unprecedented drama and detail. Precise control of contrast, structure, detail and sharpening across different tonal ranges delivers high quality results every time.   Special algorithms to prevent image artifacts, image layer stacking with opacity control, dozens of professionally created presets, adjustment […]"},{"link":"https://nmac.to/blog/hear-1-2-2/","image":"https://nmac.to/wp-content/uploads/2014/05/Hear.png","title":"Hear 1.2.2 – Improves audio quality and adds audio options system-wide","content":"Hear greatly improves audio quality in movies and music throughout all of your Mac OS X applications. With Hear, music is richer, movie sound and dialog is clearer and games will blow you out of your chair!   3D Sound – Like movies? like’em more with virtual cinema quality sound experience. Sound will approach you […]"},{"link":"https://nmac.to/blog/framer-studio-1-9-43/","image":"https://nmac.to/wp-content/uploads/2014/08/Framer.Studio.png","title":"Framer Studio 1.9.43 – Invent, design and experiment with interaction","content":"Framer Studio is built on Framer.js, an open source framework for rapid prototyping. Framer allows you to define animations and interactions. It runs on mobile devices, too.   Source on GitHub Hardware Accelerated Events & 3D Animations Spring Physics Framer.js used at: Google, Facebook, Instagram and Stripe   Generate Generate assets out of Sketch and […]"},{"link":"https://nmac.to/blog/flightradar24-2-0/","image":"https://nmac.to/wp-content/uploads/2014/01/Flightradar24.png","title":"Flightradar24 2.0 – Turns your Mac into an air traffic radar monitor","content":"Flightradar24 turns your Mac into an air traffic radar monitor. See airplane traffic around the world move in real-time. Discover why millions are already using Flightradar24. Please note that coverage will vary. We are rapidly improving Flightradar24’s coverage across the world.   Features: Planes moving in real-time Comprehensive information for each individual plane, including route, […]"},{"link":"https://nmac.to/blog/condense-1-61/","image":"https://nmac.to/wp-content/uploads/2014/09/Condense.png","title":"Condense 1.61 – Optical character recognition (OCR) application","content":"Typing out has come to an end. Say ‚Hello‘ to Condense. Your easy to use optical character recognition (OCR) application.   Imagine one of the following scenarios:   You’re writing an essay for University and you’ve to quote from a PDF, an EBook or one of your professor’s presentations? That’s a huge amount of text […]"},{"link":"https://nmac.to/blog/tag-editor-1-0-6/","image":"https://nmac.to/wp-content/uploads/2014/12/Tag-Editor.png","title":"Tag Editor 1.0.6 – Handy spreadsheet for quick ID3 tagging","content":"Tag Editor is a handy spreadsheet for easy and quick setting, editing and cleaning of ID3 tags. Tag Editor can generate missing tags and artworks and remove extra spaces and characters automatically. You can edit, copy, paste, find and replace multiple tags by batch in one spreadsheet with full control over changes.   Tag Editor […]"},{"link":"https://nmac.to/blog/soundbunny-1-1-1/","image":"https://nmac.to/wp-content/uploads/2014/01/SoundBunny.png","title":"SoundBunny 1.1.1 – Customize volume settings for individual applications","content":"SoundBunny lets you tailor volume settings for individual apps on your Mac. Turn up the sound on a game or movie without increasing the volume of your other apps. Or boost the volume of your email notifications when you’re expecting an important message. Emphasize the sound you need. Decrease the sound you don’t.   Simple […]"},{"link":"https://nmac.to/blog/randals-monday/","image":"https://nmac.to/wp-content/uploads/2014/12/Randals-Monday.png","title":"Randal’s Monday 1.0.2 – Graphical adventure game","content":"A kleptomaniac, a sociopath and a horrible friend. Randal is potentially one of the most scurrile protagonists since the invention of the hoverboard. Randal’s Monday is a crazy space-time odyssey in classic adventure design, spiced up with countless geek culture references of the last 30 years.   Randal wakes up after the engagement party of […]"}]