[{"link":"https://nmac.to/blog/pastebox/","image":"https://nmac.to/wp-content/uploads/2017/11/PasteBox.png","title":"PasteBox 2.2.5 – A clipboard manager","content":"PasteBox preserves data from the clipboard and allows easy access to those data through a shortcut. You can record various clipboard types, from plain text to images. Through the shortcut key you can invoke a popup menu with recorded items, from where you can select the item that will be pasted.   Version 2.2.5: small […]"},{"link":"https://nmac.to/blog/xscope/","image":"https://nmac.to/wp-content/uploads/2019/12/xScope_4.png","title":"xScope 4.5.2 – Onscreen graphic measurement tools","content":"xScope is a powerful set of tools for designers that are ideal for measuring, aligning and inspecting on-screen graphics and layouts. The software consists of seven tools in one: Dimensions – Find the size of anything on screen instantly Rulers – On-screen rulers that measure distances and angles Screens – A dynamic view of smaller […]"},{"link":"https://nmac.to/blog/mirror-for-sony/","image":"https://nmac.to/wp-content/uploads/2019/01/Mirror-for-Sony-TV.png","title":"Mirror for Sony TV 3.7.3 – Mirror the screen of your Mac to any Sony Bravia Smart TV","content":"Mirror for Sony TV is the application to mirror the screen of your Mac to any Sony Bravia Smart TV. No wires and no additional   The quality of your experience will be dependant on the quality of your local network. Some tips to enhance the experience: Preferably, connect your TV by LAN cable to […]"},{"link":"https://nmac.to/blog/kiosc/","image":"https://nmac.to/wp-content/uploads/2021/06/Kiosc.png","title":"Kiosc 1.13.7 – Create personalised dashboards that communicate OSC and UDP","content":"Kiosc is a simple tool for creating personalised dashboards that communicate OSC and UDP. It allows you to design your own user interface that remote controls systems and equipment via Ethernet.   There is a lot of cool equipment available that can be controlled via UDP or OSC messages. You can choose Kiosc to be […]"},{"link":"https://nmac.to/blog/rss-safari/","image":"https://nmac.to/wp-content/uploads/2020/02/RSS-Button-for-Safari.png","title":"RSS Button for Safari 1.7.3 – RSS feed discovery for Safari","content":"Discover and subscribe to RSS, Atom or JSON feeds in your preferred desktop or web based news reader from Safari.   RSS Button for Safari requires either a desktop news reader supporting RSS, Atom or JSON feeds or an account with an online news reader such as Feedbin, Feedly, FeedHQ, Inoreader, NewsBlur, The Old Reader, […]"},{"link":"https://nmac.to/blog/mac-fonetrans/","image":"https://nmac.to/wp-content/uploads/2016/05/Mac.FoneTrans9.png","title":"Mac FoneTrans 9.1.38 – iOS Transfer for Mac","content":"This Mac iOS transfer and management software can transfer files between Mac and iOS devices. Managing your digital life has never been easier.   Transfer music, photos, movies, and contacts from Mac to iPhone/iPad/iPod Import music, photos, contacts, playlists, and albums from iOS device to Mac Backup iPhone/iPad/iPod files to iTunes Transfer multimedia files, playlists, […]"},{"link":"https://nmac.to/blog/storyspace/","image":"https://nmac.to/wp-content/uploads/2022/02/Storyspace.png","title":"Storyspace 3.9.0 – Tool for writing and reading hypertext narrative","content":"Storyspace is a hypertext writing environment, especially well suited to creating large, complex, and challenging hypertexts. Storyspace is designed for the process of writing. Where other systems often emphasize visual presentation, Storyspace emphasizes writing, linking, and organizing. Storyspace creates and follows links quickly and directly. Most importantly, Storyspace gives you live, informative and powerful graphic […]"},{"link":"https://nmac.to/blog/easy-screen-recorder/","image":"https://nmac.to/wp-content/uploads/2020/01/Easy-Screen-Recorder.png","title":"Easy Screen Recorder 4.6.1 – A simple powerful screen recording app","content":"Easy Screen Recorder is a simple yet powerful screen recording and editing application that creates demos, tutorials and guides faster and easier.   Instantly record your screen, cameras, edit, comment and export to mp4 videos that you can share on Youtube, Facebook, etc.   Efficient, high quality full or partial screen recording Easy Screen Recorder […]"},{"link":"https://nmac.to/blog/audiobook-builder/","image":"https://nmac.to/wp-content/uploads/2016/04/Audiobook-Builder.png","title":"Audiobook Builder 2.2.2 – Import Audiobook CDs or other audio to iPod","content":"Audiobook Builder makes it easy to turn your audio CDs, MP3s, M4As, and other audio files into audiobooks for your iPhone, iPod or iPad. Join audio, create enhanced chapter stops, adjust quality settings and let Audiobook Builder handle the rest. When it finishes you get one or a few audiobook tracks in iTunes instead of […]"},{"link":"https://nmac.to/blog/acon/","image":"https://nmac.to/wp-content/uploads/2021/06/Acon.png","title":"Acon 1.1.1 – Make Big Sur Style Icon","content":"Acon is an app for making Big Sur-style icons   The main function: Solid color background fill Gradient background fill Customize the background size Customize icon size Custom corner radius Custom shadows   Version 1.1.1: Fix some minor issues.   Intel, 64-bit processor OS X 10.11 or later    "}]