[{"link":"https://nmac.to/blog/wifi-radar-pro/","image":"https://nmac.to/wp-content/uploads/2016/05/WiFiRadar.Pro_.png","title":"WiFi Radar Pro 2.4 – The Wireless Swiss-army knife","content":"WiFi Radar Pro lets you monitor your area networks; identify and troubleshoot issues with your home, small office, or enterprise network; and gather useful information about your network performance. Are you simply in search of an elegant replacement of the default OS X wireless utility? You’ve just found your ideal tool!   Easy-to-use, intuitive UI […]"},{"link":"https://nmac.to/blog/squeezer/","image":"https://nmac.to/wp-content/uploads/2016/12/Squeezer.png","title":"Squeezer 2.3 – Minify, compile, and compress Web sources and images","content":"Squeezer is the Web developer’s pal. It can compile your scripts, optimize your images, and shave unnecessary file bulk to speed site load times. Just drag-and-drop your files, and Squeezer will take care of the rest!   Easy-to-use, intuitive UI Batteries-included: You don’t need to install anything. It just works. Add or drag-and-drop your files/folders […]"},{"link":"https://nmac.to/blog/spy-tactics/","image":"https://nmac.to/wp-content/uploads/2019/09/Spy-Tactics.png","title":"Spy Tactics 1.01 – Turn-Based Tactics Strategy Game","content":"Spy Tactics is a mix of puzzle and turn-based strategy about fascinating adventures of a spy.   Welcome to Secret Service You are going to try yourself as a special agent and carry out secret missions in different places of the world – elimination of the corrupted officials and criminal bosses, search of the missing […]"},{"link":"https://nmac.to/blog/underworld-ascendant/","image":"https://nmac.to/wp-content/uploads/2019/09/Underworld-Ascendant.png","title":"Underworld Ascendant 1.4.3 – RPG Action & Adventure Game","content":"From the creative minds behind the acclaimed Ultima Underworld, System Shock and Thief series, in Underworld Ascendant, Paul Neurath and Warren Spector’s OtherSide Entertainment challenges you to think creatively in an interactive sandbox environment.   You are summoned by a mysterious figure to The Stygian Abyss, a dangerous and constantly evolving dungeon world imperiled by […]"},{"link":"https://nmac.to/blog/wolf-forms/","image":"https://nmac.to/wp-content/uploads/2018/07/Wolf-Forms.png","title":"Wolf Responsive Form Maker 2.37.1 – Create PHP web forms","content":"Wolf Responsive Form Maker helps you build mobile-friendly web forms in PHP format   Version 2.37.1: Google reCAPTCHA integration improvements Minor bug fixes and stability improvements   Intel, 64-bit processor OS X 10.10 or later    "},{"link":"https://nmac.to/blog/gibbous/","image":"https://nmac.to/wp-content/uploads/2019/09/Gibbous.png","title":"Gibbous – A Cthulhu Adventure 1.4 – Point & Click Adventure Game","content":"Darkham, with its crooked gambrel roofs, dark alleys, and a past shrouded in secrecy, never really was a welcoming place, but nowadays? Kooky cults are popping up everywhere, and that most evil book, the Necronomicon, is spoken of in trembling whispers once more.   Detective Don R. Ketype is on the case to retrieve the […]"},{"link":"https://nmac.to/blog/cuphead/","image":"https://nmac.to/wp-content/uploads/2017/12/Cuphead1.png","title":"Cuphead 1.2.4 – A classic run and gun action game","content":"Cuphead is a classic run and gun action game heavily focused on boss battles. Inspired by cartoons of the 1930s, the visuals and audio are painstakingly created with the same techniques of the era, i.e. traditional hand drawn cel animation, watercolor backgrounds, and original jazz recordings.   Play as Cuphead or Mugman (in single player […]"},{"link":"https://nmac.to/blog/flowstate/","image":"https://nmac.to/wp-content/uploads/2016/03/Flowstate.png","title":"Flowstate 1.32 – Featured fullscreen writing app","content":"The world is a hive of distractions, multi-tasking, and cultural ADD. Many sit down to write, only to find hours vanish with nothing to show but a trail of browser tabs. Flowstate is a response to the amphetaminic digital age, born out of ancient writing disciplines. It frees the writer to turn on, tune in, […]"},{"link":"https://nmac.to/blog/mockflow/","image":"https://nmac.to/wp-content/uploads/2019/08/MockFlow.png","title":"MockFlow 1.4.7 – Collaborative wireframing for app development","content":"MockFlow is the quickest way to turn any User Interface ideas into designs. You can use MockFlow for sketching UI ideas, prototype websites/apps and also as a whiteboard presentation tool.   Important Features: Over 100 built-in UI components for brainstorming websites, mobile apps, sketchy hand-drawn interfaces Thousands of UI icons for all categories Draw tool […]"},{"link":"https://nmac.to/blog/zed/","image":"https://nmac.to/wp-content/uploads/2019/08/ZED.png","title":"ZED 1.0 – Casual VR Adventure Game","content":"ZED is the story of an aging artist, lost in regret and the haze of dementia. Inside the dreamscape of this creative mind come undone, players reassemble the artist’s fragmented memories into a final, lasting legacy: a loving gift to his granddaughter.    Making its debut on PC (with optional VR support for Oculus Rift […]"}]