[{"link":"https://nmac.to/blog/statscenter-1-4/","image":"https://nmac.to/wp-content/uploads/2016/02/StatsCenter.png","title":"StatsCenter 1.4 – Monitor system statistics","content":"StatsCenter is a fantastic and comprehensive tool for your Mac that lets you monitor real time system statistics. The app runs as a widget under the Today view tab of your Mac’s Notification Center.   Features With StatsCenter, you get real time system stats (with full Retina support) for the following wide array of modules: […]"},{"link":"https://nmac.to/blog/poster-1-6-2/","image":"https://nmac.to/wp-content/uploads/2016/06/Poster.png","title":"Poster 1.6.2 – Post photos and video to the Web","content":"Poster enables you to post photos and videos to the web. Poster can send photos and videos to Flickr, SmugMug, Facebook profiles and Facebook pages.   Poster sports a sleek design that lets you see your photos properly and work with them effortlessly. Whether posting to Flickr, Facebook or SmugMug, Poster takes a tailored approach […]"},{"link":"https://nmac.to/blog/photo-collage-maker-pro-3-1-8/","image":"https://nmac.to/wp-content/uploads/2016/08/Photo-Collage-Maker.png","title":"Photo Collage Maker Pro 3.1.8 – Image Picture Poster Creator HD","content":"Find out just how easy it can be to turn photos into a collage! Photo Collage Make Pro allows you to create photo collages, scrapbooks, greeting cards, photo calendars, and posters quickly. With an intuitive interface, create stunning picture collages on your mac. You can sharing these self-made collages with your friends and families.   […]"},{"link":"https://nmac.to/blog/text-styles-1-0/","image":"https://nmac.to/wp-content/uploads/2016/08/Text-Styles.png","title":"Text Styles 1.0 – Turn text into art, creative logo, icons and more","content":"Text Styles is a shape-based design application for turning text into art, creative logo, icons, web graphics and buttons. With Text Styles you will get professional results without expensive software.   With Text Styles you can create: Web graphics from your text Creative Text for buttons and logos Unique titles for Keynote Presentations and Books […]"},{"link":"https://nmac.to/blog/movavi-photo-noir-1-0-1/","image":"https://nmac.to/wp-content/uploads/2016/08/Movavi.Photo_.Noir_.png","title":"Movavi Photo Noir 1.0.1 – Classic Black & White Photo Effects","content":"Enjoy black and white photography in all its silvery splendor with Movavi Photo Noir. Shoot in color with contrast and texture in mind and convert your photos to black and white on your Mac using this dedicated app. Take advantage of the built-in B&W filters, then adjust parameters for unique custom results.   Monochrome Perfection […]"},{"link":"https://nmac.to/blog/convert-to-mp3-3-3-5/","image":"https://nmac.to/wp-content/uploads/2016/08/Convert-to-Mp3.png","title":"Convert to Mp3 3.3.5 – Convert all audio & video formats to MP3","content":"Convert to Mp3 Support MP3, FLAC, WAV, WMA, M4A, AIFF, FLV, OGG, MKA, AU, CAF, AIFF, AC3 and many more.   Almost all video formats.   Function support import music, video and folder. Auto save source music tag info. Trim audio , add fadein /fadeout and adjust volume. Delete mute at the start and end. […]"},{"link":"https://nmac.to/blog/edraw-max-8-4/","image":"https://nmac.to/wp-content/uploads/2016/08/Edraw-Max.png","title":"Edraw Max 8.4 – Versatile diagramming tool","content":"Edraw Max allows students, teachers, and business professionals to reliably create and publish all kinds of diagrams to represent any sort of idea. It provides you a versatile, easy, quick, yet professional solution to let you enjoy your work.   In a corporate environment, the folks over in human resources need to be able to […]"},{"link":"https://nmac.to/blog/bulb-boy/","image":"https://nmac.to/wp-content/uploads/2016/08/Bulb-Boy.png","title":"Bulb Boy 1.0 – Point & Click Adventure & Horror Game","content":"One gloomy night, Bulb Boy wakes suddenly from a frightening nightmare to discover that evil has overshadowed the Bulbhouse. His family has disappeared and there are horrid monsters lurking in the shadows. Gather the courage and use his glass head to save everything he loves. Find light in yourself!   Gameplay Bulb Boy is an […]"},{"link":"https://nmac.to/blog/blood-bowl-2-1-0/","image":"https://nmac.to/wp-content/uploads/2016/08/Blood-Bowl-2.png","title":"Blood Bowl 2 1.0 – A Game of Warhammer and American football together","content":"Blood Bowl 2 smashes Warhammer and American football together, in an explosive cocktail of turn-based strategy, humour and brutality, adapted from Games Workshop’s famous boardgame.   Blood Bowl 2’s new graphics engine and high-flying realization makes for a faithful portrayal of the fury and intensity of classic Blood Bowl matches. The solo game mode will […]"},{"link":"https://nmac.to/blog/overlord/","image":"https://nmac.to/wp-content/uploads/2016/08/Overlord.png","title":"Overlord 1.0 – RPG, Third Person & Action Game","content":"    Prepare to be tempted, mesmerized and thrilled, become the Overlord, how corrupt you become depends on how you handle any given situation. Your actions impact the game world. With incredible power at your disposal and a team of evil minded minions to do your evil bidding, how will you resist the temptation to […]"}]