[{"link":"https://nmac.to/blog/ukelib-chords-pro/","image":"https://nmac.to/wp-content/uploads/2021/04/UkeLib-Chords-Pro.png","title":"UkeLib Chords Pro 1.3.1 – Ukulele Chord Library","content":"Explore the vast and comprehensive collection of ukulele chords in UkeLib Chords Pro. Get all the possible positions of any chord along with suggested fingering and audio demonstration of how the chord sounds. Use the built-in search to quickly get to any chord you are looking for. With beautiful chord diagrams, this chord library would […]"},{"link":"https://nmac.to/blog/comic-strip-factory/","image":"https://nmac.to/wp-content/uploads/2021/04/Comic-Strip-Factory.png","title":"Comic Strip Factory 1.0.137 – Create your own comics","content":"Comic Strip Factory was created for those who love comic strips. Now you can make your own. On your social networks, you can post your own creations with your own words, rather than just reposting clever but overused memes. Or maybe you’re really serious about comics. You want to be the next Charles Schultz, Berke […]"},{"link":"https://nmac.to/blog/cut-the-rope/","image":"https://nmac.to/wp-content/uploads/2013/02/Cut-the-Rope-Remastered.png","title":"Cut the Rope Remastere‪d‬ 1.0.2 – Collect gold stars and deliver the candy to Om Nom’s mouth","content":"Wake up and smell the cake: today is Om Nom’s Birthday! The world’s favorite sweet tooth is having a birthday party, and everyone’s invited!   Om Nom is back in the glorious 3D remaster of the legendary Cut the Rope puzzle game!   Cut ropes, avoid obstacles and use boosters to deliver candy to Om […]"},{"link":"https://nmac.to/blog/paint-x/","image":"https://nmac.to/wp-content/uploads/2019/02/Paint-X.png","title":"Paint X 6.0 – Simple yet versatile paint program","content":"Paint X is a classic painting application to draw, color, or edit pictures. You can use Paint X like a digital sketchpad to make simple pictures, creative projects, or to add text and designs to other pictures, such as those taken with your digital camera   Efficient tools: Pencil tool, Eraser tool, Airbrush tool, Fill […]"},{"link":"https://nmac.to/blog/secret-oops/","image":"https://nmac.to/wp-content/uploads/2021/04/Secret-Oops.png","title":"Secret Oops 1.5 – Spy party game","content":"Secret Oops! is an innovative cooperative local multiplayer game about preventing the dumbest possible spy from being discovered.   When a new threat arises and briefcases start to disappear all over the world, the S.P.Y. Agency, the only agency in the world run by robotic pigeons, sends its best agent to investigate: Special Agent Charles. […]"},{"link":"https://nmac.to/blog/full-throttle-remastered/","image":"https://nmac.to/wp-content/uploads/2017/06/Full_Throttle_Remastered_1.png","title":"Full Throttle Remastered 1.1.891868 – A classic graphic point & click adventure game","content":"One minute you’re on the road, riding, not a care in the world. Then some guy in a suit comes along and says he’s got a deal for you and your gang. But when you come to, you’ve got a lump on your head, the law on your back, and a feeling in your gut […]"},{"link":"https://nmac.to/blog/world-of-demons/","image":"https://nmac.to/wp-content/uploads/2021/04/World-of-Demons.png","title":"World of Demons 1.0 – A samurai’s brush with danger","content":"From award-winning Japanese developer PlatinumGames comes a new exhilarating combat action title, World of Demons.   Known for their console action and PC games including NieR:Automata and the hit Bayonetta series, PlatinumGames thrust players into a fantastical world full of yokai – a class of supernatural monsters and spirits from Japanese folklore.   Players will […]"},{"link":"https://nmac.to/blog/kingpin-private-browser/","image":"https://nmac.to/wp-content/uploads/2020/08/Kingpin-Private-Browser.png","title":"Kingpin Private Browser 1.3.25 – Privacy browser with adblock","content":"Kingpin browser is full-featured browser with incognito mode and adblock always turned on. It does not remember the history, passwords, or cookies. The browser is using Google search as default (can be changed to DuckDuckGo in settings). It can be used like additional browser for browsing sensitive content, or browser used for more secured online […]"},{"link":"https://nmac.to/blog/automailer/","image":"https://nmac.to/wp-content/uploads/2016/05/AutoMailer.png","title":"AutoMailer 2.9 – Send text and Web email to a large number of recipients","content":"AutoMailer allows sending of personalised emails to multiple addresses, in text or web format, each merged with data from an internal database. It lets you prepare and send an unlimited number of emails with a single click, each with custom contents depending of each recipient. AutoMailer is able to import from external sources in a […]"},{"link":"https://nmac.to/blog/flotato/","image":"https://nmac.to/wp-content/uploads/2019/07/Flotato.png","title":"Flotato 36 – Use any web site as a beautiful Mac app","content":"Flotato turns itself into any web app, just by giving it a new name. It’s like phone apps for your desktop; compact, light-weight, unbelievably fast.   Features:   Pin to top Don’t miss a second. Keep any compact Flotato app on top of other windows.   Put a slice in the dock Keep an eye […]"}]