[{"link":"https://nmac.to/blog/ocrtools-2-0-1/","image":"https://nmac.to/wp-content/uploads/2014/06/OCRTOOLS.png","title":"OCRTOOLS 2.0.1 – Converts Images in to text data","content":"OCRTOOLS can recognize the image files or clipboard images converts the text data by OCR technology.   iTunes can not copy text from the description, it is ideal for converting to character data. Click “Open image” button to choose image (JPEG / TIFF / PNG / BMP / PDF / GIF) . Or the image […]"},{"link":"https://nmac.to/blog/provideoplayer-2-0-5/","image":"https://nmac.to/wp-content/uploads/2014/06/ProVideoPlayer.png","title":"ProVideoPlayer 2.0.5 – Playlist and video manager","content":"ProVideoPlayer was designed to enhanced live staging events such as concerts, trade show booths, conferences, or church services; it manages an unlimited amount of clips in an unlimited number of playlists and gives a tremendous amount of control to the playback of these video clips including Hue, Brightness, Saturation, Start/Stop times, and speed, either on […]"},{"link":"https://nmac.to/blog/macjournal-6-1-2/","image":"https://nmac.to/wp-content/uploads/2014/03/MacJournal.png","title":"MacJournal 6.1.2 – Create, maintain, and blog a personal journal","content":"MacJournal is the world’s most popular journaling software for the Mac. MacJournal 6 adds a calendar mode that show entries from any journal, geolocation, word count, and progress tracking, as well as additional blogging support. A Timeline mode has been added to give the journaler the ability to see their writing activity in chronological order. […]"},{"link":"https://nmac.to/blog/makemkv/","image":"https://nmac.to/wp-content/uploads/2014/06/MakeMKV.png","title":"MakeMKV 1.9.7 – One-click video converter, with Blu-ray compatibility","content":"MakeMKV is your one-click solution to convert video that you own into free and patents-unencumbered format that can be played everywhere. MakeMKV is a format converter, otherwise called “transcoder”. It converts the video clips from proprietary (and usually encrypted) disc into a set of MKV files, preserving most information but not changing it in any […]"},{"link":"https://nmac.to/blog/hd-cleaner-1-0-2/","image":"https://nmac.to/wp-content/uploads/2014/06/HDCleaner.png","title":"HD Cleaner 1.0.2 – Remove gigabytes from your hard drive in just one click","content":"HD Cleaner helps you get rid of those useless files so you can have more room on your hard drive. Scan your home folder and free up your hard drive space for the important things.   Features Include: Overview Graph: visualize how much space you have available and how much you can clean up. Quick […]"},{"link":"https://nmac.to/blog/deepclock-1-6-3/","image":"https://nmac.to/wp-content/uploads/2014/06/deepClock.png","title":"deepClock 1.6.3 – Decorate your desktop with this analog clock","content":"deepClock is a magnificent analogue clock which will decorate any desktop. It isn’t just an ordinary clock. It’s a magnificent decoration for any desktop. deepClock doesn’t burden the desktop with unnecessary information. The program just displays a beautiful and unique clock which you can place anywhere.   You can adjust the app as much as […]"},{"link":"https://nmac.to/blog/bluenote-1-31/","image":"https://nmac.to/wp-content/uploads/2014/05/Bluenote.png","title":"Bluenote 1.31 – Easily keep track of notes, tasks, and passwords","content":"Bluenote is one place for jotting down notes, keeping track of your tasks, and accessing your passwords. A beautiful interface separates your info, lets you assign labels and icons, and search with ease.   Bluenote automatically encrypts, saves, and syncs on the fly. It’s a fantastic app, exclusively for Mac.   Features: Notes are easy […]"},{"link":"https://nmac.to/blog/cleanmyphone-1-2-0/","image":"https://nmac.to/wp-content/uploads/2014/01/CleanMyPhone.png","title":"CleanMyPhone 1.2.0 – Keep your iPhone, iPad, or iPod touch clean and well-organized","content":"CleanMyPhone is an ingeniously simple and powerful application that will help you keep your iPhone, iPad, or iPod touch clean and running smoothly. It includes useful tools such as Disk Manager, App Cleaner, Removal of Document and Data, Find Large Files, One-Click-Copy, and more.   Configure, Organize and Manage Files and Apps on Your iOS […]"},{"link":"https://nmac.to/blog/zone-2-0-2/","image":"https://nmac.to/wp-content/uploads/2014/05/Zone.png","title":"Zone 2.0.2 – Monitor working time and efficiency","content":"Zone helps you get productive by zoning in to find out what’s your best working time.   Zone is an application for Mac, that helps focus on work by “zoning in.” It means that you forget about the whole world for a while and just work.   Zone never interrupts you when you’re zoned in […]"},{"link":"https://nmac.to/blog/markdrop-1-1/","image":"https://nmac.to/wp-content/uploads/2013/12/MarkDrop.png","title":"MarkDrop 1.1 – Markdown editor built with sharing in mind","content":"MarkDrop is a gorgeous, powerful Markdown editor built with sharing in mind. Every MarkDrop document has a secure URL that is viewable in any browser. Markdown is a simple syntax built for writers who want to compose in an easy-to-write, easy-to-read format that can be converted to HTML. But the missing component up until now […]"}]