[{"link":"https://nmac.to/blog/flyer-mill-1-5/","image":"https://nmac.to/wp-content/uploads/2017/02/Flyer-Mill.png","title":"Flyer Mill 1.5 – Templates for Pages","content":"Flyer Mill – Templates for Pages is an excellent collection of 220 original templates, designed to give a unique look to your promo material. Whether you’re promoting a cool event, launching a new product, or announcing a mind-blowing sale, these flyers will help you do that with efficiency and style.   Every object in Flyers […]"},{"link":"https://nmac.to/blog/1000-opentype-font-collection-4-0/","image":"https://nmac.to/wp-content/uploads/2014/03/1000.OpenType.Fonts_.png","title":"1000 OpenType Font Collection 4.0 – Collection of stylish fonts for commercial use","content":"1000 Opentype Fonts Collection helps you get creative. The font collection includes 238 unique font family styles, with 1000 total fonts. An excellent addition to any font collector’s library for use in graphic and logo design, web design, scrapbooks, presentations, invitations, promotional material, advertisements, and more.   Each font is in OpenType font format and […]"},{"link":"https://nmac.to/blog/appriority-1-1-12/","image":"https://nmac.to/wp-content/uploads/2017/02/Appriority.png","title":"Appriority 1.1.12 – Optimize CPU load and speed up your apps","content":"Appriority is an easy-to-use tool for OS X that simply makes the app you’re working in go faster by allowing you to optimize the CPU load on your computer. Once fully configured, Appriority works by suspending and resuming applications as you switch among them. Inactive applications can be set for suspension which will eliminate their […]"},{"link":"https://nmac.to/blog/brutal-legend-1-0-0/","image":"https://nmac.to/wp-content/uploads/2017/02/Brutal.Legend.png","title":"Brutal Legend 1.0.0 – Adventure game that marries action combat with open-world freedom","content":"Brütal Legend is an action-adventure that marries visceral action combat with open-world freedom. Set in a universe somewhere between Lord of the Rings and Spinal Tap, it’s a fresh take on the action/driving genre, which in this case is full of imitation cover bands, demons intent on enslaving humanity and Heavy metal tunes. Featuring the […]"},{"link":"https://nmac.to/blog/revolve-1-0/","image":"https://nmac.to/wp-content/uploads/2017/02/Revolve.png","title":"Revolve 1.0 – Sci-fi Action & Platformer Game","content":"Revolve is a Triggeractive Platformer. You play as Reevo, drone on wheels who is trying to escape a dystopian world. You can use speed boosts, brake, jump or switch gravity.   Triggeractive But you don’t control Reevo directly! Each of these 4 actions requires energy. Reevo’s energy refills automatically, but slowly, so it’s important to […]"},{"link":"https://nmac.to/blog/ifoto-montage-2-10-1122/","image":"https://nmac.to/wp-content/uploads/2016/10/iFoto-Montage.png","title":"iFoto Montage 2.10.1122 – Easy Mosaic Photo Maker","content":"iFoto Montage is a special photomontage maker to create stunning mosaic photo with many tile-images. The advanced tiling techniques and special effects empower you to create photo collage in shape with ease. And you can also perfect the montage photo with micro-image pattern, repetition, grid and border options and other splendid features.   As a […]"},{"link":"https://nmac.to/blog/holy-potatoes-were-in-space-1-0/","image":"https://nmac.to/wp-content/uploads/2017/02/Holy.Potatoes.We_.re_.in_.Space_.png","title":"Holy Potatoes! We’re in Space?! 1.0 – A space adventure & turn-based combat game","content":"Holy Potatoes! We’re in Space?! is a space adventure game with management elements and turn-based combat. Manage your very own spaceship and explore a procedurally generated universe with dozens of planets to explore for resources, and enemies you can encounter for intergalactic space battles.   Encounter a cornucopia of space races, such as cosmic carrots, […]"},{"link":"https://nmac.to/blog/we-are-chicago-1-0/","image":"https://nmac.to/wp-content/uploads/2017/02/We.Are_.Chicago.png","title":"We Are Chicago 1.0 – Story Rich Adventure & Simulation Game","content":"You are harassed at school, your friends are avoiding you, and you need to make sure your sister is safe from the dangers that surround you. You’ve only got a week before high school graduation and everything seems to be falling apart. How will you respond and can you hold your friendships and family together […]"},{"link":"https://nmac.to/blog/evoland-2-deluxe-edition-1-0/","image":"https://nmac.to/wp-content/uploads/2017/02/Evoland-2.png","title":"Evoland 2 Deluxe Edition 1.0 – RPG Adventure & Action Game","content":"Evoland 2 graphics style is changing as you travel through time and its gameplay evolves as you move along the storyline. It is also a real RPG at heart, with a deep scenario based on time travel: explore different eras and change the history of the world. But are you sure that the consequences will […]"},{"link":"https://nmac.to/blog/dupe-away-3-0-9/","image":"https://nmac.to/wp-content/uploads/2015/06/Dupe.Away_.png","title":"Dupe Away 3.0.9 – Fast and easy iTunes duplicate remover program","content":"Dupe Away instantly finds the dupes in iTunes and, based on your preferences, automatically determines which duplicate to keep and which to remove.   Detect Unused Files: Ever wonder how many tracks exist in your Music folder that aren’t in iTunes? We call these “abandoned tracks.” Dupe Away detects these files for you so you […]"}]