[{"link":"https://nmac.to/blog/reckless-racing/","image":"https://nmac.to/wp-content/uploads/2012/10/Reckless-Racing.png","title":"Reckless Racing 1.0 – Old-school racing with modern graphics and multiplayer","content":"Reckless Racing mixes old-school racing gameplay with state of the art graphics and multiplayer features to brew a mean gumbo that takes the genre to a whole another level. Perfectly balanced controls lets you skid, slip and slide through some of the most beautiful tracks that you ever did see  leaving nothing but mud-splattered opponents, […]"},{"link":"https://nmac.to/blog/blog-post/","image":"https://nmac.to/wp-content/uploads/2013/12/mzi.sve_.png","title":"Wifi Radar v1.5 – Scan for Wireless Networks","content":"The Coolest way to scan for Wireless Networks – the Mac way!  –  Works in Lion  –  Works with Airport cards (MacBook, MacBook Pro, etc)  –  Ultra-intuitive, easy-to-use interface –  Beautiful graphics –  Scan for networks with a single click Wanna monitor your home network signal strength? Are you simply wanting to try different networks? Waiting […]"},{"link":"https://nmac.to/blog/total-video-converter-for-mac/","image":"https://nmac.to/wp-content/uploads/2013/12/conv.png","title":"Total Video Converter For Mac","content":"Total Video Converter For Mac is easy, fast, powerful, and loaded with features. It’s capable of converting videos of all popular formats like AVI, MPEG, WMV, DivX, MP4, H.264/AVC, AVCHD, MKV, RM, MOV, XviD, 3GP, and audio MP3, WMA, WAV, RA, M4A, AAC, AC3, OGG. Now you can convert video, audio to play on your PSP, PS3, […]"},{"link":"https://nmac.to/blog/mybuddy-for-facebook/","image":"https://nmac.to/wp-content/uploads/2013/12/buddy.png","title":"MyBuddy – Facebook Mac Application with tabs & themes!","content":"The only Facebook Mac Application with tabs & themes! Once you go myBuddy, you’ll never go back! You’ll never have to open your browser just for facebook again! Simply click on the myBuddy icon in the status menu and you’re there! It’s hands down, the best facebook app out there! Feathers :  – Access Facebook […]"},{"link":"https://nmac.to/blog/mplayerx/","image":"https://nmac.to/wp-content/uploads/2013/12/MPlayerX.png","title":"MPlayerX – Alternative media player","content":"MPlayerX is an alternative media player powered by ffmpeg and mplayer.  Tthe new technology Apple prevailed, such as Core Animation, Grand-Central Dispatch, even OpenCL, pushed me to give them a try. So I started without even knowing how to program under Mac, came to know Xcode, Objective-C 2.0, Cocoa and the Core family. It is still […]"},{"link":"https://nmac.to/blog/mackeeper-091/","image":"https://nmac.to/wp-content/uploads/2013/12/keeper.png","title":"MacKeeper 0.9.1 – like 911 for your Mac","content":"MacKeeper is like 911 for your Mac. It’s an easy way to manage routine tasks and keep your Mac secured, clean, reliable, fast and attended! Both beginners and experts will be comfortable with MacKeeper. Its simple and intuitive interface will allow beginners to benefit from all of its advanced features.  Expert users will take advantage […]"},{"link":"https://nmac.to/blog/farm-frenzy-2-pizza-party/","image":"https://nmac.to/wp-content/uploads/2012/10/Farm-Frenzy-2-Pizza-Party.png","title":"Farm Frenzy 2: Pizza Party 1.0 – Return to the farm to create pizza ingredients","content":"In Farm Frenzy Pizza Party you must return to the farm to create pizza ingredients for the town. You`ll start out by growing grass, feeding animals and collecting produce. Have fun working hard and you`ll be mixing up your goods to turn them into ingredients in no time. As you strive to master the game, […]"},{"link":"https://nmac.to/blog/google-earth/","image":"https://nmac.to/wp-content/uploads/2013/12/goo.png","title":"Google Earth For Mac","content":"Take a virtual journey to any location in the world. Explore 3D buildings, imagery, and terrain. Find cities, places and local businesses. Explore the world from anywhere Whether on your computer or on the go, see the world the same way you’re used to seeing it, in 3D. Start your virtual adventure Take a trip […]"},{"link":"https://nmac.to/blog/build-lot-2/","image":"https://nmac.to/wp-content/uploads/2013/12/build.png","title":"Build-a-lot 2 1.0 – Build, buy, sell houses in this strategy game","content":"Build-a-lot… Send the housing market through the roof as you build, buy, and sell houses in the new strategy game, Build-a-lot! You can flip houses for quick cash or sit back and watch the rental income pile up. Become a real estate mogul as you visit scenic towns, earn huge profits and perform special favors […]"},{"link":"https://nmac.to/blog/reckless-getaway/","image":"https://nmac.to/wp-content/uploads/2012/10/Reckless-Getaway.png","title":"Reckless: Getaway 1.0.5 – Crash, smash and trash your way through 16 levels","content":"In Reckless: Getaway, who’d a thought robbing the bank would be the easy part?   Now comes the real challenge – to escape with your hard-earned loot having the fuzz hot at your heels!   Weave in and out of oncoming traffic; dodge, outrun or ram pursuing police carsand just generally crash, smash and thrash […]"}]