[{"link":"https://nmac.to/blog/text-scanner/","image":"https://nmac.to/wp-content/uploads/2019/06/Text-Scanner.png","title":"Text Scanner 1.5.3 – PDF & Document","content":"A text information tool for identifying pictures, which mainly includes text recognition, form recognition, card identification, and supports more than ten language special recognition.   Introduction Text Scanner – is a powerful image scanning tool based on AI’s leading deep learning algorithm that uses optical character recognition technology to convert text content directly into editable […]"},{"link":"https://nmac.to/blog/turbocollage/","image":"https://nmac.to/wp-content/uploads/2016/12/TurboCollage7.png","title":"TurboCollage 7.2.6 – Create stunning picture collages","content":"TurboCollage lets you create stunning picture collages on your Mac. Setup a collage with a prominent center picture, arrange pictures in a regular grid, or create a random picture pile. Tie fond memories together into gorgeous picture mosaics. With an intuitive interface, TurboCollage gives you complete control over your collage design.   Simply start by […]"},{"link":"https://nmac.to/blog/url-manager-pro/","image":"https://nmac.to/wp-content/uploads/2021/05/URL_Manager_Pro_5.png","title":"URL Manager Pro 5.9.1 – Bookmark manager","content":"URL Manager Pro is a bookmark manager for Safari, Explorer, OmniWeb, Mozilla, Netscape, iCab, Camino, and Epic browsers, making it easier to manage bookmarks, email addresses and news groups.   Features include: System-Wide Access:You can access your bookmarks in any application through a system menu. Integration : You have access to your bookmarks from your […]"},{"link":"https://nmac.to/blog/markster/","image":"https://nmac.to/wp-content/uploads/2018/04/Markster.png","title":"Markster 2.12.4 – Store bookmarks centrally instead of syncing","content":"Markster keeps your internet bookmarks in a central store. People use Markster because either: The internal bookmarks facilities (Bookmarks Bar, Bookmarks Menu, Favorites Bar, etc.) in their web browser(s) do not meet their feature expectations. They use more than one web browser, and prefer to keep all their bookmarks in a separate app, independent of […]"},{"link":"https://nmac.to/blog/ytd-converter/","image":"https://nmac.to/wp-content/uploads/2017/07/YTD.Video_.Converter.png","title":"YTD Video Downloader 4.17 – Download free videos from 50+ sites","content":"YTD Video Downloader – Download free videos from 50+ sites also convert most video formats like mp3, mp4, wmv, flv, mov, 3gp, avi. Watch free videos later on other devices: iPad, iPhone, iPod, Samsung Galaxy, HTC, Kindle Fire, Blackberry and many others. Super easy to use and fast   Version 4.17: Release notes were unavailable when […]"},{"link":"https://nmac.to/blog/clipboard-manager/","image":"https://nmac.to/wp-content/uploads/2018/02/Clipboard_Manager_2.png","title":"Clipboard Manager 2.3.5 – Simple clipboard history manager for mac","content":"Clipboard Manager is simple clipboard history manager for mac. It keeps all the changes your clipboard for later uses.   Features: Friendly native interface Global shortcut for show application Direct paste to the current application Paste items as formatted or plain text Paste or delete items by swipe Drag and drop multiple items to any […]"},{"link":"https://nmac.to/blog/easy-new-file/","image":"https://nmac.to/wp-content/uploads/2018/10/Easy-New-File.png","title":"Easy New File 5.3 – Adds functions to Finder contextual menu","content":"Easy New File is a Finder extension which adds some functions to the right-click menu in the Finder.   Features Quick new file Copy file path Support all common file extension, such as text file, Word document, Excel, Keynote, Rich Text document, shell, Python script, Swift… New Terminal here   Version 5.3: fix menu localized. […]"},{"link":"https://nmac.to/blog/boss-radar/","image":"https://nmac.to/wp-content/uploads/2022/02/Boss-Radar.png","title":"Boss Radar 3.01 – Bluetooth Device Tracker","content":"A brand new version with Bluetooth Low Energy devices(they are almost in this mode nowadays) support. All Sandbox restricted action (e.g. start/terminate other apps) removed…   Almost everyone has been caught off task by the boss before. The encounter may be awkward, humiliating, or most likely downright disastrous. But, the truth is, nobody can work […]"},{"link":"https://nmac.to/blog/sessionrestore-for-safari/","image":"https://nmac.to/wp-content/uploads/2021/06/SessionRestore-for-Safari.png","title":"SessionRestore for Safari 2.6.6 – Browser tab management","content":"Are you the kind of person who keeps numerous Safari tabs open, with the intent of reading them later?   SessionRestore is here to help. Save your browsing session, close all windows then start with a fresh session. It’s super easy to restore a session when ever you need it. Enable the handy autosave feature […]"},{"link":"https://nmac.to/blog/resize-sense/","image":"https://nmac.to/wp-content/uploads/2016/10/Resize_Sense_2.png","title":"Resize Sense 2.3.3 – Flexible batch image resizing and cropping","content":"Resize Sense is a batch image resizer/cropper/converter known for its flexibility and convenience. To illustrate its flexibility: using custom size and saving presets, you can easily resize many images, each one to several different sizes, and save them in various formats with different filename patterns. All this in a single batch operation, in a few […]"}]