[{"link":"https://nmac.to/blog/all-my-gods/","image":"https://nmac.to/wp-content/uploads/2014/01/All-My-Gods.png","title":"All My Gods 1.02 – Help a village prosper and grow in this thrilling adventure game","content":"All My Gods … Even gods grow old. So does Saturn, one of the greatest gods of Rome. He decides to retire, and wants his son to take his place. The council of the gods respectfully accepts his will and welcomes an heir to take Saturn’s place on one condition. He has to prove that […]"},{"link":"https://nmac.to/blog/picturesque-2-4-4/","image":"https://nmac.to/wp-content/uploads/2014/01/Picturesque.png","title":"Picturesque 2.4.4 – Make images look gorgeous for the web","content":"Picturesque is an award-winning application designed to make images look gorgeous for the web.    With an animated “drag and drop” style interface, Picturesque makes images gorgeous with tasteful effects like 3D perspective, reflection, glow, shadow, curve, and stroke in less time than it takes to open Photoshop.   Picturesque can also beautify images in […]"},{"link":"https://nmac.to/blog/timelime-1-1-1/","image":"https://nmac.to/wp-content/uploads/2014/01/Timelime.png","title":"Timelime 1.1.1 – Track and visualize your working hours","content":"Timelime is the easiest and most beautiful way to track and visualize your working hours. Timelime is the perfect assistant for:   Freelancers and independent contractors who have to track their time spent on projects Students who want to spend more time studying by monitoring their daily/weekly/monthly workload Individuals who are interested in how they […]"},{"link":"https://nmac.to/blog/terraray-6-5-9/","image":"https://nmac.to/wp-content/uploads/2014/01/TerraRay.png","title":"TerraRay 6.5.9 – Create realistic landscape images","content":"TerraRay is an easy-to-use terrain rendering suite for your Mac. Skip the headache of trying to learn a complicated and expensive design application — with TerraRay, you can create richly textured, realistic landscape images in a matter of clicks! For more in-depth projects, TerraRay offers a fleet of advanced features for you to explore.   […]"},{"link":"https://nmac.to/blog/tuba-1-6/","image":"https://nmac.to/wp-content/uploads/2014/01/Tuba.png","title":"Tuba 1.6 – Super fast and elegantly designed YouTube app","content":"Tuba is a super fast and elegantly designed YouTube app for your beloved Mac   Why use Tuba app instead of youtube.com? 1) The app is blazing fast compare with the website.Everything is much faster. 2) Better design: more content, no clutter. 3) Save 50% battery. Tuba only uses half the power compare with youtube.com, […]"},{"link":"https://nmac.to/blog/idraw-2-3-1/","image":"https://nmac.to/wp-content/uploads/2014/01/iDraw.png","title":"iDraw 2.3.1 – Powerful vector drawing and illustration tool","content":"iDraw is a powerful, feature-packed vector-drawing and illustration application for OS X. It has all the tools you need to create everything from detailed technical illustrations to beautiful works of art. Create intricate designs quickly and easily, and continue working on the go with iDraw for the iPad.   Create resolution-independent illustrations that can be […]"},{"link":"https://nmac.to/blog/astro-1-9/","image":"https://nmac.to/wp-content/uploads/2014/01/Astro.png","title":"Astro 1.9 – Facebook Messenger on Mac","content":"Astro is the best Facebook Messenger app on Mac. For the first time, you can use lightening fast FB chat, just like iMessage on Mac   (1) Super fast interface, just like iMessage (2) The only app that supports group chat (3) Drag & Drop to send files (4) Shortcut to make screenshot (5) Background […]"},{"link":"https://nmac.to/blog/soundbunny-1-0-3/","image":"https://nmac.to/wp-content/uploads/2014/01/SoundBunny.png","title":"SoundBunny 1.0.3 – Tailor volume settings for individual applications","content":"SoundBunny lets you tailor volume settings for individual apps on your Mac.   Turn up the sound on a game or movie without increasing the volume of your other apps. Or boost the volume of your email notifications when you’re expecting an important message.   Emphasize the sound you need. Decrease the sound you don’t. […]"},{"link":"https://nmac.to/blog/diskaid-6-5-3/","image":"https://nmac.to/wp-content/uploads/2014/01/DiskAid.png","title":"DiskAid 6.5.3 – Use your iOS device as an external disk and more","content":"DiskAid is the ultimate transfer tool for accessing the iPod, iPhone or iPad directly from the desktop. Access data such as: music, video, photos, contacts, notes, call history, text messages (SMS), voicemail, and voice memos. With DiskAid you can also transfer files and folders betwen your iPhone, iPad or iPod touch and your computer and […]"},{"link":"https://nmac.to/blog/textexpander-4-2-1/","image":"https://nmac.to/wp-content/uploads/2014/01/TextExpander.png","title":"TextExpander 4.2.1 – Expand custom keyboard shortcuts into frequently-used text and pictures","content":"TextExpander saves your fingers and your keyboard, expanding custom keyboard shortcuts into frequently-used text and pictures. Type more with less effort!   Here are a few examples for what you can do with TextExpander: Insert standard greetings, phrases, boilerplate paragraphs, and signatures – including formatted text and pictures. Correct typos automatically Organize snippets into groups […]"}]