[{"link":"https://nmac.to/blog/slide-design-expert-3-0/","image":"https://nmac.to/wp-content/uploads/2017/06/Slide-Design-Expert.png","title":"Slide Design Expert 3.0 – Templates for MS Powerpoint","content":"These 15 high-quality designs for PowerPoint presentations are more than just good-looking backgrounds. They cover up to 20 diverse master slides, which allows you to select the most fitting layout for your information, whether it mostly consists of bullet points, combines text with illustrations, or presents multiple graphs and tables.   *Requires Microsoft Office 2008 […]"},{"link":"https://nmac.to/blog/imageframer-4-0/","image":"https://nmac.to/wp-content/uploads/2017/06/ImageFramer.png","title":"ImageFramer 4.0 – Design frames for your photos and paintings","content":"ImageFramer enables you to create stunning frames for your photos quickly.   Features Apply multiple layers of photorealistic and artistic frames. Adapt the colors and sizes of the frame and the mat for the best appearance. Multiple variations for each image. Export the framed image to a number of formats in a number of sizes. […]"},{"link":"https://nmac.to/blog/mail-stationery-expert-5-0/","image":"https://nmac.to/wp-content/uploads/2014/11/Designs-for-Mail2.png","title":"Mail Stationery Expert 5.0 – Templates for Apple’s Mail (was Stationary)","content":"Mail Stationery Expert (was Designs for Mail, then was Stationary) brings you a diverse collection of templates for creating customized email messages in Apple Mail. Choose a lively seasonal template for a family newsletter. Or select a sharp, sophisticated design for a business proposal. Its selection is constantly expanding, so you’ll always have access to […]"},{"link":"https://nmac.to/blog/daily-1-9-0/","image":"https://nmac.to/wp-content/uploads/2016/02/Daily.png","title":"Daily 1.9.0 – Time tracking for professionals","content":"Looking for an easy way to get insights in your daily activities? Meet Daily, world’s most convenient time tracking companion for professionals, loved by many due its simplicity. It works by asking what you’re doing in a discrete manner.   Each time Daily asks you what you’re doing, a sample is recorded. Together with other […]"},{"link":"https://nmac.to/blog/audio-record-pro-3-3-8/","image":"https://nmac.to/wp-content/uploads/2016/10/Audio-Record-Pro.png","title":"Audio Record Pro 3.3.8 – Best Music Voice CD Audio Recorder","content":"Audio Record Pro – is easy to record computer audio, online music, software audio, iTunes audio and mic audio.   The app can record internet calls , such as Skype call or other chat software .   The app can edit recorded audio file ( ID3, trim, split, fadein/fadeout, audio volume ) .   Main Function […]"},{"link":"https://nmac.to/blog/fax-studio-1-5/","image":"https://nmac.to/wp-content/uploads/2016/11/Fax-Templates-for-Pages.png","title":"Fax Studio 1.5 – Templates for Pages","content":"Fax Studio – Templates for Pages is a top-quality set of over 100 original templates for Apple’s Pages word processing app. While many businesses have moved on to a variety of modern communication technologies, some still insist using the fax machine. You can be on top of the fax with a range of Graphic Node’s […]"},{"link":"https://nmac.to/blog/photo-album-expert-3-0/","image":"https://nmac.to/wp-content/uploads/2016/12/Photo-Album-Templates.png","title":"Photo Album Expert 3.0 – Templates for Adobe Photoshop","content":"Capture your most precious memories and relive the best times with unique scrapbooks by Graphic Node! The Photo Album Templates for Photoshop-Alungu Designs collection offers 50 quirky and fun scrapbook templates for Adobe Photoshop—a great way to preserve and share your photos or give someone a gorgeous gift.   The 50 templates provide a variety […]"},{"link":"https://nmac.to/blog/aerea-1-0/","image":"https://nmac.to/wp-content/uploads/2017/06/AereA.png","title":"AereA 1.0 – Action & RPG Game","content":"AereA is a music themed Action RPG in which you play as one of Great Maestro Guido’s disciples and explore Aezir; a floating island that was broken into pieces. Your mission is to find and return the nine primordial instruments to restore balance and peace to the world. You have to find your way through […]"},{"link":"https://nmac.to/blog/hover-revolt-of-gamers-1-0/","image":"https://nmac.to/wp-content/uploads/2017/06/Hover.png","title":"Hover : Revolt Of Gamers 1.0 – Open World Action & Adventure Game","content":"Hover: Revolt of Gamers is a fast-paced single and multiplayer Parkour game in a futuristic 3D Open World.   The game takes place in ECP17, a high-tech city also called Hover City by its inhabitants and located on a distant planet. The Great Admin cut the communication with the Galactic Union and established a strong […]"},{"link":"https://nmac.to/blog/rezrog-1-0/","image":"https://nmac.to/wp-content/uploads/2017/06/Rezrog.png","title":"Rezrog 1.0 – Turn-Based adventurer game","content":"The lands of Rezrog are in turmoil. Evil Wizards and hideous monsters from far around have descended to the darkest depths of the earth where they harvest the power of the potent gems that are found there. You must take your team of heroes and defeat all that stands before you in a quest to […]"}]