[{"link":"https://nmac.to/blog/clustertruck/","image":"https://nmac.to/wp-content/uploads/2017/11/Clustertruck.png","title":"Clustertruck 1.1 – A chaotic physics based truckformer game","content":"Clustertruck is a new kind of platformer on-top of a speeding highway!   Use agility and acrobatics through insane levels in a game of “the floor is lava” on top of unpredictable, speeding trucks!   The game only gets harder when dangers such as swinging hammers, lasers and flamethrowers are added!   Features: A campaign […]"},{"link":"https://nmac.to/blog/pharaonic/","image":"https://nmac.to/wp-content/uploads/2017/11/Pharaonic.png","title":"Pharaonic 1.0 – Sidescrolling Combat-RPG set in Ancient Egypt","content":"Pharaonic is an unforgiving sidescrolling Combat-RPG set in Ancient Egypt. Explore a vast kingdom full of dangers and brutal enemies while you find the truth behind Ahmosis I, the Red Pharaoh.   Only the most audacious warriors will have any chance of success. The Pharaoh’s army and countless dangerous creatures will stand in your way. […]"},{"link":"https://nmac.to/blog/adobe-acrobat-xi-pro/","image":"https://nmac.to/wp-content/uploads/2017/08/Adobe-Acrobat-XI11.png","title":"Adobe Acrobat XI Pro 11.0.23 – Powerful PDF editor","content":"    Adobe Acrobat XI Pro allows users to communicate and collaborate more effectively and securely. Unify a wide range of content in a single organized PDF Portfolio. Collaborate through electronic document reviews. Create and manage dynamic forms. And help protect sensitive information.   Version 11.0.23: Fix some part of image/text are getting disappeared while using […]"},{"link":"https://nmac.to/blog/sphinx-and-the-cursed-mummy/","image":"https://nmac.to/wp-content/uploads/2017/11/Sphinx-And-The-Cursed-Mummy.png","title":"Sphinx and the Cursed Mummy 1.0 – 3rd person action-adventure game","content":"Sphinx and The Cursed Mummy is an original 3rd person action-adventure inspired by the mythology of ancient Egypt. Travelling the world via magical portals to foil the evil plans of Set. Sphinx’s Journey will require all his wits, agility, and special powers. He will also rely on his reluctant hero friend, The Mummy, to help […]"},{"link":"https://nmac.to/blog/fossil-echo/","image":"https://nmac.to/wp-content/uploads/2017/11/Fossil-Echo.png","title":"Fossil Echo 1.0 – A story-driven, short and challenging 2D platformer game","content":"Fossil Echo is a short and challenging story driven platformer with hand drawn 2D graphics. Set in a fantastical world, it tells a wordless tale of adventure and mystery.   Features Varied and detailed environments Hand animated 2D characters Over 15 minutes of fully animated cutscenes A wordless, mysterious story Breathtaking orchestral score Very dynamic […]"},{"link":"https://nmac.to/blog/finale/","image":"https://nmac.to/wp-content/uploads/2016/07/Finale.png","title":"Finale 25.5.0.259 – Music notation app","content":"Finale is a music notation program that gives you control over every aspect of the printed page and provides control over MIDI I/O.   Version 25.5.0.259: Release notes were unavailable when this listing was updated.   Intel OS X 10.8 or later Intel Core 2 Duo or better, Intel i3 and above recommended    "},{"link":"https://nmac.to/blog/diluvion/","image":"https://nmac.to/wp-content/uploads/2017/11/Diluvion.png","title":"Diluvion 1.17 – A 3D deep sea exploration RPG game","content":"Forced into the deep oceans by a Great Flood that occurred countless centuries ago, humanity now lives trapped under a thick layer of unbreakable ice and their survival hangs by a tenuous thread. However, their penchant for perseverance is strong, and a new civilization has emerged with distinct kingdoms, religions and cultures. By a twist […]"},{"link":"https://nmac.to/blog/starry-night-pro-plus/","image":"https://nmac.to/wp-content/uploads/2015/01/Starry-Night-Pro7.png","title":"Starry Night Pro Plus 7.6.3 – Virtual space galaxy software","content":"Starry Night Pro has everything the experienced astronomy enthusiast needs to explore the universe.   Features include: Enhanced observation planner lets you create detailed lists of targets for an observing session New observation logs allow you to store notes, times, sky conditions, equipment used, and even images on targets Equipment list allows you to store […]"},{"link":"https://nmac.to/blog/duplicate-file-doctor/","image":"https://nmac.to/wp-content/uploads/2017/11/Duplicate-File-Doctor.png","title":"Duplicate File Doctor 1.1.1 – Find and remove duplicates","content":"Duplicate File Doctor is the complete solution for finding and removing duplicate files. In time, your hard drive will inevitably get filled up with unnecessary duplicate files that will take up a considerable amount of disk space. This is where Duplicate File Doctor comes in with its advanced detection algorithm that will identify all your […]"},{"link":"https://nmac.to/blog/super-music-converter/","image":"https://nmac.to/wp-content/uploads/2017/06/Super-Music-Converter6.png","title":"Super Music Converter 6.2.37 – Best MP3 Music Converter","content":"Super Music Converter can convert almost all audios to any audio format, including FLAC, WAV, WMA, AAC, ALAC, AC3, AIFF, M4A, MP3 and more. Also, it can take out audio files from all videos like MTS, MKV, AVI, FLV MOV, WMV, M4V and even HD videos, and then convert them to popular audio formats like […]"}]