[{"link":"https://nmac.to/blog/omnigraffle-pro/","image":"https://nmac.to/wp-content/uploads/2017/09/OmniGraffle7.png","title":"OmniGraffle Pro 7.18.5 – Create diagrams, flow charts and more","content":"OmniGraffle Pro helps you draw beautiful diagrams, family trees, flow charts, org charts, layouts, and (mathematically speaking) any other directed or non-directed graphs. We’ve had people use Graffle to plan plotlines for a story, make an overview of an operating system, show the evolution of computers, and even show how diseases can spread in a […]"},{"link":"https://nmac.to/blog/leech/","image":"https://nmac.to/wp-content/uploads/2016/06/Leech3.png","title":"Leech 3.1.6 – Complete control over your downloads","content":"Leech gives you complete control over your downloads and full browser integration. You can queue, pause and resume downloads, download from password-protected servers and store your passwords in your system-wide, secure keychain. And you won’t have to worry about downloads that were disrupted by a crashing browser ever again.   Version 3.1.6: Release notes were […]"},{"link":"https://nmac.to/blog/private-contact/","image":"https://nmac.to/wp-content/uploads/2016/05/Private-Contact.png","title":"Private Contact 3.5.2 – Encrypt and store your contacts","content":"Private Contact is an application to manage an always-encrypted address book to protect your privacy and keep your contacts really private.   Data are organised using a master-and-details interface, which is very easy to use. Custom colour categories can be associated with contacts to categorise them. Everything can be sorted by name, company, or category. […]"},{"link":"https://nmac.to/blog/cronette/","image":"https://nmac.to/wp-content/uploads/2018/06/Cronette.png","title":"Cronette 1.9.1 – Launch tasks automatically","content":"Cronette can be used to specify tasks to be launched unattended on your Mac. It is perfect for Mac servers or workstations on which tasks should be executed during the night, or for recurring tasks to be performed on a regular basis.   Cronette provides different types of launch tasks, and any task can be […]"},{"link":"https://nmac.to/blog/punch-planet/","image":"https://nmac.to/wp-content/uploads/2021/01/Punch_Planet_1.png","title":"Punch Planet 1.4.0 – A Fun Sci-Fi Fighter","content":"Punch Planet is a competitive 2D Sci-Fi fighting game with a rich and immersive universe, spanning exotic planets, advanced cities, and alien races.   Battle against friends on the couch or online!   Connect 2 controllers to play together on the same device or invite friends through Game Center. Fight the CPU in single player […]"},{"link":"https://nmac.to/blog/beyond-blue/","image":"https://nmac.to/wp-content/uploads/2021/04/Beyond-Blue.png","title":"Beyond Blue 1.4 – Explore an untouched world","content":"Beyond Blue takes you into the near future, where you’ll have the opportunity to explore the mysteries of our ocean through the eyes of Mirai, a deep sea explorer and scientist. You and your newly-formed research team will use groundbreaking technologies to see, hear, and interact with the ocean in a more meaningful way than […]"},{"link":"https://nmac.to/blog/vintage-scene/","image":"https://nmac.to/wp-content/uploads/2013/02/Vintage-Scene.png","title":"Vintage Scene 2.79 – Special effects software for photography enthusiasts","content":"Vintage Scene is the best special effects software for photography enthusiasts, turning a new or recent photo into an old photo, one that looks like it was taken many years ago. This unique algorithm automatically combines several classic effects: sepia tone, grain, darkened edges, distressed paper, along with the look of fade that with time has […]"},{"link":"https://nmac.to/blog/mimolive/","image":"https://nmac.to/wp-content/uploads/2016/05/mimoLive.png","title":"mimoLive 5.10 – Live-production software for video podcasters","content":"mimoLive ( Was BoinxTV ) is the pioneering live-production software for video podcasters that turns any recent Mac into a TV studio “for the rest of us”.   Record stunning studio shows, podcasts, sports events, concerts, interviews, sermons, seminars and more using your Mac, multiple cameras, microphones and other footage. With its innovative user interface, […]"},{"link":"https://nmac.to/blog/mediahuman-youtube-to-mp3-converter/","image":"https://nmac.to/wp-content/uploads/2021/01/MediaHuman-YouTube-to-MP3-Converter.png","title":"MediaHuman YouTube to MP3 Converter 3.9.9.54 – Download music and take it anywhere","content":"You like to listen to music on YouTube or SoundCloud and want to save it for offline playing. Or you want to download soundtrack of a new movie. Then we recommend you to try out this software developed specifically for this purpose. Downloads all music from a playlist or channel Tracks playlist/channel updates and downloads […]"},{"link":"https://nmac.to/blog/pro-presenter/","image":"https://nmac.to/wp-content/uploads/2021/03/ProPresenter_7.png","title":"ProPresenter 7.4.2 – Presentation system that utilizes two screens","content":"ProPresenter is a presentation system that utilizes two screens, allowing users to quickly and easily present slides on one screen while controlling the presentation with another screen.   Our program allows an operator to click on a slide in our “Control Panel”, at which point the projector screen immediately transitions to the new slide.   […]"}]