[{"link":"https://nmac.to/blog/infographics-lab-for-powerpoint-1-0-3/","image":"https://nmac.to/wp-content/uploads/2017/01/Infographics-Lab-for-PowerPoint.png","title":"Infographics Lab for PowerPoint 1.0.3 – Templates Bundle","content":"Infographics Lab for PowerPoint contains a massive collection of thousands of data visualization tools to illustrate and enhance your Microsoft PowerPoint presentations! Every single item is crafted to perfection to be visually captivating and easily customizable.   Infographics Lab for PowerPoint has items for virtually any occasion, from charts and diagrams to editable city, state, […]"},{"link":"https://nmac.to/blog/hopper-disassembler-4-0-8/","image":"https://nmac.to/wp-content/uploads/2017/03/Hopper-Disassembler4.png","title":"Hopper Disassembler 4.0.8 – Binary disassembler, decompiler, and debugger","content":"Hopper Disassembler is a binary disassembler, decompiler, and debugger for 32-bit and 64-bit executables.   This tool will let you disassemble any binary you want, and provide you all the information about its content, like imported symbols, or the control flow graph! Hopper can retrieve procedural information about the disassembled code like the stack variables, […]"},{"link":"https://nmac.to/blog/biosupremacy-1-0/","image":"https://nmac.to/wp-content/uploads/2017/03/Biosupremacy.png","title":"Biosupremacy 1.0 – RPG Adventure & Action Game","content":"In BioSupremacy, you play as the last remnant of a archaic alien civilization. A multidimensional being has recovered some ancient DNA allowing him to create powerful creatures that now roam the universe looking to dominate every planet on sight. Your duty is to stop them before they take control of the entire universe! Roam through […]"},{"link":"https://nmac.to/blog/codex-of-victory-1-0/","image":"https://nmac.to/wp-content/uploads/2017/03/Codex.of_.Victory.png","title":"Codex of Victory 1.0 – Turn-Based Strategy War Game","content":"Human society has been divided. On one side, the natural course of human evolution has been disrupted. What started as an attempt to adapt to the harsh conditions of outer space and hostile planets, led to the creation of a weird race of transhuman cyborgs – the Augments. Driven by a desire to ‘liberate’ ordinary […]"},{"link":"https://nmac.to/blog/quickphotos-for-google-1-1-2/","image":"https://nmac.to/wp-content/uploads/2016/06/QuickPhotos-for-Google.png","title":"QuickPhotos for Google 1.1.2 – Upload, view and download photos on Google cloud","content":"QuickPhotos for Google is a Mac application from where users can upload, view and download photos on Google cloud. This app will give you a faster access to your Google photos inside a compact app layout from where users will be able to upload and download new photos, create and share new albums, make animations […]"},{"link":"https://nmac.to/blog/movieicon-2-9-50/","image":"https://nmac.to/wp-content/uploads/2017/01/MovieIcon.png","title":"MovieIcon 2.9.50 – Adds cover art to video files","content":"MovieIcon is a simple Mac application designed to automatically apply movie-poster images retrieved from the Internet as icons to your video files, helping you to keep your collection with the sleek style you expect from a Mac.   Features Easy to use. Just drag a file or folder into the window (or add it from […]"},{"link":"https://nmac.to/blog/mosaic-1-2-0/","image":"https://nmac.to/wp-content/uploads/2017/03/Mosaic1.png","title":"Mosaic 1.2.0 – Photo Collage, Blend and Tile","content":"Mosaic is a fun app that creates collages consisting of tiles arranged according to a wide variety of layout templates.   Mosaic contains 48 built-in templates, but you can make your own in the Mosaic iOS editor, or download many additional templates from the website using your web browser or inside the app itself.   […]"},{"link":"https://nmac.to/blog/memory-cleaner-5-1/","image":"https://nmac.to/wp-content/uploads/2017/03/Memory-Cleaner.png","title":"Memory Cleaner 5.1 – Monitor and Free Up Memory","content":"The first and the most efficient Memory Cleaner on the Mac App Store. Don’t waste your memory; clean it. Don’t waste your time; be productive.   Features: Frees up to 2x more memory than the competition Doesn’t freeze your system while cleaning Enable auto clean and forget about slowdowns Tracks the most memory-consuming apps   Recognition: […]"},{"link":"https://nmac.to/blog/keyboard-pilot-1-9-0/","image":"https://nmac.to/wp-content/uploads/2016/09/Keyboard-Pilot.png","title":"Keyboard Pilot 1.9.0 – Switch keyboard layout for different applications","content":"Let Keyboard Pilot take over switching keyboard layouts for different apps. If you’re using a non-English keyboard layout, you might have noticed that some applications work better with an English layout. Things like key shortcuts in Photoshop, or typing symbols like [ ] { } in Xcode.   By letting Keyboard Pilot take over switching […]"},{"link":"https://nmac.to/blog/freeway-pro-7-1-4/","image":"https://nmac.to/wp-content/uploads/2014/12/Freeway-Pro.png","title":"Freeway Pro 7.1.4 – Drag-and-drop Web design solution","content":"Freeway Pro lets you build websites with speed and precision… without writing a line of code!   With it’s user-oriented drag-and-drop interface, Freeway Pro helps you piece together the website of your dreams. Add images, audio, video and interactive content — when your masterpiece is complete, Freeway Pro converts it into clean, standards-compliant code at […]"}]