[{"link":"https://nmac.to/blog/daymap-2-1-3/","image":"https://nmac.to/wp-content/uploads/2017/06/DayMap.png","title":"DayMap 2.1.3 – Optimize your productivity through visual day planning","content":"Have you ever been confused by your day planner? Do you think and plan visually? We created DayMap because we believe visual people deserve an organizer tailored to their strengths.   DayMap is a visual planning app which helps you plan your days and weeks for optimum productivity. The project outliner places your projects side […]"},{"link":"https://nmac.to/blog/anymp4-mod-converter-6-2-35/","image":"https://nmac.to/wp-content/uploads/2016/11/AnyMP4-MOD-Converter.png","title":"AnyMP4 MOD Converter 6.2.35 – Convert MOD to any popular video format","content":"AnyMP4 MOD Converter can convert MOD to any popular video format like MP4, MOV, M4V, MPEG, AVI, WMV, FLV, WebM and more. With this powerful and professional MOD Converter App, you can convert MOD and other HD/4K videos and general videos like MTS, M2TS, TS, TRP, MP4, 3GP, MOV, M4V, MKV, AVI, WMV, OGM, WTV, […]"},{"link":"https://nmac.to/blog/designs-expert-3-0/","image":"https://nmac.to/wp-content/uploads/2017/06/Designs-Expert-InDesign.png","title":"Designs Expert 3.0 – Templates for InDesign","content":"The perfect tool for publishers and advertisers, the Templates for InDesign – Alungu Designs app provides 100 distinctive designs for Adobe InDesign. Just choose a template, add your text and photos, make a few adjustments, and save time for other projects.   The 100 fully editable designs include blogs, brochures, certificates, invitations, labels, magazines, posters […]"},{"link":"https://nmac.to/blog/face-it-1-0/","image":"https://nmac.to/wp-content/uploads/2017/06/Face.It_.png","title":"Face It 1.0 – A game to fight inner demons","content":"Carefuly crafted puzzles in a challenging 3D plaformer experience take the player on a surrealistc journey through a maze of feelings. In Face It, abstract concepts are shaped into gameplay. Darker emotions like fear and depression are monsters and traps, while brighter concepts like HOPE, VISION and LOVE are the powers you need to beat […]"},{"link":"https://nmac.to/blog/expert-clipart-3-1/","image":"https://nmac.to/wp-content/uploads/2017/06/Expert-Clipart.png","title":"Expert Clipart 3.1 – Icons, Backgrounds for iWork","content":"Stills is an ultimate set of 1733 illustrations appropriate for any Pages or Keynote document that requires color, texture and authenticity. It contains 100 high-quality clipart images, 100 illustrations images, 417 high-quality photos (1024 x 768 pixels), 200 photo items with transparent backgrounds, 300 People Clipart, 399 realistic objects rendered in 3D and 217 high-quality […]"},{"link":"https://nmac.to/blog/templates-for-ms-powerpoint-3-0/","image":"https://nmac.to/wp-content/uploads/2017/06/Templates-for-MS-Powerpoint.png","title":"Templates for MS Powerpoint 3.0 – Xpert Designs","content":"These 15 high-quality designs for PowerPoint presentations are more than just good-looking backgrounds. They cover up to 20 diverse master slides, which allows you to select the most fitting layout for your information, whether it mostly consists of bullet points, combines text with illustrations, or presents multiple graphs and tables.   *Requires Microsoft Office 2008 […]"},{"link":"https://nmac.to/blog/mosaic-shapes-2-0-3/","image":"https://nmac.to/wp-content/uploads/2017/06/Mosaic-Shapes.png","title":"Mosaic Shapes 2.0.3 – Convert your photos to abstract mosaic artwork","content":"Mosaic Shapes provides the following parameters to customize and experiment with: Size of grid and shapes that sets level of detail of your mosaics Grid vs diamond layout Average color of original image or colorful spin on the original image   Version 2.0.3: Added analogous color option Minor bug fixes with blending   Intel, 64-bit […]"},{"link":"https://nmac.to/blog/psd-expert-3-0/","image":"https://nmac.to/wp-content/uploads/2017/06/PSD-Expert.png","title":"PSD Expert 3.0 – Templates for Adobe Photoshop","content":"Templates for Photoshop offers 200 high-quality PSD templates for books, newsletters, scrapbooks, and other documents, allowing you to have the final say over how your content looks.   The premium-quality selection offers 200 beautiful and functional designs for Adobe Photoshop. It includes an eclectic mixture of fully editable templates, from flyers and invoices to 50 […]"},{"link":"https://nmac.to/blog/expert-designs-3-0/","image":"https://nmac.to/wp-content/uploads/2017/06/Expert-Designs.png","title":"Expert Designs 3.0 – Templates for MS Word","content":"The collection of 287 easy-to-use templates for creating business and personal documents with MS Word – Templates presents a mix of designs, from business proposals and newsletters to books and menus. Every layout – from the prime elegance of text-only pages to the light-hearted fusion of pictures and slogans in the poster templates – features […]"},{"link":"https://nmac.to/blog/bloom-1-0-773/","image":"https://nmac.to/wp-content/uploads/2016/02/Bloom.png","title":"Bloom 1.0.773 – Lightweight, cross-platform, procedural graphics editor","content":"Bloom (was Ormr) is a fast, lightweight, cross-platform procedural graphics editor that lets you tweak any action you have ever performed — organized by layer. In Bloom, everything is numerically adjustable – all the time, long after the initial effect has been applied. You can tweak and adjust every detail to your heart’s delight until […]"}]