[{"link":"https://nmac.to/blog/watch-this-1-1/","image":"https://nmac.to/wp-content/uploads/2016/01/Watch-This.png","title":"Watch This 1.1 – The new way to watch your movies and TV shows","content":"Because a video player should do more than just play videos. Watch This automatically organizes your movies and TV shows, tracks what you’ve watched and notifies you when new episodes from your favorite shows are available.   Nothing to watch right now? Watch This also has support for streaming sites like Twitch.tv as well as […]"},{"link":"https://nmac.to/blog/between-me-and-the-night/","image":"https://nmac.to/wp-content/uploads/2016/01/Between.Me_.and_.The_.Night_.png","title":"Between Me and The Night 1.0 – A surrealist action adventure game","content":"‘Between Me and The Night’ is a surrealist action adventure game that walks the thin path between sanity and madness. Take on the role of a young boy and explore and interact with the mysterious house in which he lives. Solve puzzles around the house to reveal new places, help you overcome the shadows of […]"},{"link":"https://nmac.to/blog/app-for-whatsapp-3-0-0/","image":"https://nmac.to/wp-content/uploads/2016/01/App-for-WhatsApp.png","title":"App for WhatsApp 3.0.0 – WhatsApp Messenger to your Mac desktop","content":"App for WhatsApp brings the WhatsApp Messenger to your Mac desktop with seamless integration by using native notifications, drag and drop to send media, full support for emojis and much more.   It is the must have App for any WhatsApp addict with a Mac!   Only with App for WhatsApp: Polished Mac style user […]"},{"link":"https://nmac.to/blog/watermarker-2-2-1/","image":"https://nmac.to/wp-content/uploads/2015/08/Watermarker.png","title":"Watermarker 2.2.1 – Branding images with a wide varitey of watermark types","content":"Watermarker is a professional tool for branding images with a wide varitey of watermark types. No stone was left unturned when it came to overhauling the original Watermaker. It was necessary to completely re-write Watermarker from the ground up using the latest technologies to accomplish Watermarker’s ambitious feature set. Thanks to these new technologies, not […]"},{"link":"https://nmac.to/blog/topaz-texture-effects-1-1-0/","image":"https://nmac.to/wp-content/uploads/2016/01/Topaz-Texture-Effects.png","title":"Topaz Texture Effects 1.1.0 – Create an awe-inspiring image","content":"Effortlessly add your creative touch to your images in a fraction of the time it takes in other editing software.   Who says it has to take time to create an awe-inspiring image? With the ability to quickly achieve a variety of textured, toned, and lighting effects, Topaz Texture Effects allows you to do in […]"},{"link":"https://nmac.to/blog/joystick-mapper-1-1-3/","image":"https://nmac.to/wp-content/uploads/2016/01/Joystick-Mapper.png","title":"Joystick Mapper 1.1.3 – Map keys and mouse movements to your gamepads","content":"Joystick Mapper Joystick Mapper is an application that allows you to configure your joysticks or gamepads to simulate keyboard keys/mouse movement/mouse click/mouse scroll, so you can control any app or game using them, even the ones without built-in support.   A very good companion for First Person Shooters, Flash Games, Media Players, for example.   […]"},{"link":"https://nmac.to/blog/episodes-2-2/","image":"https://nmac.to/wp-content/uploads/2016/01/Episodes.png","title":"Episodes 2.2 – Manage all of your TV shows","content":"Episodes is an app which allows you to manage your favorite TV-Shows in a quick and easy way.   It features a powerful dashboard, which gives you a overview over all your favorite shows. It also allows you to play the next episode with one simple click from your hard-disk. It also tracks your viewing […]"},{"link":"https://nmac.to/blog/super-denoising-1-2-5/","image":"https://nmac.to/wp-content/uploads/2015/11/Super.Denoising.png","title":"Super Denoising 1.2.5 – Powerful, professional image-noise reduction","content":"Super Denoising is a powerful, professional image-noise reduction app that detects and removes noise, perfect for handling grainy and underexposed digital images. Super Denoising uses advanced smart-denoising technology to quickly and effectively remove noise and improve image quality without disrupting crisp outlines and image colors for clearer, more natural images. Unlike most noise reduction software […]"},{"link":"https://nmac.to/blog/pdf-encrypt-1-0/","image":"https://nmac.to/wp-content/uploads/2016/01/PDF.Encrypt.png","title":"PDF Encrypt 1.0 – Encrypt and password-protect PDF files","content":"PDF Encrypt makes it possible to easily secure and protect your PDF files. It’s fast and reliable, and uses strong encryption algorithms. Secure your PDF Files today!   PDF Encrypt is one of the apps included in PDF Powerpack, which offers five great PDF tools at one very low price.   Version 1.0: Initial release […]"},{"link":"https://nmac.to/blog/hide-files-1-0/","image":"https://nmac.to/wp-content/uploads/2016/01/Hide.Files_.png","title":"Hide Files 1.0 – Keep sensitive files away from prying eyes","content":"Hide Files can hide your sensitive files from others, but lets you retrieve them quickly without remembering any passwords.   Version 1.0: Initial release   Intel, 64-bit processor OS X 10.7 or later    "}]