[{"link":"https://nmac.to/blog/smart-player/","image":"https://nmac.to/wp-content/uploads/2019/06/Smart-Player.png","title":"Smart Player 1.1.0 – Play and manage MP4 MKV AVI etc.","content":"Smart Player makes watching videos on your Mac effortless! It plays all common file types (MOV, MP4, MKV, AVI plus many more) with ease. As you add video files to your Mac, Smart Player automatically adds them to its library. The app recognises movies, TV shows and home videos, and groups them for you.   […]"},{"link":"https://nmac.to/blog/dropzone/","image":"https://nmac.to/wp-content/uploads/2020/12/Dropzone_4.png","title":"Dropzone 4.3.0 – Open, transfer, and install files by drag-and-drop","content":"Dropzone makes it faster and easier to copy and move files, open applications and share files with many different services.   Dropzone is a unique and amazing app that’s like nothing you’ve ever used before.   We’ve paid fanatical attention to every detail and built an app that looks and feels like an integral part […]"},{"link":"https://nmac.to/blog/pdf-expert/","image":"https://nmac.to/wp-content/uploads/2015/11/PDF-Expert.png","title":"PDF Expert 2.5.21 – Fast & beautiful tool that will empower your PDF workflow","content":"PDF Expert is a fast, beautiful tool that will empower your PDF workflow.   Instant PDFs From the first document, PDF Expert springs into action with smooth scrolling and fast search. PDFs open instantly, whether they are just small attachments or 2000-page reports.   Robust Tools When it’s time to edit, all the great tools […]"},{"link":"https://nmac.to/blog/keka/","image":"https://nmac.to/wp-content/uploads/2021/10/Keka__1.png","title":"Keka 1.2.53 – File archiver for Mac OS X","content":"Keka is a full featured file archiver, as easy as it can be.   With Keka you can compress as many files as you want in a bunch of formats. Divide files and protect them with a password is now a kids game. Just drop the files you want to compress to the Keka icon […]"},{"link":"https://nmac.to/blog/istat-menus-6/","image":"https://nmac.to/wp-content/uploads/2017/08/iStat-Menus6.png","title":"iStat Menus 6.62 – Monitor your system right from the menubar","content":"iStat Menus lets you monitor your system right from the menubar. Included are 8 menu extras that let you monitor every aspect of your system.   Some features: CPU — Monitor cpu usage. 7 display modes, multiple core support. Memory — Monitor memory usage. 4 display modes, page ins/outs and swap usage display. Disks — […]"},{"link":"https://nmac.to/blog/deflection/","image":"https://nmac.to/wp-content/uploads/2019/12/Deflection.png","title":"Deflection 6.0.0 – Structural beam analysis","content":"Deflection is the most interactive, fast, and precise app available for structural beam analysis. Design visually and obtain engineering results, graphs, and equations instantaneously!   Simply place loads and supports on the beam, and see how it bends. Find a cross section in the built-in library, or define a custom shape. Deflection, internal stresses, and […]"},{"link":"https://nmac.to/blog/multitouch/","image":"https://nmac.to/wp-content/uploads/2018/04/Multitouch.png","title":"Multitouch 1.27.4 – Handful trackpad gestures","content":"Multitouch (formerly TouchOven)Easily add more multitouch gestures to macOS, and customize what the gestures do. Multitouch is the elegant way to utilize the power of your Magic Trackpad and Magic Mouse.   Features Free updates with a growing list of gestures and actions. Privacy. No user data is gathered from the app. Does not require Accessibility privileges […]"},{"link":"https://nmac.to/blog/tuneskit-iphone-unlocker/","image":"https://nmac.to/wp-content/uploads/2022/04/TunesKit-iPhone-Unlocker.png","title":"TunesKit iPhone Unlocker 1.1.0 – Quickly Unlock iPad/iPhone without Passcode","content":"Forgot iPhone passcode? Face ID fails to work? No panic! TunesKit iPhone Unlocker is here to get you out of troubles from various scenarios, including iPhone being disabled after many failed attempts, your iPhone screen broken or unresponsive, Touch ID not working, and many more. Thus, you can regain full access to your iPhone, iPad, […]"},{"link":"https://nmac.to/blog/joyoshare-ultfix/","image":"https://nmac.to/wp-content/uploads/2022/04/Joyoshare-UltFix.png","title":"Joyoshare UltFix 3.0.0 – iOS System Recovery","content":"Joyoshare UltFix iOS System Recovery is classic and professional to repair more than 30 kinds of iOS/tvOS issues with no data loss, such as boot loop, iPhone won’t update, stuck in headphone mode, blue screen, white Apple logo, activation error, etc. More than that, this intelligent tool also makes it available to free exit and […]"},{"link":"https://nmac.to/blog/stacks/","image":"https://nmac.to/wp-content/uploads/2016/06/Stacks.png","title":"Stacks 4.2.4 – New way to create pages in RapidWeaver","content":"Stacks is a new way to create pages in RapidWeaver. It’s a plugin designed to combine drag-and-drop simplicity with the power of fluid layout.   Features Fluid Layout: Stacks lets you build pages that flow text to the dimensions of a theme even if the theme has a variable width. You can build flowing columns, […]"}]