[{"link":"https://nmac.to/blog/vault-101-1-4-4/","image":"https://nmac.to/wp-content/uploads/2015/08/Vault.101.png","title":"Vault 101 1.4.4 – Protect critical data with AES-256 encryption. Optionally share online","content":"Vault 101 will help you keep your data protected via strong AES-256 encryption, 256-bit Advanced Encryption Standard. Password-protect files and folders in 3 easy steps: choose the source folder; set capsule name and password; click “Create”.   Easy Access to Your Encrypted Data Since your capsule is encrypted, it’s not possible for others to read […]"},{"link":"https://nmac.to/blog/tublme-1-2/","image":"https://nmac.to/wp-content/uploads/2014/04/Tublme.png","title":"Tublme 1.2 – Beautiful Tumblr desktop client","content":"Tublme is a beautiful and powerful, yet easy-to-use, Tumblr desktop client. It makes browsing Tumblr a whole new experience with its minimalistic approach.   Features: Lists – As in Twitter, a list is a selected group of users. Just add people (you don’t even need to be following them) to a new or existing list […]"},{"link":"https://nmac.to/blog/phoneview-2-11-4/","image":"https://nmac.to/wp-content/uploads/2013/12/25347.png","title":"PhoneView 2.11.4 – Use your iPhone for file storage, data syncing, and much more","content":"PhoneView is the Mac companion for iPhone, iPad and iPod Touch. Access voicemail, SMS/MMS, call history, photos, App Store app data, notes, file storage, iTunes media, voice memos and contacts with one click. PhoneView also automatically archives your messages, call history and voicemails, so you can access them even when your iPhone is not available. […]"},{"link":"https://nmac.to/blog/pdf-nomad-2-4-2/","image":"https://nmac.to/wp-content/uploads/2014/03/PDF-Nomad.png","title":"PDF Nomad 2.4.2 – PDF editor built for Mac","content":"PDF Nomad is a modern, carefully styled PDF editor, built from the ground up for OS X 10.7 and later. It features a multitude of ways to take your PDF documents from one place to the next, through an easy-to-use interface. It provides often used operations like merging multiple documents, as well as more exotic […]"},{"link":"https://nmac.to/blog/floid-1-1-1/","image":"https://nmac.to/wp-content/uploads/2016/01/Floid.png","title":"Floid 1.1.1 – An interaction design tool for any platform & device (Web, iOS, Android)","content":"Floid is a UX design tool for creating interactive animations and multiscreen app flows. Create almost like native experiences. Build prototypes for everyone you can think of. Work efficiently and without any hassle.   We are combining single layer animations together with screens. This means you can easily switch back and forth between animation groups […]"},{"link":"https://nmac.to/blog/up-3-8/","image":"https://nmac.to/wp-content/uploads/2015/12/Up.png","title":"Up 3.8 – Uploader for Instagram","content":"Up, a feature-rich Instagram client and uploader for OS X.   Drag, drop, upload and have fun.   Features: Upload images of any shape or videos with captions directly from your Mac, by simply drag and drop them to the window. Make photos into a 3 by 3 matrix formed large photo on your timeline. […]"},{"link":"https://nmac.to/blog/tunesmedic-1-9-0/","image":"https://nmac.to/wp-content/uploads/2016/01/TunesMedic.png","title":"TunesMedic 1.9.0 – A cleaning utility specially created for iTunes","content":"TunesMedic can solve the problems you have with your Music library by removing duplicates or broken links, deleting empty playlists or exporting songs.   It can also make iTunes run faster by cleaning caches, the Music folder or iOS update files. Besides repairing, TunesMedic can help make your library look nicer by solving naming issues. […]"},{"link":"https://nmac.to/blog/photoflow-1-2-6/","image":"https://nmac.to/wp-content/uploads/2015/08/Photoflow.png","title":"Photoflow 1.2.6 – Brings Instagram to your Desktop","content":"Photoflow brings Instagram to the Desktop. You can view your feed, view popular photos, search for hashtags, browse nearby photos, and search for other Instagram users.   ** All third-party Instagram applications including Photoflow are not able to upload photos.   Features:   Multiple accounts: Switch accounts with ease by opening the sidebar accounts drawer. […]"},{"link":"https://nmac.to/blog/keep-note-1-0-1/","image":"https://nmac.to/wp-content/uploads/2016/01/Keep.Note_.png","title":"Keep Note 1.0.1 – Clean and beautiful notes app","content":"Keep Note is a clean and beautiful notes app that is designed for lightweight note-taking.   You can add, delete, and flip through your notes or do a quick search.   Clean and Explicit Keep Note puts your list of notes right alongside the note you’re currently viewing, so that you can quickly switch between […]"},{"link":"https://nmac.to/blog/callpad-1-2-3/","image":"https://nmac.to/wp-content/uploads/2015/01/CallPad.png","title":"CallPad 1.2.3 – Make phone calls from your Mac","content":"CallPad is a very simple app to ease making phone calls without picking up your iPhone in OS X Yosemite. CallPad requires an iPhone with iOS 8 and an activated carrier plan.   Phone calling works with any iOS device that supports iOS 8 and any Mac that supports Yosemite.   NOTE : In order […]"}]