[{"link":"https://nmac.to/blog/rcmd-app-switcher/","image":"https://nmac.to/wp-content/uploads/2022/03/rcmd.png","title":"rcmd App Switcher 1.5.6 – Reimagined Command-Tab","content":"Re-imagined Command-Tab.   Switch apps instantly just by their first letter! Hold down the right side |⌘ command| and press the first letter of the app name to focus apps instantly The Dynamic algorithm will choose the most useful app for each letter The algorithm will adapt in real time to your workflow If apps […]"},{"link":"https://nmac.to/blog/filmconvert-nitrate-fcpx/","image":"https://nmac.to/wp-content/uploads/2022/03/FilmConvert-Nitrate-FCPX.png","title":"FilmConvert Nitrate FCPX 3.22 – Final Cut Pro Plugin","content":"FilmConvert introduces Nitrate for Final Cut Pro X. A new set of features to give you even more power and control over your color grading. Cineon Log film emulations. Full custom curve control. Advanced film grain controls and more!   Giving Power Back To The Filmmaker. We believe Filmmaking should be enhanced by technology, leaving […]"},{"link":"https://nmac.to/blog/devonthink-pro-office/","image":"https://nmac.to/wp-content/uploads/2020/12/DEVONthink_Pro_3.png","title":"DEVONthink Pro 3.8.2 – Knowledge base, information manager and much more","content":"DEVONthink Pro is a knowledge base, information manager and much more. In today’s world, everything is digital. From shopping receipts to important research papers, your life often fills your hard drive in the form of emails, PDFs, Word documents, multimedia files and more. Questions eventually pop up, like where do you store all of this stuff? […]"},{"link":"https://nmac.to/blog/kaleidoscope/","image":"https://nmac.to/wp-content/uploads/2021/10/Kaleidoscope_3.png","title":"Kaleidoscope 3.3 – Spot differences in text and image files","content":"Kaleidoscope spots differences in text and image files.   Features: General Single window workflow: One tab per comparison Compare two+ files: Add any number of files per tab Always up to date: Auto-refreshes when files change File Shelf: Quickly go from file to file Path Bar: See where your files are Keyboard shortcuts: Every action […]"},{"link":"https://nmac.to/blog/smooze/","image":"https://nmac.to/wp-content/uploads/2022/01/Smooze_Pro.png","title":"Smooze Pro 2.0.17 – Change the way you scroll","content":"Smooze animates your scroll and adds functionality to your non-Apple mouse (scroll-wheel mouse). Disable scroll acceleration in macOS 10.12 Sierra (the app is not free but that specific feature is free and will always be free) Every app you own will have buttery smooth scrolling Save time by attaching mouse buttons to actions Disable animated […]"},{"link":"https://nmac.to/blog/color-wheel/","image":"https://nmac.to/wp-content/uploads/2021/01/Color_Wheel_6.png","title":"Color Wheel 7.0 – Digital color wheel","content":"Digital, abstract, classic – all types of color wheels in one app!   A set of tools for painters and designers includes: Digital Color Wheel – our unique graphic design tool. Classic Color Wheel – a classic, versatile version of the color wheel. Abstract Color Wheel – a specialized color choice for abstract painting (a […]"},{"link":"https://nmac.to/blog/textcraft/","image":"https://nmac.to/wp-content/uploads/2022/03/Textcraft.png","title":"Textcraft 1.0.13 – Magic text transformations","content":"Textcraft is a magical utility that allows you to transform any text in real-time into a variety of 90+ different formats.   WHY YOU’LL LOVE TEXTCRAFT: It’s built with macOS design guidelines in mind to look great in light and dark mode alike, along with containing multiple tints and themes to tweak the app your […]"},{"link":"https://nmac.to/blog/logic-x/","image":"https://nmac.to/wp-content/uploads/2020/06/Logic-Pro_10.png","title":"Logic Pro X 10.7.3 – Professional songwriting, editing, and mixing","content":"Logic Pro X is the most advanced version of Logic ever. Sophisticated new tools for professional songwriting, editing, and mixing are built around a modern interface that’s designed to get creative results quickly and also deliver more power whenever it’s needed. Logic Pro X includes a massive collection of instruments, effects, and loops, providing a […]"},{"link":"https://nmac.to/blog/mainstage/","image":"https://nmac.to/wp-content/uploads/2020/02/MainStage_3.png","title":"MainStage 3.6 – Live performance tool for musicians","content":"Love the sound you got on your recording? MainStage 3 makes it easy to bring all the same instruments and effects to the stage. Everything from the Sound Library and Smart Controls you’re familiar with from Logic Pro X is integrated into MainStage 3. You can even expand your show with prerecorded backing tracks. You’ll […]"},{"link":"https://nmac.to/blog/affinity-photo/","image":"https://nmac.to/wp-content/uploads/2021/01/Affinity_Photo_1.png","title":"Affinity Photo 1.10.5 – Digital editing for photographers and bitmap artists","content":"Affinity Photo–five years in the making–redefines the boundaries for professional photo editing software for the Mac. With a meticulous focus on workflow it offers sophisticated tools for enhancing, editing and retouching your images in an incredibly intuitive interface with all the power and performance you need.   Engineered for Professionals Open, edit and save Photoshop® […]"}]