[{"link":"https://nmac.to/blog/translateq-1-1-8/","image":"https://nmac.to/wp-content/uploads/2014/02/TranslateQ.png","title":"TranslateQ 1.1.8 – Online translator ( Google , Microsoft , Yandex )","content":"Just select text and press key Fn. Program have a button to save the translation to clipboard Services : Google , Microsoft , Yandex. Dictionaries : ImTranslator , Systran, Bab.la.   How it work- TranslateQ Support link. Supported languages(Google): English,  German,  Chinese(Simplified),  Chinese(Traditional),  Spanish,  Japanese, Russian, French, Portuguese, Arabic, Korean, Basque, Catalan, Czech, Danish, Dutch, […]"},{"link":"https://nmac.to/blog/ssh-proxy-14-02/","image":"https://nmac.to/wp-content/uploads/2014/02/SSH-Proxy.png","title":"SSH Proxy 14.02 – Turn various remote SSH servers into SOCKS v5 proxies","content":"SSH Proxy is an easy-to-use tool that helps you effortlessly create and use a SOCKS v5 proxy through an SSH tunnel.    SSH Proxy is able to remember the SSH login password and save it to OS X’s keychain. Furthermore, SSH Proxy is designed to automatically reconnect when your Mac is waking up from sleep. […]"},{"link":"https://nmac.to/blog/movie-database-1-2/","image":"https://nmac.to/wp-content/uploads/2014/02/Movie-Database.png","title":"Movie Database 1.2 – Turn your computer into multimedia center","content":"Turn your computer into an attractive and uncomplicated multimedia center.   MDB (Movie Database) is a simple manager for your movies, series ,TV shows …   Search the contents of your hard drives , Movie Database is responsible for finding additional information on the Internet and create a display where you can easily view your […]"},{"link":"https://nmac.to/blog/unrar-sharp-1-2/","image":"https://nmac.to/wp-content/uploads/2014/02/UnRar-Sharp.png","title":"UnRar Sharp 1.2 – Simple decompression app","content":"UnRar Sharp is a simple, practical decompression software, can fast, simple and efficient extracting file its easy-to-use interface, personalized settings let you easily office.   Features Supports to unzip password protected RAR files . Double click to BROWSE images and PREVIEW files inside an archive without extracting. Supports to automatic mode and manual mode with […]"},{"link":"https://nmac.to/blog/7-wonders-magical-mystery-tour/","image":"https://nmac.to/wp-content/uploads/2014/02/7.Wonders-Magical.Mystery.Tour_.png","title":"7 Wonders: Magical Mystery Tour 1.0 – Build the most enchanting sites of legend and mythology","content":"In an all-new 7 Wonders, you’ll take a fantastic journey to some of the most enchanting sites ever dreamed of. With a team of master builders, you’ll match colorful runes to collect the building blocks needed for Camelot, El Dorado, Atlantis, Shangri-La, and many others. Build all 7 Wonders and then unlock a magical 8th […]"},{"link":"https://nmac.to/blog/choosy-1-0-3/","image":"https://nmac.to/wp-content/uploads/2014/02/Choosy.png","title":"Choosy 1.0.3 – Lets you decide what browser will open when clicking on links","content":"Choosy… Forget the default browser, Choosy opens links in the right browser. When you click on a link Choosy will do the right thing, whether that’s something simple (like using whatever browser is already running) or something complex (like prompting you to pick a browser, but only when you hold down the shift key and […]"},{"link":"https://nmac.to/blog/portrait-3-0-10058/","image":"https://nmac.to/wp-content/uploads/2014/02/portraitplus.png","title":"Portrait+ 3.0.10058 – Auto Retoucher for Portraits","content":"With an innovative retouching program like ArcSoft’s Portrait Plus, you can remove blemishes, smooth skin and even manipulate facial features to make your photos look amazing. Filled to the brim with features and tools, Portrait Plus is one of the best photo enhancers available and is our TopTenREVIEWS Gold Award winner.   ArcSoft Portrait+ is […]"},{"link":"https://nmac.to/blog/notesuite-1-3/","image":"https://nmac.to/wp-content/uploads/2014/02/NoteSuite.png","title":"NoteSuite 1.3 – Stay on top of everything that matters in one organized place","content":"NoteSuite helps you stay on top of everything that matters in one organized place. Macworld rates NoteSuite 4 stars and TUAW calls NoteSuite “one of the most powerful, well thought out applications we’ve seen on Mac and iPad.”   Take notes, manage to-dos, clip web pages, and read and search documents together in one app. […]"},{"link":"https://nmac.to/blog/porthole-1-5-0/","image":"https://nmac.to/wp-content/uploads/2014/02/Porthole.png","title":"Porthole 1.5.0 – AirPlay all audio to multiple speakers","content":"Porthole is a tool that lets you stream the music from your favorite music player such as Spotify or Pandora to your Airplay speakers, Apple AirPort Express and Apple TV.   Porthole focuses on being elegant and simple to use. The setup wizard will have you going in no-time. De-cable your living room and start […]"},{"link":"https://nmac.to/blog/flowchart-1-0/","image":"https://nmac.to/wp-content/uploads/2014/02/FlowChart.png","title":"FlowChart 1.0 – Workflow & Diagram App","content":"FlowChart is an editor for drawing professional looking flowchart diagrams, mind mappings, organization charts, and other diagrams. The diagrams are copied as image to the clipboard with one single click. It also exports diagrams as .png, .jpg, and .bmp image files, and even has an integrated fast .pdf exporter supporting shadows and transparencies.   Features: […]"}]