[{"link":"https://nmac.to/blog/stationery-set-for-pages-4-0-2/","image":"https://nmac.to/wp-content/uploads/2016/10/Stationery-Set-for-Pages.png","title":"Stationery Set for Pages 4.0.2 – Modern and smooth Stationery Set for Pages","content":"A new look for your letters! The modern and smooth Stationery Set encompasses 213 recognizable designs that have been adapted from Jumsoft’s various templates for Mail.   Like its Mail equivalents, Stationery Set for Pages presents an exceptional collection of letters for business and personal use that are visually attractive and highly functional to boot. […]"},{"link":"https://nmac.to/blog/pulpmotion-advanced-3-6-1/","image":"https://nmac.to/wp-content/uploads/2014/01/PulpMotion-Advanced.png","title":"PulpMotion Advanced 3.6.1 – Create animations using your own pictures, videos, music","content":"PulpMotion Advanced is the next generation slideshow and animation software for your media.    PulpMotion Advanced creates slideshow based on highly customizable themes. It allows you to present your pictures as well as your video in a single animation you can share as video, screensaver or executable player.   PulpMotion Advanced makes your pictures come […]"},{"link":"https://nmac.to/blog/screen-capture-pro-2-5-0/","image":"https://nmac.to/wp-content/uploads/2016/10/Screen-Capture-Pro.png","title":"Screen Capture Pro 2.5.0 – Screen capture utility","content":"Screen Capture Pro is a very handy screen capturing software on Mac to help users record the computer screen and save them as video to share with others. It’s one of the best screen recording tool on Mac for you to record online videos or make video demos and you are able to upload your […]"},{"link":"https://nmac.to/blog/foldermarker/","image":"https://nmac.to/wp-content/uploads/2016/10/FolderMarker.png","title":"FolderMarker 2.5.1 – Folder Icon Editor App","content":"Drag and Drop out the icon presets you like to the selected folder, or drag and drop into the app multiple folders to mark them.   Collection with Icons, Emoji and Generic symbols in editor directly.   Customize icon you want and save additional looks.   Add your own images on the folder icon by […]"},{"link":"https://nmac.to/blog/cssdesigner-4-7-1/","image":"https://nmac.to/wp-content/uploads/2016/07/CSSDesigner.png","title":"CSSDesigner 4.7.1 – Full-featured and powerful CSS designing app","content":"CSS Designer is a full-featured and powerful CSS design app. CSSDesigner takes full advantage of the latest Mac technologies, giving you speedy, powerful tools that let you touch up and enhance CSS, draw or paint, apply dazzling effects, or create advanced compositions amazingly easily.   Features Quickly and easily create any CSS3 (CSS2) effects Edit […]"},{"link":"https://nmac.to/blog/masquerada-songs-and-shadows-1-0/","image":"https://nmac.to/wp-content/uploads/2016/10/Masquerada-Songs-and-Shadows.png","title":"Masquerada: Songs and Shadows 1.0 – Deadly magic RPG game","content":"Navigate the masked deceptions and deadly magic of a vividly Venetian city in this fully voiced pause-for-tactics RPG.   In the turmoil-ridden Citte della Ombre, religion holds no sway. Only the songs sung of one’s deeds will carry an Ombrian’s legacy beyond death. Those who hold even the smallest morsel of power will make every […]"},{"link":"https://nmac.to/blog/annotate-2-1-4/","image":"https://nmac.to/wp-content/uploads/2015/06/Annotate2.png","title":"Annotate 2.1.4 – Screenshot capture and annotation tool (was Glui)","content":"Annotate (was Glui) is the simplest way to capture, annotate and share screenshots.   This is a complete rewrite that builds on what made Glui popular and adds some of the most requested features. It’s way faster, far better, and most importantly, just as simple.   Key features: Capture a screenshot or drag and drop […]"},{"link":"https://nmac.to/blog/topaz-texture-effects-2-0-0/","image":"https://nmac.to/wp-content/uploads/2016/01/Topaz-Texture-Effects.png","title":"Topaz Texture Effects 2.0.0 – Create an awe-inspiring image","content":"Effortlessly add your creative touch to your images in a fraction of the time it takes in other editing software.   Who says it has to take time to create an awe-inspiring image? With the ability to quickly achieve a variety of textured, toned, and lighting effects, Topaz Texture Effects allows you to do in […]"},{"link":"https://nmac.to/blog/do-your-data-recovery-for-iphone-4-0/","image":"https://nmac.to/wp-content/uploads/2016/10/Do-Your-Data-Recovery-for-iPhone.png","title":"Do Your Data Recovery For iPhone 4.0 – Easy iOS data recovery","content":"Do Your Data Recovery for iPhone provides three recovery modes to help Mac users retrieve lost contacts, photos, SMS, videos, voice memos, notes or other iPhone data from iPhone, iPad, iPod touch. It lets you directly recover lost data from iOS device, as well recover lost data from iTunes backup or iCloud account. It could […]"},{"link":"https://nmac.to/blog/hybrid-wars-4-5-1/","image":"https://nmac.to/wp-content/uploads/2016/10/Hybrid.Wars_.png","title":"Hybrid Wars 4.5.1 – A futuristic top-down mech shooter game","content":"In 2060, humanity is on the cusp of the second technological revolution. Earth has become a tangled web of information, energy and transportation networks watched from orbit by thousands of electric eyes. Sprawling cities, vast spaceports, and immense military complexes are dominated by tanks, choppers and variety of other machines that rule land, sea and […]"}]