[{"link":"https://nmac.to/blog/disc-cover-3-0-11/","image":"https://nmac.to/wp-content/uploads/2014/11/Disc-Cover.png","title":"Disc Cover 3.0.11 – Design and print CD/DVD labels","content":"Disc Cover is slick and intuitive software to create CD and DVD labels, covers, tray inserts, folding booklets, slim cases, super jewel boxes as well as mini-CD labels, business card CDs, VHS wraps and more.   Over 250 template sets and 1,000+ clipart imahes (40,000+ with Extras Pack) provide a great help for a quick […]"},{"link":"https://nmac.to/blog/lego-movie-videogame/","image":"https://nmac.to/wp-content/uploads/2014/11/The-LEGO-Movie-Videogame.png","title":"The LEGO Movie Videogame 1.0 – Transform the ordinary into the extraordinary","content":"Emmet Brickowski is an averagely ordinary construction worker until he finds the mysterious Piece of Resistance and is mistakenly identified as the “Special”, who is prophesied to save the world from a sticky fate. Together with his new friends Wyldstyle, Batman and Princess Unikitty, Emmet will embark on an epic quest to bring down the […]"},{"link":"https://nmac.to/blog/riffle-1-0/","image":"https://nmac.to/wp-content/uploads/2014/11/Riffle.png","title":"Riffle 1.0 – Lightweight image browser and contact sheet generator","content":"Riffle is an elegantly simple image browser designed for quickly “riffling” through images to find the one you want. Simply drop a folder of images or files onto Riffle and then scrub through every image in every subfolder as fast as your Mac can read and display their contents. Riffle can even export a PDF […]"},{"link":"https://nmac.to/blog/porthole-1-7-4/","image":"https://nmac.to/wp-content/uploads/2014/02/Porthole.png","title":"Porthole 1.7.4 – AirPlay all audio to multiple speakers","content":"Porthole is a tool that lets you stream the music from your favorite music player such as Spotify or Pandora to your Airplay speakers, Apple AirPort Express and Apple TV.   Porthole focuses on being elegant and simple to use. The setup wizard will have you going in no-time. De-cable your living room and start […]"},{"link":"https://nmac.to/blog/hueshifter-1-2-3/","image":"https://nmac.to/wp-content/uploads/2014/01/HueShifter.png","title":"HueShifter 1.2.3 – Image color shifting application","content":"HueShifter is an amazing new application for doing color transposition or “color shifting” in images. Unlike other graphics applications, HueShifter works in perceptually uniform colorspace so you can make changes that are virtually imperceptible, all while working with color dimensions that you’re familiar with – hue, saturation and lightness.   HueShifter works right alongside Adobe […]"},{"link":"https://nmac.to/blog/flamingo-1-3-0/","image":"https://nmac.to/wp-content/uploads/2014/03/Flamingo.png","title":"Flamingo 1.3.0 – Messaging client that supports Hangouts/Gtalk, Facebook, and XMPP","content":"Flamingo is a beautiful, native instant messaging client for OS X that supports Hangouts/Gtalk, Facebook, and XMPP.   Features: All-in-one design: buddies, conversations, and chats in a single window. Multiple, detachable chats in a single window. Inline previews for images, videos, and tweets. Supports CloudApp, Droplr, Instagram, and YouTube. File transfer via direct connection (compatible […]"},{"link":"https://nmac.to/blog/watermark-fx-3-0/","image":"https://nmac.to/wp-content/uploads/2014/11/Watermark-FX.png","title":"Watermark FX 3.0 – Batch watermarking with effects","content":"Watermark FX combines features of powerful image converter and easy-to-use image editor. It is packed with powerful tools that let you add logos, and a variety of text and line watermark effects to hundreds of your photos at once. Application also converts images into other file formats, changes names or sizes and more.   Import […]"},{"link":"https://nmac.to/blog/pdf-toolbox-2-0-2/","image":"https://nmac.to/wp-content/uploads/2014/11/PDF.Toolbox.png","title":"PDF Toolbox + 2.0.2 – Perform significant editing tasks on PDF files","content":"Enhance the way you work with PDF documents. PDF Toolbox + is an easy-to-use but powerful app, it can handle many PDF tasks that you throw at it. It is equipped with 8 tools to combine, split, encrypt, compress, insert PDF document, and lets you convert PDF to plain text (.txt) with advanced OCR function, […]"},{"link":"https://nmac.to/blog/doodle-god/","image":"https://nmac.to/wp-content/uploads/2014/11/Doodle.God_.png","title":"Doodle God 3.0.0 – Entertainment puzzle game","content":"The power of creation is in your hands! In this addictive, ALL ages, puzzle game mix and match different combinations of fire, earth, wind and air to create an entire universe! Of course the universe was not created in a day. You’ll have to work your up from a simple microorganism to create animals, tools, […]"},{"link":"https://nmac.to/blog/reformator-1-0-3/","image":"https://nmac.to/wp-content/uploads/2014/09/Reformator.png","title":"Reformator 1.0.3 – Multi-functional batch photo converter","content":"Reformator helps you convert a bulk of images into the most popular image formats, give your files meaningful names, watermark with text and image, adjust photos (brightness/saturation/exposure/grayscale/etc.), fit geometry (scale/crop/trim/etc.), remove private metadata, add your own copyrights, and much more. Also, Reformator is a great tool to browse your photos with an up-to-date photo Browser, […]"}]