[{"link":"https://nmac.to/blog/glimpses-2-2/","image":"https://nmac.to/wp-content/uploads/2015/07/Glimpses.png","title":"Glimpses 2.2 – Still-motion video creator (was Briefly)","content":"With Glimpses (was Briefly), still-motion videos are a neat and fun way to show hundreds and hundreds of your photos within a few minutes. (Still-motion videos consist of photos that are shown for the fraction of a second – though not to be confused with stop motion where photos necessarily correlate with each other and […]"},{"link":"https://nmac.to/blog/daily-1-7-3/","image":"https://nmac.to/wp-content/uploads/2016/02/Daily.png","title":"Daily 1.7.3 – Time tracking for professionals","content":"Looking for an easy way to get insights in your daily activities? Meet Daily, world’s most convenient time tracking companion for professionals, loved by many due its simplicity. It works by asking what you’re doing in a discrete manner.   Each time Daily asks you what you’re doing, a sample is recorded. Together with other […]"},{"link":"https://nmac.to/blog/capture-gif-1-4-4/","image":"https://nmac.to/wp-content/uploads/2016/06/Capture.Gif.png","title":"Capture Gif 1.4.4 – Record your screen as an animated GIF","content":"With Capture Gif, you can easily record your entire screen or just an area as an animated GIF image. Capture Gif has support for multiple displays, is Retina-ready, and always generates clear GIF images.   Features Record any connected display Optionally capture the mouse cursor Can record OS X menu bar area (or anywhere on […]"},{"link":"https://nmac.to/blog/keyflow-pro-1-7-1/","image":"https://nmac.to/wp-content/uploads/2016/08/KeyFlow-Pro.png","title":"KeyFlow Pro 1.7.1 – Personal Asset Management and More","content":"KeyFlow Pro is a simple, but powerful media asset management app for single user and small workgroup.   KeyFlow Pro keeps all your assets online, searchable, editable, and easily sharable.   On more thing, KeyFlow Pro provides seamless workflow with Final Cut Pro X as well as other applications.   KEY FEATURES   ALL MEDIA […]"},{"link":"https://nmac.to/blog/bee-2-4-5/","image":"https://nmac.to/wp-content/uploads/2015/03/Bee.png","title":"Bee 2.4.5 – Client for tracking in FogBugz, GitHub, and JIRA","content":"Bee syncs with GitHub Issues, JIRA, and FogBugz. You can also use Bee to keep track of your plain text notes.   Features: Flight Path. Flight Path lives in your menu bar and helps you by intelligently selecting the task you should be working on next. Notifications. Bee uses Notification Center to inform you of […]"},{"link":"https://nmac.to/blog/picframe-2-8-4/","image":"https://nmac.to/wp-content/uploads/2014/09/PicFrame.png","title":"PicFrame 2.8.4 – Combine multiple photos into frames","content":"PicFrame helps you combine multiple photos into amazing looking frames that you can save to your computer or share to Facebook. With 67 adjustable frames, rounded corners and plenty of patterns, you will always have a unique look.   Since PicFrame was released on the iPhone and iPad we have often been requested to create […]"},{"link":"https://nmac.to/blog/greeting-cards-1-9/","image":"https://nmac.to/wp-content/uploads/2016/07/Greeting-Cards.png","title":"Greeting Cards 1.9 – A collection of 500 Pages templates for cheerful celebrations","content":"Greeting Cards – Graphic Node presents a holidays card application offering a collection of 500 Pages templates for cheerful celebrations.   Buy it now if you: Want to congratulate your friends or loved ones Do it like a professional designer Want to get regular updates Like free things and holidays   Nearly all objects in […]"},{"link":"https://nmac.to/blog/bullshot-1-0/","image":"https://nmac.to/wp-content/uploads/2016/11/Bullshot.png","title":"BULLSHOT 1.0 – Run & gun action shooting game","content":"BULLSHOT, run & gun action shooting game for diehard fans and newcomers!   Twenty light years from AR-K space station is planet planet Valer, inhabited by the peaceful valerians. After several years of war, the invaders, the evil cardesians rule with an iron fist, depriving the valerians from their freedom, apple pies and the valerian […]"},{"link":"https://nmac.to/blog/headlander-1-0/","image":"https://nmac.to/wp-content/uploads/2016/11/Headlander.png","title":"Headlander 1.0 – Sci-fi, Action & Adventure Platformer Game","content":"You are the last known human in the universe, and all that’s left of you is a disembodied head. Seeking clues to your fractured past, you must travel through a hostile world of machines using a special helmet that allows you to dock into and take control of any robotic host body. As you launch […]"},{"link":"https://nmac.to/blog/mekazoo-1-0/","image":"https://nmac.to/wp-content/uploads/2016/11/Mekazoo.png","title":"Mekazoo 1.0 – A 2D platformer set in a vibrant 3D world","content":"Mekazoo is a 2D platformer set in a vibrant 3D world with fast-flowing gameplay and a cast of kinetically-diverse mechanized animals. Control a pair of synthetic creatures by switching between each unique set of movements and abilities at any moment. Fast reflexes and determination will be needed to overcome and discover the many obstacles and […]"}]