[{"link":"https://nmac.to/blog/airfile-1-1-0/","image":"https://nmac.to/wp-content/uploads/2014/03/AirFile.png","title":"AirFile 1.1.0 – Manage and access all your clouds in one place","content":"AirFile for iOS now comes to Mac! It lets you manage and access all your clouds in one place. You don’t need to use each application for each cloud. It provides you a unified access to all your clouds. Are you looking for an app that allows for accessing multiple Dropbox, multiple Box, multiple Google […]"},{"link":"https://nmac.to/blog/photoresize-pro-4-1/","image":"https://nmac.to/wp-content/uploads/2014/03/PhotoResize-Pro.png","title":"PhotoResize Pro 4.1 – Tool to resize, convert, optimize and rename images and photos","content":"PhotoResize Pro is fantastic tool to resize, convert, optimize and rename thousands of images and photos at lightning fast speed. It offers features like image format conversion between JPEG, TIFF, PNG, JP2, RAW image types and many more formats, Lossless optimization for JPEG and PNG types, Resize using flexible editing controls with sharpness and resolution […]"},{"link":"https://nmac.to/blog/audio-normalizer-1-0-0/","image":"https://nmac.to/wp-content/uploads/2014/03/Audio.Normalizer.png","title":"Audio Normalizer 1.0.0 – Adjust the audio files volume levels","content":"Do your audio files have different volume levels? Are you tired of constantly adjusting your music’s volume? It’s really annoying, right? You need Audio Normalizer which is used to control audio volume.   Audio Normalizer ensures that all your songs could be controlled and adjusted to the same volume level. Most popular audio file formats […]"},{"link":"https://nmac.to/blog/itriumph-1-0-2/","image":"https://nmac.to/wp-content/uploads/2014/02/iTriumph.png","title":"iTriumph 1.0.2 – Your life organized: calendars, contacts, and journal.","content":"Life happens fast whether it’s personal or business. The best way to stay on top is focus. iTriumph is here to help. iTriumph integrates your calendar, contacts, and journal in a single application to provide you with clarity. Not only will iTriumph help you manage current obligations and relationships, it will help you reflect and […]"},{"link":"https://nmac.to/blog/geoexpert-3-0/","image":"https://nmac.to/wp-content/uploads/2014/03/GeoExpert.png","title":"GeoExpert 3.0 – Have fun learning geography","content":"Have fun learning to identify the countries, capitals and flags of the world!! GeoExpert is unique among games in the App Store due to the fact that it is educational in nature and makes learning fun. Because of this, it is used in various schools to teach geography.   Available also for iPad and iPhone. […]"},{"link":"https://nmac.to/blog/mavericks-cache-cleaner-8-0-4/","image":"https://nmac.to/wp-content/uploads/2014/03/Mavericks-Cache-Cleaner.png","title":"Mavericks Cache Cleaner 8.0.4 – Clear caches, access hidden OS X settings, and more","content":"Mavericks Cache Cleaner is an award-winning general purpose tool for OS X. MCC makes system maintenance simple with an easy point-and-click interface to many OS X functions. Novice and expert users alike will appreciate the powerful toolset MCC provides. Mavericks Cache Cleaner is one of the world’s leading maintenance tools, with millions of downloads around […]"},{"link":"https://nmac.to/blog/stuffit-deluxe-15-0-4/","image":"https://nmac.to/wp-content/uploads/2014/02/StuffIt-Deluxe.png","title":"StuffIt Deluxe 15.0.4 – File compression tool","content":"StuffIt Deluxe packages your files and sends them where you want them as easily as drag-and-drop. Need security? Destinations uses strong AES 256-bit encryption. Destinations combines DropStuff and StuffIt Expander into one powerful tool. It’s an expansion tool that supports nearly any file type you download from the Internet or receive as an attachment. Destinations […]"},{"link":"https://nmac.to/blog/euro-truck-simulator/","image":"https://nmac.to/wp-content/uploads/2014/02/Euro-Truck-Simulator-1.png","title":"Euro Truck Simulator 1.4.0 – Play with European long haul trucks","content":"Euro Truck Simulator is a European first – a truck simulation game in a European setting, with European long haulage trucks! Drive cargos from Rome to Berlin to Madrid to Prague – and many more cities – in realistic vehicles. Euro Truck Simulator is a faithful reproduction of driving trucks on the European road.   […]"},{"link":"https://nmac.to/blog/pdf-toolset-2-1-0/","image":"https://nmac.to/wp-content/uploads/2014/02/PDF.Toolset.png","title":"PDF Toolset 2.1.0 – Powerful PDF document toolkit","content":"Enolsoft PDF Toolset is a ultimate yet powerful PDF document toolkit that allows you to merge multiple PDF files into one, split one big PDF file into smaller ones, compress entire PDF file into smaller size file, extract images out of the PDF, or extract Text out of the PDF file.   Key Features: Quickly […]"},{"link":"https://nmac.to/blog/pdfscanner-1-7-0/","image":"https://nmac.to/wp-content/uploads/2014/02/PDFScanner.png","title":"PDFScanner 1.7.0 – Scan and archive documents","content":"PDFScanner has been created with one simple task in mind: scanning and archiving documents as quick and easy as possible, and making them findable with Spotlight search. There are many applications for OS X that allow scanning of images or text. Most of them are however complex, slow or not really suited for scanning documents […]"}]