[{"link":"https://nmac.to/blog/compose-1-8-7/","image":"https://nmac.to/wp-content/uploads/2015/12/Compose.png","title":"Composé 1.8.7 – Develop iOS apps without writing code","content":"Composé creates apps for iOS that are tailored to iPhone and iPad. This ensures an authentic look-and-feel and no compromise on performance.   Features Arrange text and images on a pixel-perfect layout grid Include RSS-Feeds, JSON- and CSV data Include audio and video Add animations Create forms and databases Export your result for Xcode, so […]"},{"link":"https://nmac.to/blog/desk-pm-2-1-1/","image":"https://nmac.to/wp-content/uploads/2015/02/Desk.png","title":"Desk PM 2.1.1 – A Writing, Blogging, and Notetaking App","content":"Desk is a premium writing experience for all types of writers.   Whether you’re a casual enthusiast, the weekend writer, blogger, or digital publishing professional, you’ll find Desk to be a much-needed breath of fresh air.   Designed to marry both function and form, it is the desktop publishing client that you’ve always wanted: Simple, […]"},{"link":"https://nmac.to/blog/photojob-2-0-1/","image":"https://nmac.to/wp-content/uploads/2015/12/PhotoJob.png","title":"PhotoJob 2.0.1 – Batch photo-editing toolkit","content":"PhotoJob is a powerful and intuitive toolkit to batch-edit your photos. It helps you to convert, resize, watermark, rename, optimize, enhance, and apply effects to thousands of photos at lightning fast speed. In addition, PhotoJob has options to preserve metadata properties, time stamp and can also maintains your source folder photo storage hierarchy. An extensive […]"},{"link":"https://nmac.to/blog/ibank-5-6-4/","image":"https://nmac.to/wp-content/uploads/2014/02/iBank.png","title":"iBank 5.6.4 – Intuitive personal finance manager, widget available","content":"iBank is a new standard for Mac money management.    With its intuitive user interface and a full set of money management features, iBank 5 is the most complete software available for Mac personal finance. iBank 5 lets you enter and edit your transactions with ease, pay bills online and on time, download your online […]"},{"link":"https://nmac.to/blog/quicken-2016-3-0-3/","image":"https://nmac.to/wp-content/uploads/2014/12/Quicken.png","title":"Quicken 2016 3.0.3 – Complete personal finance solution","content":"Quicken 2016 helps you manage all your personal finances in one place, so you can see where you’re spending and where you can save. Quicken automatically categorizes your financial transactions, helps you stay on top of bills and set goals so you can save more. You can even access your data on the go.   Features: […]"},{"link":"https://nmac.to/blog/up-3-6/","image":"https://nmac.to/wp-content/uploads/2015/12/Up.png","title":"Up 3.6 – Uploader for Instagram","content":"Up, a feature-rich Instagram client and uploader for OS X.   Drag, drop, upload and have fun.   Features: Upload images of any shape or videos with captions directly from your Mac, by simply drag and drop them to the window. Make photos into a 3 by 3 matrix formed large photo on your timeline. […]"},{"link":"https://nmac.to/blog/mackernews-1-0-4/","image":"https://nmac.to/wp-content/uploads/2015/12/MackerNews.png","title":"MackerNews 1.0.4 – The Hacker News Client","content":"MackerNews is the best fully functional Hacker News desktop client for Mac.   Interact with the Hacker News community with style and ease!   FEATURES: Beautiful readable renditions of the article (original version displayed if its not available) Browse article comments with ease in a native interface Share articles easily Open article in your browser […]"},{"link":"https://nmac.to/blog/ibackupbot-5-3-6/","image":"https://nmac.to/wp-content/uploads/2015/11/iBackupBot.png","title":"iBackupBot 5.3.6 – Browse, view, export and modify iTunes backup files","content":"iBackupBot gives you the ability to browse, view, export, and modify iTunes backup files. With its built-in plist editor, hex editor, text editor, database viewer, image viewer, SMS message viewer, notes viewer, address book viewer, and media browser, you can view and edit any file that iTunes backed up from iPad/iPhone/iPod Touch to your computer. […]"},{"link":"https://nmac.to/blog/into-the-void-1-0/","image":"https://nmac.to/wp-content/uploads/2015/12/IntoTheVoid.png","title":"Into the Void 1.0 – A strategy RPG and exploration sci-fi game","content":"Into the Void is a strategy RPG and exploration sci-fi game with an epic story and intense battles. Travel through space and discover the origin of a cosmic threat which destroyed Earth centuries ago. Fight or cooperate with the different factions; be a leader !   Fully command your faction. Build your fleet, arm it […]"},{"link":"https://nmac.to/blog/jitouch-2-63/","image":"https://nmac.to/wp-content/uploads/2015/01/Jitouch.png","title":"Jitouch 2.63 – Expands the gestures for MacBook multi-touch trackpad and Magic Mouse","content":"Jitouch is an application that expands the set of Multi-Touch gestures for the new MacBook and the new Magic Mouse. These thoughtfully designed gestures will enable you to perform frequent tasks more easily such as changing tabs in Web browsers, closing windows, minimizing windows, changing Spaces, and a lot more.   Jitouch also fulfills many […]"}]