[{"link":"https://nmac.to/blog/justbroadcaster-for-youtube/","image":"https://nmac.to/wp-content/uploads/2017/01/JustBroadcaster-for-YouTube.png","title":"JustBroadcaster for YouTube 2.0 – Video streaming for YouTube on your Mac","content":"JustBroadcaster for YouTube allows you to live stream from your Mac. Just insert the video sources into the prepared templates and start stream. Easy logo and background setup. The application supports built-in, USB, DV, HDMI cameras. Simple capturing of the screen and application windows. Cursor capture is supported. You can broadcast iOS games and applications by […]"},{"link":"https://nmac.to/blog/photoshrinkr/","image":"https://nmac.to/wp-content/uploads/2018/08/PhotoShrinkr.png","title":"PhotoShrinkr 1.0 – Optimizes Highest Quality Photos to Smallest Size","content":"PhotoShrinkr is an application to dramatically reduce the size of photos while maintaining the finest visual quality. PhotoShrinkr optimizes the compression of .jpg format in ways that Photoshop and other apps do not.   We worked months pondering the details of jpg compression and creating algorithms to reduce the size dramatically while maintaining the highest […]"},{"link":"https://nmac.to/blog/battery-health-2/","image":"https://nmac.to/wp-content/uploads/2018/06/Battery-Health-2.png","title":"Battery Health 2 1.8 – Monitor Battery Stats and Usage","content":"Battery Health 2 provides detailed stats and health information for your MacBook’s battery!   Be sure to check out the ‘Tips’ section within the app to learn a host of useful ways to improve the life of your MacBook’s battery.   Note: This app contains in-app or external-module purchases.   Version 1.8: Bug fixes   […]"},{"link":"https://nmac.to/blog/pdf-reader/","image":"https://nmac.to/wp-content/uploads/2018/07/PDF-Reader.png","title":"PDF Reader 1.3.2 – PDF Document Viewer","content":"PDF Reader gives you a complete file managing system that allows you to edit your PDFs to your specification. Building on solid features such as annotation and bookmarking. PDF Reader offers even more —   combining multiple documents, splitting your PDF into several files,   inserting pages from another PDF and PDF files.   READ […]"},{"link":"https://nmac.to/blog/volta/","image":"https://nmac.to/wp-content/uploads/2018/07/Volta.png","title":"Volta 1.2.5 – Ultimate power control for Mac","content":"Reduce the voltage suppiled to the processor   A reduced voltage decreases power consumption and thermal output of the processor – improving battery life   Preventing thermal throtteling – allowing longer sustained performance    Only compatible with Haswell and Broadwell processors (Macbooks from 2013 – 2015). This functionality has been prevented on later generations.   […]"},{"link":"https://nmac.to/blog/mountain/","image":"https://nmac.to/wp-content/uploads/2016/01/Mountain.png","title":"Mountain 1.6.6 – Manage mounted storage drives from the menu bar","content":"Mountain allows you to manage volumes with ease.   With Mountain you can mount, unmount or eject volumes with two single clicks. Unmount a single volumes or eject all external volumes at once. Unmounted volumes will be spun down and can either be unplugged or reactivated in Mountain without the need to unplug the USB […]"},{"link":"https://nmac.to/blog/unbound/","image":"https://nmac.to/wp-content/uploads/2018/03/Unbound.png","title":"Unbound 1.3 – A faster, simpler photo manager","content":"Unbound was designed with speed as a priority. Everything from the initial app launch to scrolling through your thumbs is incredibly responsive. Access photos whenever you want without having to wait. It doesn’t create a separate photo library like other photo apps. Instead, Unbound uses your existing file structure to create its albums. This means […]"},{"link":"https://nmac.to/blog/ancient-planet/","image":"https://nmac.to/wp-content/uploads/2018/07/Ancient-Planet.png","title":"Ancient Planet 1.0.23 – Casual Tower Defense Game","content":"The stronghold of an ancient civilization has been invaded by hordes of alien raiders.   Use powerful technologies of the Ancient and repel the attack of the enemy’s armies!   Features: Classic Tower Defense (TD) for those who are fond of good old games; Building towers in any free area on the field; 40 unique […]"},{"link":"https://nmac.to/blog/rise-tomb-raider/","image":"https://nmac.to/wp-content/uploads/2018/04/Rise-of-the-Tomb-Raider.png","title":"Rise of the Tomb Raider 1.0.4 – Discover the legend within","content":"Rise of the Tomb Raider: 20 Year Celebration includes the base game and Season Pass featuring all-new content. Explore Croft Manor in the new “Blood Ties” story, then defend it against a zombie invasion in “Lara’s Nightmare”. Survive extreme conditions with a friend in the new online Co-Op Endurance mode, and brave the new “Extreme […]"},{"link":"https://nmac.to/blog/tropico/","image":"https://nmac.to/wp-content/uploads/2014/09/Tropico5.png","title":"Tropico 5 1.0.10 – Build and control your own island “Simulation Game”","content":"Return to the remote island nation of Tropico in the next installment of the critically acclaimed and hugely popular ‘dictator sim’ series. Expand your Dynasty’s reign from the early colonial period to beyond the 21st Century, facing an all-new set of challenges, including advanced trading mechanics, technology and scientific research, exploration and for the first […]"}]