[{"link":"https://nmac.to/blog/projection-first-light/","image":"https://nmac.to/wp-content/uploads/2021/01/Projection.png","title":"Projection: First Light 1.14.0 – A shadow puppet adventure","content":"Projection: First Light follows the adventures of Greta, a girl living in a mythological shadow puppet world, as she embarks on a journey of self-enlightenment with the assistance of legendary heroes from each culture she explores.   Accompanied by atmospheric visuals and an ethereal soundtrack made with antique instruments used for shadow puppet performances, Projection: […]"},{"link":"https://nmac.to/blog/carto/","image":"https://nmac.to/wp-content/uploads/2020/11/Carto.png","title":"Carto 1.0.6 – Story Rich Puzzle & Adventure Game","content":"Carto is a charming adventure game wrapped around a unique, world-altering puzzle mechanic. Use this power to explore mysterious lands, help a quirky cast of characters, and guide Carto on her journey back to her family.   Separated from her Granny during a storm, young Carto must use her innate cartography powers to map and […]"},{"link":"https://nmac.to/blog/in-other-waters/","image":"https://nmac.to/wp-content/uploads/2020/04/In-Other-Waters.png","title":"In Other Waters 1.0.6 – Atmospheric Exploration & Adventure Game","content":"When Ellery is called to planet Gliese 677Cc by Minae Nomura, only to arrive at an abandoned base, she finds herself adrift in an ocean of secrets, with little more than a malfunctioning diving suit and a strange AI to guide her. You are this AI.   Guide Ellery—and keep her safe—as you dive deeper […]"},{"link":"https://nmac.to/blog/dodo-peak/","image":"https://nmac.to/wp-content/uploads/2021/01/Dodo-Peak.png","title":"Dodo Peak 1.4.0 – A Retro Platformer For All","content":"Play as a dodo bird to find and rescue your lost babies from a series of dangerous peaks. Maneuver them home while avoiding obstacles and enemies! Dodo Peak is a throwback to the classic arcade platformers of the past with a modern twist.   Collect coins, dodge sneaky snakes, avoid malevolent monkeys, grab power-ups for […]"},{"link":"https://nmac.to/blog/planet-nomads/","image":"https://nmac.to/wp-content/uploads/2019/04/Planet-Nomads1.png","title":"Planet Nomads 1.0.7.1 – Open World Survival & Exploration Game","content":"Planet Nomads is a singleplayer sci-fi sandbox game of survival on alien planets through block-style building. You are a lone astronaut scientist crash-landing on a strangely captivating planet. Keeping your wit together and securing your basic survival needs that include food, water and building material is the best start towards figuring out a way out […]"},{"link":"https://nmac.to/blog/net-worth-pro/","image":"https://nmac.to/wp-content/uploads/2020/12/NetWorth-Pro-2.png","title":"Net Worth Pro 2 3.4.2 – Your financial health checkup","content":"Track your net worth using your own custom asset and liability categories. Apply your own tags to categories. Supports assets and liabilities held in foreign currencies.   Net Worth is the most important number in your personal finance. Tracking your Net Worth gives you the most accurate picture of your complete financial health.   Are […]"},{"link":"https://nmac.to/blog/typing/","image":"https://nmac.to/wp-content/uploads/2020/12/Typing.png","title":"Typing 2.4 – Touch typing practice","content":"The best way to learn something is to play, our game will help you quickly learn blind typing.   Version 2.4: Thank you for using our app! In this update: Improved order of levels. Fixed a couple of bugs.   Intel, 64-bit processor macOS 10.13 or later    "},{"link":"https://nmac.to/blog/magoshare-data-recovery/","image":"https://nmac.to/wp-content/uploads/2018/12/Magoshare-Data-Recovery.png","title":"Magoshare Data Recovery 4.5 – Data recovery from most storage media","content":"Magoshare Data Recovery is one of the most powerful apps for Mac data recovery. It makes data recovery easier and deeper, easily and completely recovering deleted, formatted, or inaccessible data from hard drives, USB flash drives, portable hard drives, memory cards, digital cameras, and other storage media devices. It not only can recover deleted files […]"},{"link":"https://nmac.to/blog/rainy-daze/","image":"https://nmac.to/wp-content/uploads/2020/01/Rainy-Daze.png","title":"Rainy Daze 1.23 – Add cloudy skies and rain to your photos","content":"Rainy Daze puts the power, emotion and uses of rain at your fingertips. With it, you have the power to envelop your photos in a soft mist’s romantic glow, wash your landscapes clean of imperfection, and bring drops of meaning, large and small, fast or smooth, to your personal expression.   Is it possible for […]"},{"link":"https://nmac.to/blog/aquarella/","image":"https://nmac.to/wp-content/uploads/2017/06/Aquarella.png","title":"Aquarella 1.38 – Transform photographs into watercolors","content":"Watch as Aquarella transforms your image into one with liquid pools of color blended fluidly on paper to create a watercolor with all the delicate transparent and luminous artistic details found in a traditional watercolor media.   Look closely as you render your aquamedia to discover light delicate “blooms” of wet color running throughout your […]"}]