[{"link":"https://nmac.to/blog/kid-pix/","image":"https://nmac.to/wp-content/uploads/2020/11/KID.PIX_.png","title":"KID PIX The STEAM Edition 5.0.3 – Everything kids need to create and share their stories","content":"Kid Pix the biggest leap forward in a decade for the #1 kids drawing and painting creativity software, our brand new Kid Pix has everything your young artist needs to tell their stories and adventures on screen. The “3D” part of the name refers to the wonderfully rounded new 3D animations and 3D backgrounds, and […]"},{"link":"https://nmac.to/blog/phoneclean/","image":"https://nmac.to/wp-content/uploads/2017/03/PhoneClean5.png","title":"PhoneClean 5.6.0 – Reclaim free space on your iOS devices","content":"PhoneClean is uniquely designed to reclaim more free space on iPhone, iPad, iPod touch and make all iOS devices running faster. Working on both PC and Mac, this free-yet-magic tool will safely remove all kinds of useless files on iOS system in order to clean up and speed up your iDevices.   Now with PhoneClean, […]"},{"link":"https://nmac.to/blog/overland/","image":"https://nmac.to/wp-content/uploads/2019/09/Overland.png","title":"Overland 849 – Turn-Based Strategy & Survival Game","content":"Take care of a group of travelers on a post-apocalyptic road-trip across the United States in this turn-based survival game. Fight scary creatures, rescue stranded survivors, and scavenge for supplies like fuel, first aid kits, and weapons. Decide where to go next, whether it’s upgrading this wrecked car, or rescuing that dog. Just remember, there […]"},{"link":"https://nmac.to/blog/the-whispered-world-special-edition/","image":"https://nmac.to/wp-content/uploads/2014/08/The-Whispered-World.png","title":"The Whispered World Special Edition 3.2.0419 – Mystery Adventure game","content":"When the fate of a world hangs in the balance, an unusual hero arises!   The visually impressive adventure-epic The Whispered World is now available as a Special Edition for the first time. Let the Whispered World enchant you with its many animated details and fantastic characters.   Sadwick’s adventure begins when he sets out […]"},{"link":"https://nmac.to/blog/order-of-battle-world-war-ii/","image":"https://nmac.to/wp-content/uploads/2019/01/Order-of-Battle-World-War-II.png","title":"Order of Battle: World War II 8.6.1a – World War II Turn-Based Strategy Game","content":"Order of Battle: World War II is breath of fresh air for all strategy fans. It is a game that takes wargaming to a new level by upgrading every single game element and rebooting the genre for a new generation of players. Detailed terrain, rich animations and a slick interface, all within a traditional setting […]"},{"link":"https://nmac.to/blog/abandon-ship/","image":"https://nmac.to/wp-content/uploads/2020/05/Abandon-Ship.png","title":"Abandon Ship 1.3.14934 – Pirates Naval Combat, Strategy & Adventure Game","content":"Discover a huge amount of unique, story-filled islands across diverse biomes and themed areas: Fight ghost ships in the Haunted Seas. Ward off giant arachnids in the Spider Islands. Regions filled with poisonous gas, icebergs, cannibals and much more await.   Engage enemy ships, fortifications and sea monsters in vicious combat, employing your best tactics […]"},{"link":"https://nmac.to/blog/the-signifier/","image":"https://nmac.to/wp-content/uploads/2020/10/The.Signifier.png","title":"The Signifier 1.03 – Psychological Horror Game","content":"The Signifier is a first-person tech-noir mystery adventure that blends investigation, experimental psychology, and artificial intelligence.   Explore the real and surreal worlds, become immersed in fringe psychology, solve puzzles, and find the truth as Frederick Russell, an expert in AI and psychology, and the main researcher behind an experimental deep brain scanner called the […]"},{"link":"https://nmac.to/blog/a-game-of-thrones-the-board-game/","image":"https://nmac.to/wp-content/uploads/2020/11/A-Game-of-Thrones.png","title":"A Game of Thrones: The Board Game 0.9.1.765 – Strategy board game from Fantasy Flight Games","content":"A Game of Thrones: The Board Game – Digital Edition is the digital adaptation of the top-selling strategy board game from Fantasy Flight Games. During the game, players spread their influence across Westeros through a combination of strategic planning, masterful diplomacy, and military might. As one of the Great Houses, will you conquer with force, […]"},{"link":"https://nmac.to/blog/cultist-simulator/","image":"https://nmac.to/wp-content/uploads/2020/11/Cultist.Simulator.png","title":"Cultist Simulator 2020.10.e.2 – A game of apocalypse and yearning","content":"Cultist Simulator is a game of apocalypse and yearning from Alexis Kennedy, creator of Fallen London and Sunless Sea. Play as a seeker after unholy mysteries, in a 1920s-themed setting of hidden gods and secret histories. Perhaps you’re looking for knowledge, or power, or beauty, or revenge. Perhaps you just want the colours beneath the […]"},{"link":"https://nmac.to/blog/blasphemous/","image":"https://nmac.to/wp-content/uploads/2020/11/Blasphemous.png","title":"Blasphemous 2.0.27 – A brutal action-platformer game","content":"A foul curse has fallen upon the land of Cvstodia and all its inhabitants – it is simply known as The Miracle.   Play as The Penitent One – a sole survivor of the massacre of the ‘Silent Sorrow’. Trapped in an endless cycle of death and rebirth, it’s down to you to free the […]"}]