[{"link":"https://nmac.to/blog/isale-5-9-4/","image":"https://nmac.to/wp-content/uploads/2014/08/iSale.png","title":"iSale 5.9.4 – Create and post eBay auctions","content":"iSale is an eBay auction manager. It keeps track of every aspect of monitoring, bidding and exchanging items on eBay.   Have you used eBay before? Have you already auctioned off a few things, but find the eBay website simply too complicated? Click here, look for a picture there, click “next” and then again on […]"},{"link":"https://nmac.to/blog/clusters-1-7-2/","image":"https://nmac.to/wp-content/uploads/2014/08/Clusters.png","title":"Clusters 1.7.2 – Background file compressor (formerly known as Squeeze)","content":"Clusters is a background file compressor, which uses FS-compression technology to transparently compress the folders you configure it to process. OS X will read those files normally, they will just take less disk space.   Version 1.7.2: Fixed a couple of issues with the menu icon when running on OS X 10.9. Important: Running Clusters […]"},{"link":"https://nmac.to/blog/transtype-4-0-1/","image":"https://nmac.to/wp-content/uploads/2014/08/transtype4.png","title":"TransType 4.0.1 – Universal font format converter for Mac and Windows","content":"TransType is a small Mac application which can convert Type 1 and TrueType fonts between the Mac and PC. Unlike other programs of this kind, TransType does the conversion with full respect to codepages, encodings, font suitcases, bitmap fonts, and other features specific to the Mac or PC platform. Allowing you to convert fonts in […]"},{"link":"https://nmac.to/blog/mailtab-pro-for-gmail-6-6/","image":"https://nmac.to/wp-content/uploads/2014/08/MailTab-Pro-for-Gmail.png","title":"MailTab Pro for Gmail 6.6 – Access Gmail from the menu bar","content":"MailTab Pro for Gmail is the ideal app for instantly accessing your Gmail account without having to open your Web browser. Download it for free and benefit from visual and audio mail notifications, quick access to your inbox, and the ability to respond to mails at lightning speed.   After downloading, simply click on the […]"},{"link":"https://nmac.to/blog/menutab-for-facebook-6-4/","image":"https://nmac.to/wp-content/uploads/2014/08/MenuTab-Pro-for-Facebook.png","title":"MenuTab for Facebook 6.4 – Provides real-time Facebook access from your menu bar","content":"MenuTab for Facebook (was FaceTab) takes your Facebook addiction to a whole new level. It is the best app for instantly accessing your Facebook account without having to open your Web browser!   With our competitors, you have to manually hit refresh constantly – way too much work. With MenuTab, we take advantage of the […]"},{"link":"https://nmac.to/blog/friendly-for-pinterest-2-2/","image":"https://nmac.to/wp-content/uploads/2014/08/Friendly-for-Pinterest.png","title":"Friendly for Pinterest 2.2 – Enjoy pinning from your mac desktop","content":"The Ultimate Pinterest App for your Mac. Friendly for Pinterest is a beautiful, slick and easy to use app for browsing your Pinterest account.   Pinterest is a Virtual Pinboard. It lets you organize and share all the beautiful things you find in your life. People use pinboards to plan their weddings, decorate their homes, […]"},{"link":"https://nmac.to/blog/blogo-2-0/","image":"https://nmac.to/wp-content/uploads/2014/08/Blogo.png","title":"Blogo 2.0 – Write, publish and manage multiple blogs","content":"Blogo is the easiest and fastest way to write, publish and manage multiple blogs. Blogo gathered features for a powerful solution and helps users to publish and create content easily. It makes it possible to manage multiple blogs at the same time, edit pictures with a built-in image editor, preview your posts on real-time, manage […]"},{"link":"https://nmac.to/blog/translation-1-3/","image":"https://nmac.to/wp-content/uploads/2014/08/Translation.png","title":"Translation 1.3 – Quality translate between languages","content":"Translation is a handy little app that takes care of all your language translation needs. The app lives in your Mac’s menubar and is instantly available at the click of a button. Searching the web for translation services will be a thing of the past once you make the switch to Translation.   Here is […]"},{"link":"https://nmac.to/blog/tonality-pro-1-0/","image":"https://nmac.to/wp-content/uploads/2014/08/Tonality-Pro.png","title":"Tonality Pro 1.0 – Professional-grade monochrome image editor","content":"Tonality Pro gives you the power to create stunning and dramatic black & white images. This is a complete monochrome image editor with more than 150 one-click style presets, totally unique creativity tools, stackable layers, adjustable brushes, RAW file support and so much more will blow you away.   Features: Professional image quality with a […]"},{"link":"https://nmac.to/blog/ringtones-1-1-3/","image":"https://nmac.to/wp-content/uploads/2014/08/Ringtones.png","title":"Ringtones 1.1.3 – Create unlimited ringtones from your iTunes music library","content":"Ringtones creates unlimited iPhone ringtones from your iTunes music. When launched, it displays music in your iTunes library. Select a song, and then select part of the song that you wish to be repetitive as a ring tone.   Version 1.1.3: Updated for OS X 10.10   OS X 10.6 or later     Tusfiles  […]"}]