[{"link":"https://nmac.to/blog/write-208/","image":"https://nmac.to/wp-content/uploads/2013/12/Write2Icon.175x175-751.jpg","title":"Write 2.0.8 – Simple. Fast. Powerful. iCloud enabled. Retina-aware","content":"Write 2 is a cute lightweight word processor for our daily writing tasks. It is fast, clean, intuitive to use and has a native (Mac-like) and uncluttered interface. Most important of all – it is very user-friendly. In most cases there is no need to use Word. We don’t need its jam-packed interface and least of […]"},{"link":"https://nmac.to/blog/expeditions-conquistador-10/","image":"https://nmac.to/wp-content/uploads/2013/12/UnityPlayer6.jpg","title":"Expeditions Conquistador 1.0 – Mac Strategy Game","content":"Conquer the New world: In the 16th Century, Spanish explorers and soldiers reached the shores of America. The search for gold, fame, and adventure drove these travelers into a treacherous wilderness where they faced hunger, disease, and dangerous predators. In their wake, the Aztec Empires lay in ruins.   Re-write the history of the Conquistadors: […]"},{"link":"https://nmac.to/blog/find-replace-it-209/","image":"https://nmac.to/wp-content/uploads/2013/12/FindReplaceIt.175x175-75.jpg","title":"Find & Replace It! 2.0.9 – An advanced search-and-replace solution for your files","content":"Find & Replace It! is a high-end solution to find files and execute search-and-replace operations across directories. It allows performing very complex batch replacements inside text files of any size. It supports regular expression syntax and dozens of encodings. It has scripting capabilities which allow transforming on the fly the replacement text for every found […]"},{"link":"https://nmac.to/blog/xenon-82/","image":"https://nmac.to/wp-content/uploads/2013/12/33721.jpg","title":"Xenon 8.2 – Associative 3D solid & surface modeling, drafting, rendering","content":"Xenon, like our flagship software, Cobalt™, offers supreme design flexibility and speed, without the high-end mechanical functions, like equation-driven parametrics and mechanical parts library. For both Mac and Windows, Xenon lets designers work freely without worrying about how to run their software. For those doing highly stylized concepts with a great degree of customization, Xenon […]"},{"link":"https://nmac.to/blog/cobalt-82/","image":"https://nmac.to/wp-content/uploads/2013/12/33281.jpg","title":"Cobalt 8.2 – CAD drafting design drawing tool","content":"Cobalt matches professional power with speed and ease of use for flexible 3D modeling. It lets creative people work without worrying about their software. Designers save time and money by moving quickly from conception through completion in the real world of last minute changes.   Primarily for designers, engineers and inventors, Cobalt leads the Ashlar-Vellum […]"},{"link":"https://nmac.to/blog/argon-82/","image":"https://nmac.to/wp-content/uploads/2013/12/33416.jpg","title":"Argon 8.2 – Entry-level professional 3D modeler","content":"Argon offers entry-level 3D modeling without the commitment of high-end professional packages. It contains the same solid and surface modeling, rendering engine and animation tools found in Cobalt and Xenon, but without the high-end mechanical design and extreme productivity features you may not needyet. For both Mac and Windows, Argon lets you model and render […]"},{"link":"https://nmac.to/blog/clipbuddy-2101/","image":"https://nmac.to/wp-content/uploads/2013/06/ClipBuddy.png","title":"ClipBuddy 2.10.1 – Organize all your text and image clippings","content":"ClipBuddy is the ultimate Clipboard Extender on Mac OS that records everything you cut or copy to the Mac Clipboard, and provides multiple ways to view, edit and paste them to any app. It saves an unlimited number of clips in a searchable database. These clips can be images, text or a mix of them […]"},{"link":"https://nmac.to/blog/dwellclick-212/","image":"https://nmac.to/wp-content/uploads/2013/12/DwellClickIcon.175x175-75.jpg","title":"DwellClick 2.1.2 – Control your Mac with mouse movements only","content":"DwellClick is an app that clicks the mouse for you, and lets you give your fingers a rest!   Click and drag with mouse movements only. No clicking required! Save thousands of clicks per day. No more tired and sore hands. Drag and resize windows so easily it’s like magic! Works great with any trackpad […]"},{"link":"https://nmac.to/blog/picturito-102/","image":"https://nmac.to/wp-content/uploads/2013/12/Picturito.175x175-75.jpg","title":"Picturito 1.0.2 – The fastest and easiest way to share multiple pictures on Facebook","content":"Picturito is a small Status Bar App that helps you share multiple pictures to Facebook using the built-in OSX Facebook Integration. You just have to choose the pictures you want and Picturito will do the hard work! Sharing those 50+ holiday pictures to your Facebook albums has never been easier! Picturito features:◆ Share multiple pictures […]"},{"link":"https://nmac.to/blog/choco-201/","image":"https://nmac.to/wp-content/uploads/2013/12/Choco.png","title":"Choco 2.0.1 – Design photo collages","content":"Choco is the ultimate photo collage designer, loaded with more than 100 helpful templates, layout generators, frames, shadows and built-in effects to bring your images to life.   Templates library Choco features more than 100 pre-built templates, divided into helpful categories: Classic – Create classic collages with a clean-and-simple grid layout, featuring fixed numbers of […]"}]