[{"link":"https://nmac.to/blog/mini-motorways/","image":"https://nmac.to/wp-content/uploads/2020/11/Mini-Motorways.png","title":"Mini Motorways 1.4 – Draw roads that drive the city","content":"Have you ever been stuck in traffic and wished you could do something to fix it? In Mini Motorways, the city’s traffic problems are in your hands.   From the makers of Mini Metro, Mini Motorways is a game about drawing the roads that drive a growing city. Build a road network, one road at […]"},{"link":"https://nmac.to/blog/rest-time/","image":"https://nmac.to/wp-content/uploads/2021/08/Rest-Time.png","title":"Rest Time 1.33 – Simple and elegant break reminder","content":"Rest Time is a small, simple, elegant and unobtrusive break reminder. Taking regular rest breaks away from your computer is essential for remaining focused, maintaining your energy levels throughout the day and preventing discomfort and repetitive strain injuries. Rest Time lives under an icon in your Mac’s menu bar and detects for how long you […]"},{"link":"https://nmac.to/blog/boring-old-menu-bar/","image":"https://nmac.to/wp-content/uploads/2021/08/Boring-Old-Menu-Bar.png","title":"Boring Old Menu Bar 1.17 – Catalina menu bar on Big Sur","content":"Boring Old Menu Bar was developed to bring the “perfectly fine” macOS Catalina menu bar to macOS 11 Big Sur.   macOS 11 Big Sur does many things right and after a bit of getting used to, the visual style really grows on you. The transparent menu bar, however, is a bit of a legibility […]"},{"link":"https://nmac.to/blog/tuner/","image":"https://nmac.to/wp-content/uploads/2017/01/Tuner.png","title":"Tuner 5.3 – experience YouTube music","content":"Want an unlimited music library? that’s why we developed Tuner, the YouTube music player for your Mac.   Tuner lets you stream music on YouTube, with a friendly UI.   Main features: Stream music directly from YouTube. Picture in picture, keep watching videos while using other apps. Use media keys to control playback, even if […]"},{"link":"https://nmac.to/blog/felix-the-reaper/","image":"https://nmac.to/wp-content/uploads/2019/12/Felix-The-Reaper.png","title":"Felix The Reaper 1.14.0 – A challenging and strict 3D puzzle game","content":"Felix The Reaper is a challenging single-player puzzle game. You take on the role as Felix, whose job is to make sure that people die. To do this, Felix must work in the shadows and rearrange faith so that death is always the end result.   At its core, the game is about manipulating shadows […]"},{"link":"https://nmac.to/blog/sweet-home-3d/","image":"https://nmac.to/wp-content/uploads/2017/01/Sweet-Home-3D.png","title":"Sweet Home 3D 6.5.5 – Home interior design made easy","content":"Sweet Home 3D is an easy to learn interior design application that helps you draw the plan of your house in 2D, arrange furniture on it and visit the results in 3D.   Sweet Home 3D is aimed at people who wants to design their interior quickly, whether they are moving or they just want […]"},{"link":"https://nmac.to/blog/oka-mirror-for-any-device/","image":"https://nmac.to/wp-content/uploads/2021/05/Mirror-for-any-device.png","title":"Mirror for any device 1.0.5 – Cast screen to TV & no latency","content":"With Mirror – for any device, you can view live screen images on your Mac from a browser on any device!   Screen Mirroring Use this option to put the screen of your Mac on any device – desktop，Laptop，mobile phone，smart TV …   Just use a web browser with smooth access to the local network, such […]"},{"link":"https://nmac.to/blog/bill-boss/","image":"https://nmac.to/wp-content/uploads/2017/11/Bill-Boss.png","title":"Bill Boss 1.2.2 – Bill and payment tracker for budgeting","content":"Bill Boss is a powerful-yet-simple app for keeping track of upcoming (and overdue) bills, payment history and notes. Imagine being able to easily see all the bills that need to be paid this month, along with a total amount – an amazing tool for budgeting.   Features Notifications on your Mac when a bill payment […]"},{"link":"https://nmac.to/blog/mht-viewer/","image":"https://nmac.to/wp-content/uploads/2021/08/MHT-Viewer.png","title":"MHT Viewer 3.2 – MHT/MHTML file reader","content":"MHT Viewer is a lightweight MHT (MHTML/MIME HTML) document viewer/reader.   Features Lightweight and fast Minimal reader user interface Supports .mht, .mhtm, .mhtml files Text zoom (zoom in / zoom out / actual size) Keyboard shortcuts to navigate back / forward / home Preview MHT files with MHT Quick Look plug-in Export page to PDF […]"},{"link":"https://nmac.to/blog/sticky/","image":"https://nmac.to/wp-content/uploads/2021/08/Sticky.png","title":"Sticky 1.8 – Note, to-do list on Desktop","content":"The Sticky Notes app uses your Evernote & iCloud space and to sync notes between Evernote account. It cannot access your private files only those created by itself.   Features: Sticky Notes! (..Sherlock!) Syncs with Evernote®. Optional, custom synchronization via iCloud Import & Export notes online with one click. Feel free to move and resize […]"}]