[{"link":"https://nmac.to/blog/out-of-the-park-baseball/","image":"https://nmac.to/wp-content/uploads/2019/03/Out-of-the-Park-Baseball-21.png","title":"Out of the Park Baseball 21.1.33 – The ultimate baseball game","content":"Out of the Park Baseball 21 – the 21st version of the award-winning sports strategy franchise – delivers the most new features and improvements in series history! It features unprecedented depth and customization, brand-new guided experiences for newcomers and veterans, authenticity licensed by MLB and the MLBPA, and a bounty of offline and online experiences […]"},{"link":"https://nmac.to/blog/macbooster/","image":"https://nmac.to/wp-content/uploads/2017/10/MacBooster6.png","title":"MacBooster 8.0.3 – Maintains and optimizes your system (release candidate)","content":"MacBooster provides a full arsenal of system-maintenance tools to make your Mac run faster.   System Status: Explore the status of your Mac by running a full scan. Security Center: Quickly and deeply analyze the security status of your Mac. Safely remove the threats to make your Mac stay safe. System Cleanup: Scan every corner […]"},{"link":"https://nmac.to/blog/cosmicast/","image":"https://nmac.to/wp-content/uploads/2020/04/Cosmicast.png","title":"Cosmicast 2.0.4 – Beautiful podcast player","content":"Cosmicast is a beautiful podcast player built with design guidelines in mind. There are no complicated user accounts or settings to configure. You can pick it up and get started immediately. This is made even faster with OPML podcast importing, so you can start using the gorgeous turntable right away.   Key features: Beautiful interface […]"},{"link":"https://nmac.to/blog/tune-sweeper/","image":"https://nmac.to/wp-content/uploads/2017/02/Tune-Sweeper.png","title":"Tune Sweeper 4.25 – Remove iTunes duplicates and fix track data","content":"Tune Sweeper is a powerful tool for cleaning your iTunes library. It makes finding and removing duplicate tracks from your iTunes library a breeze. Tune Sweeper can also be used to download missing track information and artwork to your tracks.   Tune Sweeper searches your iTunes library for groups of duplicate tracks based upon the […]"},{"link":"https://nmac.to/blog/sonicweb-internet-radio-player/","image":"https://nmac.to/wp-content/uploads/2017/07/SonicWeb-Internet-Radio-Player2.png","title":"SonicWeb Internet Radio Player 2.5 – Internet radio player and recorder","content":"SonicWeb is an advanced multi-radio recording internet radio player. It plays free internet radio stations, records, and automatically splits the recorded streams into separate tracks and adds them to playlists. It supports the creation of custom playlists and allows the export of tracks to iTunes and into files.   Check out the demonstration video to […]"},{"link":"https://nmac.to/blog/bad-north/","image":"https://nmac.to/wp-content/uploads/2018/11/Bad-North.png","title":"Bad North 2.00.5 – Defend your idyllic island kingdom against a horde of Viking invaders","content":"Bad North is a charming but brutal real-time tactics roguelite. Defend your idyllic island kingdom against a horde of Viking invaders, as you lead the desperate exodus of your people. Command your loyal subjects to take full tactical advantage of the unique shape of each island.   Real-time tactics roguelite: Position and relocate your troops […]"},{"link":"https://nmac.to/blog/the-coma-2-vicious-sisters/","image":"https://nmac.to/wp-content/uploads/2020/02/The.Coma_.2.Vicious.Sisters.png","title":"The Coma 2: Vicious Sisters 1.06 – Horror, Action & Adventure","content":"The Coma 2: Vicious Sisters is an atmospheric, story-driven game. Immerse yourself in the warped Sehwa district as you encounter an engaging cast of characters, solve puzzles, discover revealing clues, and fight for survival against a relentless psycho.   Heroines, forced to confront their worst fears, rarely emerge unscathed. Over the course of the story, […]"},{"link":"https://nmac.to/blog/haptic-touch-bar/","image":"https://nmac.to/wp-content/uploads/2020/04/Haptic.Touch_.Bar_.png","title":"Haptic Touch Bar 2.4.0 – Tactile and sound feedback for your MacBook Pro Touch Bar","content":"Haptic Touch Bar provides actual feedback when pressing buttons on your Touch Bar Brings back the full Escape key experience! Get back to touch typing—no more glancing at the Touch Bar as you type Stop the self-doubt (did I hit the key?) with tactile & audible feedback Configurable for intensity of feedback & sound Supports […]"},{"link":"https://nmac.to/blog/easy-markdown/","image":"https://nmac.to/wp-content/uploads/2015/02/Easy_Markdown.png","title":"Easy Markdown 1.8.1 – Create Web pages using markdown","content":"Easy Markdown lets you create Web pages just writing plain text. Even if you know well html, using Easy markdown improves your speed in your work.   Using Easy Markdown is simple and effective.   A text written in Markdown is a plain text which looks correctly to humans as text and automatically translates in […]"},{"link":"https://nmac.to/blog/ultra-character-map/","image":"https://nmac.to/wp-content/uploads/2020/04/Ultra-Character-Map.png","title":"Ultra Character Map 2.1.1 – Access any character or glyph in any font","content":"Ultra Character Map lets you access any character or glyph in any font and use it in other apps. It also lets you do side-by-side font comparisons, print font catalogs, view detailed character and font information (including the keystroke combinations that produce special or accented characters), and much more.   Features Unlock everything your fonts […]"}]