[{"link":"https://nmac.to/blog/waitinglist/","image":"https://nmac.to/wp-content/uploads/2017/12/WaitingList.png","title":"WaitingList 1.2.3 – Create countdown timers","content":"WaitingList is a smart choice that will help you to wait with pleasure, whether you’re waiting for the holidays, the new release of your favorite game, or a performance by your favorite artist.   Features Beautiful countdown timers – Just set the date to an important event of your life, and you will always know […]"},{"link":"https://nmac.to/blog/responsive-video-grid/","image":"https://nmac.to/wp-content/uploads/2016/10/Responsive-Video-Grid1.png","title":"Responsive Video Grid 3.10 – HTML5 video gallery maker","content":"With Responsive Video Grid you can create a professional video gallery in minutes! Responsive Video Grid is a great way to index and showcase your video and movie collections.   Key Features: Fast and efficient video file searching and indexing Supports MP4, AVI, MOV, OGG and WEBM file formats Leverages HTML5 Generates fully responsive video […]"},{"link":"https://nmac.to/blog/space-panic-defense/","image":"https://nmac.to/wp-content/uploads/2017/12/Space.Panic_.Defense.png","title":"Space Panic Defense 1.1.5 – A futuristic tower defense game with action and strategy","content":"A futuristic tower defense game with action and strategy!   Features 12 Towers with special abilities 12 Enemies Upgrade towers to increase effectiveness Earn exp and level up to unlock new towers High Quality 3D Graphics and FX   OS X 10.9 or later    "},{"link":"https://nmac.to/blog/the-shrouded-isle/","image":"https://nmac.to/wp-content/uploads/2017/12/The-Shrouded-Isle-Sunken-Sins.png","title":"The Shrouded Isle: Sunken Sins 1.0 – Love craftian Management & Simulation Game","content":"As the high priest, uncover and purge heretics to prepare for the awakening of your beloved god beneath the waves.   Now including the Sunken Sins expansion with a more robust inquiry system, lengthened campaign mode, and a new purification tower mechanic, cinematic ending, art, additional events, personality traits and… madness…?   Features: Villagers with […]"},{"link":"https://nmac.to/blog/getting-over-it-with-bennett-foddy/","image":"https://nmac.to/wp-content/uploads/2017/12/Getting-Over-It-with-Bennett-Foddy.png","title":"Getting Over It with Bennett Foddy 1.52 – A punishing climbing game","content":"Getting Over It with Bennett Foddy is a punishing climbing game, a homage to Jazzuo’s 2002 B-Game classic ‘Sexy Hiking’. You move the hammer with the mouse, and that’s all there is. With practice, you’ll be able to jump, swing, climb and fly. Great mysteries and a wonderful reward await the master hikers who reach […]"},{"link":"https://nmac.to/blog/baby-workout/","image":"https://nmac.to/wp-content/uploads/2017/12/Baby-Workout.png","title":"Baby Workout 1.1 – The perfect way to prevent unwanted weight gain during pregnancy","content":"Want to stay fit during your pregnancy or regain your previous weight and shape, together with your baby? – then you’re right here with this innovative app. Just follow your personal instructor along real-time video workouts embedded in specifically designed programs. The programs begin from short to medium length and are designed in a way […]"},{"link":"https://nmac.to/blog/page-booth/","image":"https://nmac.to/wp-content/uploads/2017/12/Page-Booth.png","title":"Page Booth 2.3 – An easy to use website screenshot tool","content":"Page Booth is an easy to use website screenshot tool. It creates full page images of any website and stores it in the Page Booth library. All snapshots can be exported to JPEG, PNG and TIFF image formats.   Page Booth is perfect for all web designers and developers who need to show complete pages […]"},{"link":"https://nmac.to/blog/player-for-youtube-lite/","image":"https://nmac.to/wp-content/uploads/2017/12/Player-for-YouTube-Lite.png","title":"Player for YouTube Lite 1.2 – YouTube Client App","content":"Introducing the Best YouTube Client. Built for YouTube Addicts and Power Users!   Guaranteed to enhance your YouTube watching experience with; Set default video quality Block all YouTube adverts Pop-out YouTube video player Set video auto playback Hide YouTube comments and related videos Hide annotations by default Receive subscriber notifications Subscriber Video Deck Set global […]"},{"link":"https://nmac.to/blog/moneywell/","image":"https://nmac.to/wp-content/uploads/2017/04/MoneyWell3.png","title":"MoneyWell 3.0.6 – Unique personal finance manager and budgeting app","content":"MoneyWell is a streamlined solution for money management on your Mac. If you’ve ever been overwhelmed by the needless complexity of other personal finance applications, you’ll find MoneyWell to be a breath of fresh air.   Features Single-window simplicity – Tracking your transactions doesn’t have to be intimidating. With its single-window interface, MoneyWell brings everything […]"},{"link":"https://nmac.to/blog/music-binder-pro/","image":"https://nmac.to/wp-content/uploads/2016/12/Music-Binder-Pro.png","title":"Music Binder Pro 3.5 – Music sheets organizer and Music Player","content":"Music sheets organizer and Music Player designed for live performance.   Features:   Basic Support PDF and Chordpro files Quickly sort your songs by Title or Artist Embedded Chordpro editor Transpose (Chordpro files only) Add notes to songs Record Time Markers (page changes, message, note, MIDI events) Use Tabs to create Setlists or Collections Visual […]"}]