[{"link":"https://nmac.to/blog/word-air-1-7-1/","image":"https://nmac.to/wp-content/uploads/2016/08/Word-Air.png","title":"Word Air 1.7.1 – for Microsoft Word Edition & Open Office Format","content":"Word Air is a beautiful, easy-to-use text editor that is designed to make writing convenient, efficient and comfortable. Word Air is ease, fast and uncluttered. It starts up quickly, has a live word count, easy on the eyes and you can export all the common formats: .pdf, .rtf, .doc, .txt and more .   Features […]"},{"link":"https://nmac.to/blog/tomatoes-2-4/","image":"https://nmac.to/wp-content/uploads/2016/08/Tomatoes.png","title":"Tomatoes 2.4 – Organize and improve your tasks to make your time more productive","content":"With Tomatoes you can organize your tasks, improve your efficiency and make your time more productive.   Tomatoes uses iCloud to sync beetwen your Macs and Tomatoes for iPhone.   Inspired by The Pomodoro Technique®, Tomatoes allows you to subdivide your tasks in activities, providing as many units of time are necessary for their realization. […]"},{"link":"https://nmac.to/blog/supremeplayer-6-0-1/","image":"https://nmac.to/wp-content/uploads/2016/09/SupremePlayer6.png","title":"SupremePlayer 6.0.1 – A player can play all media file","content":"SupremePlayer is a fully functional media player able to play almost every kind of media file.   The supported formats include MPG, MPEG, MPEG 2, VOB, DAT, MP4, M4V, TS, RM, RMVB, WMV, ASF, MKV, AVI, 3GP, 3G2, FLV, MOV, H264/x264 1080p/720p HD video, and all audio formats.   Features Fully compatible with OS X […]"},{"link":"https://nmac.to/blog/ifoto-hdr-2-3-1095/","image":"https://nmac.to/wp-content/uploads/2016/09/iFoto-HDR.png","title":"iFoto HDR 2.3.1095 – Make HDR Photo Effects with Ease","content":"HDR should be a tricky subject to master for photographers. When you merge the images with different exposure to HDR photographs, how to ensure a creative and natural look? iFoto HDR should be the best answer for you to merge HDR photos. It is a super easy HDR program to make awesome results.   When […]"},{"link":"https://nmac.to/blog/dicrecorder-1-0/","image":"https://nmac.to/wp-content/uploads/2016/09/DicRecorder.png","title":"DicRecorder 1.0 – Record audio from any application on Mac","content":"DicRecorder is designed for recording audio from any application on Mac, including browsers (Safari, Chrome, Firefox), voice call applications (Skype, iChat, FaceTime), media players and managers (iTunes, QuickTime, VLC, Apple Music), online radio sites, including Pandora, Lastfm, iTunes Radio, GrooveShark) as well as grab audio from websites like YouTube, Vimeo, Facebook, VEVO, MTV.com, etc.   […]"},{"link":"https://nmac.to/blog/themes-for-keynote-4-6/","image":"https://nmac.to/wp-content/uploads/2016/08/Themes-for-Keynote.png","title":"Themes for Keynote 4.6 – Professional themes for Apple Keynote","content":"Themes for Keynote lets you start a new presentation and focus on the content – the design is already there.   Themes for Keynote consists of high-quality designs for Keynote presentations. These are more than just beautiful backgrounds – each one of them includes up to 20 different master slides, which lets you choose the […]"},{"link":"https://nmac.to/blog/surge-2-0/","image":"https://nmac.to/wp-content/uploads/2016/09/Surge.png","title":"Surge 2.0 – Web Developer Tool and Proxy Utility","content":"Working quietly on the Menubar, Surge is a high-performance HTTP/SOCKS5 proxy server. It is capable of intercepting and logging the summary of HTTP traffic, and meanwhile transmitting the traffic to other proxy servers according to the flexible rule system. Multiple proxy protocols are supported including HTTP, HTTPS, SOCKS5, SOCK5 over TLS.   Launching the Dashboard, […]"},{"link":"https://nmac.to/blog/posters-templates-for-pages-1-2/","image":"https://nmac.to/wp-content/uploads/2016/09/Posters-Templates-for-Pages.png","title":"Posters Templates for Pages 1.2 – A collection of over 180 original templates for Pages","content":"Posters Templates for Pages is a collection of over 180 original templates of the highest quality, created to lend a unique look to your promo material. Whether you’re trying to hype up a cool new product, starting a season sale, or announcing a mind-blowing event, Graphic Node’s posters will help you make sure your promotion […]"},{"link":"https://nmac.to/blog/cleanusbdrive-1-1/","image":"https://nmac.to/wp-content/uploads/2016/09/CleanUSBDrive.png","title":"CleanUSBDrive 1.1 – The fastest DS_Store remover for external drives","content":"CleanUSBDrive is an utility to eject any external drive removing those files that you don’t want to see in your smartTV multimedia-browser, for example. It cleans all drives from system junk before ejecting, with a very high performance.   Features Simple and fast Very minimalist design Status bar App Remove .DS_Store, ._AppleDouble, Thumbs.db, .Trashes, .Spotlight, […]"},{"link":"https://nmac.to/blog/tadam-2-0/","image":"https://nmac.to/wp-content/uploads/2016/09/Tadam2.png","title":"Tadam 2.0 – Simple Pomodoro timer","content":"Tadam is a simple Pomodoro timer that stays out of your way and lets you get the work done. When it’s time for a break, a big windowpops up, reminding you to take a break. You can’t ignore it – you can either take a break or choose to work a little more.   Simple: […]"}]