[{"link":"https://nmac.to/blog/silkypix-developer-studio/","image":"https://nmac.to/wp-content/uploads/2018/05/SILKYPIX-Developer-Studio.png","title":"SILKYPIX Developer Studio 9.1.8.0 – RAW photo correction","content":"SILKYPIX Developer Studio 8 has same image processing engine as a higher version Pro 8. This image processing engine relaize high resolution by “Natural sharp” and improve gradation on highlighting. Therefore, this product has achieved the high image quality, such as high color separation performance and excellent noise reduction. Further it has a powerful correction […]"},{"link":"https://nmac.to/blog/flextime/","image":"https://nmac.to/wp-content/uploads/2019/03/FlexTime.png","title":"FlexTime 1.4 – Versatile timer for your repetitive activities","content":"FlexTime is a timer for repetitive activities. Use it for scheduling your workday activities, stretch breaks, dance, meditation – you name it!   Design a routine of timed activities and assign them custom cues of various types: play a sound, run a script, show a text message, or speak text.   FlexTime is fully AppleScriptable. […]"},{"link":"https://nmac.to/blog/hegis-grasp/","image":"https://nmac.to/wp-content/uploads/2019/03/Hegis-Grasp.png","title":"Hegis’ Grasp: Evil Resurrected 2.0.3 – A story-driven, atmospheric survival horror game","content":"1896, Great Britain: Henry Wood, a journalist who heard rumors of a village, that supposedly had undergone a curse, gets curious enough to check out the place for his latest anticipated newspaper story. Bringing Jacob, his nephew, coach boy, and intern journalist, and his friend and escort, Lieutenant Samuel Miller, on his trip to Hegis […]"},{"link":"https://nmac.to/blog/cook-serve-delicious/","image":"https://nmac.to/wp-content/uploads/2018/01/COOK.SERVE_.DELICIOUS.2.png","title":"Cook, Serve, Delicious! 2!! 2.6.0 m.1.1 – Restaurant Simulation & Management Game","content":"Cook, Serve, Delicious! 2!! is the massive sequel to the surprise best selling original, one of the few games that gives players complete control on how they want to build their restaurant.   The game starts like any other morning at SherriSoda Tower as you take the elevator up to open Cook, Serve, Delicious!, a […]"},{"link":"https://nmac.to/blog/disk-cleaner-1/","image":"https://nmac.to/wp-content/uploads/2017/01/Disk-Cleaner.png","title":"Disk Cleaner 1.6 – Free Your Hard Drive Space","content":"Disk Cleaner does all the work for you! We’ve optimized the most efficient locations to quickly scan and remove all the junk taking up your valuable disk space. Stop wasting disk space on unneeded files leftover from uninstalled apps, temporary internet files, old mail attachments, and others you didn’t know about. Let Disk Cleaner free […]"},{"link":"https://nmac.to/blog/fluid-browser/","image":"https://nmac.to/wp-content/uploads/2016/03/Fluid.Browser.png","title":"Fluid Browser 1.6 – A new evolution to multitasking on your computer","content":"Fluid is a floating browser built to view your favorite media like Netflix, Youtube, and Hulu right alongside your work. Fluid works just like any other browser; however, once active, Fluid only shows your media or web content, hiding all other features of the browser.   Features There is only so much space on your […]"},{"link":"https://nmac.to/blog/clean-text/","image":"https://nmac.to/wp-content/uploads/2013/06/Clean-Text7.png","title":"Clean Text 7.9 – Reduce text cleanup and editing time","content":"Clean Text is an essential tool for webmasters, graphic designers, developers and magazine editors to reduce text cleanup and editing time, and it is a very convenient tool for all Mac users that needs to cleanup and editing text from emails, documents, or other material.   Solve text problems with a couple of clicks Clean […]"},{"link":"https://nmac.to/blog/ambers-airline/","image":"https://nmac.to/wp-content/uploads/2019/03/Ambers-Airline.png","title":"Amber’s Airline 1.8 – Time Management Simulation & Casual Game","content":"In Amber’s Airline – High Hopes, you’ll get a taste of the glamorous life of a flight attendant.    Meet Amber Hope, aspiring stewardess for Snuggford Airlines. Amber has dreamed of flying to exotic destinations around the world since she was a girl. But before she can join the elite crew of air hostesses, she’ll […]"},{"link":"https://nmac.to/blog/temp-monitor/","image":"https://nmac.to/wp-content/uploads/2018/07/Temp-Monitor1.png","title":"Temp Monitor 1.2.4 – Monitor your Mac’s temperature","content":"Temp Monitor app is an unobtrusive tool which will alert you when your Mac overheats, and the perfect utility to help you log all instances when the processor goes beyond a temperature which might be dangerous for both your Mac and yourself, if you’re using a MacBook or MacBook Pro.   Features Support for customizable […]"},{"link":"https://nmac.to/blog/justbroadcaster-for-facebook/","image":"https://nmac.to/wp-content/uploads/2017/01/JustBroadcaster.for_.Facebook.png","title":"JustBroadcaster for Facebook 2.1.6 – Video streaming for Facebook on your Mac","content":"JustBroadcaster for Facebook allows you to live stream from your Mac. Just insert the video sources into the prepared templates and start stream. Easy logo and background setup. The application supports built-in, USB, DV, HDMI cameras. Simple capturing of the screen and application windows. Cursor capture is supported. You can broadcast iOS games and applications by […]"}]