[{"link":"https://nmac.to/blog/fundy-designer-1-5-0/","image":"https://nmac.to/wp-content/uploads/2014/02/Fundy.Designer.png","title":"Fundy Designer 1.5.0 – Next generation design tool","content":"A design leader in the professional photographic community since 2008, Fundy Software is behind you every step of the way. Working to bring you software that is revolutionary in its functionality and ease of use, learn how Andrew Funderburg, CEO of Fundy Software started the company.   Revolutionize your album design workflow and design like […]"},{"link":"https://nmac.to/blog/video-screensaver-2-0-2/","image":"https://nmac.to/wp-content/uploads/2014/02/Video.Screensaver.png","title":"Video Screensaver 2.0.2 – Use a video as your screensaver","content":"Select a custom video as a screensaver with Video Screensaver, or use the built in fireplace video.    Features: Built in fireplace video Custom video Password protect   Version 2.0.2: Dock fix   Intel, 64-bit processor OS X 10.7 or later   Turbobit          Uploaded         1fichier          Tusfiles  […]"},{"link":"https://nmac.to/blog/scribe-1-1-0/","image":"https://nmac.to/wp-content/uploads/2014/02/Scribe.png","title":"Scribe 1.1.0 – Copy anything from your Mac to your iPhone","content":"Scribe lets you copy anything from your Mac to your mobile device, without Wi-Fi.   Select text, links, numbers or small images, and simply press “COMMAND + SHIFT + X” to instantly transfer your selection from your Mac to your iOS Device.   See your sent history, copy, enter URL links, call or add contact […]"},{"link":"https://nmac.to/blog/vncviewer-5-1-0/","image":"https://nmac.to/wp-content/uploads/2014/02/VNCViewer.png","title":"VNCViewer 5.1.0 – Interact with desktop applications across any network","content":"RealVNC provides remote control software which lets you see and interact with desktop applications across any network.   The software has a widespread user base from individuals to the largest multi-national companies. Founded by the original developers of VNC to promote, enhance and commercialize VNC.   Version 5.1.0: Bug fix   Intel/PPC, OS X 10.5 […]"},{"link":"https://nmac.to/blog/boilsoft-video-splitter-1-03-1/","image":"https://nmac.to/wp-content/uploads/2014/02/Boilsoft.Video_.Splitter.png","title":"Boilsoft Video Splitter 1.03.1 – Cut or trim all popular video formats","content":"Boilsoft Video Splitter for Mac is a powerful video splitter to split video file into an unlimited number of smaller video segments in a flash. Our splitter supports almost all popular video formats, such as 3GP, AVI, MPG, MPA,VOB, RM, MP4, Windows Media file(.asf, .wmv, .wma), FLV(flash video), MP3(.mp3), MKV(Matroska Video),etc.. It also has a […]"},{"link":"https://nmac.to/blog/chopper-2/","image":"https://nmac.to/wp-content/uploads/2014/02/Chopper.2.png","title":"Chopper 2 1.2 – Control a chopper with your iOS device","content":"Chopper 2 is the highly anticipated sequel to the best selling Mac and App Store classic Chopper.   Chopper 2 features 36 action packed missions over 12 unique and beautiful locations. It features a completely re-written 3D game engine, all new enemies, weapons, graphics, and missions, while still retaining the classic side scrolling game-play.   […]"},{"link":"https://nmac.to/blog/arcsoft-photo-3-0-10138/","image":"https://nmac.to/wp-content/uploads/2014/02/ArcSoft-Photo+.png","title":"ArcSoft Photo+ 3.0.10138 – Smart Photo Viewer","content":"Smart Photo Viewer for Mac. Click one photo in Finder to display all photos in the same folder without importing them. Easily browse through photos and zoom photos using track pad gestures or the keyboard. Auto rotate your vertical photos. Crop, rotate and delete your photos while browsing. Easily pick your favorite photos for displaying […]"},{"link":"https://nmac.to/blog/astro-1-9-2/","image":"https://nmac.to/wp-content/uploads/2014/01/Astro.png","title":"Astro 1.9.2 – Facebook Messenger on Mac","content":"Astro is the best Facebook Messenger app on Mac. For the first time, you can use lightening fast FB chat, just like iMessage on Mac   (1) Super fast interface, just like iMessage (2) The only app that supports group chat (3) Drag & Drop to send files (4) Shortcut to make screenshot (5) Background […]"},{"link":"https://nmac.to/blog/macaw-0-7-2/","image":"https://nmac.to/wp-content/uploads/2014/02/Macaw.png","title":"Macaw 0.7.2 – The code-savvy web design tool","content":"Stop writing code. Start drawing it.   Macaw provides the same flexibility as your favorite image editor but also writes semantic HTML and remarkably succinct CSS. It’s time to expect more from a web design tool.   Fluid canvas and grid Macaw is engineered for fluid widths. Resize the canvas and your grids and elements […]"},{"link":"https://nmac.to/blog/diskaid-6-5-5/","image":"https://nmac.to/wp-content/uploads/2014/01/DiskAid.png","title":"DiskAid 6.5.5 – Use your iOS device as an external disk and more","content":"DiskAid is the ultimate transfer tool for accessing the iPod, iPhone or iPad directly from the desktop. Access data such as: music, video, photos, contacts, notes, call history, text messages (SMS), voicemail, and voice memos. With DiskAid you can also transfer files and folders betwen your iPhone, iPad or iPod touch and your computer and […]"}]