[{"link":"https://nmac.to/blog/tasktime4-5-2-3/","image":"https://nmac.to/wp-content/uploads/2015/10/TaskTime4.png","title":"TaskTime4 5.2.3 – Track time spent on client projects","content":"TaskTime4 is a reliable and versatile time-tracking solution. TaskTime makes keeping track of time spent on multiple client projects easy and efficient. With TaskTime you can track any number of clients and any number of projects for each client. Create invoices that can be emailed, printed, and saved to disk. Since you can have more […]"},{"link":"https://nmac.to/blog/picgif-2-0-6/","image":"https://nmac.to/wp-content/uploads/2014/03/PicGIF.png","title":"PicGIF 2.0.6 – Convert photos and videos into incredible GIFs quickly","content":"PicGIF enables you to quickly create incredible animated GIFs from photos or short videos. It’s easy to customize GIF Size, Sequence, Frame Delay, and to add text and stickers, etc. After a satisfying GIF is done, you can share the GIF with your friends via E-Mail, iMessage, Tumblr or simply save it in Finder on […]"},{"link":"https://nmac.to/blog/menubar-rearranger-2-5/","image":"https://nmac.to/wp-content/uploads/2015/10/MenuBar.ReArranger.png","title":"MenuBar ReArranger 2.5 – Rearrange your menu bar","content":"MenuBar ReArranger lets you easily rearrange your menu bar items. Keep your menu bar icons ordered as you want! Define profiles for your icons’ order and automatically change the order as you wish. Useful if you have different needs between your work and home, or to hide all of them the time of a presentation, […]"},{"link":"https://nmac.to/blog/leos-fortune/","image":"https://nmac.to/wp-content/uploads/2015/10/Leo’s.Fortune.png","title":"Leo’s Fortune 0.1 – An award-winning platform adventure game","content":"Leo’s Fortune is an award-winning platform adventure game where you hunt down the cunning and mysterious thief that stole your gold. Beautifully hand-crafted levels bring the story of Leo to life in this epic adventure.   “I just returned home to find all my gold has been stolen! For some devious purpose, the thief has […]"},{"link":"https://nmac.to/blog/actionify-1-1-5/","image":"https://nmac.to/wp-content/uploads/2015/10/Actionify.png","title":"Actionify 1.1.5 – Simple, efficient task manager","content":"Actionify is a clean, simple and efficient task manager, inspired by Getting Things Done (GTD). It has been designed to free your mind by organizing your tasks for you.   Features: Organise your tasks using Projects and Areas Focus lists Drag-and-drop scheduling of tasks Set start dates and due dates for tasks Quickly add tasks […]"},{"link":"https://nmac.to/blog/timelime-1-4-1/","image":"https://nmac.to/wp-content/uploads/2014/01/Timelime.png","title":"Timelime 1.4.1 – Track and visualize your working hours","content":"Timelime is the easiest and most beautiful way to track and visualize your working hours. Timelime is the perfect assistant for:   Freelancers and independent contractors who have to track their time spent on projects Students who want to spend more time studying by monitoring their daily/weekly/monthly workload Individuals who are interested in how they […]"},{"link":"https://nmac.to/blog/markdown-plus-1-3-8/","image":"https://nmac.to/wp-content/themes/nmac/images/placeholder-320.png","title":"Markdown Plus 1.3.8 – Efficient markdown editor","content":"Markdown Plus is a lightweight markdown editor. Besides common markdown, GitHub flavored markdown, it also supports task lists, emojis, Font Awesome icons, Ionicons icons, Mathematical formulae, flowcharts, sequence diagrams and gantt diagrams.   Fundamental features GitHub Flavored Markdown (GFM) Realtime preview Fenced code blocks Tables & Alignment Export to PDF Drag & drop to open […]"},{"link":"https://nmac.to/blog/human-anatomy-atlas/","image":"https://nmac.to/wp-content/uploads/2015/10/Human.Anatomy.Atlas_.png","title":"Human Anatomy Atlas 7.4.01 – 3D Anatomical Model of the Human Body","content":"Visible Body’s Human Anatomy Atlas is the most anatomically accurate 3D atlas of the male and female human body, with over 4,600 structures in each model (male and female). This app also includes additional content not included in other 3D anatomy apps: microanatomy models of senses, 3D animated models of muscle actions, skeleton models that […]"},{"link":"https://nmac.to/blog/dockstar-4-0/","image":"https://nmac.to/wp-content/uploads/2015/10/DockStar.png","title":"DockStar 4.0 – Add 5 new-mail icons to Mail.app","content":"DockStar is the ingenious way to keep an eye on your Mail. Add new badges to the Mail dock icon and clickable indicators to the menu bar. DockStar lets you keep track of email in various accounts and folders, RSS feeds, Notes, and To Do items with customizable badges in the Mail icon, menu bar, […]"},{"link":"https://nmac.to/blog/ceres-1-0/","image":"https://nmac.to/wp-content/uploads/2015/10/Ceres.png","title":"Ceres 1.0 – Take control of a squadron of ships in full 3D space combat","content":"The solar system is ravaged. The Earth is gone, shattered to pieces. Nothing remains but a huge ring of rocky debris. Nobody knows why the Gate malfunctioned. It was built to connect our world to other stars, but only a handful of colony ships were sent away before disaster struck. The Gate is believed to […]"}]