[{"link":"https://nmac.to/blog/desk-2-0/","image":"https://nmac.to/wp-content/uploads/2015/02/Desk.png","title":"Desk 2.0 – A Writing, Blogging, and Notetaking App","content":"Desk is a premium writing experience for all types of writers.   Whether you’re a casual enthusiast, the weekend writer, blogger, or digital publishing professional, you’ll find Desk to be a much-needed breath of fresh air.   Designed to marry both function and form, it is the desktop publishing client that you’ve always wanted: Simple, […]"},{"link":"https://nmac.to/blog/simbooster-pro-1-5-1/","image":"https://nmac.to/wp-content/uploads/2015/01/SimBooster.png","title":"SimBooster Pro 1.5.1 – System optimizing utility","content":"SimBooster Pro is an all-in-one package that includes a variety of system tools to help you clean and protect your Mac. For slow Macs, SimBooster can release RAM to increase the processing speed. It can also help users protect their personal data from malicious cookies. Users who suffer from small hard drive space, SimBooster can […]"},{"link":"https://nmac.to/blog/photostyler-6-8-5/","image":"https://nmac.to/wp-content/uploads/2014/09/PhotoStyler.png","title":"PhotoStyler 6.8.5 – Add a sense of realism to your digital photos","content":"PhotoStyler is the easiest way to style your digital photos with your Mac. This simple, fast and accurate native solution combines the powers of Apple’s core technologies with the flexibility and efficiency of proprietary application-specific modules. PhotoStyler supports all image formats that are supported by MacOS including RAW images.   PhotoStyler doesn’t require any special […]"},{"link":"https://nmac.to/blog/radio-2-1/","image":"https://nmac.to/wp-content/uploads/2015/07/Radio.png","title":"Radio 2.1 – Listen to over 10,000 professional and community radio stations","content":"The Radio App features over 10,000 professional and community radio stations from around the world. Radio offers tremendous depth and breadth of stations with genres ranging from Alternative, Electronica, Metal to Jazz and Classic across a broad set of languages including Italian, Spanish, French, German, Russian and Portuguese. We even have public radio, talk and […]"},{"link":"https://nmac.to/blog/gyazmail-1-5-17/","image":"https://nmac.to/wp-content/uploads/2015/04/GyazMail.png","title":"GyazMail 1.5.17 – Alternative email client","content":"GyazMail is an e-mail client that is developed from scratch to be a simple, easy-to-use e-mail client with many features, based on the Cocoa framework. This software will be distributed as shareware (undecided on details at this point).   The main features of GyazMail are as follows: Multiple accounts Management of messages by one file […]"},{"link":"https://nmac.to/blog/boinxtv-1-9-12/","image":"https://nmac.to/wp-content/uploads/2015/03/BoinxTV.png","title":"BoinxTV 1.9.12 – Live-production software for video podcasters","content":"BoinxTV is the pioneering live-production software for video podcasters that turns any recent Mac into a TV studio “for the rest of us”.   Record stunning studio shows, podcasts, sports events, concerts, interviews, sermons, seminars and more using your Mac, multiple cameras, microphones and other footage. With its innovative user interface, BoinxTV makes it easy […]"},{"link":"https://nmac.to/blog/airplayrecorder-1-2/","image":"https://nmac.to/wp-content/uploads/2015/09/AirPlay.Recorder.png","title":"AirPlayRecorder 1.2 – Save iTunes audio streams for offline playback","content":"AirPlayRecorder brings to Mac users the ability to save iTunes audio streams for offline playback. AirPlay Recorder is easy to use and appears as an AirPlay device in iTunes. Recorded audio is saved to your music folder under “Recorder”.   Version 1.2: Release notes were unavailable when this listing was updated.   OS X 10.7.3 […]"},{"link":"https://nmac.to/blog/1000-opentype-font-collection-2-1/","image":"https://nmac.to/wp-content/uploads/2014/03/1000.OpenType.Fonts_.png","title":"1000 OpenType Font Collection 2.1 – Collection of stylish fonts for commercial use","content":"1000 Opentype Fonts Collection helps you get creative. The font collection includes 238 unique font family styles, with 1000 total fonts. An excellent addition to any font collector’s library for use in graphic and logo design, web design, scrapbooks, presentations, invitations, promotional material, advertisements, and more.   Each font is in OpenType font format and […]"},{"link":"https://nmac.to/blog/subtitles-3-2-5/","image":"https://nmac.to/wp-content/uploads/2015/03/Subtitles.png","title":"Subtitles 3.2.5 – Automatically downloads subtitles for your movies and TV shows","content":"Subtitles App is the easiest way to download subtitles, Just drop your videos into Subtitles and let it do its magic. It doesn’t matter if the files don’t have the right name or the format they’re in, Subtitles will always find the right subtitles for your movies and TV shows.   Automatically finds subtitles Just […]"},{"link":"https://nmac.to/blog/dmg-architect-1-2/","image":"https://nmac.to/wp-content/uploads/2015/09/DMG.Architect.png","title":"DMG Architect 1.2 – Create professional disk images","content":"DMG Architect… Easily add your own custom window backgrounds, files and icons. Total WYSIWYG control of everything including background image and window location. Use any image for your container icon, not just .ICNS files. Even change the icon of files already added to a project. No artwork? No problem. Choose a theme from our gallery […]"}]