[{"link":"https://nmac.to/blog/filmage-converter/","image":"https://nmac.to/wp-content/uploads/2021/01/Filmage-Converter.png","title":"Filmage Converter 1.1.6 – Fast and easy-to-use video converter","content":"Filmage Converter is a fast and easy to use video converter. There are no settings and technical knowledge required to use this converter   Filmage Converter enables you to convert videos, extract audio from video, edit your video, clip and crop videos and more with advanced editing tools   Filmage Converter is totally ad-free for […]"},{"link":"https://nmac.to/blog/disk-scope/","image":"https://nmac.to/wp-content/uploads/2012/12/Drive-Scope.png","title":"Drive Scope 1.2.15 – Disk health and maintenance","content":"Drive Scope is an advanced SMART drive-testing and health-warning application. Building on the improvements to the SMART check in TechTool Pro, Drive Scope not only provides early warning when a drive is on the path to failure, but provides a deep dive into the health of the drive. See what errors have occurred, and when, […]"},{"link":"https://nmac.to/blog/sqlpro-for-mssql/","image":"https://nmac.to/wp-content/uploads/2016/08/SQLPro-for-MSSQL.png","title":"SQLPro for MSSQL 2021.106 – Database management studio for Microsoft SQL Server","content":"SQLPro for MSSQL (was SQL Client) is a lightweight TDS client, allowing quick and simple access to Microsoft SQL servers (sqlserver), including those hosted in Azure. This client does NOT work with MySQL. Please ensure that your server is a Microsoft SQL server.   Features Syntax highlighting Intellisense Tab-based interface Support for executing multiple queries […]"},{"link":"https://nmac.to/blog/poser-pro/","image":"https://nmac.to/wp-content/uploads/2015/12/Poser.Pro_.png","title":"Poser 12.0.619 – Easily create 3D character art and animation","content":"Poser is perfect for creating 3D character art and animation. For nearly 20 years, artists, hobbyists, illustrators, and animators have been getting creative with Poser. Poser includes over 5GB of 3D figures and content to get you started. Pose figures, add hair and clothing, props, lights, and cameras to build 3D scenes. Render photorealistic and cartoon […]"},{"link":"https://nmac.to/blog/pizza-connection/","image":"https://nmac.to/wp-content/uploads/2018/05/Pizza.Connection.3.png","title":"Pizza Connection 3 1.0.7583 – Simulation, Strategy & Management Game","content":"Mamma mia… Long awaited by fans around the world, the new installment of the cult series “Pizza Connection” returns to the PC with even more flavour and extra cheese.   Make ’em a pizza they can’t refuse!   In addition to the series’ tried and true basic ingredients, economic simulation Pizza Connection 3 offers a […]"},{"link":"https://nmac.to/blog/clunky-hero/","image":"https://nmac.to/wp-content/uploads/2021/12/Clunky-Hero.png","title":"Clunky Hero Early Access 0.91 – A story-driven platformer game","content":"Clunky Hero is a story-driven, platformer metroidvania, with a touch of RPG and tons of humor. If you’d love a platformer game where you have a funny storyline, can talk with characters, solve side quests, find and buy items, change weapons and wearables, with great hand-drawn-looking backgrounds, presented in a very comical way, then Clunky […]"},{"link":"https://nmac.to/blog/lego-star-wars-castaways/","image":"https://nmac.to/wp-content/uploads/2021/12/Lego-Star-Wars-Castaways.png","title":"Lego Star Wars: Castaways 1.0.5 – New adventures await!","content":"Play LEGO Star Wars: Castaways with Apple Arcade, a game subscription service with 200+ groundbreaking new games.   Explore a mysterious new planet and meet new friends along the way in LEGO Star Wars: Castaways. By customizing their character, fans can live out their Star Wars fantasies in the first social, action-adventure LEGO Star Wars […]"},{"link":"https://nmac.to/blog/asphalt-6/","image":"https://nmac.to/wp-content/uploads/2013/08/Asphalt-8.png","title":"Asphalt 8: Airborne+ 1.0.2 – Drive real cars and motors","content":"A high-speed premium racing game full of real dream cars and bikes   400 MILLION PLAYERS CAN’T BE WRONG!   TAKE A SPIN WITH THE FRONT-RUNNER AMONG MOBILE RACING GAMES!   LEAVE GRAVITY IN THE DUST! 250+ OFFICIAL SPEED MACHINES: Ferrari, Ducati, Lamborghini, McLaren, Bugatti, Mercedes, Audi, Ford, Chevrolet… From bikes to cars, we got […]"},{"link":"https://nmac.to/blog/baldo-the-guardian-owls/","image":"https://nmac.to/wp-content/uploads/2021/12/Baldo-The-Guardian-Owls.png","title":"Baldo The Guardian Owls 1.2.1 – Journey through a magical land","content":"Baldo: the Guardian Owls is full of challenging puzzles to solve and intricate dungeons to explore.   Traverse this captivating open world as Baldo, and meet a host of quirky and unforgettable characters, as you struggle to decipher the cryptic prophecy, and thwart destiny.   From delightful whimsy to thrilling adventure, discover new towns and […]"},{"link":"https://nmac.to/blog/pathfinder-wrath-of-the-righteous/","image":"https://nmac.to/wp-content/uploads/2021/09/Pathfinder-Wrath-of-the-Righteous.png","title":"Pathfinder: Wrath of the Righteous 1.1.3e – Party-Based RPG Game","content":"Your path will lead you to the Worldwound, where the opening of a rift to the Abyss has unleashed all-consuming terror across the land. For over a century, the neighboring nations have fought fearlessly, trying to drive the enemy back — but to little avail.    Now, you have the chance to put an end […]"}]