[{"link":"https://nmac.to/blog/pixave/","image":"https://nmac.to/wp-content/uploads/2020/04/Pixave_2.png","title":"Pixave 2.3.13 – Store and organize your inspired moments","content":"There is a whole world that we get from images. A single picture can fill us with inspiration which, in turn, brings us joy. Such impressions grow to create wonder and amazement for the world. That growth and creation is made possible by you. And Pixave is here to store and organize those inspired moments […]"},{"link":"https://nmac.to/blog/cryptey/","image":"https://nmac.to/wp-content/uploads/2017/01/Coiney.png","title":"Cryptey 1.9.2 – Cryptocurrency ticker for the menu bar (was Coiney)","content":"Coiney (was Coiney) is a menu-bar cryptocurrency ticker that lets you follow current rates for all major e-coins such Bitcoin, Litecoin, Ethereum, and more. You can add the most important rates to your menu bar to make them always visible, or add them to a favourites list so they can be just one click away. With […]"},{"link":"https://nmac.to/blog/tri-backup-pro/","image":"https://nmac.to/wp-content/uploads/2018/08/Tri-BACKUP9.png","title":"Tri-BACKUP Pro 9.1.7 – Customizable back-up solution with advanced features","content":"Tri-BACKUP Pro is a customizable back-up solution for your disks and folders, Tri-Backup Pro adds advanced functions such as web server back-ups, control for actions from remote machines, copying process double-checking, and e-mail alerts (for example, to send email to an administrator when errors were detected, or to monitor the proper implementation of backups). Multiples […]"},{"link":"https://nmac.to/blog/charles/","image":"https://nmac.to/wp-content/uploads/2017/07/Charles4.png","title":"Charles 4.6.1 – Java HTTP proxy and monitor","content":"Charles is a web proxy (HTTP Proxy / HTTP Monitor) that runs on your own computer. Your web browser (or any other Internet application) is then configured to access the Internet through Charles, and Charles is then able to record and display for you all of the data that is sent and received.   Key […]"},{"link":"https://nmac.to/blog/photomatix/","image":"https://nmac.to/wp-content/uploads/2017/09/Photomatix-Pro6.png","title":"Photomatix Pro 6.2.1 – Extends dynamic range of digital photos/scanned films","content":"Photomatix Pro merges photographs taken at varying exposure levels into a single HDR image that reveals both highlight and shadow details, with options for automatically aligning hand-held photographs, removing ghosts, and reducing noise and chromatic aberrations. Merged images can then be adjusted by a range of options and settings to get the look that users […]"},{"link":"https://nmac.to/blog/redacted/","image":"https://nmac.to/wp-content/uploads/2018/10/Redacted1.png","title":"Redacted 1.2.4 – Hide sensitive details in an image","content":"Redacted makes it quick and easy to redact parts of an image. Hide sensitive details of an image by simply clicking and dragging. You can redact an image in three different ways: Pixelate Blur Black bar   Quickly drag and drop an image into Redacted or simply paste and image to get going. When you’re […]"},{"link":"https://nmac.to/blog/bettersnaptool/","image":"https://nmac.to/wp-content/uploads/2013/11/icon.175x175-751.png","title":"BetterSnapTool 1.9.5 – Easily manage window positions and sizes","content":"BetterSnapTool allows you to easily manage your window positions and sizes by either dragging them to one of your screens corners or to the top, left or right side of your screen. This lets you easily maximize your windows or position them side by side.In addition to that you can set keyboard shortcuts in order […]"},{"link":"https://nmac.to/blog/records/","image":"https://nmac.to/wp-content/uploads/2015/03/Records.png","title":"Records 1.6.13 – Innovative personal database","content":"Records is one of the most innovative personal databases app ever designed for the Mac. It lets you collect and organize any kind of information–from your favorite movies to your customer invoices–in this easy-to-use database creation and management tool.   Features WYSIWYG Editor Incredibly easy, drag-and-drop form and database creation Visual Editor lets you customize […]"},{"link":"https://nmac.to/blog/export-calendars-pro/","image":"https://nmac.to/wp-content/uploads/2020/02/Export_Calendars_Pro_1.png","title":"Export Calendars Pro 1.10 – Export tabular data from Calendar and Reminders","content":"Export Calendars Pro is a powerful, flexible tool to export events and reminders stored in your Mac’s Calendar and Reminders apps into various tabular-data files such as Excel, CSV, or tab-delimited text. You can also export almost any Address Book field for any participant attached to an event, including fields with custom labels. You’re able […]"},{"link":"https://nmac.to/blog/importer-for-contacts/","image":"https://nmac.to/wp-content/uploads/2020/01/Importer_for_Contacts_1.png","title":"Importer for Contacts 1.6 – Import tabular data to Apple Contacts","content":"Importer for Contacts picks up where Apple Contacts left off by importing Excel files, CSV files, tab-delimited files, and vCards into “Contacts” with more options.   As a bonus, it can also convert CSV and Excel files to vCard files directly without the need to import them first. The app is also able to restore […]"}]