[{"link":"https://nmac.to/blog/moneyspire/","image":"https://nmac.to/wp-content/uploads/2017/06/Moneyspire2018.png","title":"Moneyspire 18.0.4 – Comprehensive, user-friendly personal-finance software","content":"Moneyspire is remarkably great personal finance software! Enjoy these benefits: Keep track of your bank accounts, credit cards, etc. and see all your account balances in one place. Categorize your spending and income. Balance your checkbook and keep your accounts in order. Set bill reminders and see all your upcoming payments so you never forget […]"},{"link":"https://nmac.to/blog/split-screen/","image":"https://nmac.to/wp-content/uploads/2016/08/Split-Screen3.png","title":"Split Screen 3.12 – Super simple window management","content":"Split Screen allows you to effortlessly resize windows to exactly half your desktop at the touch of a simple keystroke. Gone are the days of trying to resize windows to fit nicely next to each other, with Split Screen it is as easy as pressing a button.   Supported Actions: Resize window left Resize window […]"},{"link":"https://nmac.to/blog/sofaplay/","image":"https://nmac.to/wp-content/uploads/2017/02/SofaPlay2.png","title":"SofaPlay 2.1.3 – Stream media directly to your TV using the UPnP/DLNA standard","content":"SofaPlay connects your Mac to your Smart TV and takes care of the streaming. Just drag any movie file onto SofaPlay and it will appear instantly on the big screen in front of you. SofaPlay streams your video wirelessly to your TV. No configuration needed, no hassle. Just drag and drop. Your Mac is completely […]"},{"link":"https://nmac.to/blog/presentation-prompter/","image":"https://nmac.to/wp-content/uploads/2017/02/Presentation-Prompter.png","title":"Presentation Prompter 5.4.2 – Feature-filled teleprompter","content":"Presentation Prompter is built for anyone who has ever used cue cards or read from a script.   It features: Smooth scrolling on multiple screens, optionally flipping text on the talent screen Precise speed controls using a keyboard, trackpad, or a remote A focus arrow, margins, and on-screen timers to help delivery A script editor […]"},{"link":"https://nmac.to/blog/scorch/","image":"https://nmac.to/wp-content/uploads/2017/11/Scorch.png","title":"Scorch 1.1.2 – Backblaze B2 storage client","content":"Scorch is a feature-packed Backblaze B2 cloud-storage client. It gives you everything you need to upload to, download from, and manage the files and buckets on your Backblaze B2 cloud storage account. Quickly and easily upload anything from a single file to folders containing thousands, no limit on file type or size. Uploading and downloading […]"},{"link":"https://nmac.to/blog/run-swift/","image":"https://nmac.to/wp-content/uploads/2017/11/Run-Swift.png","title":"Run Swift 1.2 – Quickly run and test your Swift scripts","content":"Run Swift offers the best way to easily test your Swift code – without having to open Xcode, mess with “Playgrounds”, or touch the Terminal. All in one place.   Features Powerful editor based on Peppermint Advanced code highlighting Autocompletion Snippets Run your scripts with one-click (or just Cmd+R) Option to pass additional command line […]"},{"link":"https://nmac.to/blog/ipastels-pro/","image":"https://nmac.to/wp-content/uploads/2017/11/iPastels.png","title":"iPastels Pro 2.13.1 – Simulates soft pastels, oil pastels, and color blending","content":"iPastels Pro simulates soft (chalk) pastels, oil pastels, and color blending as realistically as possible.   The pastel medium has been around for several centuries, with roots as old as mankind. An ever-increasing number of artists have since discovered the rich colors and expressiveness of pastel painting.   This app will let you create beautiful […]"},{"link":"https://nmac.to/blog/soulless-ray-of-hope/","image":"https://nmac.to/wp-content/uploads/2017/11/Soulless-Ray-Of-Hope.png","title":"Soulless Ray Of Hope 1.3.9.4 – Challenge yourself with intricate puzzles gameplay","content":"Follow the ray of hope in a world of darkening silhouettes as you help Elin save his friend and face his deepest fears.   Immerse yourself in Elin’s childlike wonder, and witness each new puzzle, secret, sin, or dilemma unfold to discover the truth behind this shadowy world.   Features: Travel through beautiful handcrafted environments […]"},{"link":"https://nmac.to/blog/liclipse/","image":"https://nmac.to/wp-content/uploads/2017/06/LiClipse.png","title":"LiClipse 4.3.1 – Swift editor based on Eclipse IDE","content":"LiClipse provides a new experience for Eclipse users   With it, users get out of the box: A fast editor supporting many languages out of the box. View supported languages Support for TextMate Bundles. View TextMate Bundles Integration A simple way to add support for a new language Usability improvements for all Eclipse editors featuring: […]"},{"link":"https://nmac.to/blog/manual-samuel/","image":"https://nmac.to/wp-content/uploads/2017/11/Manual-Samuel.png","title":"Manual Samuel 1.0 – A classic adventure game with a wild twist","content":"Manual Samuel is a classic adventure game with a wild twist. After making a deal with Death, our hero, the spoiled rich-kid Samuel, must survive for 24 hours controlling his entire body manually. From breathing and blinking to driving and working, all these tasks will fall to you. It won’t be easy, with Death himself […]"}]