[{"link":"https://nmac.to/blog/pelican/","image":"https://nmac.to/wp-content/uploads/2022/04/Pelican.png","title":"Pelican 1.2.0 – Lightweight clipboard manager","content":"Increase your efficiency, speed and productivity with Pelican Clipboard Manager!   Access and use your copy history.   No unnecessary features, fast, secure.   Features: Access your last 999 copied texts and images. Search, pin and delete easily. Everything is stored on your computer. English, Spanish, Russian and Turkish supported. If your password manager removes […]"},{"link":"https://nmac.to/blog/ruler/","image":"https://nmac.to/wp-content/uploads/2022/04/Ruler.png","title":"Ruler 22.3 – Measuring length","content":"Ruler: Measuring length   Ruler Ruler (Horizontal) Ruler (Vertical) Horizontal Ruler Vertical Ruler   Move Move up Move down Move left Move right   Zoom   Version 22.3: Fix the issue of the inch scale display of the ruler   Intel, 64-bit processor OS X 10.10 or later    "},{"link":"https://nmac.to/blog/istring/","image":"https://nmac.to/wp-content/uploads/2022/04/iString.png","title":"iString 2.2.5 – All your languages in one interface","content":"Use a lot of languages with iString easily. You have only one interface for all your languages. Everything that you need to do, it`s opening folder where you have your languages   Version 2.2.5: Improvements   Intel, 64-bit processor macOS 10.15 or later    "},{"link":"https://nmac.to/blog/magic-battery/","image":"https://nmac.to/wp-content/uploads/2017/10/Magic_Battery_5.png","title":"Magic Battery 7.3.9 – Displays battery status for Apple input devices","content":"Magic Battery supports all Apple input and audio devices. Battery information will be shown in the menu bar and the main window.   The App Magic Battery shows the battery level of supported input devices and headphones that are connected via Bluetooth in the menu bar. Internal batteries are also supported.   The following devices […]"},{"link":"https://nmac.to/blog/swiftymenu/","image":"https://nmac.to/wp-content/uploads/2022/04/SwiftyMenu.png","title":"SwiftyMenu 0.7 – Handy actions for Finder","content":"SwiftyMenu is a nifty extension for Finder.   It presents a customizable menu to rapidly open selected folders or files with your favorite applications.   Version 0.7: Addressed an issue of the folder dialog Minor interface refinements   Intel, 64-bit processor macOS 11.0 or later    "},{"link":"https://nmac.to/blog/cbrf-exchange-rates/","image":"https://nmac.to/wp-content/uploads/2022/04/CBRF-Exchange-Rates.png","title":"CBRF Exchange Rates 1.4.3 – Current exchange rates of Russian Central Bank","content":"CBRF Exchange Rates is a small app sitting in your menu bar and showing current exchange rates of Russian Central Bank for US Dollar, Euro, British Pound Sterling, and Japanese Yen to Russian Ruble.   You can choose to display several exchange rates by holding Shift or Command when selecting currency from menu. To select […]"},{"link":"https://nmac.to/blog/darkroom/","image":"https://nmac.to/wp-content/uploads/2022/04/Darkroom_6.png","title":"Darkroom 6.0.1 – Video, Portrait, & RAW Photos","content":"Darkroom is a premium photo & video editor that is easy to use by casual photographers, yet powerful enough for the pros.   UNIVERSAL & FREE PHOTO EDITOR All the tools you need to bring your photos to life are Live Photos, RAW images, and Portrait images offered for free, available on iPhone, iPad, and […]"},{"link":"https://nmac.to/blog/neofinder/","image":"https://nmac.to/wp-content/uploads/2013/04/NeoFinder.png","title":"NeoFinder 8.1.1 – Catalog your external media and disks (was CDFinder)","content":"NeoFinder (formerly CDFinder) rapidly organizes your data, either on external or internal disks, or any other volumes. It catalogs all your data, so you stay in control of your data archive or disk library. With extensive metadata support, you can find your files quickly.   Feature Overview Catalog: any hard disk, data folder, CD-ROM, DVD-ROM, […]"},{"link":"https://nmac.to/blog/screegle/","image":"https://nmac.to/wp-content/uploads/2021/12/Screegle.png","title":"Screegle 2.0.3 – Clean screen sharing and recording tool","content":"Screegle lets you share or record your entire screen, but only with the windows you want. The result is a clean, uncluttered «virtual desktop» that looks professional, doesn’t send private information, and never shows notifications during your online meetings.   Use with video conferencing apps like Zoom, Google Meet, Microsoft Teams and Others: simply share […]"},{"link":"https://nmac.to/blog/getirc/","image":"https://nmac.to/wp-content/uploads/2022/04/getIRC.png","title":"getIRC 1.3 – Simple yet Powerful Chat","content":"Internet Relay Chat (IRC) chatrooms on macOS: Featured IRC Client Powerful Beautiful interface   IRC provides a way of communicating in real-time with people from all over the world. It consists of various separate networks (or “nets”) of IRC servers, machines that allow users to connect to IRC.   Features: One window for multiple servers […]"}]