[{"link":"https://nmac.to/blog/unmechanical-2-0/","image":"https://nmac.to/wp-content/uploads/2016/01/Unmechanical.png","title":"Unmechanical 2.0 – Over 30 unique puzzles of exploration and adventure!","content":"Unmechanical is a puzzle adventure that combines tricky puzzle solving, alluring exploration, and an engrossing atmosphere. Set in a fantastic world of flesh, rock and steel, your journey to freedom requires you to solve a great variety of puzzling challenges, and while it’s easy to pick up and play, later challenges may prove very difficult […]"},{"link":"https://nmac.to/blog/youtube-hunter-5-6-2/","image":"https://nmac.to/wp-content/uploads/2014/08/YouTubeHunter.png","title":"YouTube Hunter 5.6.2 – Download and convert YouTube videos","content":"YouTubeHunter is a video downloader and converter.   It takes only seconds to find and download videos from YouTube, Vimeo, DailyMotion, VEVO and others. YouTubeHunter downloads videos 15x faster than real time playing and supports simultaneous downloads. YouTubeHunter has built-in search and preview capabilities. Get video by URL feature is available. YouTubeHunter keeps subtitles for […]"},{"link":"https://nmac.to/blog/wick/","image":"https://nmac.to/wp-content/uploads/2016/01/wick.png","title":"Wick 1.0 – A survival horror game","content":"Wick is a survival horror game where ghost stories are brought to life. Explore a local legend about the long lost children in the woods who can still be seen– but only by those who dare to enter alone by candlelight.   Deep in the darkness you sense you are not alone. But will you […]"},{"link":"https://nmac.to/blog/photo-batch-movavi-1-0/","image":"https://nmac.to/wp-content/uploads/2016/01/Photo-Batch-Movavi.png","title":"Photo Batch Movavi 1.0 – Quickly edit all your images in one fell swoop","content":"Have a large collection of vacation photos waiting to be edited? Feeling overwhelmed? You need Photo Batch Movavi! It’s a simple and effective application that will help you quickly edit all your images in one fell swoop.   Perhaps you took lots of vertical shots that were all mistakenly saved in horizontal format? There’s no […]"},{"link":"https://nmac.to/blog/grandreporter-1-6-6/","image":"https://nmac.to/wp-content/uploads/2016/01/GrandReporter.png","title":"GrandReporter 1.6.6 – Web search utility","content":"GrandReporter is a Web search and survey utility for automated queries. GrandReporter lets you automate searches over the Internet. Create your own queries in GrandReporter and it will scan for new Web information periodically.   As soon as a new page on one of the subjects that you want to survey is detected on the […]"},{"link":"https://nmac.to/blog/fear-equation-1-0/","image":"https://nmac.to/wp-content/uploads/2016/01/FearEquation.png","title":"Fear Equation 1.0 – A turn-based horror strategy game","content":"Fear Equation is a turn-based strategy with rogue-like elements where you must take control of a modified freight train in an end-of-the-world scenario. The landscape has been overrun by a thick, deadly fog that manifests the nightmares of those inside it. Your survival depends on tactical planning and careful resource management.   As the Engineer, […]"},{"link":"https://nmac.to/blog/shade-1-0-1/","image":"https://nmac.to/wp-content/uploads/2016/01/Shade.png","title":"Shade 1.0.1 – Hide your messy desktop with the click of a button","content":"Shade – Hide your messy desktop with the click of a button!   Just drag an image to the Shade icon. Click the Shade icon to turn Shade on and off. Click and hold for options and to quit. Retina Display Compatible.   Version 1.0.1: Maintenance update for Mac OS 10.10.1 Added Help menu link […]"},{"link":"https://nmac.to/blog/copyless-1-8-7/","image":"https://nmac.to/wp-content/uploads/2014/12/CopyLess.png","title":"CopyLess 1.8.7 – Store and access up to 100 clipboard items","content":"CopyLess is an advanced and flexible clipboard manager.   Unlike the system clipboard CopyLess can store up to 100 items to which you have instant access at any time. With CopyLess is no longer necessary to switch constantly between different applications or windows just to copy and paste several different items. Everything can now be […]"},{"link":"https://nmac.to/blog/cloudmagic-email-7-6-18/","image":"https://nmac.to/wp-content/uploads/2016/01/CloudMagic.png","title":"CloudMagic Email 7.6.18 – One app for all of your email accounts","content":"CloudMagic is the perfect app to handle your email accounts.   Instant push notifications for ALL types of email accounts: Gmail, Exchange, Yahoo, Outlook, iCloud, Google Apps, Office 365, IMAP – you name it! Supports all versions of Exchange: ActiveSync (EAS), EWS and IMAP. Handoff: Effortlessly hand off what you’re doing on iPhone, iPad or […]"},{"link":"https://nmac.to/blog/webbla-1-6-5/","image":"https://nmac.to/wp-content/uploads/2015/04/Webbla.png","title":"Webbla 1.6.5 – A visual bookmark manager","content":"Webbla allows you to organize your Bookmarks visually with Delicious and Pinboard support.   If you like to handle your music and photos with iTunes and iPhoto, Webbla is the right application to handle your bookmarks.   Webbla is a modern bookmark manager that helps you in organizing your bookmarks visually. It also offers you […]"}]