[{"link":"https://nmac.to/blog/eset-cyber-security-pro/","image":"https://nmac.to/wp-content/uploads/2017/05/Eset.Cyber_.Security.Pro_.png","title":"ESET Cyber Security Pro 6.7.300.0 – Total integrated computer security","content":"ESET Cyber Security Pro represents a new approach to truly integrated computer security. The most recent version of the ThreatSenseÂ® scanning engine, combined with Email client protection, Personal firewall and Parental control, utilizes speed and precision to keep your computer safe. The result is an intelligent system that is constantly on alert defending your computer […]"},{"link":"https://nmac.to/blog/nantucket/","image":"https://nmac.to/wp-content/uploads/2018/11/Nantucket.png","title":"Nantucket – Songs Of The Braves 1.3b – Strategy RPG & Adventure Game","content":"Chase after Moby Dick, and live through the Golden Age of American whaling in this seafaring strategy game. Set sail around the world, manage your ship and crew, and live Ishmael’s story, the sole survivor of the Pequod, a few years after the events narrated by Herman Melville in his masterpiece.   Set sail and […]"},{"link":"https://nmac.to/blog/timer/","image":"https://nmac.to/wp-content/uploads/2018/11/Timer.png","title":"+Timer 2.0.1 – Timer and stopwatch for the Dock","content":"+Timer is a timer and stopwatch app that sits in your Dock, just one glance away. With only 2 clicks you can launch a new timer (using customizable presets) or a stopwatch. You can set customizable global keyboard shortcuts for presets and most frequent actions. It is packed with multiple beautiful designs so you can […]"},{"link":"https://nmac.to/blog/f1-106/","image":"https://nmac.to/wp-content/uploads/2018/04/F1-2017.png","title":"F1 2017 1.0.6 Patch 1.13 – Create your own legend [UPDATE]","content":"Win the 2017 World Championship and race some of the fastest and most iconic F1 cars of the last 30 years.   F1 2017 grants unprecedented access to not only the on-track excitement of F1, but also the off-track dealings and vehicle development that goes along with it. The ten-year Career Mode includes practice programmes […]"},{"link":"https://nmac.to/blog/infographics-lab-for-keynote/","image":"https://nmac.to/wp-content/uploads/2017/11/Infographics-Lab-for-Keynote.png","title":"Infographics Lab 3.4.2 – Visualization graphics for Keynote","content":"Infographics Lab contains a massive collection of thousands of data visualization tools to illustrate and enhance your Apple Keynote presentations! Every single item is crafted to perfection to be visually captivating and easily customizable.   Infographics Lab for Keynote has items for virtually any occasion, from charts and diagrams to editable city, state, country, and region […]"},{"link":"https://nmac.to/blog/airplayer-pro/","image":"https://nmac.to/wp-content/uploads/2016/02/AirPlayer.Pro_.png","title":"AirPlayer Pro 2.5.0.2 – iDevices wireless streaming App","content":"AirPlayer Pro – Use AirPlay capabilities to display a photo or video, audio and recording with your devices on Mac computers   Big screen to play games  Start AirPlayer and just enjoy the game on the big screen   Enable HIFI music  computer is connected to a HiFi, Iphone music can be listened to in […]"},{"link":"https://nmac.to/blog/moho-pro/","image":"https://nmac.to/wp-content/uploads/2016/09/Moho-Pro.png","title":"Moho Pro 12.5.1 – Create your own 2D cartoons and animations","content":"Moho Pro is a full-featuresd animation system for creating 2D anime and cartoons. Moho Pro was especially designed for professionals looking for a more efficient alternative to tedious frame-by-frame animation.   Moho Pro provides an easy-to-use interface, a visual content library and powerful features such as a bone rigging system, automatic image tracing, integrated lip-synching, […]"},{"link":"https://nmac.to/blog/recorder/","image":"https://nmac.to/wp-content/uploads/2018/11/Recorder.png","title":"+ Recorder 2.0.1d – Voice recorder for the Dock","content":"+Recorder is a voice recorder located in your Dock, always just one glance away. It contains beautiful designs, as well as customizable hotkeys, so you can customize your recorder to fit perfectly into your setup.   Features Customizable behavior and appearance Beautiful designs Customizable hotkeys Simple and easy-to-use interface Fast and lightweight Option to launch […]"},{"link":"https://nmac.to/blog/pichi/","image":"https://nmac.to/wp-content/uploads/2018/11/Pichi.png","title":"Pichi 1.0.0 – Optimize and resize your images","content":"Pichi optimizes and resizes your images.   Features: The fastest way to optimize images: Display the UI when dragging images files, even when the app is closed. Batch processing: Just drop/select a selection of images with no upper limit. Quick Optimization: Get results fast using the default settings. PNGs optimized as PNGs and JPEGs optimized […]"},{"link":"https://nmac.to/blog/nice-todo/","image":"https://nmac.to/wp-content/uploads/2018/11/Nice-Todo.png","title":"Nice Todo 2.0.5d – Checklist manager with cloud-sync features","content":"Nice Todo is a simple way to remember things. It can lay always on top of your desktop so you will not miss any of your checklist items and it is always just one click away. It has 3 beautiful styles built-in and more to come! It also syncs using iCloud so you will be […]"}]