[{"link":"https://nmac.to/blog/tumblekit-v1-1-0/","image":"https://nmac.to/wp-content/uploads/2013/12/tumblekit.175x175-75.png","title":"TumbleKit v1.1.0 – Decent client for Tumblr","content":"Browse your dashboard, visit your favorite blogs, read liked posts, find posts with tags you are interested in, create post directly from TumbleKit, attach photos, audio, video and much more. FEATURES • Browse your dashboard• Read posts you liked• List blogs you are following• Blog browser• Tag browser• Like/Unlike post• Reblog with comment• Show notes• […]"},{"link":"https://nmac.to/blog/shareurl-v1-1/","image":"https://nmac.to/wp-content/uploads/2013/12/app.175x175-753.png","title":"ShareURL v1.1 – URLs Sharing via soical networks","content":"ShareURL Allows you to share your current URL to your social networks!Share websites with your friends via Twitter, Facebook, Messages, and Mail! Safari’s not the only browser with social sharing now. You can even use the Mountain Lion notification center to keep a list of your recent shares! So what are you waiting for? Get […]"},{"link":"https://nmac.to/blog/screen-lock-v1-0-2/","image":"https://nmac.to/wp-content/uploads/2013/12/Screen_Lock.175x175-75.png","title":"Screen Lock v1.0.2 – Lock you screen with password for additional security","content":"Lock Screen replacement. Does not sleep or shutdown running applications.Use with Lock Screen or Screen Saver with password for additional security.Screen turns black when locked and password text box appears when key pressed or mouse clicked. Use global hot key to lock the screen. Coming soon and idle timer to lock the screen. What’s New […]"},{"link":"https://nmac.to/blog/resizex-v-4-1-1/","image":"https://nmac.to/wp-content/uploads/2013/12/RX.175x175-75.png","title":"ResizeX v.4.1.1 – Converts and resize image format","content":"ResizeX changes image size and converts image format of multiple files at once.ResizeX is a shareware version of ResizeIt and it has some more useful features. ・PreviewResized image can be shown in Preview window. Resizing images can be previewed and processed one by one. In this window high quality conversion and normal conversion can be […]"},{"link":"https://nmac.to/blog/radio-cloud-v1-0/","image":"https://nmac.to/wp-content/uploads/2013/12/icon.175x175-7549.png","title":"Radio Cloud v1.0 – New way to listen to the radio on OS X","content":"Welcome to the next generation of radio. You won’t believe your ears. Radio Cloud brings a revolutionary new way to listen to the radio on OS X.Featuring a stunning 3D user interface, radio stations appear to hover in front of your eyes. As you swipe your finger across the trackpad or magic mouse, one station […]"},{"link":"https://nmac.to/blog/praise-v1-0-1/","image":"https://nmac.to/wp-content/uploads/2013/12/praiseIcon.175x175-751.png","title":"Praise v1.0.1 – Facebook and Twitter Share","content":"Praise is an menu tab app that is running your Facebook and Twitter in the menu tab for check your friends post quickly. – Shortcut key to share a post. – URL sharing when you are watching webpage at Safari/Chrome. – Shortcut key customization. – Share URL or Post message to Facebook & Twitter at the […]"},{"link":"https://nmac.to/blog/piggystocks-1-2/","image":"https://nmac.to/wp-content/uploads/2013/12/PiggyStocks.175x175-75.png","title":"PiggyStocks 1.2 – Monitor your portfolio stock","content":"Get instant access with PiggyStocks, an intuitive, powerful app that lets you monitor your portfolio stock quotes as well as daily stock/charting data for analysis about any ticker. Simply enter a stock ticker symbol into the search field and you’ll get price, volume, market cap etc. PiggyStocks is the perfect app for investors to keep […]"},{"link":"https://nmac.to/blog/picturito-v1-0/","image":"https://nmac.to/wp-content/uploads/2013/12/Picturito.175x175-75.png","title":"Picturito v1.0 – Pictures sharing for Facebook","content":"Picturito. The fastest and easiest way to share multiple pictures from multiple places on Facebook right from your desktop! Easy as 1, 2, 3!Picturito is a small Status Bar App that helps you share multiple pictures to Facebook using the built-in OSX Facebook Integration. You just have to choose the pictures you want and Picturito […]"},{"link":"https://nmac.to/blog/menu-map-v1-0/","image":"https://nmac.to/wp-content/uploads/2013/12/app.175x175-754.png","title":"Menu Map v1.0 – Google Map and map direction","content":"Google Map on the menu for easy and quick accessFor map direction, you select the current location field, click the “location” icon (second icon) on the top, it will paste the current address to the current location field. Then you enter your destination address to get the map direction. Important: This app starts up and […]"},{"link":"https://nmac.to/blog/menu-calculator-v1-1/","image":"https://nmac.to/wp-content/uploads/2013/12/app.175x175-755.png","title":"Menu Calculator v1.1 – Calculator on you status bar","content":"Calculator on the menu bar for easy and quick access. Important: This app starts up and stay on the top menu bar close to the clock until you quit.  What’s New in Version 1.1 bug fixes ScreenShots : BitShare Click Here Uploaded Click Here SlingFile Click Here CroCko Click Here FileFactory Click Here affiliate marketing"}]