[{"link":"https://nmac.to/blog/motorsport-manager/","image":"https://nmac.to/wp-content/uploads/2016/12/Motorsport.Manager.png","title":"Motorsport Manager 1.5.16749 – Racing, Management & Simulation Game","content":"Motorsport Manager is a highly detailed, best-in-class management game for fans of motorsport. You’ll hire the drivers, build the cars and embed yourself in the dynamic world of racing.   Every single detail will need to be considered in order to push your way to the championship title. Split second decisions on the race track […]"},{"link":"https://nmac.to/blog/ring-menu/","image":"https://nmac.to/wp-content/uploads/2016/03/Ring-Menu1.png","title":"Ring Menu 1.4.8 – Shortcut to your favorite apps, documents and folders","content":"Ring Menu provides a place for your favorite apps, files and folders that’s always at hand. It’s a dock that responds to trackpad gestures and keyboard shortcuts:   Features: A dynamic circular menu around your mouse cursor that can be accessed from anywhere Easily add apps, files and folders via drag-and-drop Use keyboard shortcuts or […]"},{"link":"https://nmac.to/blog/paint-expert/","image":"https://nmac.to/wp-content/uploads/2017/11/Paint-Expert.png","title":"Paint Expert 2.1 – Beautiful and powerful graphics painting app","content":"Paint Expert is a beautiful and powerful graphics painting app like MS Paint that offers you the most needed and useful tools in the toolbox panel. With all the simple and effective tools, you’ll be able to create your own fantastic pictures in seconds.   Features: Draw the beauty with Paint Expert as you would […]"},{"link":"https://nmac.to/blog/neptunes/","image":"https://nmac.to/wp-content/uploads/2016/06/NepTunes.png","title":"NepTunes 1.65 – Music controller and scrobbler for iTunes and Spotify","content":"NepTunes is a simple-to-use, yet powerful Last.fm music scrobbler for iTunes that is light, super-reliable and fully works with Apple Music, and can help you with discovering new music.   What is it and what it can do?   iTunes and Spotify controller. Change volume. Love track. Pause/Play. Find lyrics. Share to Twitter nad Facebook. […]"},{"link":"https://nmac.to/blog/notefile/","image":"https://nmac.to/wp-content/uploads/2017/09/Notefile2.png","title":"Notefile 2.7.2 – Share notes on all of your devices","content":"Notefile lets you make quick notes and view them quickly, from anywhere. It’s a Dashboard widget for your Mac, as well as a universal app for iPhone, iPad, and iPod touch. You can sync notes between all your devices. You can also view and edit your notes on the JuneCloud website.   Version 2.7.2: Improved […]"},{"link":"https://nmac.to/blog/handsfree/","image":"https://nmac.to/wp-content/uploads/2017/07/HandsFree2.png","title":"HandsFree 2.6.5 – Use any Bluetooth phone for calls, texting, recording, and more","content":"HandsFree lets you use your Mac to make phone calls, send/receive text messages*, record conversations, see call lists and more. It couldn’t be any easier. With HandsFree running in the background (with the always available status icon and menu), you don’t have to worry about missing a call or a text message. And we think […]"},{"link":"https://nmac.to/blog/h265-converter-pro/","image":"https://nmac.to/wp-content/uploads/2016/11/H265-Converter-Pro.png","title":"H265 Converter Pro 3.3.1 – Simple H.256 (MKV) converter","content":"H265 Converter Pro allows you to convert all your videos to MKV format using the H.265 video codec, retaining full quality and saving about 50% of disk space. Remember that Apple devices don’t support H.265 hardware playback; you will need third-party software to play H.265/MKV videos.   Features Same quality as H.264, but with half […]"},{"link":"https://nmac.to/blog/webdrive/","image":"https://nmac.to/wp-content/uploads/2017/11/WebDrive.png","title":"WebDrive 2017.0 – Mount cloud storage as a local device","content":"WebDrive’s instantly familiar interface lets you fluently work with cloud storage, local files, and files on remote servers through one common access point. Use WebDrive instead of the traditional FTP client, WebDAV, or SFTP client to reduce the steps of updating remote content.   Connect to popular cloud storage servers through the convenience of a […]"},{"link":"https://nmac.to/blog/annotation-edit/","image":"https://nmac.to/wp-content/uploads/2014/01/Annotation-Edit.png","title":"Annotation Edit 1.9.89.20 – Editor for working with subtitles, captions, and annotations","content":"Annotation Edit is a unique editor for professional subtitles, captions, and annotations. Annotation Edit is designed to give production houses and eLearning environments a smooth subtitle workflow for Apple DVD Studio Pro / Final Cut Pro, QuickTime WebTV and broadcast. Annotation Edit can import and export DVD Studio Pro/Spruce STL, STL EBU binary (all latin […]"},{"link":"https://nmac.to/blog/dockshelf/","image":"https://nmac.to/wp-content/uploads/2016/12/DockShelf1.png","title":"DockShelf 1.5.1 – Increase accessibility by creating multiple docks","content":"DockShelf lets you place unlimited docks around your desktop so you never run out of space again for your commonly used files, folders and applications!   We’ve all seen it and you’ve probably experienced it yourself – a Dock exploding with files and apps which has been shrunk so small you can barely see what […]"}]