[{"link":"https://nmac.to/blog/super-eraser-1-2-5/","image":"https://nmac.to/wp-content/uploads/2016/03/Super-Eraser.png","title":"Super Eraser 1.2.5 – Remove unwanted elements from your photos","content":"Super Eraser magically removes unwanted elements and instantly fixes your photos. Powered by the latest revolutionary image-restoration algorithm, Super Eraser never ruins your photos, which can happen with some professional image-processing software. A variety of experiments shows that Super Eraser can give you better and more natural, amazing results than similar tools. Super Eraser quickly […]"},{"link":"https://nmac.to/blog/world-of-tanks-blitz-2-7-1/","image":"https://nmac.to/wp-content/uploads/2016/03/World-of-Tanks-Blitz.png","title":"World of Tanks Blitz 2.7.1 – MMO action game dedicated to fierce tank combat","content":"World of Tanks Blitz is a team-based MMO action game dedicated to fierce tank combat. The game derives its best traits from the original World of Tanks PC version and puts an energetic twist on its dynamic combat. World of Tanks Blitz lets you control over 200 legendary armored vehicles, while deep mechanics and realistic […]"},{"link":"https://nmac.to/blog/morphx-2-13/","image":"https://nmac.to/wp-content/uploads/2016/03/MorphX.png","title":"MorphX 2.13 – Morph images or movies together","content":"MorphX is a simple application for calculating images or movies where one image transforms into another.   Version 2.13: Fixes a bug that could make opening documents fail.   Intel OS X 10.11 or later    "},{"link":"https://nmac.to/blog/image-editor-0-61/","image":"https://nmac.to/wp-content/uploads/2016/03/Image-Editor.png","title":"Image Editor 0.61 – Brush, Text, Texture, Photo Effects","content":"Image Editor is a simple image editor. It features gradients, textures and anti-aliasing for both text and brush strokes. It also supports multiple layers, alpha channel editing and uses the same native file format as GIMP.   Key Features: Full support for the XCF file format Reading and writing TIFF, PNG, GIF, JPEG and JPEG […]"},{"link":"https://nmac.to/blog/drive-1-3/","image":"https://nmac.to/wp-content/uploads/2016/03/Drive.png","title":"Drive 1.3 – External Drive Manager","content":"Drive makes it easy to check the available space on all your volumes with a single click. Eject your mounted volumes quickly and monitor free space of your system volumes in the menubar.   Drive helps you to; Monitor free space on your drives Auto mount selected drives Easily eject drives from the menubar Notifications […]"},{"link":"https://nmac.to/blog/apps-on-sale-2-1/","image":"https://nmac.to/wp-content/uploads/2016/03/Apps-On-Sale.png","title":"Apps On Sale 2.1 – Do not miss out any sales/deals at the Mac App Store","content":"Mac App Store is growing fast, dozens of apps are going on sale every hour, 100th of apps are added every single day.   With App On Sale you’ll surely not miss out any sales/deals at the Mac App Store and will always stay aware of a new arrivals!   Apps on Sale is feature packed Mac […]"},{"link":"https://nmac.to/blog/appicon-generator-1-1-0/","image":"https://nmac.to/wp-content/uploads/2016/03/AppIcon-Generator.png","title":"AppIcon Generator 1.1.0 – Powerful icon generator for OS X","content":"AppIcon Generator is a simple but powerful icon generator for OS X, iOS, and Android. Unlike other icon generator applications, AppIcon Generator do more than a simple resizing job. This application lets you set shape, background color, and add border and glossy effect to finished icon.   Key Features: Generate icon for OS X, iOS, […]"},{"link":"https://nmac.to/blog/emcee-for-itunes-and-spotify-2-0-2/","image":"https://nmac.to/wp-content/uploads/2016/03/Emcee.png","title":"Emcee for iTunes and Spotify 2.0.2 – Humbly shows the song in the menu bar","content":"Many Mac apps show what’s currently playing in your iTunes — often by rendering semi-transparent widgets over what you do. Those widgets distract you from work and never answer the question “What’s playing?” the moment you have it.   Emcee humbly shows the song in the menu bar.   The song name does not scroll, […]"},{"link":"https://nmac.to/blog/compose-1-8-10/","image":"https://nmac.to/wp-content/uploads/2015/12/Compose.png","title":"Composé 1.8.10 – Develop iOS apps without writing code","content":"Composé creates apps for iOS that are tailored to iPhone and iPad. This ensures an authentic look-and-feel and no compromise on performance.   Features Arrange text and images on a pixel-perfect layout grid Include RSS-Feeds, JSON- and CSV data Include audio and video Add animations Create forms and databases Export your result for Xcode, so […]"},{"link":"https://nmac.to/blog/x-mirage-2-01-10/","image":"https://nmac.to/wp-content/uploads/2014/04/X-Mirage.png","title":"X-Mirage 2.01.10 – Mirror your iOS devices on your Mac","content":"X-Mirage allows users to wirelessly mirror iOS devices on a Mac using AirPlay. X-Mirage supports mirroring multiple iOS devices to one Mac, as well as the ability to record the mirrored devices’ screens.   Version 2.01.10: Added compatibility with iOS 9   Intel OS X 10.6 or later iPad 2, iPad 3, iPad 4, iPad […]"}]