[{"link":"https://nmac.to/blog/torment-tides-of-numenera-immortal-edition-1-0-2/","image":"https://nmac.to/wp-content/uploads/2017/05/Torment-Tides-of-Numenera.png","title":"Torment – Tides of Numenera – Immortal Edition 1.0.2 – RPG & Story Rich Adventure Game","content":"You are born falling from orbit, a new mind in a body once occupied by the Changing God, a being who has cheated death for millennia. If you survive, your journey through the Ninth World will only get stranger… and deadlier.   With a host of strange companions – whose motives and goals may help […]"},{"link":"https://nmac.to/blog/mafia-iii-1-0-0/","image":"https://nmac.to/wp-content/uploads/2017/05/Mafia.III_.png","title":"Mafia III 1.0.0 – Rise through the ranks of a mob family","content":"It’s 1968 and after years of combat in Vietnam, Lincoln Clay knows this truth: family isn’t who you’re born with, it’s who you die for. Now back home in New Bordeaux, Lincoln is set on escaping a criminal past. But when his surrogate family, the black mob, is betrayed and wiped out by the Italian […]"},{"link":"https://nmac.to/blog/universal-kit-mill/","image":"https://nmac.to/wp-content/uploads/2017/03/Universal-Kit-Mill.png","title":"Universal Kit Mill 1.2 – Templates for Photoshop","content":"Universal Kit Mill – Templates for Photoshop is the perfect tool for the Adobe Photoshop users for creating high-quality Banners, Headers, Infographics, or social media networks’ (such as Facebook and Twitter) covers quickly and easily. This set includes over 400 templates and textures.   Focus on your content – we’ll take care of the design. […]"},{"link":"https://nmac.to/blog/movie-maker-3-3-0/","image":"https://nmac.to/wp-content/uploads/2016/08/Movie-Maker.png","title":"Movie Maker 3.3.0 – Time-lapse movie maker","content":"Movie Maker puts everything you need to tell your story in a movie, with a streamlined interface and intuitive workflow that let you enjoy your photos/videos like never before. Browse your image/video library, add background music & subtitle, use stunning Ken Burns & transition effects, create Hollywood-style movies, and quickly share your favorite moments online. […]"},{"link":"https://nmac.to/blog/samorost-3-1-6/","image":"https://nmac.to/wp-content/uploads/2016/03/Samorost.3.png","title":"Samorost 3 1.6 – An exploration adventure and puzzle game","content":"Samorost 3 is an exploration adventure and puzzle game from the award-winning creators of Machinarium and Botanicula. It is Amanita Design’s most ambitious experience to date and a loose continuation of the hit indie games Samorost and Samorost 2.   Samorost 3 follows a curious space gnome who uses the powers of a magic flute […]"},{"link":"https://nmac.to/blog/bundle-for-iwork-5-3/","image":"https://nmac.to/wp-content/uploads/2016/09/Bundle-for-iWork.png","title":"Bundle for iWork 5.3 – Pages, Numbers, and Keynote templates","content":"Bundle for iWork provides you with unique designs for Pages documents, spreadsheet templates for Numbers, first-class slideshow themes for Keynote, and images for illustrating your content. All templates are available in the US and international paper sizes.   Version 5.3: 55 new Pages templates   Intel, 64-bit processor OS X 10.12 or later    "},{"link":"https://nmac.to/blog/midikit-4-2/","image":"https://nmac.to/wp-content/uploads/2017/05/MidiKit.png","title":"MidiKit 4.2 – MIDI batch editor and browser","content":"MidiKit is a MIDI file browser/editor and batch processor. The browser quickly displays the most significant information about MIDI files. The editor allows native SMF editing with unlimited undo/redo capacity. Finally, MidiKit allows you to apply several operations on your MIDI files by batch processing entire disks at a time.   Version 4.2: New: The […]"},{"link":"https://nmac.to/blog/markly-1-8-2/","image":"https://nmac.to/wp-content/uploads/2015/11/Markly.png","title":"Markly 1.8.2 – Create measurement and design specs in Photoshop and Sketch","content":"Markly is a measurement and design-spec plugin/extension for Photoshop and Sketch. It is made for modern Web designers and app front-end developers. You can add specification marks simply by clicking-and-dragging. Coordinates, dimensions, distance, or fonts, no matter what or where you want.   Super Easy and Fast   Without Markly, you have to spend time […]"},{"link":"https://nmac.to/blog/devonnote-2-9-11/","image":"https://nmac.to/wp-content/uploads/2014/04/DEVONnote.png","title":"DEVONnote 2.9.11 – Intelligent notepad","content":"DEVONnote is an easy-to-use, intelligent note pad capable of storing and organising plain or rich texts and file aliases. Store and manage your bookmarks in DEVONnote too, browse the Web using the integrated browser based on Apple’s WebKit, capture interesting notes immediately or organize webcams. Furthermore, DEVONnote helps you sort in new stuff and supports […]"},{"link":"https://nmac.to/blog/slideshow-dvd-creator-4-0/","image":"https://nmac.to/wp-content/uploads/2017/05/Slideshow-DVD-Creator.png","title":"Slideshow DVD Creator 4.0 – Burn Photo Movies on DVD","content":"Build photo slideshow easily and quickly and watch hi-resolution slideshow video on bigger TV screen.   Slideshow DVD Creator helps you create photo slideshow with music and burn DVD video disc to get movies on DVD from your photo collections, video clips and favorite music as easy as 1,2,3. with Slideshow DVD Creator, you can […]"}]