[{"link":"https://nmac.to/blog/sonicfire-pro/","image":"https://nmac.to/wp-content/uploads/2012/12/Sonicfire.Pro_.png","title":"Sonicfire Pro 6.0.8 – Create soundtracks for your videos","content":"Sonicfire Pro is designed from the ground up to help you create perfect music soundtracks custom fit to your videos in just minutes. No other audio software is as fast or as easy in creating the music you need to make your visuals come to life and custom soundtracks are the key to high-impact, professional […]"},{"link":"https://nmac.to/blog/runner3/","image":"https://nmac.to/wp-content/uploads/2018/05/Runner3.png","title":"Runner3 1.0 – Action Rhythm & Platformer Game","content":"The rhythm-music platformer gameplay of BIT.TRIP RUNNER and Runner2 is back and better than ever!   The Timbletot is determined to rid the multiverse of all its love and happiness. CommanderVideo, a lover if ever there were one, refuses to let this happen. He’s ready to jump, double-jump, wall-jump, slide-jump, slide, kick, float, fly, and […]"},{"link":"https://nmac.to/blog/deus-ex/","image":"https://nmac.to/wp-content/uploads/2017/02/Deus-Ex-Mankind-Divided.png","title":"Deus Ex: Human Revolution 1.1.1 – First-person role-playing game","content":"The year is 2029, and mechanically augmented humans have now been deemed outcasts, living a life of complete and total segregation from the rest of society.    Now an experienced covert operative, Adam Jensen is forced to operate in a world that has grown to despise his kind. Armed with a new arsenal of state-of-the-art […]"},{"link":"https://nmac.to/blog/liquid-flow/","image":"https://nmac.to/wp-content/uploads/2017/09/Liquid15.png","title":"Liquid 17 – Integrated shortcuts for common daily tasks","content":"With Liquid, you flow through your work effortlessly and quickly by doing the things you need to do every way – looking up words sharing information, translating, copying, calculating and converting. When you interact with your information through your computer smoothly, not in little bits and dribs and drabs, your work becomes liquid and you work […]"},{"link":"https://nmac.to/blog/yummy-ftp-watcher/","image":"https://nmac.to/wp-content/uploads/2016/05/Yummy.FTP_.Watcher.png","title":"Yummy FTP Watcher 3.0.9 – Automated FTP/S + SFTP + WebDAV/S client","content":"Yummy FTP Watcher automates uploads and downloads, and syncs between your Mac and any number of FTP/S + SFTP + WebDAV/S servers, watching the chosen folders for changes and acting upon them. Powered by the file transfer engine of the highly regarded Yummy FTP Pro app, all the speed and reliability you’d expect is provided, […]"},{"link":"https://nmac.to/blog/yummy-ftp-pro/","image":"https://nmac.to/wp-content/uploads/2016/02/Yummy-FTP1.png","title":"Yummy FTP Pro 2.0.5 – FTP/SFTP client for speedy, trouble-free file transfers","content":"Yummy FTP is an FTP + SFTP + FTPS file transfer client which focuses on speed, reliability, and productivity. Whether you need to transfer a few files or a few thousand, schedule automatic backups, or perform website maintenance, Yummy FTP will handle it with ease.   Features Beautiful, Retina-enabled user interface Full FTP/FTPS/SFTP protocol support […]"},{"link":"https://nmac.to/blog/bias-amp-2/","image":"https://nmac.to/wp-content/uploads/2018/05/BIAS-AMP-2.png","title":"BIAS AMP 2 Elite 2.1.2.1163 – The ultimate in virtual guitar amplification technology","content":"BIAS AMP 2 is the ultimate virtual amp designer, authentically recreating the tone and feel of real tube amplifiers, while allowing you to mix and match components to create your ideal amp. You can use Amp Match to clone the tone of real hardware or a guitar track, or connect to the ToneCloud® to gain […]"},{"link":"https://nmac.to/blog/promv/","image":"https://nmac.to/wp-content/uploads/2018/05/ProMV-Music-Video-Maker.png","title":"ProMV 1.3.0 – An easy-to-use music video creator","content":"ProMV uses a variety of visualization techniques to convert musics to videos. So you can experience the music in a new way.   ProMV is an easy-to-use music video creator, an audio visualization tool that allows you to produce great music video in a very fast way. It is very useful for people wanting to […]"},{"link":"https://nmac.to/blog/highland/","image":"https://nmac.to/wp-content/uploads/2016/09/Highland-2.png","title":"Highland 2.0.5 – Powerful, straightforward screenwriting app","content":"Highland is a powerful, straightforward screenwriting app. With Highland, crafting a perfectly-formatted screenplay is as simple as writing an email. Just type. Highland will make it look good.   Created by acclaimed screenwriter John August (Big Fish, Frankenweenie), Highland works its magic on plain text, allowing you to focus on the writing. “The old apps […]"},{"link":"https://nmac.to/blog/ffworks/","image":"https://nmac.to/wp-content/uploads/2016/06/iFFmpeg.png","title":"ffWorks 1.0.10 – Convert multimedia files between formats","content":"ffWorks (was iFFmpeg), focused on simplicity, brings a fresh approach to the use of FFmpeg, allowing you to create ultra-high-quality movies without the need to write a single line of code on the command-line. High Quality and Control – Convert and processes many media files with high level quality using FFmpeg with no knowledge. Advanced […]"}]