[{"link":"https://nmac.to/blog/art-view-1-1-1/","image":"https://nmac.to/wp-content/uploads/2014/01/Art-View.png","title":"Art View 1.1.1 – Enhanced Quick Look support for Adobe Creative Suite and Cloud","content":"Art View: Quick Look enhancement for Creative Suite and Creative Cloud.    Download and launch Art View. Suddenly your graphics files’ Quick Look previews come to life. Illustrator files preview with or without PDF compatibility, InDesign files show their embedded previews for the first time outside of Bridge, and Adobe Swatch Exchange files show up […]"},{"link":"https://nmac.to/blog/ipin-1-12/","image":"https://nmac.to/wp-content/uploads/2014/01/iPIN.png","title":"iPIN 1.12 – Secure PIN & Password Safe","content":"You have to remember several PINs and passwords? For various credit cards, online-banking, security-token, email accounts and so on?   iPIN – and your PINs and passwords are always at hand. Access at lightning speed, as secure as possible and – if you like – also in synch via iCloud at any time on your […]"},{"link":"https://nmac.to/blog/connect-1-2/","image":"https://nmac.to/wp-content/uploads/2014/01/Connect.png","title":"Connect 1.2 – Phone calls using Bluetooth connection","content":"Connect lets you connect with your friends by allowing you to place phone calls and receive phone calls from your Mac using a Bluetooth connection to your phone. You may also press the keys 0-9 * # during a call, to use the dialer.   WHAT’S NEW Version 1.2:   Critical Bug Fixes: – International […]"},{"link":"https://nmac.to/blog/unison-2-1-10/","image":"https://nmac.to/wp-content/uploads/2014/01/Unison.png","title":"Unison 2.1.10 – Usenet newsreader handles messages, files, & media","content":"Unison is a carefully-crafted, genuinely revolutionary Mac OS X Usenet newsreader. It offers all the expected newsreader functionality: easy-to-navigate threaded discussions, the ability to ignore annoying posters, multiple signature management, and easy, Mail-like posting with spell checking and all the trimmings.   But it also goes much, much further than any other Usenet client on […]"},{"link":"https://nmac.to/blog/growltunes-3-0/","image":"https://nmac.to/wp-content/uploads/2014/01/GrowlTunes.png","title":"GrowlTunes 3.0 – Control iTunes via Growl","content":"GrowlTunes will eliminate the question, “What song just started playing in iTunes?” GrowlTunes makes it easy to see what track is playing, and gives you even more control, like changing track ratings and the volume of iTunes too. If you have Growl you can even change the way track change notifications look.   GrowlTunes makes […]"},{"link":"https://nmac.to/blog/font-sleuth-2-4-2/","image":"https://nmac.to/wp-content/uploads/2014/01/Font-Sleuth.png","title":"Font Sleuth 2.4.2 – Font browser and organizer","content":"Font Sleuth is a font browser and organizer with a focused feature set enabling users to find fonts fast. Create font groups according to your own criteria for even faster font location.   Using the Font Sleuth Viewer window, you can view your installed or uninstalled fonts in a wysiwyg list (displayed in their font […]"},{"link":"https://nmac.to/blog/optimprefs-1-1/","image":"https://nmac.to/wp-content/uploads/2014/01/OptimPrefs.png","title":"OptimPrefs 1.1 – iPhone-style shortcuts to system functions","content":"OptimPrefs provides fast shortcuts to system functions!!!!    Now you can access to the most important settings much faster! Instantly!! Like iPhone style.   Version 1 has these shortcuts: Wi-Fi Volume Mute Brightness Location   WHAT’S NEW Version 1.1: Ready for new OS X 10.9. New UI window. New “About” window with “HamacaSoft” name! New […]"},{"link":"https://nmac.to/blog/antetype-1-3-0/","image":"https://nmac.to/wp-content/uploads/2014/01/Antetype.png","title":"Antetype 1.3.0 – Interface design tool","content":"Antetype UI designer is a brand new, ground-breaking design application that supports user-interface designers at every step of their work. Design beautiful interfaces, invent new widgets, style them, and put it all together in an interactive prototype!   Features: Multiple Looks and Feels: Looks and feels are stored globally in the shared library and can […]"},{"link":"https://nmac.to/blog/hueshifter-1-1-1/","image":"https://nmac.to/wp-content/uploads/2014/01/HueShifter.png","title":"HueShifter 1.1.1 – Image color shifting application","content":"HueShifter is an amazing new application for doing color transposition or “color shifting” in images. Unlike other graphics applications, HueShifter works in perceptually uniform colorspace so you can make changes that are virtually imperceptible, all while working with color dimensions that you’re familiar with – hue, saturation and lightness.   HueShifter works right alongside Adobe […]"},{"link":"https://nmac.to/blog/audiomate-1-2-5/","image":"https://nmac.to/wp-content/uploads/2014/01/AudioMate.png","title":"AudioMate 1.2.5 – Easy audio control for your Mac","content":"AudioMate lets you control all your audio devices from the status bar, receive system notifications when relevant events happen on your audio devices, and more — all for less than the price of your favourite Frappuccino!   AudioMate features: Status bar: See your favorite device’s master output volume, sample rate or clock source at any […]"}]