[{"link":"https://nmac.to/blog/lethal-league-blaze/","image":"https://nmac.to/wp-content/uploads/2021/07/Lethal-League-Blaze.png","title":"Lethal League Blaze 1.27 – An intense, high speed ball game","content":"Lethal League Blaze is an intense, high speed ball game, with unique characters, outta sight sounds and none of that weak shit. In Shine City, the anti-gravity ball game has long been illegal. The group who kept playing was dubbed the Lethal League. Even now, with their sport pushed underground, players and crews compete in […]"},{"link":"https://nmac.to/blog/kentucky-route-zero/","image":"https://nmac.to/wp-content/uploads/2016/07/Kentucky.Route_.Zero_.png","title":"Kentucky Route Zero: PC Edition 2.0 – A magical realist adventure game","content":"Kentucky Route Zero is a magical realist adventure game about a secret highway in the caves beneath Kentucky, and the mysterious folks who travel it.   Developed by Cardboard Computer (Jake Elliott and Tamas Kemenczy), the game features an original score by Ben Babbitt, along with a suite of old hymns and bluegrass standards recorded […]"},{"link":"https://nmac.to/blog/crusader-kings-iii/","image":"https://nmac.to/wp-content/uploads/2020/09/Crusader-Kings-III.png","title":"Crusader Kings III 1.4.4 – Medieval Strategy & Historical Game","content":"Crusader Kings III is the heir to a long legacy of historical grand strategy experiences and arrives with a host of new ways to ensure the success of your royal house.   History Choose a royal or noble house from a number of realms on a map that stretches from Iceland to India, from the […]"},{"link":"https://nmac.to/blog/man-o-war-corsair/","image":"https://nmac.to/wp-content/uploads/2017/12/Man-O-War-Corsair.png","title":"Man O’ War: Corsair 1.4.2 – Warhammer Naval Battles","content":"Engage in epic naval combat and explore the oceans of the Warhammer world. Man O’ War: Corsair is a video game of high adventure, naval combat and exploration based on the Games Workshop classic Man O’ War table top game.   Your Quest Sail the seas plundering enemy ships, visiting ports, and trading. Dominate everything […]"},{"link":"https://nmac.to/blog/the-dwarves/","image":"https://nmac.to/wp-content/uploads/2017/01/The-Dwarves.png","title":"The Dwarves 1.2.1 – Tactically challenging with real-time battles game","content":"The Dwarves is a fantasy role-playing game with a strong story and tactically challenging real-time battles. 15 playable heroes, each with individual skills, are to be deployed cleverly. Take on superior numbers of orcs, ogres, älfs, bögnilim, zombies, dark mages and many more foes, to give them the low-down.   Based on the bestselling novel […]"},{"link":"https://nmac.to/blog/the-raven-remastered/","image":"https://nmac.to/wp-content/uploads/2021/07/The-Raven-Remastered.png","title":"The Raven Remastered 1.1.0.654 – Point & Click Adventure Game","content":"The Raven Remastered is a full graphical remaster of the classic whodunit adventure that lets you explore a thrilling crime story through the eyes of multiple characters.   London, 1964. An ancient ruby is stolen from the British Museum. At the crime scene: a raven feather. Is somebody trying to follow in the footsteps of […]"},{"link":"https://nmac.to/blog/phonerescue-for-android/","image":"https://nmac.to/wp-content/uploads/2018/02/PhoneRescue-for-Android.png","title":"PhoneRescue for Android 3.8.0 – Recover data from Android devices","content":"PhoneRescue for Android, covering literally all Android devices from Samsung, Huawei, LG, Google, or any manufacturer in the market, can save you from any data disaster from the very first moment. It adopts customized technologies based on each specific phone and tablet, making sure you get back your lost data and files with the highest […]"},{"link":"https://nmac.to/blog/easeus-todo-backup/","image":"https://nmac.to/wp-content/uploads/2021/02/EaseUS-Todo-Backup.png","title":"EaseUS Todo Backup 3.6.4 – Augments Time Machine with extra features","content":"EaseUS Todo Backup augments Time Machine with extra features. You can create bootable backups, encrypted backups, compress your backup archives, and back up mounted & network disks. Conduct full, differential, or incremental backups. Set up customizable backup schedules to automate the process just as you need. Secure archived backups with AES-168, AES-256, Blowfish, or Triple […]"},{"link":"https://nmac.to/blog/simon/","image":"https://nmac.to/wp-content/uploads/2018/10/Simon_5.png","title":"Simon 5.0.1 – Monitor changes and crashes with Web sites and servers","content":"Simon monitors websites and alerts you of crashes and changes.   Select pages to monitor, choose your alert options, and customize your settings. Simon does the rest.   Keep a watchful eye on your favorite sites Monitor any site. Want to receive an alert when a favorite blog has been updated? Or monitor activity on […]"},{"link":"https://nmac.to/blog/exposure-x6/","image":"https://nmac.to/wp-content/uploads/2020/10/Exposure-X6.png","title":"Exposure X6 Bundle 6.0.8.210 – The fastest way to bring your vision to life","content":"Exposure is the award-winning RAW photo editor and organizer that enables you to create beautiful images and master your workflow.   For over a decade, Exposure has helped photographers bring their images to life with unmatched creative tools. Exposure also offers powerful organizing tools, fast performance, an intuitive layout, and a subscription-free approach. It’s the […]"}]