[{"link":"https://nmac.to/blog/totem/","image":"https://nmac.to/wp-content/uploads/2020/10/Totem.png","title":"Totem 1.06 – Atmospheric alien puzzle game","content":"Something strange has appeared on earth – multiple gigantic beings with unique languages… and you’re the only one who can deter them. You are the translator   A unique experience in which you are tasked with translating and conversing with unidentified entities. Your goal is to make them leave, while using their unique languages.   […]"},{"link":"https://nmac.to/blog/inside/","image":"https://nmac.to/wp-content/uploads/2020/10/INSIDE.png","title":"INSIDE 1.0 – Story Rich 2D Adventure & Puzzle Game","content":"Hunted and alone, a boy finds himself drawn into the center of a dark project.   Try Playdead’s award-winning indie adventure game. INSIDE is a dark, narrative-driven platformer combining intense action with challenging puzzles. It has been critically acclaimed for its moody art style, ambient soundtrack and unsettling atmosphere.   Version 1.0: Initial release   […]"},{"link":"https://nmac.to/blog/handy-note/","image":"https://nmac.to/wp-content/uploads/2017/06/Handy-Note.png","title":"Handy Note 1.1.1 – Sticky Notes for Mac","content":"Handy Note is a finely crafted sticky note app that allows you to quickly jot down important information and keep it easily visible on your screen.   Search with Hashtags Writing sticky notes is addictive, but even if you have several dozen notes, it’s still easy to find what you’re looking for with Handy Note’s […]"},{"link":"https://nmac.to/blog/dying-light/","image":"https://nmac.to/wp-content/uploads/2018/02/Dying-Light.png","title":"Dying Light 1.31.0 – A first-person, action survival game","content":"Dying Light is a first-person, action survival game set in a vast open world. Roam a city devastated by a mysterious epidemic, scavenging for supplies and crafting weapons to help defeat the hordes of flesh-hungry enemies the plague has created. At night, beware the Infected as they grow in strength and even more lethal nocturnal […]"},{"link":"https://nmac.to/blog/total-war-saga-troy/","image":"https://nmac.to/wp-content/uploads/2020/10/Total-War-Saga-TROY.png","title":"Total War Saga: TROY 279458 – Historical Strategy & Simulation Game","content":"In this legendary age, heroes walk the earth. Yet it takes only a single impulsive act to spark a conflict that will shake the world. Audacious Paris, prince of Troy, takes beautiful Helen from her palace in Sparta. As they sail away, Helen’s husband, king Menelaus, curses her name. He will bring his errant wife […]"},{"link":"https://nmac.to/blog/hades/","image":"https://nmac.to/wp-content/uploads/2020/09/Hades.png","title":"Hades 1.36232 – Action, Indie & RPG Game","content":"Hades is a god-like rogue-like dungeon crawler that combines the best aspects of Supergiant’s critically acclaimed titles, including the fast-paced action of Bastion, the rich atmosphere and depth of Transistor, and the character-driven storytelling of Pyre.   BATTLE OUT OF HELL As the immortal Prince of the Underworld, you’ll wield the powers and mythic weapons […]"},{"link":"https://nmac.to/blog/adware-zap/","image":"https://nmac.to/wp-content/uploads/2020/08/Adware-Zap2.png","title":"Adware Zap 2.8.3 – Clean browser cookies, caches and more","content":"Adware Zap & Privacy Cleaner restores your browser back to its full health by removing unwanted extensions, cookies, caches and resetting your browser preferences. Adware Zap is your choice if: Browser displays constant pop-up advertisements about dubious products and scams even from respected websites Your browser is being hijacked and redirected to dubious websites Your […]"},{"link":"https://nmac.to/blog/roki/","image":"https://nmac.to/wp-content/uploads/2020/10/Roki.png","title":"Röki 3.2 – Point & Click Adventure Game","content":"Get ready for over a dozen hours of adventure through a magical world inspired by Scandinavian folklore.   Every dark fairytale has its monster. Röki is an adventure game inspired by Scandinavian folklore – a dark contemporary fairy tale underpinned by a touching narrative, an alluring art style, ancient puzzles and atmospheric exploration.   Join […]"},{"link":"https://nmac.to/blog/ccleaner/","image":"https://nmac.to/wp-content/uploads/2016/09/CCleaner1.png","title":"CCleaner Pro 1.18.30 – System maintenance application","content":"CCleaner is a system optimization, privacy and cleaning tool. It removes unused files from your system – allowing your Mac to run faster and freeing up valuable hard disk space. It also cleans traces of your online activities such as your Internet history.   Version 1.18.30: General: Added support for macOS Catalina and Big Sur […]"},{"link":"https://nmac.to/blog/desperados-iii/","image":"https://nmac.to/wp-content/uploads/2020/10/Desperados-III.png","title":"Desperados III 1.4.10 – A hardcore tactical stealth game","content":"Desperados III is a story-driven, hardcore tactical stealth game, set in a ruthless Wild West scenario.   In this long-awaited prequel to the beloved classic Desperados: Wanted Dead or Alive, John Cooper will join forces with the runaway bride Kate, the shady hitman Doc McCoy, the giant trapper Hector, and Isabelle, a mysterious lady from […]"}]