[{"link":"https://nmac.to/blog/pixelpumper-v1-0/","image":"https://nmac.to/wp-content/uploads/2013/12/Icon.175x175-757.png","title":"PixelPumper v1.0 – Blog from your desktop","content":"With PixelPumper, you can now create, edit and publish your blog posts directly from OS X in a beautiful retina display interface. It doesn’t matter if you host your blog on WordPress.com or self-host, PixelPumper allows you to post to either. Features: Manage multiple blogs simultaneously Compose posts offline Publish with retina quality images Style […]"},{"link":"https://nmac.to/blog/iteleport-v6-1-0/","image":"https://nmac.to/wp-content/uploads/2013/12/iTeleport.175x175-75.png","title":"iTeleport 6.1.0 – Access your Mac from anywhere in the world","content":"iTeleport is a magical app that lets you access your computer from anywhere in the world. Supports Mac, Windows, Linux and all VNC servers. See your computer screen and control its keyboard/mouse from wherever: a few feet away, or halfway around the world.   Teleport yourself to your computer from anywhere in the world. iTeleport gives […]"},{"link":"https://nmac.to/blog/echo-v1-2/","image":"https://nmac.to/wp-content/uploads/2013/12/icon.175x175-7522.png","title":"Echo v1.2 – Powerful HTTP(S) service test tool","content":"Echo is a powerful HTTP(S) service test tool and a must have for developers of all kinds. Save valuable time with debugging by sending customised requests to your web server and review the response in multiple formats. Features:• Different request methods: GET, POST, PUT, DELETE, TRACE, OPTIONS, HEAD and CONNECT.• Add authentication, HTTP versions and user-agents […]"},{"link":"https://nmac.to/blog/translateq-v1-1/","image":"https://nmac.to/wp-content/uploads/2013/12/icons.175x175-756.png","title":"TranslateQ v1.1 – Online translator (Services:Google,Yandex)","content":"Select the text.Use keybindings ctrl+alt (or right alt)for translate.   Supported languages(Google): English, German, Chinese(Simplified), Chinese(Traditional), Spanish, Japanese, Russian, French, Portuguese, Arabic, Korean, Basque, Catalan, Czech, Danish, Dutch, Esperanto, Estonian, Finnish, Galician, Georgian, Greek, Haitian, Creole, Hebrew, Hungarian, Icelandic, Indonesian, Irish, Italian, Latvian, Lithuanian, Macedonian, Malay, Norwegian, Polish, Romanian, Slovak, Slovenian, Swahili, Swedish, Thai, Turk..."},{"link":"https://nmac.to/blog/due-v1-2-3/","image":"https://nmac.to/wp-content/uploads/2013/12/DueOSXIcon.175x175-75.png","title":"Due 1.2.3 – Set reminders in your own words","content":"Due lets you type “Make dinner reservation at 9am tomorrow” and your reminder is set for 9 AM tomorrow. “Cancel subscription in 1 month” and you get a buzz a month later. Just tell Due in your own words what you’d like to do, and when you’d like to be reminded.There are no awkward date pickers to […]"},{"link":"https://nmac.to/blog/my-window-v1-0/","image":"https://nmac.to/wp-content/uploads/2013/12/icon.175x175-7523.png","title":"My Window v1.0 – Actively display animated weather on top of your own images","content":"Personalize your weather with My Window. Simply take a picture of what you see looking out of your window and the animation of the real weather will appear on top of your image. You will feel at ease seeing your weather in real time matching what you see looking out of your own window. If your […]"},{"link":"https://nmac.to/blog/live-wallpaper-v2-3/","image":"https://nmac.to/wp-content/uploads/2013/12/43464.png","title":"Live Wallpaper v2.3 – Wallpapers with live clock and weather forecasts","content":"Live Wallpaper is a beautiful wallpaper application with live clock and weather forecast. It provides a variety of themes which has different layouts and unique styles. Currently, we have 12 themes and we are adding themes continuously (All themes are free). Each theme has the unique layout, clock, text, and weather forecast. The application provides a […]"},{"link":"https://nmac.to/blog/flashfrozen-v1-3-2/","image":"https://nmac.to/wp-content/uploads/2013/12/flashfrozen.175x175-751.png","title":"FlashFrozen v1.3.2 – Menu item kills Flash plug-in in popular browsers","content":"FlashFrozen is a menu item that allows you to quit the Flash plug-in in a browser if a Flash animation is hogged your Mac’s CPU cycles or freezing the loading of Web pages. WHAT’S NEW Version 1.3.2: Newer Chrome (24+) and Chromium-based browsers (Chromium, Chrome Canary, etc) are now properly detected.   REQUIREMENTS Intel, Mac […]"},{"link":"https://nmac.to/blog/tunesart-v1-6/","image":"https://nmac.to/wp-content/uploads/2013/12/TunesArt.175x175-75.png","title":"TunesArt v1.6 – Display iTunes track info and cover art on your desktop","content":"TunesArt offers new features for iTunes : display cover art and track information on your desktop (many themes available), get notification on track change, display bezel notifications, search your iTunes Library, scrobble to Last.fm, post to Twitter, edit Tags, display/edit lyrics, support for Growl notifications, artwork fetching from Amazon… and more Available in English, French, […]"},{"link":"https://nmac.to/blog/applicons-v1-2/","image":"https://nmac.to/wp-content/uploads/2013/12/Applicons.175x175-75.png","title":"Applicons v1.2 – Generate all the icons for OS X and iOS","content":"Applicons is an utility that allow you generate all the icons/iconset needed for OS X and iOS development (Mac, iPhone and iPad). You can choose whether to apply the effects “rounded corners” or “reflected shine” to the icon. The name of all the icons (iPhone, iPad) and the iconset (Mac) is changeable.Choose to create the […]"}]