[{"link":"https://nmac.to/blog/ummy-video-downloader/","image":"https://nmac.to/wp-content/uploads/2016/11/Ummy-Video-Downloader.png","title":"Ummy Video Downloader 1.72 – The simplest YouTube downloader for Mac","content":"While there are a lot of applications or web services that can help you download videos from YouTube, many have trouble extracting high-definition clips over 720p in resolution.   Ummy Video Downloader does not suffer from this limitation, as it allows you to save any YouTube clip on your Mac of resolutions up to 4320p, […]"},{"link":"https://nmac.to/blog/polyball/","image":"https://nmac.to/wp-content/uploads/2017/12/polyball.png","title":"Polyball 1.0.6 – Get ready to enter a new era of physics platforming","content":"Polyball is a modern take on classic ball rolling games such as Super Monkey Ball, Marble Madness, and Marble Blast – while taking cues from games such as the Sonic series, Trackmania, and Mario Kart.   A BIT ABOUT POLYBALL There’s a lot to do in Polyball — Challenge yourself or a friend to one […]"},{"link":"https://nmac.to/blog/easy-duplicate-photo-finder/","image":"https://nmac.to/wp-content/uploads/2019/04/Easy-Duplicate-Photo-Finder.png","title":"Easy Duplicate Photo Finder 1.8.0 – Search duplicate photo, Photos library and external drives","content":"Easy Duplicate Photo Finder searches duplicate photo in your Mac, Photos library and external drives. With it, you can free up tons of disk space. Especially, Photos library is different from the picture folder, which is the dataset of the picture. The Easy Duplicate Photo Finder takes a new approach to finding and purging the […]"},{"link":"https://nmac.to/blog/cisdem-datarecovery/","image":"https://nmac.to/wp-content/uploads/2016/02/DataRecovery.png","title":"Cisdem DataRecovery 6.4.0 – Recover lost, deleted, formatted, or inaccessible files","content":"Cisdem Data Recovery can help you to recover valuable lost data, documents, emails, videos, music, photos, and lost partitions from any Mac-supported data storage medium, including internal/external hard drives, USB drives, SD card, optical media, memory cards, digital cameras, iPods, etc. It’s amazingly fast, accurate, and a breeze to use. Download now and get back […]"},{"link":"https://nmac.to/blog/time-fix/","image":"https://nmac.to/wp-content/uploads/2020/06/Time-Fix.png","title":"Time Fix 2.0.4 – Fix time stamps in exif data","content":"It may well happen that the time in your camera was not set correctly or that you forgot to set the correct time zone on your last trip. At some point it is no longer clear, when the pictures were shot. If the pictures were shot with several cameras and you wish to combine all […]"},{"link":"https://nmac.to/blog/timer-utility-5/","image":"https://nmac.to/wp-content/uploads/2019/08/Timer-Utility-5.png","title":"Timer Utility 5 1.0.1 – Timing Utility","content":"Timer Utility is an all-in-one timing tool that brings alarms, timers, and stopwatches to your Mac. We take it one mega step further with actions to create powerful workflows customized to your liking.   Features: Alarms – Set a time, choose which day or days of the week, and you’re all set. Create as many […]"},{"link":"https://nmac.to/blog/smart-gps-sync/","image":"https://nmac.to/wp-content/uploads/2020/06/Smart-GPS-Sync.png","title":"Smart GPS Sync 2.0.8 – Transfer geodata from one image to a batch of images","content":"If you take just one single photo containing GPS data with your smartphone you can use “Smart GPS Sync” to transfer that GPS information to all other photos in your camera at a later point in time. If you have no photo with the right GPS data at hand you can also just copy longitude […]"},{"link":"https://nmac.to/blog/fileloupe/","image":"https://nmac.to/wp-content/uploads/2016/08/Fileloupe1.png","title":"Fileloupe 1.7.3 – Browse photos, watch videos, view PDFs and preview documents on your Mac","content":"Unlike existing solutions, Fileloupe does not require a lengthy import process, does not use a master library and never moves or copies your files in any way. With Fileloupe’s broad support for different types of files, you no longer have to open multiple windows or multiple applications to quickly view the contents of a folder. […]"},{"link":"https://nmac.to/blog/cyber-ops/","image":"https://nmac.to/wp-content/uploads/2020/06/Cyber-Ops.png","title":"Cyber Ops 1.015 – Hacking Strategy & Simulation Game","content":"Cyber Ops is a story-based tactical hacking game, told from the point of view of a mission control supervisor, operating from the distance.    You are the eye in the sky, the invisible hand, the cyber ghost, looking after your team over the net.   Cyber Ops is an innovative take on the stealth / […]"},{"link":"https://nmac.to/blog/remote-desktop-manager/","image":"https://nmac.to/wp-content/uploads/2016/12/Remote-Desktop-Manager4.png","title":"Remote Desktop Manager 2020.2.0.0 – All-in-one management platform for IT teams","content":"Remote Desktop Manager lets you centralize all your remote connections, passwords and credentials into a unique platform that people love to work with.   Drive security, speed and productivity through your organization while reducing risks for your IT department.   Join over 200,000 users in more than 99 countries who enjoy Remote Desktop Manager.   New […]"}]