[{"link":"https://nmac.to/blog/visio-viewer-3-1-0/","image":"https://nmac.to/wp-content/uploads/2016/10/Visio-Viewer.png","title":"Visio Viewer 3.1.0 – A fast Visio file viewer for Mac","content":"Enolsoft Visio Viewer is a fast Visio file viewer for Mac users to easily open and read Microsoft Visio files, as well as convert the Visio drawing documents to PDF file or print out.   Highlight: Open and view any .vsd & .vsdx files quickly and easily on Mac. Support opening and viewing Visio files […]"},{"link":"https://nmac.to/blog/photo-batcher-1-2-4/","image":"https://nmac.to/wp-content/uploads/2016/10/Photo-Batcher.png","title":"Photo Batcher 1.2.4 – Easy-to-use batch photo utility","content":"Photo Batcher is an easy-to-use photo batch utility that makes it easy to convert, resize, rotate, color adjust, apply effects, add watermark, and rename tons of photos in a single operation. It supports all popular formats: JPEG, JPEG2000, PNG, TIFF, TGA, GIF, BMP, PICT, PSD, PDF, etc.   Version 1.2.4: Fixed some issues when running […]"},{"link":"https://nmac.to/blog/ifoto-hdr-2-4-1097/","image":"https://nmac.to/wp-content/uploads/2016/09/iFoto-HDR.png","title":"iFoto HDR 2.4.1097 – Make HDR Photo Effects with Ease","content":"HDR should be a tricky subject to master for photographers. When you merge the images with different exposure to HDR photographs, how to ensure a creative and natural look? iFoto HDR should be the best answer for you to merge HDR photos. It is a super easy HDR program to make awesome results.   When […]"},{"link":"https://nmac.to/blog/video-editor-enhancer-1-0-31/","image":"https://nmac.to/wp-content/uploads/2016/08/Video.Editor.Enhancer.png","title":"Video Editor Enhancer 1.0.31 – Video editing/video quality enhancer","content":"Video Editor Enhancer does everything to supply you a visual feast by improving video quality better and better. It is the best video editing software to edit your video, enhance the video quality and the viewing experience. It is capable of increasing video resolution, automatically adjusting video brightness and contrast ratio, and removing video noise. […]"},{"link":"https://nmac.to/blog/calcpad-1-2/","image":"https://nmac.to/wp-content/uploads/2016/10/CalcPad.png","title":"CalcPad 1.2 – Notepad and Calculator Reinvented","content":"CalcPad is a note taking app with powerful calculator built in. It can perform basic calculations as well as complex unit conversions, real time currency conversions and percentages. It can even handle variables and custom functions if you need them.   With a handy menubar icon, global access shortcut and window options, it will be […]"},{"link":"https://nmac.to/blog/caret-1-8/","image":"https://nmac.to/wp-content/uploads/2016/10/Caret1.png","title":"Caret 1.8 – Markdown Editor for Mac","content":"Caret is a Markdown editor with a beautifully simple interface that focuses on usability while still providing advanced features for power users.   FEATURES Code highlighting for fenced code blocks. Auto-completion of repetitive formatting tasks. Context Commands: Hit + Space to see context commands or spelling suggestions. Preview: Hit + P to see a preview […]"},{"link":"https://nmac.to/blog/any-video-cutter-1-0-4/","image":"https://nmac.to/wp-content/uploads/2016/10/Any-Video-Cutter.png","title":"Any Video Cutter 1.0.4 – Easy and simple video cutter app","content":"Like to grab a portion of a video?   Just 3 Steps. 1. Open any video, 2. Specify the portion using a simple Range Chooser, 3. Save. That’s it!   No Encoding. So Lossless. Blazing fast. You don’t even need a Preview. Easily specify the Start time & End time using a Range Chooser. Supports […]"},{"link":"https://nmac.to/blog/templates-for-numbers-4-6-1/","image":"https://nmac.to/wp-content/uploads/2016/10/Templates-for-Numbers.png","title":"Templates for Numbers 4.6.1 – Spreadsheet templates for Apple Numbers","content":"Templates for Numbers is a high-quality collection of diverse and useful templates for Apple’s Numbers. Use them for your business or personal needs. Handle your day-to-day assignments a lot easier. Customize the templates to your requirements: create tables, make calculations, draw diagrams, insert images, thus tackling your job efficiently and effortlessly.   Version 4.6.1: Improved […]"},{"link":"https://nmac.to/blog/ifoto-denoise-2-2/","image":"https://nmac.to/wp-content/uploads/2016/10/iFoto-Denoise.png","title":"iFoto Denoise 2.2 – Photo/Image Noise Reduction","content":"Since noisy images are inevitable, what should you do to reduce noise for cameras or iPhone? Especially when you shooting in Lowlight environment or moving stuff. iFoto Denoise is the best Noise reduction software to minimize image grain and other imperfections.   iFoto Denoise is not only a noiseware for landscapes, but also photo beautifier […]"},{"link":"https://nmac.to/blog/goodtimes-1-3-3/","image":"https://nmac.to/wp-content/uploads/2015/02/GoodTimes.png","title":"GoodTimes 1.3.3 – Collage-making app","content":"GoodTimes is a worldwide unique collage solution for all occasions. With other apps a collage is just a collection of pictures, with GoodTimes your photos get a full environment, so the situation can impress even before you look at the first photo. It’s also not just a theme based, app, it brings all the objects, […]"}]