[{"link":"https://nmac.to/blog/elements-2-3-1/","image":"https://nmac.to/wp-content/uploads/2016/08/Elements.png","title":"Elements 2.3.1 – Periodic table of elements","content":"Elements is a cool and searchable periodic table of elements with lots of useful information. Passing over an element on the table gives you instant access to general information. Clicking on an element gives you full information, such as crystal structure, physical properties, electron configuration with graphical diagram, and known isotopes.   Elements also contains […]"},{"link":"https://nmac.to/blog/themes-for-keynote-4-5/","image":"https://nmac.to/wp-content/uploads/2016/08/Themes-for-Keynote.png","title":"Themes for Keynote 4.5 – Professional themes for Apple Keynote","content":"Themes for Keynote lets you start a new presentation and focus on the content – the design is already there.   Themes for Keynote consists of high-quality designs for Keynote presentations. These are more than just beautiful backgrounds – each one of them includes up to 20 different master slides, which lets you choose the […]"},{"link":"https://nmac.to/blog/skullgirls-2nd-encore-1-0/","image":"https://nmac.to/wp-content/uploads/2015/11/Skullgirls.png","title":"Skullgirls 2nd Encore 1.0 – Fast-paced 2-D fighting game","content":"Hear Skullgirls‘ story as never before, try your hand at all new trials and challenges, and see how long you can last in Survival! Also unlocks all five additional characters: sing zombie opera with Squigly, and make beautiful music with Big Band! Unleash Eliza’s skeletal Parasite, and howl at the moon with Beowulf! And, finally, […]"},{"link":"https://nmac.to/blog/photo-denoise-movavi-1-0/","image":"https://nmac.to/wp-content/uploads/2016/08/Photo-DeNoise-Movavi.png","title":"Photo DeNoise Movavi 1.0 – Reduce Noise & Get Clear Photos","content":"Photo DeNoise Movavi is the ideal software for reducing visual noise in photos shot under inadequate lighting conditions.   Say goodbye to grainy pictures – just one click will make them incredibly crisp and clean. Apply one of the default filters to instantly denoise the image with different degrees of intensity, removing the existing imperfections. […]"},{"link":"https://nmac.to/blog/desktop-ghost-pro-1-5-1/","image":"https://nmac.to/wp-content/uploads/2016/02/Desktop.Ghost_.png","title":"Desktop Ghost Pro 1.5.1 – Instantly hide and show desktop icons","content":"Desktop Ghost Pro instantly hides or shows all files, folders, and app icons on your messy desktop. You don’t need to move all the files on your desktop to take a screen recording or a screenshot anymore! Temporarily hide your messy desktop with Desktop Ghost and unhide it when you’re ready!   Features Instantly hide […]"},{"link":"https://nmac.to/blog/appgenome-1-4/","image":"https://nmac.to/wp-content/uploads/2016/06/AppGenome.png","title":"AppGenome 1.4 – Create your own URL-based apps","content":"AppGenome lets you set your own URL, browser agent type (mobile or desktop), and create your own desktop app that will stay in your menubar, so you can forget about all those “app for” apps.   Features Set your own URL of any web page or web app Manually set your agent type (browser type): […]"},{"link":"https://nmac.to/blog/zombie-city-defense-2/","image":"https://nmac.to/wp-content/uploads/2016/08/Zombie-City-Defense-2.png","title":"Zombie City Defense 2 1.0 – A tactical/strategy defense game","content":"In a near future, the world has been devastated by a virus turning humanity into zombies. You are Iron Corps, the last defense of civilization traveling the world to find resources, help people and find answers.   Prepare your army before infiltrating a new area – choose carefully your set of infantry units, vehicles and […]"},{"link":"https://nmac.to/blog/split-lab-1-5/","image":"https://nmac.to/wp-content/uploads/2016/07/Split-Lab.png","title":"Split Lab 1.5 – A professional image splitting tool","content":"Split Lab is a professional image splitting tool. It creates pieces from PNG, TIFF and JPG images at any size and resolution.   Split Lab is for all creatives, artists and designers, who need to create high quality splits from artwork for print, digital or for experimenting with content formats.   Split Lab comes with […]"},{"link":"https://nmac.to/blog/roadmap-planner-1-9/","image":"https://nmac.to/wp-content/uploads/2016/05/Roadmap.Planner1.png","title":"Roadmap Planner 1.9 – Strategic Planner, Product Ideas Accounting","content":"Roadmap Planner is your strategic communication tool to build your marketing, business development and product vision roadmap, and show off it to your team and stakeholders at a glance. It will take you where you want to be in one, five, or 10 years.   In our busy environment, every minute counts. You can continue […]"},{"link":"https://nmac.to/blog/pdf-paper-renamer-1-53/","image":"https://nmac.to/wp-content/uploads/2016/08/PDF-Paper-Renamer.png","title":"PDF Paper Renamer 1.53 – Easy batch documents renamer","content":"Batch rename pdf documents quickly. PDF Paper Renamer automatically rename filenames by obtaining the correct titles from metadata or from PDF contents. Variety of different options can be applied to rename the files.   Usually scientific papers or academic papers downloaded from internet have bogus name. It would be difficult to manage without expensive management […]"}]