[{"link":"https://nmac.to/blog/livequartz-2-4-4/","image":"https://nmac.to/wp-content/uploads/2014/05/lq.png","title":"LiveQuartz 2.4.4 – Simple image editor","content":"LiveQuartz is a simple and powerful photo editor for the Mac. It is based on non-destructive layers and filters. The layers are at the left and the filters are at the right of the window.   To edit a photo, just drag it into the window (or layers list) and it will be added as […]"},{"link":"https://nmac.to/blog/earth-3d-3-2-0/","image":"https://nmac.to/wp-content/uploads/2014/09/Earth-3D.png","title":"Earth 3D 3.2.0 – Turn your monitor into a realistic Space Shuttle window","content":"Earth 3D turns your monitor into a realistic space shuttle window! Our planet looks exactly as it’s seen by astronauts. You see the blackness of outer space with sparks of stars on it. You are flying around the Earth, a colorful ball with a veil of atmosphere.   Features: explore our planet with Interactive mode […]"},{"link":"https://nmac.to/blog/clear-day-3-0-0/","image":"https://nmac.to/wp-content/uploads/2015/02/Clear-Day.png","title":"Clear Day 3.0.0 – Weather forecasts with alerts for U.S. and Europe","content":"Clear Day (was Weather HD), the iPhone and iPad’s top-selling weather application, brings the stunning beauty and design of Weather HD tailored and specifically designed for OS X.   Features: Weather forecasts in more than 150,000 locations around the world. Stunning high-definition animations that depicts the weather conditions. Severe Alerts in the U.S. and Europe. […]"},{"link":"https://nmac.to/blog/total-war-attila/","image":"https://nmac.to/wp-content/uploads/2015/02/Total.War_.ATTILA.png","title":"Total War : ATTILA 1.0 – Turn-based strategy game with real-time tactics","content":"    Against a darkening background of famine, disease and war, a new power is rising in the great steppes of the East. With a million horsemen at his back, the ultimate warrior king approaches, and his sights are set on Rome…   The next instalment in the multi award-winning PC series that combines turn-based […]"},{"link":"https://nmac.to/blog/moneywiz-2-0-3/","image":"https://nmac.to/wp-content/uploads/2015/02/MoneyWiz2.png","title":"MoneyWiz 2.0.3 – Personal finance solution","content":"All your accounts, budgets and bills in one place! With powerful reports, worldwide online banking and instant sync between all your devices!   That’s MoneyWiz – the world’s most powerful and beautiful finance software.   HOW CAN MONEYWIZ HELP YOU? GET OUT OF DEBT : We’ve built MoneyWiz in a way that makes it easy […]"},{"link":"https://nmac.to/blog/designs-for-mail-3-1/","image":"https://nmac.to/wp-content/uploads/2014/11/Designs-for-Mail2.png","title":"Designs for Mail 3.1 – 100+ beautiful templates for Apple’s Mail","content":"Designs for Mail brings you a diverse collection of templates for creating customized email messages in Apple Mail.    Choose a lively seasonal template for a family newsletter. Or select a sharp, sophisticated design for a business proposal. Designs for Mail’s selection is constantly expanding, so you’ll always have access to the latest templates.   […]"},{"link":"https://nmac.to/blog/dreadout-1-0/","image":"https://nmac.to/wp-content/uploads/2015/02/DreadOut.png","title":"DreadOut 1.0 – Third person supernatural horror game","content":"DreadOut is a third person supernatural horror game where you play as Linda, a high school student trapped in an old abandoned town. Equipped with her trusty smart-phone, she will battle against terrifying encounters and solve mysterious puzzles which will ultimately determine her fate.   Help her overcome the challenges that will stand before her. […]"},{"link":"https://nmac.to/blog/supreme-league-of-patriots-e1-e2-e3/","image":"https://nmac.to/wp-content/uploads/2015/02/Supreme-League-of-Patriots.png","title":"Supreme League of Patriots E1 E2 E3 – Superhero comedy adventure game","content":"Don your cape and mask and join the Supreme League of Patriots in this hilarious and irreverent superhero comedy adventure!   Poking fun at pop culture, politics, reality TV and more, join Kyle Keever in his politically incorrect quest to win a spot on the newest hit reality TV show, America’s Got Superpowers. But when […]"},{"link":"https://nmac.to/blog/simbooster-pro-1-5-0/","image":"https://nmac.to/wp-content/uploads/2015/01/SimBooster.png","title":"SimBooster Pro 1.5.0 – System optimizing utility","content":"SimBooster Pro is an all-in-one package that includes a variety of system tools to help you clean and protect your Mac. For slow Macs, SimBooster can release RAM to increase the processing speed. It can also help users protect their personal data from malicious cookies. Users who suffer from small hard drive space, SimBooster can […]"},{"link":"https://nmac.to/blog/erato-1-4-3/","image":"https://nmac.to/wp-content/uploads/2015/02/Erato.png","title":"Erato 1.4.3 – Markdown text editor","content":"Erato is a gorgeous Markdown composer with live preview. It offers full support for regular Markdown syntax, GitHub flavored markdown, YAML front matter and parts of the MultiMarkdown specification.   Smart composer: Syntax highlighted Markdown Autocompletion for lists, task lists and block quotes Automatic indentation for code blocks   GitHub flavored Markdown: Fenced code blocks […]"}]