[{"link":"https://nmac.to/blog/isplash-color-photo-editor-32/","image":"https://nmac.to/wp-content/uploads/2013/12/iSplash.175x175-75.jpg","title":"iSplash Color Photo Editor 3.2 – Photo editor for adding focused color to grayscale images","content":"iSplash Pro allows you to convert a photo to grayscale, then colorize one object. Get creative with the iSplash app! Choose any image and iSplash will turn it to grayscale. Then, choose any part of the image to restore the original color. iSplash allows you to beautifully modify your pictures and create bold images that […]"},{"link":"https://nmac.to/blog/moving-dock-110/","image":"https://nmac.to/wp-content/uploads/2013/12/Icon.175x175-757.jpg","title":"Moving Dock 1.1.0 – Most intuitively quickly moving dock","content":"By using Moving Dock, the dock can be moved most intuitively quickly most ever. Don’t need worry about the position of the dock. To change the position, time is never spent.   While Moving Dock runs, the dock automatically moves to the place where the mouse exist when the mouse moves to screen left, bottom, […]"},{"link":"https://nmac.to/blog/mornings-20/","image":"https://nmac.to/wp-content/uploads/2013/12/icon.175x175-7527.jpg","title":"Mornings 2.0 – Alarm clock app with iTunes support","content":"Mornings is a beautiful alarm clock app for your Mac. Wake up to your own music and snooze using your Apple remote. Features in detail: Many original sounds: cow moo, several ringers, “System Activated” voice, a buzzer, a rooster (perfect for mornings, and more!) Import your own sounds! If you have MP3 or WAV files […]"},{"link":"https://nmac.to/blog/menutab-pro-for-facebook-59/","image":"https://nmac.to/wp-content/uploads/2013/12/APPL-PRO.175x175-75.jpg","title":"MenuTab Pro for Facebook 5.9 – Provides real-time Facebook access from your menu bar","content":"MenuTab Pro for Facebook is an incredibly slick and gorgeous app for quickly accessing your Facebook account directly from your Mac’s menu bar. It is one of the most popular and actively used apps on the entire Mac App Store, with over 2 million happy users! Why is MenuTab Pro the best app of its […]"},{"link":"https://nmac.to/blog/sharemate-11/","image":"https://nmac.to/wp-content/uploads/2013/12/sharemate.jpg","title":"ShareMate 1.1 – Share local files via Dropbox","content":"ShareMate is a small but very powerful menubar utility that allows you to share the files and folders on your computer with anyone in the world! Simply connect ShareMate to your Dropbox account and you’re all set! Incredibly simple two-click file sharing: 1- Right-click on the file/folder you want to share, or select a few […]"},{"link":"https://nmac.to/blog/witch-392/","image":"https://nmac.to/wp-content/uploads/2013/12/PMWSPreferencePane.175x175-75.jpg","title":"Witch 3.9.2 – Shortcut for switching between windows","content":"Witch makes switching between windows easy. Have you ever wanted to switch to a certain window, not just the application it belongs to? While you can use Exposé to switch windows, doing so can be very clumsy if you’re the keyboard-only type of user. And don’t all of these windows look just the same when […]"},{"link":"https://nmac.to/blog/system-lens-21/","image":"https://nmac.to/wp-content/uploads/2013/12/systemlens.175x175-75.jpg","title":"System Lens 2.1 – Quickly manage resource usage","content":"System Lens is a beautiful way to quickly manage resource usage on your Mac. Heavy resource usage can sometimes cause your Mac to get warmer, slower and sometimes even cause your battery to drain faster. – Easily check your system usage at a glance from the status bar.– See which applications are heavily using resources.– […]"},{"link":"https://nmac.to/blog/mailtab-pro-for-gmail-59/","image":"https://nmac.to/wp-content/uploads/2013/12/APPL-PRO.175x175-751.jpg","title":"MailTab Pro for Gmail 5.9 – Access Gmail from the menu bar","content":"MailTab Pro for Gmail is an incredibly slick and gorgeous app for quickly accessing your Gmail account directly from your Mac’s menu bar.   Why is MailTab Pro the best Mac app for your Gmail needs? Good question, allow us to explain just how fully loaded this app is:   – Instant access to Gmail […]"},{"link":"https://nmac.to/blog/favs-141/","image":"https://nmac.to/wp-content/uploads/2013/12/Icon.175x175-754.png","title":"Favs 1.4.1 – The app for all your Internet favorites","content":"Favs is a favourites manager for all your favourite Web and social media content. After all, if you are using social networks, you are also creating favorites: on Facebook you ‘like’, on Twitter and Google Reader you ‘star’, on Delicious and Pinboard you ‘bookmark’ and so on. Find Favorites: Instead of spreading your favorites across […]"},{"link":"https://nmac.to/blog/cargolifter-11/","image":"https://nmac.to/wp-content/uploads/2013/12/47346.jpg","title":"CargoLifter 1.1 – Automatically uploads email attachments to the cloud","content":"CargoLifter automatically uploads your email’s attachments to the cloud (e.g., Dropbox or YouSendIt) and adds the corresponding links to the end of your email. Thus, the recipient can decide himself when he wants to download the files and more importantly his mailbox does not get filled with attached files. Your colleagues and friends will thank […]"}]