[{"link":"https://nmac.to/blog/motion-weather-4k/","image":"https://nmac.to/wp-content/uploads/2018/09/Motion_Weather_4K_1.png","title":"Motion Weather 4K 1.1.3 – Ultra HD Dynamic Wallpaper and Weather Application","content":"Introducing Motion Weather 4K: The most insanely beautiful and innovative weather application ever conceived. Motion Weather 4K turns your Wallpaper into breathtaking Cinema quality 4K video based on the Weather conditions outside — and is an excellent weather application in it’s own right. Motion Weather 4K also “knows” when it’s day time and night time […]"},{"link":"https://nmac.to/blog/mach-desktop/","image":"https://nmac.to/wp-content/uploads/2019/10/Mach-Desktop_3.png","title":"Mach Desktop 3.0.5 – Use Quartz Compositions, videos, or Web pages as wallpaper","content":"Mach Desktop brings your desktop to life with Quartz Compositions, Quicktime Movies, or Web pages. Mach Desktop also comes built-in with over 20 stunning Quartz Compositions and over 5 beautiful Quicktime movies. You can, of course, choose your own Quartz Composition, Quicktime movie, or Web page to put on the desktop as well. Unlike all […]"},{"link":"https://nmac.to/blog/through-the-darkest-of-times/","image":"https://nmac.to/wp-content/uploads/2020/11/Through.The_.Darkest.Of_.Times_.png","title":"Through The Darkest Of Times 1.04 – Political Strategy & Simulation Game","content":"Dark times mean fear and risks. The risk to be caught by patrolling National Socialists, looking for people who publicly stand against their point of view. The risk of being beaten up or even killed by the German military because we‘re opposing the regime. The risk of losing everything, including our loved ones. This is […]"},{"link":"https://nmac.to/blog/vaporum/","image":"https://nmac.to/wp-content/uploads/2019/02/Vaporum_Lockdown.png","title":"Vaporum Lockdown Patch 4 – A grid-based dungeon crawler RPG game","content":"Vaporum: Lockdown is a prequel to the award-winning steampunk dungeon crawler Vaporum. It is a grid-based, single-player, single-character game, seen from a first-person perspective in an original steampunk setting, and inspired by old-school games like Dungeon Master I and II, the Eye of the Beholder series, and the more recent Legend of Grimrock I and […]"},{"link":"https://nmac.to/blog/7-days-to-die/","image":"https://nmac.to/wp-content/uploads/2020/03/7.Days_.To_.Die_.png","title":"7 Days To Die 19.2 b4 – Open World Survival Zombies Game","content":"With nearly 10 million copies sold, 7 Days to Die has defined the survival genre, with unrivaled crafting and world-building content. Set in a brutally unforgiving post-apocalyptic world overrun by the undead, 7 Days to Die is an open-world game that is a unique combination of first person shooter, survival horror, tower defense, and role-playing […]"},{"link":"https://nmac.to/blog/switchglass/","image":"https://nmac.to/wp-content/uploads/2020/06/SwitchGlass.png","title":"SwitchGlass 1.4.6 – Customizable App Switcher","content":"SwitchGlass adds a dedicated application switcher to your Mac. You can customize its appearance, size, and position on each attached display, including hiding it on selected displays. Use it to bring one or all of an app’s windows to the front, or as a drag-and-drop target to open files.   The following app switcher attributes […]"},{"link":"https://nmac.to/blog/netler/","image":"https://nmac.to/wp-content/uploads/2020/11/Netler.png","title":"Netler 2.0 – A network monitor for your menu bar","content":"Netler is a network monitor for menu bar and Notification Center.   Access your active network interfaces, external ip and country and traffic statistics.   Features Active/inactive network interfaces Local ip and mac-address Gateway ip External ip and country detection Sent/received data and speed   Version 2.0 New icon macOS Big Sur support Universal Binary […]"},{"link":"https://nmac.to/blog/gestimer/","image":"https://nmac.to/wp-content/uploads/2016/01/Gestimer.png","title":"Gestimer 1.2.6 – Create reminders using a unique gesture","content":"Gestimer is a beautiful menu-bar app for those little reminders during the day. Simply drag the Gestimer menu bar icon onto the screen to create your reminder.   Do you constantly check the time while using your Mac because you don’t want to forget to leave the house in 10 minutes, to pick up the […]"},{"link":"https://nmac.to/blog/lingon-x/","image":"https://nmac.to/wp-content/uploads/2017/09/Lingon-X5.png","title":"Lingon X 7.6 – Run applications and scripts automatically","content":"Lingon X is based on the great Lingon 3 and extends it with new features like running jobs as root and at multiple dates. It is now even easier to use yet much more powerful. Version X 7 is a paid upgrade.   Features Start an app, a script or run a command automatically whenever you […]"},{"link":"https://nmac.to/blog/coderunner/","image":"https://nmac.to/wp-content/uploads/2019/11/CodeRunner4.png","title":"CodeRunner 4.0 – Edit and run code in 10 different programming languages","content":"CodeRunner, an advanced, highly flexible, and easy-to-use programming editor, supports a large number of languages, and delivers big IDE features while remaining lightweight and clutter-free.   CodeRunner can run code in 23 languages out-of-the-box, and can be easily extended to run code in any other language. Notable features include debugging with breakpoints in lots of […]"}]