[{"link":"https://nmac.to/blog/the-otherside/","image":"https://nmac.to/wp-content/uploads/2021/01/The-Otherside.png","title":"The Otherside 5.0 – For brave players","content":"The Otherside is a turn based RPG and strategy board game where you will control four survivors who hope to push back the shadowy threat. Make your way through each level solving puzzles, fighting monsters, and destroying the spirit anchors that threaten our dimension.   Do you have what it takes to restore the town […]"},{"link":"https://nmac.to/blog/doomsday-vault/","image":"https://nmac.to/wp-content/uploads/2020/12/Doomsday-Vault.png","title":"Doomsday Vault 1.6 – Rescue Earth’s precious plants","content":"Earth’s climate has collapsed and your mission is to collect the precious remaining plant life and return it to the safety of the Doomsday Vault.   You’re on a lone mission in a post-climate collapse Earth. Adventure around the world in your robotic suit and use your suit’s tools and abilities to explore challenging environments. […]"},{"link":"https://nmac.to/blog/sociable-soccer/","image":"https://nmac.to/wp-content/uploads/2020/12/Sociable_Soccer_2.png","title":"Sociable Soccer 2.5.7 – Fun Soccer Game & Online PvP","content":"For gamers of a certain age there will be fond memories of playing a simple but awesome football game called Sensible Soccer back in the 90s. Fast forward to now and Jon Hare who was the designer behind my favorite game back then has reappeared on the gaming scene with Sociable Soccer.   Playing the […]"},{"link":"https://nmac.to/blog/web-confidential/","image":"https://nmac.to/wp-content/uploads/2014/04/Web_Confidential_.png","title":"Web Confidential 5.3.3 – Professional password manager","content":"Where do you keep your confidential data? Like most people these days, you’ve probably got a growing number of user IDs, passwords, registration keys, credit card numbers, PIN codes, serial numbers, and the like, stored in various places on your computer or scribbled on miscellaneous pieces of paper around your home or office. When you […]"},{"link":"https://nmac.to/blog/osculator/","image":"https://nmac.to/wp-content/uploads/2016/12/OSCulator.png","title":"OSCulator 3.4.3 – Make music and motion with unusual inputs","content":"OSCulator is a software that links your controllers to your music and video software. For example, with OSCulator, your Nintendo Wiimote or iPhone can talk to major MIDI sequencers or your favorite console emulator or even the Kyma sound design workstation.   Version 3.4.3: Fix OSC URL validation when specifying an OSC Target. Fix a […]"},{"link":"https://nmac.to/blog/kings-league-ii/","image":"https://nmac.to/wp-content/uploads/2021/01/Kings-League-II.png","title":"King’s League II 2.0.9 – Recruit, train, battle!","content":"Lead your team to victory! Recruit, train and manage fighters of different classes before entering tactical battles of wit and glory. In this sequel to an award-winning strategy simulation RPG, can you climb the King’s League?   Enter the King’s League and prepare yourself for battle! King’s League II is the sequel to the award-winning […]"},{"link":"https://nmac.to/blog/tint/","image":"https://nmac.to/wp-content/uploads/2020/11/tint_3.png","title":"tint 3.7 – Lets you solve puzzles by painting","content":"Mix watercolours to match the colour of the origami – all at a soothing pace and in the comfort of your own garden studio. There are no timers, no countdowns, no points and certainly no rush, whenever you feel like a break.   270 LEVELS AND COUNTING Each level can often be solved in multiple […]"},{"link":"https://nmac.to/blog/spire-blast/","image":"https://nmac.to/wp-content/uploads/2021/01/Spire-Blast.png","title":"Spire Blast 1.3.0 – Physics-based match puzzler","content":"Step into the colourful world of Spire Blast. Work with your ever-hungry dragon companion to collapse numerous mysterious towers of all shapes and sizes that have risen up across the kingdom.   Test your wits and skills, use all the tools at your disposal and you will emerge victorious! Conquer countless challenges Visit many breath-taking […]"},{"link":"https://nmac.to/blog/sid-apple-music-converter/","image":"https://nmac.to/wp-content/uploads/2020/06/Sidify.Apple_.Music_.Converter3.png","title":"Sidify Apple Music Converter 3.2.0 – Removes DRM from Apple Music songs","content":"Sidify Apple Music Converter is a well-designed audio converter for iTunes music for Mac users. It can remove DRM from Apple Music songs, and makes it possible to save them in MP3, AAC, or WAV format to either your local computer or your music players. Besides, you can use Sidify Apple Music Converter to convert […]"},{"link":"https://nmac.to/blog/kig-amazon-prime-video-downloader/","image":"https://nmac.to/wp-content/uploads/2021/04/Kigo-Amazon-Prime-Video-Downloader.png","title":"Kigo Amazon Prime Video Downloader 1.2.1 – Amazon Prime Video Downloader","content":"Download and Save Amazon Prime Videos offline for Mac Users. Retain Audio Track and Subtitles With Fast Speed.   Fast to Add Prime Videos Just copy Prime Video link and paste to the program to add the videos to download. And you can also find videos quickly with the built-in smart search engine. If you […]"}]