[{"link":"https://nmac.to/blog/bridge-constructor-medieval/","image":"https://nmac.to/wp-content/uploads/2020/08/Bridge-Constructor-Medieval.png","title":"Bridge Constructor Medieval 2.1 – Physics Puzzle Simulation Game","content":"Bridge Constructor Medieval turns back the clock a few centuries to the time of knights and castles. Build sturdy bridges to supply your city with provisions – or cunningly constructed bridges that collapse under the weight of attacking troops, sending the horde of enemies into the abyss below. You won’t even be safe from cannon […]"},{"link":"https://nmac.to/blog/bridge-constructor-portal/","image":"https://nmac.to/wp-content/uploads/2018/02/Bridge-Constructor-Portal.png","title":"Bridge Constructor Portal 1.4 – 2D Strategy & Simulation Game","content":"Enter the Aperture Science Enrichment Center and experience Bridge Constructor Portal – the unique merging of the classic Portal  and Bridge Constructor games.   As a new employee in the Aperture Science test lab, it’s your job to build bridges, ramps, slides, and other constructions in 60 test chambers and get the Bendies safely across […]"},{"link":"https://nmac.to/blog/bridge-constructor/","image":"https://nmac.to/wp-content/uploads/2020/08/Bridge-Constructor9.png","title":"Bridge Constructor 9.0 – Physics Puzzle Simulation Game","content":"Become an appraised bridge engineer and architect in Bridge Constructor. Create and design your own constructions and watch the cars and trucks pass over them – or see them fall and crash while your inferior creations collapse due to weight and the laws of physics!   Progress through numerous levels and build bridges over deep […]"},{"link":"https://nmac.to/blog/movavi-pdf-editor/","image":"https://nmac.to/wp-content/uploads/2017/10/Movavi-PDF-Editor.png","title":"Movavi PDF Editor 3.2.1 – Easy PDF viewer & editor","content":"Looking for a PDF reader for Mac with good editing tools? Most of the software for Mac that you can find online for download is not that great. Free desktop apps usually lack advanced options and have inadequate formatting tools, and higher-quality paid programs can be out of the question because of their high price. […]"},{"link":"https://nmac.to/blog/little-inferno/","image":"https://nmac.to/wp-content/uploads/2020/08/Little-Inferno.png","title":"Little Inferno 1.3 – Singleplayer Casual Puzzle Game","content":"Congratulations on your new Little Inferno Entertainment Fireplace! Throw your toys into your fire, and play with them as they burn. Stay warm in there. It’s getting cold outside!   Burn flaming logs, screaming robots, credit cards, batteries, exploding fish, unstable nuclear devices, and tiny galaxies. An adventure that takes place almost entirely in front […]"},{"link":"https://nmac.to/blog/planetary-annihilation-titans/","image":"https://nmac.to/wp-content/uploads/2019/05/Planetary-Annihilation-Titans.png","title":"Planetary Annihilation: TITANS 114803 – Space & Robots Strategy Game","content":"TITANS is the huge stand-alone expansion to the already massive-scale RTS Planetary Annihilation, which includes the base game and adds tons of new features:   Devastate your enemies with 5 massive Titan-class super units like the earth-shaking Atlas bot and lightning-wielding Zeus airship!   Expand your strategic arsenal with 16 new units such as versatile […]"},{"link":"https://nmac.to/blog/launchey/","image":"https://nmac.to/wp-content/uploads/2017/10/Launchey2.png","title":"Launchey 2.1.1d – A menubar app launcher","content":"Launchey 2 is a lightweight launcher that lets you launch any app on your Mac from the menubar. You can choose which apps are visible in the Launchey’s menubar menu and select up to 5 favorites that you can display on your directly on your Mac’s menubar. Launchey lets you set global hotkeys for launching […]"},{"link":"https://nmac.to/blog/todoey/","image":"https://nmac.to/wp-content/uploads/2017/09/Todoey2.png","title":"Todoey 2.0.6d – Cloud-synced checklist manager","content":"Todoey is the simplest way to remember things. It sits in your menubar so it is always just one click away. It blends perfectly into your macOS desktop in both dark and light theme. It also syncs using iCloud so you will be always backed up and up to date on all your Macs.   […]"},{"link":"https://nmac.to/blog/pingey/","image":"https://nmac.to/wp-content/uploads/2018/12/Pingey1.png","title":"Pingey 1.0.1d – Easy way to monitor your websites","content":"Pingey is the simplest way to monitor your websites. It sits in the menu bar, always one click away. Click on its icon to see status of all your websites or add separate menu bar items for your most important ones to make them glanceable.   Features: Option to add separate, always visible menu bar […]"},{"link":"https://nmac.to/blog/focusey/","image":"https://nmac.to/wp-content/uploads/2020/08/Focusey.png","title":"Focusey 1.0.1d – A timer in the menu bar","content":"Focusey is an incredibly simple to use and effective timer and checklist app for the Pomodoro Technique. It always sits in your menu bar and you can customize it according to your needs.   Basic technique description: Decide which tasks you want to work on during the day and put them on the checklist. Start […]"}]