[{"link":"https://nmac.to/blog/xtwin-v2-0-6/","image":"https://nmac.to/wp-content/uploads/2013/12/Icon.175x175-7517.png","title":"xTwin v2.0.6 – Online storage solution","content":"xTwin (was Twin) is the most flexible online backup solution for Mac OS X, compatible with most Internet servers: FTP, FTPS, SFTP, WebDAV, Amazon S3, MobileMe. It even supports offline backups to external drives. Twin is a true Mac product that preserves Finder info, resource forks, ACLs, Privileges and comes with an elegant user interface and […]"},{"link":"https://nmac.to/blog/xpoint-v1-1-4/","image":"https://nmac.to/wp-content/uploads/2013/12/iconApp.175x175-75.png","title":"xPoint v1.1.4 – Manage your favorite places on a map","content":"xPoint makes your favorite places management more efficient and productive. All of your places information can be easily stored, viewed, and referenced. xPoint combines innovative features with an simple interface to create a clean and elegant application specifically built for OS X 10.7 Lion and OS X 10.8 Mountain Lion. xPoint can be easily customized to […]"},{"link":"https://nmac.to/blog/twins-mini-v1-1/","image":"https://nmac.to/wp-content/uploads/2013/12/twinsmini.175x175-75.png","title":"Twins Mini v1.1 – Minimalistic duplicate finder","content":"Twins Mini is a handy and minimalistic duplicate finder. It helps you to quickly find duplicates and get rid of them easily. Features: – Fast and solid scan engine based on our professional Twins application– SHA-1 Checksum based file compare – Automatic one-click duplicate selection– Selection warning messages Highlights: Optimized for Retina display Quick Look […]"},{"link":"https://nmac.to/blog/translucent-v1-5-3/","image":"https://nmac.to/wp-content/uploads/2013/12/TranslucentIcon.175x175-75.png","title":"Translucent 1.5.3 – Displays system monitoring info","content":"Translucent provides detailed real-time information about what is going on inside your Mac. At any given time Translucent displays how much each one of your processors is being utilized, detailed information about how your memory is being used, how much data is being sent and received on your network interfaces and how much is being […]"},{"link":"https://nmac.to/blog/translation-v1-0/","image":"https://nmac.to/wp-content/uploads/2013/12/Translator.175x175-751.png","title":"Translation 1.0 – Quality translate between languages","content":"Translation is a handy little app that takes care of all your language translation needs. The app lives in your Mac’s menubar and is instantly available at the click of a button. Searching the web for translation services will be a thing of the past once you make the switch to Translation.   Here is […]"},{"link":"https://nmac.to/blog/rainbow-v1-10/","image":"https://nmac.to/wp-content/uploads/2012/12/Rainbow.png","title":"Rainbow 1.10 – Set wonderful effects for your photos","content":"Rainbow is a graphic application that allow you to set wonderful effects in a fast and easy way.It’s possible to apply the effects in sequence, getting amazing results. Reflection: sets the distance, height and transparency of the image reflection. Shadow: sets the angle, depth, X offset, Y offset, blur and color of the shadow of […]"},{"link":"https://nmac.to/blog/mountain-lion-cache-cleaner-v7-0-5/","image":"https://nmac.to/wp-content/uploads/2013/12/9503.png","title":"Mountain Lion Cache Cleaner v7.0.5 – Clear caches, access hidden OS X settings and more","content":"Mountain Lion Cache Cleaner is an award-winning general purpose tool for Mac OS X. MLCC makes system maintenance simple with an easy point and click interface to many OS X functions. Novice and expert users alike will appreciate the powerful toolset MLCC provides. Mountain Lion Cache Cleaner is one of the world’s leading maintenance tools […]"},{"link":"https://nmac.to/blog/iclipboard-v4-1-7/","image":"https://nmac.to/wp-content/uploads/2013/12/iClipboard.175x175-752.png","title":"iClipboard 4.1.7 – A flexible clipboard manager","content":"iClipboard automatically keeps a history of everything you copy to the clipboard from any application. You can then paste any clipping from the history five different ways:   1) the Shelf on the side of the screen. 2) the special menu in the menu bar. 3) the Rapid-Fire hot key. 4) the Services menu. 5) […]"},{"link":"https://nmac.to/blog/egis-v1-0-8/","image":"https://nmac.to/wp-content/uploads/2013/12/Egis.png","title":"Egis v1.0.8 – Visualizes all connections established","content":"Egis works like Zeus’ shield: it visualizes all connections established in your Mac so that you always know the sites your app is connected. If you think an app is suspicious, you can terminate it with one-click. Highlights: – List all established connections.– List all listening connections.– TCP and UDP support.– IPv4 and IPv6 support. […]"},{"link":"https://nmac.to/blog/imuscle-v1-0/","image":"https://nmac.to/wp-content/uploads/2013/12/icon.175x175-7543.png","title":"iMuscle 1.0 – Easily search and identify body parts, muscles & exercises","content":"iMuscle can be used to easily identify a body part or individual muscle by zooming into a 3-Dimensional human body with the musculature exposed. The user can then access hundreds of exercises associated with the development / rehabilitation of specific muscles.Multiple user profiles and workouts can be created using iMuscle, making it ideal for fitness […]"}]