[{"link":"https://nmac.to/blog/bluestacks-app-player-v0-2-5-107/","image":"https://nmac.to/wp-content/uploads/2013/01/BlueStacks.png","title":"BlueStacks App Player 0.2.5.107 – Run Android applications on your Mac","content":"BlueStacks App Player lets you run your Android apps fast and full screen on your Apple computer.   Note : WhatsApp Messenger works fine 🙂 happy chatting …   Version 0.2.5.107: Now supports all Android applications (over 750,000) Faster than ever   Intel, OS X 10.6 or later BitShare Click Here   SlingFile Click Here […]"},{"link":"https://nmac.to/blog/tunespan-v1-0-4/","image":"https://nmac.to/wp-content/uploads/2013/12/TuneSpan.175x175-75.png","title":"TuneSpan 1.0.4 – Effortless iTunes media library management","content":"TuneSpan allows you to browse and span your iTunes Library.   Span (verb): to distribute the media files in your iTunes Library across multiple drives.   What does TuneSpan do? TuneSpan helps you easily move the media files (Music, Movies, etc.) in your iTunes Library to multiple drives, avoiding the pitfalls of moving files manually. […]"},{"link":"https://nmac.to/blog/koku-v2-0-3/","image":"https://nmac.to/wp-content/uploads/2013/12/icon.175x175-7532.png","title":"Koku v2.0.3 – A flexible financial manager","content":"Koku is a flexible financial manager that can handle it all. Keep track of your money using Direct Connect to automatically and safely download your transactions as they occur. You can even have your transactions automatically tagged for you, so you never have to lift a finger.Innovative smart tagging capabilities allow you to assign multiple […]"},{"link":"https://nmac.to/blog/calories-v3-3/","image":"https://nmac.to/wp-content/uploads/2013/12/red-white-candy.175x175-75.png","title":"Calories v3.3 – Record and analyze your daily nutrition","content":"Calories is your personal diet, health and fitness trainer!  What Calories does for you: – Track, analyze and improve your dietary habits.– Control and reduce your body weight. – Track your energy-usage and improve your fitness.– Chronologically monitor your body data (weight, blood pressure, blood sugar) and set them in relation to your diet and […]"},{"link":"https://nmac.to/blog/servus-v1-1-2/","image":"https://nmac.to/wp-content/uploads/2013/12/app-icon1.png","title":"Servus v1.1.2 – turn any file on your computer into a branded download page hosted on Dropbox","content":"It’s a menubar icon. If you drop a file on it, it’ll build a nice preview page around it, upload both to your Dropbox, then copy the public preview link to your clipboard. If you drop a folder on it, the folder will be zipped up before uploading.I created it because I’m a freelancer and […]"},{"link":"https://nmac.to/blog/processes-v1-0-1/","image":"https://nmac.to/wp-content/uploads/2013/12/43756.png","title":"Processes v1.0.1 – Monitor and manage running system processes","content":"Processes is an application that gives you the ability to: – Zap Stalled Processes and Apps – If a process is stuck, Processes can kill it or restart it with pinpoint accuracy.– Pause Apps and Processes -Is a process bogging-down your system? Pause it and resume it later.– Monitor System Usage Per Process – Monitor […]"},{"link":"https://nmac.to/blog/window-magician-v1-0-7/","image":"https://nmac.to/wp-content/uploads/2013/12/Window_Magician.175x175-75.png","title":"Window Magician v1.0.7 – Automatic window re-sizer and re-positioner","content":"Window Magician helps streamline your user experience and optimize your workflow by automatically resizing and repositioning windows. Create “Window Watchers” to individually process windows with specific titles, from specific applications, and of specific types. Ensure all of your Finder windows are positioned tightly in the most top-left corner of the screen. Ensure your Web browser […]"},{"link":"https://nmac.to/blog/project-canvas-v1-1-7/","image":"https://nmac.to/wp-content/uploads/2013/12/Project_Canvas.175x175-75.png","title":"Project Canvas v1.1.7 – Multimedia presentation tool","content":"Project Canvas is a multimedia presentation tool, much like industry giant PowerPoint, but comes at the fraction of the cost. Create click-by-click adventure games, interactive tutorials, storybooks, school presentations, and more.Sporting a cross-platform compatible file format, Project Canvas files can also contain an unlimited number of cards and buttons. Buttons can perform a variety of […]"},{"link":"https://nmac.to/blog/moccanote-v1-0-0/","image":"https://nmac.to/wp-content/uploads/2013/12/icon.175x175-7533.png","title":"Moccanote v1.0.0 – Capture and organize your ideas and thoughts","content":"With moccanote you can do both: Write simple notes or even record complex ideas. The clean and streamlined interface lets you focus on what is really important: your thoughts and ideas.Integrate moccanote into your workflow and you will be amazed how organized and productive your day becomes: • Create a new Entry in your Inbox […]"},{"link":"https://nmac.to/blog/fusio-utility-v2-0-1/","image":"https://nmac.to/wp-content/uploads/2013/12/fusioIcon.175x175-75.png","title":"Fusio Utility v2.0.1 – Merge multiple folders into one","content":"No matter how many folders you need combined together, just drag them to the app’s icon or drag and drop them in the top table, select a destination, choose a few options, and click Merge. Couldn’t be simpler! The folders’ hierarchies will be preserved (you can now also choose to flatten the folders), duplicate files […]"}]