[{"link":"https://nmac.to/blog/image-exif-editor/","image":"https://nmac.to/wp-content/uploads/2016/12/Image-Exif-Editor.png","title":"Image Exif Editor 5.2.1 – View and edit your images’ metadata","content":"Image Exif Editor is the best and easiest way to view and edit image’s EXIF metadata. It was designed to present as many details about how a photo was taken in a clear and easy to understand format with powerful EXIF metadata editing capabilities. It’s the most powerful tool for handling the EXIF information in […]"},{"link":"https://nmac.to/blog/recordia/","image":"https://nmac.to/wp-content/uploads/2021/02/Recordia.png","title":"Recordia 2.3.0 – Simple audio recorder","content":"Recordia lets you record audio directly from the menu bar or with a global keyboard shortcut.   This can be useful for recording voice memos, song ideas, meetings, lectures, interviews, phone calls, voice-overs, and more.   Features Record compressed or lossless audio. Customizable keyboard shortcuts to start/stop and pause/resume recording. Change input device. Unlimited recording […]"},{"link":"https://nmac.to/blog/visualdiffer/","image":"https://nmac.to/wp-content/uploads/2015/10/VisualDiffer.png","title":"VisualDiffer 1.8.7 – Compare folders and files side-by-side","content":"VisualDiffer compares folders and files side-by-side using colors to visually show differences. From the Folder view it’s possible to make operations on folders and files like copying or deleting.   It’s possible to compare directories quickly choosing base folders from the context menu. Using the File Filter feature, it is possible to hide specific files […]"},{"link":"https://nmac.to/blog/compress-pdf/","image":"https://nmac.to/wp-content/uploads/2019/11/Compress-PDF.png","title":"Compress PDF 2.0.0 – Minimize file size of PDF document [FIX]","content":"Compress PDF has the capability to minimize file size of PDF documents, especially useful for those PDF files with many graphics and photos.   You can send smaller and faster emails, save your storage space, decrease file upload or download times after reducing file size of PDF documents.   Features:   Extremely simple Simply drag […]"},{"link":"https://nmac.to/blog/tuneskit-video-cutter/","image":"https://nmac.to/wp-content/uploads/2018/06/TunesKit-Video-Cutter.png","title":"TunesKit Video Cutter 2.3.2 – Trim videos losslessly and easily","content":"TunesKit Video Cutter is a smart and free video cutting tool to help users trim videos losslessly and easily. With the simple yet professional design of this freeware, everyone can operate the video splitter with a few clicks only. It supports cutting almost all popular video formats, including M4V, WebM, ASF, TP, AVI, MTS, M2TS, […]"},{"link":"https://nmac.to/blog/aiseesoft-mac-video-enhancer/","image":"https://nmac.to/wp-content/uploads/2018/02/Aiseesoft-Mac-Video-Enhancer.png","title":"Aiseesoft Mac Video Enhancer 9.2.26 – Professional video enhancement software","content":"Aiseesoft Mac Video Enhancer is the most professional video enhancement software for Mac users. It is skilled in enhancing video quality to bring a clearer video vision. Also, it works as video editing software to rotate or flip your video angle on Mac. More editing functions enable you to clip, crop, and make video or […]"},{"link":"https://nmac.to/blog/filmage-screen/","image":"https://nmac.to/wp-content/uploads/2021/01/Filmage-Screen.png","title":"Filmage Screen 1.4.3 – Record Screen,Video Editing","content":"Filmage Screen = Screen Recorder + Audio Recorder + Video Editor + Video Format Converter + Video Player + GIF Maker + Media Management + Meeting Record   Filmage Screen Recorder is an all-in-one screen recording and video editing software, allowing you to make videos amazing. It is easy-to-use, intuitive, light and stable. With this […]"},{"link":"https://nmac.to/blog/anymp4-dvd-creator/","image":"https://nmac.to/wp-content/uploads/2021/12/AnyMP4-DVD-Creator.png","title":"AnyMP4 DVD Creator 6.2.26 – Burn MP4/AVI/WMV/MKV to DVD","content":"Create personalized DVD/DVD Folder/ISO file with SD and HD videos (MP4, AVI, MKV, M4V, WMV, M2TS, MOV video, and more) on Mac.   Create DVD Folder from videos If you want to back up your important DVD movie, you’ll also need this DVD Creator for Mac software. It allows you to create a DVD Folder […]"},{"link":"https://nmac.to/blog/mirror-for-android-tv/","image":"https://nmac.to/wp-content/uploads/2018/10/Mirror-for-Android-TV.png","title":"Mirror for Android TV 2.7.3 – Mirror your Mac screen to your Android TV","content":"Mirror for Android TV allows you to mirror the screen and sound of your Mac to Android TV. Works on any TV, settop box or Media Player with the Android TV operating system.   You can also stream individual video files from your Mac to your Android TV. Also, we included the option to watch […]"},{"link":"https://nmac.to/blog/mirror-for-roku/","image":"https://nmac.to/wp-content/uploads/2018/12/Mirror-for-Roku.png","title":"Mirror for Roku 2.9.3 – Mirror your Mac Screen to Roku TV","content":"Mirror for Roku allows you to mirror the screen and audio of your Mac to a Roku Streaming Player, Roku Streaming Stick or Roku TV. You can also stream individual video files from your Mac to your Roku. Also, we included the option to watch one window on your Mac, and another window on your […]"}]