[{"link":"https://nmac.to/blog/iconvert-icons-2-8/","image":"https://nmac.to/wp-content/uploads/2015/06/iConvert.Icons_.png","title":"iConvert Icons 2.8 – Convert icons to .png format","content":"iConvert Icons is now the easiest way to create and convert icons from almost any format. With its unique auto-detection feature, just drop images, apps, folders with custom icons, and of course other icons right into the conversion window. All you need to do is choose the location where you want the newly converted icons […]"},{"link":"https://nmac.to/blog/dupe-away-3-0-7/","image":"https://nmac.to/wp-content/uploads/2015/06/Dupe.Away_.png","title":"Dupe Away 3.0.7 – Fast and easy iTunes duplicate remover program","content":"Dupe Away instantly finds the dupes in iTunes and, based on your preferences, automatically determines which duplicate to keep and which to remove.   Detect Unused Files: Ever wonder how many tracks exist in your Music folder that aren’t in iTunes? We call these “abandoned tracks.” Dupe Away detects these files for you so you […]"},{"link":"https://nmac.to/blog/textexpander-5-0/","image":"https://nmac.to/wp-content/uploads/2014/01/TextExpander.png","title":"TextExpander 5.0 – Expand custom keyboard shortcuts into frequently-used text and pictures","content":"TextExpander saves your fingers and your keyboard, expanding custom keyboard shortcuts into frequently-used text and pictures. Type more with less effort!   Here are a few examples for what you can do with TextExpander: Insert standard greetings, phrases, boilerplate paragraphs, and signatures – including formatted text and pictures. Correct typos automatically Organize snippets into groups […]"},{"link":"https://nmac.to/blog/reformator-1-2-2/","image":"https://nmac.to/wp-content/uploads/2014/09/Reformator.png","title":"Reformator 1.2.2 – Multi-functional batch photo converter","content":"Reformator helps you convert a bulk of images into the most popular image formats, give your files meaningful names, watermark with text and image, adjust photos (brightness/saturation/exposure/grayscale/etc.), fit geometry (scale/crop/trim/etc.), remove private metadata, add your own copyrights, and much more. Also, Reformator is a great tool to browse your photos with an up-to-date photo Browser, […]"},{"link":"https://nmac.to/blog/notestab-pro-4-7/","image":"https://nmac.to/wp-content/uploads/2015/06/NotesTab.Pro_.png","title":"NotesTab Pro 4.7 – Take notes from the menu bar","content":"NotesTab Pro is an indispensable app and is the easiest piece of software you will ever use. Try it for a day and you’ll be hooked for life! This nifty app sits on your Mac’s menu bar and is available at the click of a button. It is perfect for jotting down a few lines […]"},{"link":"https://nmac.to/blog/haven-1-0/","image":"https://nmac.to/wp-content/uploads/2015/06/Haven.png","title":"Haven 1.0 – A writing tool, and a place to write","content":"Haven is not a tool but a place to write…   Simply put, Haven helps all kinds of amateur and professional writers get inspired and focused on their writing, stimulating their creativity while setting a peaceful mind-set and offering bullet-proof creative writing aids. As a place to write, Haven offers several different locations/themes as well […]"},{"link":"https://nmac.to/blog/framer-studio-1-11-259/","image":"https://nmac.to/wp-content/uploads/2014/08/Framer.Studio.png","title":"Framer Studio 1.11.259 – Invent, design and experiment with interaction","content":"Framer Studio is built on Framer.js, an open source framework for rapid prototyping. Framer allows you to define animations and interactions. It runs on mobile devices, too.   Source on GitHub Hardware Accelerated Events & 3D Animations Spring Physics Framer.js used at: Google, Facebook, Instagram and Stripe   Generate Generate assets out of Sketch and […]"},{"link":"https://nmac.to/blog/noiseless-pro-1-0-2/","image":"https://nmac.to/wp-content/uploads/2015/04/Noiseless.Pro_.png","title":"Noiseless Pro 1.0.2 – Remove luma and chroma noise from photos","content":"Noiseless Pro breathes new life into every photo! When taking photos in low light situations, every smartphone, compact camera, or DSLR creates “noise”, small color or light speckles that can ruin an otherwise cool photo. Noiseless Pro cleans up digital noise fast, with advanced technology to retain sharp details, with one-click operation, and at an […]"},{"link":"https://nmac.to/blog/1keyboard-2-6/","image":"https://nmac.to/wp-content/uploads/2015/05/1Keyboard.png","title":"1Keyboard 2.6 – Use your Mac’s keyboard on all your devices","content":"1Keyboard lets you type on your iPhone, iPad, or Apple TV using your Mac’s keyboard. It turns your Mac into a Bluetooth keyboard that works with all of your devices.   Features: Use keyboard shortcuts to start typing on devices. Copy-paste text into your device. Minimal menubar app that stays out of sight until you […]"},{"link":"https://nmac.to/blog/delineato-pro-1-2-6/","image":"https://nmac.to/wp-content/uploads/2015/05/Delineato.Pro_.png","title":"Delineato Pro 1.2.6 – Stylish outliner","content":"Delineato Pro is the professional edition of Delineato – the italian word for “outline”. Designed using the WYSIWYN paradigm – What You See Is What You Need – this carefully crafted application is targeted at creating simple diagrams, mind maps, brainstorming, to-do lists, architectural diagrams.   A clutter-free interface allows you to concentrate and focus […]"}]