[{"link":"https://nmac.to/blog/last-epoch/","image":"https://nmac.to/wp-content/uploads/2020/06/Last-Epoch.png","title":"Last Epoch Early Access 0.7.10c – RPG Action & Adventure Game","content":"Last Epoch combines time travel, exciting dungeon crawling, engrossing character customization and endless replayability to create an Action RPG for veterans and newcomers alike. Travel through the world of Eterra’s past and face dark empires, wrathful gods and untouched wilds – to find a way to save time itself from The Void.   Key Features […]"},{"link":"https://nmac.to/blog/pathfinder-kingmaker/","image":"https://nmac.to/wp-content/uploads/2018/10/Pathfinder.Kingmaker.png","title":"Pathfinder: Kingmaker 2.1.5d – Singleplayer RPG & Fantasy Game","content":"With the help of over 18,000 Kickstarter backers, Narrative Designer Chris Avellone and composer Inon Zur, Owlcat Games is proud to bring you the first isometric computer RPG set in the beloved Pathfinder tabletop universe. Enjoy a classic RPG experience inspired by games like Baldur’s Gate, Fallout 1 and 2 and Arcanum. Explore and conquer […]"},{"link":"https://nmac.to/blog/periscope-pro/","image":"https://nmac.to/wp-content/uploads/2014/06/Periscope.Pro_.png","title":"Periscope Pro 3.4.2 – Turn your Mac into a motion-based surveillance system","content":"Periscope Pro turns your Mac into a surveillance system that records video clips with sound. You can store the clips to view them later, or automatically upload them so you can see what’s happening remotely!   Periscope Pro uses your Mac’s built-in camera and microphone, or an external camera and microphone, to take video clips […]"},{"link":"https://nmac.to/blog/arrog/","image":"https://nmac.to/wp-content/uploads/2020/10/Arrog.png","title":"Arrog 1.0 – Point & Click Adventure Game","content":"Arrog is an enigmatic puzzle adventure game featuring hand-drawn art and set in a bizarre black-and-white world with color accents.   Features A tale about the journey of a man accepting his death through his dreams. A unique black-and-white art style and traditional animations used in a bizarre world. An intense 30-minute narrative experience. A […]"},{"link":"https://nmac.to/blog/fort-triumph/","image":"https://nmac.to/wp-content/uploads/2020/05/Fort-Triumph.png","title":"Fort Triumph 1.1.0 – Turn-Based Tactical Strategy Game","content":"Fort Triumph is a challenging fantasy turn-based tactics game where permanent death is a possibility at any moment. How’s that for pressure?   Lead a band of heroes with different skill sets through a witty, parody fantasy plot. Missions with various objectives are waiting for you on tiled procedural maps—whether in story mode or skirmish, […]"},{"link":"https://nmac.to/blog/drama/","image":"https://nmac.to/wp-content/uploads/2019/09/drama.png","title":"Drama 2.1.1 – Prototyping, animation & design tool","content":"Drama‘s handy 3-in-1 functionality uniquely integrates design, animation and prototyping into a single familiar tool. No more frustrating switching between apps or learning new stuff.   And by delivering advanced features such as Magic Move, Time Travel, 3D layers, Drivers and Magic Drag, Drama is truly the one-stop solution for your design needs.   Powerful […]"},{"link":"https://nmac.to/blog/icarefone/","image":"https://nmac.to/wp-content/uploads/2019/09/iCareFone5.png","title":"iCareFone 7.1.0.2 – System care for iOS devices","content":"iCareFone will fix iOS to normal by installing the latest firmware file without wiping data on iPhone/iPad/iPod touch. Repairing Operating System can fix all iOS stuck, crash, and errors occur on iOS update/jailbreak. You can also repair the system just for a faster and better iOS experience.   Issues you can fix Stuck in white […]"},{"link":"https://nmac.to/blog/leisure-suit-larry-wet-dreams-dont-dry/","image":"https://nmac.to/wp-content/uploads/2020/08/Leisure-Suit-Larry-Wet-Dreams-Dry-Twice.png","title":"Leisure Suit Larry – Wet Dreams Dry Twice 1.0.1.53 – Point & Click Adventure Game","content":"This Save the World Edition is a bundle of the main game, the official soundtrack, the artbook and two meals for children from the ShareTheMeal initiative (WFP) for all those who want to support and appreciate the developer’s work on Leisure Suit Larry – Wet Dreams Dry Twice even more.   ABOUT THIS GAME Hey […]"},{"link":"https://nmac.to/blog/afterparty/","image":"https://nmac.to/wp-content/uploads/2019/11/Afterparty.png","title":"Afterparty 1.4.9 – Story Rich Adventure Game","content":"In Afterparty, you play Milo and Lola, recently deceased best buds who suddenly find themselves staring down an eternity in Hell. But there’s a loophole: outdrink Satan and he’ll grant you re-entry to Earth.   Milo and Lola are now dead, thirsty, and roaming the streets of Nowhere, the outermost island of Hell.   What […]"},{"link":"https://nmac.to/blog/crossroads-inn/","image":"https://nmac.to/wp-content/uploads/2020/10/Crossroads.Inn_.png","title":"Crossroads Inn 1.17 – A real time management sim game","content":"Crossroads Inn is a real-time management sim with role-playing games elements. The game consists of two unique modes offering totally different experiences.   In Sandbox mode gamers will focus solely on managing their business and economy – to build their very own tavern, hire and oversee staff, manage the supply chains and create new dish […]"}]