[{"link":"https://nmac.to/blog/idamedic-evolution/","image":"https://nmac.to/wp-content/uploads/2021/12/iDAMedic-Evolution.png","title":"iDAMedic Evolution 2.0.0 – Intelligent Medical Administrative Program","content":"La Aplicación Medica más completa que existe para la elaboración de expedientes médicos electrónicos.   1. Creación rápida y fácil de pacientes. 2. Historia Clínica Completa y de acuerdo a las Normas. Antecedentes Heredofamiliares | Antecedentes Patológicos y No Patológicos | Gineco Obstétricos | Interrogatorio por aparatos y sistemas | Padecimiento Actual | Exploración física […]"},{"link":"https://nmac.to/blog/infoclick/","image":"https://nmac.to/wp-content/uploads/2017/03/InfoClick.png","title":"InfoClick 1.2.8 – Search tool for Mail","content":"InfoClick is designed to be used with Apple’s Mail application to navigate through your emails to see the words, contacts, and information within. InfoClick knows precisely what words you’ve used, so there’s no guessing; it offers a guided process of progressively narrowing down the matches in a series of simple choices. That means you can’t […]"},{"link":"https://nmac.to/blog/menubar-stats/","image":"https://nmac.to/wp-content/uploads/2020/07/MenuBar-Stats3.png","title":"MenuBar Stats 3.8.5 – Advanced system monitoring","content":"MenuBar Stats 3, completely re-written, goes further than before   MenuBar Stats A quick view to your system health right in your menu bar. 5 advanced modules (Cpu, Memory, Network, Disk, Battery). Each modules can be in 1 combined window, or in their own separated window, for more detailed information. Simply use drag & drop […]"},{"link":"https://nmac.to/blog/download-shuttle-pro/","image":"https://nmac.to/wp-content/uploads/2018/03/Download-Shuttle-Pro.png","title":"Download Shuttle Pro 1.9 – Ultra-fast file downloader & website media extractor","content":"Download Shuttle Pro is the best download manager and accelerator for Mac. It intelligently splits file downloads into multiple segments and simultaneously downloads them; allowing for a faster overall transfer speed than using a web browser.   Website Scanner & Extractor Simply enter a web link into our website scanner and a list of downloadable […]"},{"link":"https://nmac.to/blog/window-focus/","image":"https://nmac.to/wp-content/uploads/2016/08/Window-Focus.png","title":"Window Focus 1.0.8 – Highlight Active Apps & Dim Your Screen","content":"Window Focus is a super useful and beautiful app that helps you focus on what’s important. The app highlights the current working window and dims all the others in the background.   If you want to concentrate on a task at hand on your Mac, Window Focus is an absolutely essential app. By highlighting the […]"},{"link":"https://nmac.to/blog/battery-health-3/","image":"https://nmac.to/wp-content/uploads/2017/05/Battery-Health3.png","title":"Battery Health 3 1.0.29 – Monitor Battery Stats and Usage","content":"With Battery Health, you can easily see all the important information about your MacBook’s battery, such as current charge level, battery capacity, power usage, number of times it has been charged and much more.   Download the app and learn more about your battery than you ever thought possible!   Version 1.0.29: Release notes were […]"},{"link":"https://nmac.to/blog/duplicate-detective-2/","image":"https://nmac.to/wp-content/uploads/2021/05/Duplicate-Detective-2.png","title":"Duplicate Detective 2 1.0.14 – Duplicate File Finder","content":"Duplicate Detective 2 is our brand new and intelligent app for quickly finding and removing unneeded duplicate files such as photos, documents, videos, folders and more with just a few clicks.   With our advanced hash matching and filtering algorithms, you can be confident that only exactly identical duplicate files are removed from your storage […]"},{"link":"https://nmac.to/blog/disk-doctor-pro/","image":"https://nmac.to/wp-content/uploads/2021/12/Disk-Doctor-Pro.png","title":"Disk Doctor Pro 1.0.22 – Save Gigabytes of Disk Space","content":"Disk Doctor Pro is our all-new and ultra-powerful disk cleaning app that is capable of removing gigabytes of unneeded files from your Mac within just a few minutes.   The app automatically scans your Mac’s hard drive and quickly displays a huge range of files that can be safely removed to free up valuable disk […]"},{"link":"https://nmac.to/blog/memory-clean-2/","image":"https://nmac.to/wp-content/uploads/2016/09/Memory-Clean-2.png","title":"Memory Clean 2 2.1.2 – Utility for purging inactive memory","content":"Memory Clean 2 is the ultimate app for optimizing your Mac’s memory and is best used after you have finished using a memory (RAM) intensive app or game.   With the slickest interface and user experience, Memory Clean 2 stands head and shoulders above the rest.   Our users have experienced a smoother and faster […]"},{"link":"https://nmac.to/blog/currency-assistant/","image":"https://nmac.to/wp-content/uploads/2016/11/Currency-Assistant3.png","title":"Currency Assistant 3.5 – Convenient currency conversion [FIX]","content":"Currency Assistant is a very flexible currency conversion calculator. It lets you convert between 174 world currencies and automatically updates exchange rates over the Internet. With Currency Assistant you can easily create multiple converters, import and convert series of amounts, calculate and convert the result of expressions, and quickly log, save, export, and print your […]"}]