[{"link":"https://nmac.to/blog/photomill/","image":"https://nmac.to/wp-content/uploads/2016/04/PhotoMill-X1.png","title":"PhotoMill 2.1.1 – Multi-functional batch photo converter","content":"PhotoMill helps you convert a bulk of images into the most popular image formats, give your files meaningful names, watermark with text and image, adjust photos (brightness/saturation/exposure/grayscale/etc.), fit geometry (scale/crop/trim/etc.), remove private metadata, add your own copyrights etc. Also, PhotoMill is a great batch metadata editor, renamer and photo browser.   Features: Convert Conversion to: […]"},{"link":"https://nmac.to/blog/tweak-photos/","image":"https://nmac.to/wp-content/uploads/2016/10/Tweak-Photos.png","title":"Tweak Photos 2.8 – Batch Image Editing Made Easy","content":"Systweak has developed a brand new batch image editing app, Tweak Photos, for your Mac. It could very well be the ultimate batch editing tool you have been looking for! With Tweak Photos, editing thousands of your photos is just a matter of few clicks. It is a highly efficient tool that helps you customize […]"},{"link":"https://nmac.to/blog/data-guardian/","image":"https://nmac.to/wp-content/uploads/2021/05/Data_Guardian_7.png","title":"Data Guardian 7.0.5 – Secure database application with 448-bit Blowfish encryption","content":"Data Guardian is a secure database application. Security and privacy are two of the most important issues in today’s world; leaving passwords on sticky notes around your computer simply will not cut it anymore. Data Guardian is a secure database application with up to 448-bits of Blowfish encryption – regardless of how sensitive your data […]"},{"link":"https://nmac.to/blog/storyist/","image":"https://nmac.to/wp-content/uploads/2015/04/Storyist.png","title":"Storyist 4.2.5 – Story development tool for novelists","content":"Storyist is a powerful story development tool for novelists and screenwriters. With an intuitive interface that puts you in control, Storyist provides: A word processor with a page layout view and support for headers, footers, and style sheets. A storyboard with customizable story sheets for tracking your plot, characters, and settings. A project manager with […]"},{"link":"https://nmac.to/blog/hookshot/","image":"https://nmac.to/wp-content/uploads/2020/08/Hookshot.png","title":"Hookshot 1.24 – Window manager","content":"Hookshot is cursor movement window snapping.   Features: Snap windows by pressing a modifier key and moving your cursor Snap windows with keyboard shortcuts or by dragging windows to the edge of the screen Move & resize windows by holding a modifier key and moving your cursor Snap windows not in focus   Version 1.24: […]"},{"link":"https://nmac.to/blog/reeder/","image":"https://nmac.to/wp-content/uploads/2020/06/Reeder5.png","title":"Reeder 5.1 – RSS reader","content":"Reader is a news reader for the Mac with support for various sync services.   Reeder adds new features like… The new Bionic Reading mode An in-app Read Later service which syncs with iCloud Image previews in the articles list (finally) An image viewer Much improved article viewer More layout options, including automatic layout depending […]"},{"link":"https://nmac.to/blog/iconjar/","image":"https://nmac.to/wp-content/uploads/2018/04/IconJar1.png","title":"IconJar 2.10.0 – Change the way you organize icons","content":"Iconjar leaves digging through your design asset folders behind and lets you access your icons without the hassle. Your icon organizer is always just one click away. It features incredible support for SVG’s and icon fonts that you can drag-and-drop into any app. It’s no rocket science, we pinky promise.   Browse & preview – […]"},{"link":"https://nmac.to/blog/showkeypro/","image":"https://nmac.to/wp-content/uploads/2021/11/ShowKeyPro.png","title":"ShowKeyPro 1.0.3 – Show Keystroke and mouse event","content":"All the keys you press are displayed in real time.   Show your mouse click event.   It is suitable for scenes such as live broadcast, training and recording demonstration videos.   Automatically switch the display style according to the system theme.   Perfect support for multi-language button display.   It supports the adaptation of […]"},{"link":"https://nmac.to/blog/pdf-to-worddocument-converter/","image":"https://nmac.to/wp-content/uploads/2020/12/PDF-to-WordDocument-Converter.png","title":"PDF to Word&Document Converter 6.2.1 – The Document Converter","content":"PDF to Word&Document Converter is an app that enables you to quickly convert PDF documents into other format files. The app comes with batch processing capabilities. user can easily choose to convert only certain pages for each document.   Key Features: Batch convert PDF to Word files Batch convert PDF to PowerPoint files Batch convert […]"},{"link":"https://nmac.to/blog/privatus/","image":"https://nmac.to/wp-content/uploads/2020/12/Privatus_6.png","title":"Privatus 6.3.6 – Automated privacy protection","content":"Privatus has been designed from the ground up with simplicity in mind. Built for ease of use, there is nothing to configure, no favourites, no whitelists, no blacklists,… no problems! Privatus just works!   Privatus securely removes all tracking cookies, unnecessary cookies, flash cookies, Silverlight, and databases from your Mac, automatically. You can run it […]"}]