[{"link":"https://nmac.to/blog/dayrate/","image":"https://nmac.to/wp-content/uploads/2017/06/DayRate.png","title":"DayRate 5.1 – Currency Exchange Rates Converter","content":"Convert exchange rates for over 160 currencies. Support 12 languages Custom theme colors. Support for over 160 world currencies Exchange rate auto-updates Historical chart Make quick currency calculations into multiple currencies Beautiful flags are shown for every currency Allow sharing currency rate   Version 5.1: Stability improvements   OS X 10.10 or later, 64-bit processor […]"},{"link":"https://nmac.to/blog/mela/","image":"https://nmac.to/wp-content/uploads/2021/09/Mela.png","title":"Mela 1.4.2 – Your personal cookbook","content":"Mela is a simple, elegant and modern recipe manager that syncs with iCloud.   IN-APP BROWSER Quickly save a recipe while browsing: If Mela detects a recipe on the currently viewed page, it will be displayed in Mela’s native recipe viewer*, on the same screen. Want to add or view a recipe from outside of […]"},{"link":"https://nmac.to/blog/advanced-uninstall-manager/","image":"https://nmac.to/wp-content/uploads/2021/08/Advanced-Uninstall-Manager.png","title":"Advanced Uninstall Manager 3.0 – Remove Unnecessary Apps","content":"Advanced Uninstall Manager as the name implies is an application uninstaller. Created by Systweak Software this uninstaller app not only helps uninstall unwanted applications but it also helps boost startup time.   Simply drag and drop the unwanted application onto Advanced Uninstall Manager and delete all its related files in a single click. Additionally, you […]"},{"link":"https://nmac.to/blog/color-folder/","image":"https://nmac.to/wp-content/uploads/2020/07/Color-Folder.png","title":"Color Folder 2.9 – One-click change folder colour","content":"Keeping your files well ordered and categorized is ideal for efficiency and helps to keep things more organized. Another option to help visually locate certain folders is making them have different colored to the standard folder. A standard folder in Finder is blue, ColorFolder can help quickly make a folder looks different with others. Grag […]"},{"link":"https://nmac.to/blog/firetask/","image":"https://nmac.to/wp-content/uploads/2022/01/Firetask_4.png","title":"Firetask 4.6.10 – Innovative task management solution","content":"Firetask empowers project-minded people to get things done efficiently.   From capturing your thoughts and managing your to-dos to organizing and focusing on your most important tasks, Firetask combines David Allen’s Getting Things Done (GTD®) approach with Kanban task management in a unique way.   GETTING THINGS DONE If you don’t know how GTD works […]"},{"link":"https://nmac.to/blog/auto-refresh-page/","image":"https://nmac.to/wp-content/uploads/2022/03/Auto-Refresh-Page.png","title":"Auto Refresh Page 1.0 – Refresh web pages automatically","content":"Refresh web pages automatically. Auto-refresh and page monitor with specified time intervals. Auto clicker.   Auto Refresh Page is a browser extension that automatically refreshes and reloads any page or tab after a specified number of seconds. Just enter the number of seconds between page refreshes and click the “Start” button.   The extension is […]"},{"link":"https://nmac.to/blog/lungo/","image":"https://nmac.to/wp-content/uploads/2020/11/Lungo_2.png","title":"Lungo 2.0.5 – Prevent your Mac from sleeping","content":"Lungo prevents your Mac from falling asleep and your screen from dimming.   Lungo can be useful when: Doing a presentation at work Watching YouTube videos in non-fullscreen mode Reading a long article without scrolling Cooking and having the recipe open on your computer Using the screen to view live stats Monitoring progress on a […]"},{"link":"https://nmac.to/blog/sitesucker/","image":"https://nmac.to/wp-content/uploads/2020/11/SiteSucker4.png","title":"SiteSucker Pro 4.4.1 – Automatically downloads complete Web sites","content":"SiteSucker is an application that automatically downloads Web sites from the Internet. It does this by copying the site’s HTML documents, images, backgrounds, movies, and other files to your local hard drive. Just enter a URL and click a button and SiteSucker can download the entire site.   SiteSucker can be used to make local […]"},{"link":"https://nmac.to/blog/nonotify/","image":"https://nmac.to/wp-content/uploads/2022/03/NoNotify.png","title":"NoNotify 1.1.1 – Do Not Disturb mode for your Mac","content":"Puts your mac in Do Not Disturb mode when you need it!   Lives in the menubar NoNotify lives a quiet life in your menubar. Quickly see at a glance if focus mode is active or not by glancing at the menubar icon.   Focus on the apps that matter to you Select the apps […]"},{"link":"https://nmac.to/blog/jpeg-jackal/","image":"https://nmac.to/wp-content/uploads/2016/09/JPEG-Jackal.png","title":"JPEG Jackal 2.0.6 – Simple, powerful and quick photo optimization tool","content":"Meet JPEG Jackal! JPEG Jackal is simple, powerful and quick tool for home and professional usage, that can help you to optimize pictures size and save disk space. It uses special compression algorithm to give you best jpeg quality.   Features: It’s easy – just drag and drop files or folders with pictures you need […]"}]