[{"link":"https://nmac.to/blog/spotify-audio-converter-platinum/","image":"https://nmac.to/wp-content/uploads/2018/01/Spotify-Audio-Converter-Platinum.png","title":"Spotify Audio Converter Platinum 1.2.1 – Music Converter and DRM removal","content":"Spotify Audio Converter Platinum is a professional Spotify music converter and DRM remover, which can convert all the Spotify music songs and playlists to MP3, AAC, FLAC and WAV, and remove DRM protections from Spotify, so you can play the converted songs on Sony PSP, Sony Walkman, iRiver, the general MP3 player and so on. […]"},{"link":"https://nmac.to/blog/photodirector/","image":"https://nmac.to/wp-content/uploads/2017/09/PhotoDirector10.png","title":"PhotoDirector 10.0.2509.0 – Adjust and edit photos in one application","content":"PhotoDirector offers an extreme blend of features that goes far beyond what you would normally expect to find in photography software. Simplified photo management tools combine with powerfully easy-to-use yet sophisticated adjustment and editing options that offer a complete, end-to-end photo editing and management solution. Layer Editing. – PhotoDirector 9 demystifies layer editing, making this advanced […]"},{"link":"https://nmac.to/blog/design-invitation-templates/","image":"https://nmac.to/wp-content/uploads/2018/02/DesiGN-Invitation-Templates.png","title":"Invitation Templates – DesiGN 2.0.1 – 120 original invitation templates for Pages","content":"Organizing an event? Make sure everyone’s invited stylishly! With 120 original invitation templates, Graphic Node’s Pages Invitations is your trusty companion to craft that perfect invitation for any kind of event. Birthday party, picnic, wedding, Christmas, New Year, Thanksgiving – Pages Invitations have you covered!   Every template is highly-customizable so unleash your creativity: edit, […]"},{"link":"https://nmac.to/blog/owlet/","image":"https://nmac.to/wp-content/uploads/2016/02/Owlet.png","title":"Owlet 1.7 – Unbiasedly Cute 3D Rendering Software","content":"Owlet is a standalone, unbiased, physically-based raytracing renderer. It loads 3D models in many common formats, allows you to compose the scene and setup materials, and then renders resulting images using our state-of-the-art raytracing engine. Owlet provides a sophisticated materials system with support of multi-layer reflection, refraction, subsurface scattering, absorbtion, thin-film interference, image-based lighting and […]"},{"link":"https://nmac.to/blog/gore-guns-cannoli/","image":"https://nmac.to/wp-content/uploads/2019/01/Gore.Guns_.Cannoli.png","title":"Gore, Guns & Cannoli 1.2.21 – Prepare yourself for a non-stop action fights","content":"Welcome to Thugtown circa 1920, the height of Prohibition.   Prepare yourself for a non-stop, action-packed, completely over-the-top, fast-paced, platform game. Set against the gangster heyday of the roaring twenties. Lose yourself in an exciting, elaborate tale of the underground and underworld. Experience friendship, betrayal, vengeance, and witness first hand the rise and fall of […]"},{"link":"https://nmac.to/blog/classicweather/","image":"https://nmac.to/wp-content/uploads/2014/01/ClassicWeather.png","title":"ClassicWeather 4.0.1 – Weather widgets, in the Dock, and in the menu bar","content":"ClassicWeather, the Mac version of the popular iOS weather app ClassicWeather, offers clear weather widgets in 3 different sizes and colors. It also provides weather forecast in the dock and menu bar menu.   ClassicWeather Features Current weather conditions Forecast for 7 days Forecast for next 12 hours Forecast by the hour Forecast in text […]"},{"link":"https://nmac.to/blog/catalog-templates-design/","image":"https://nmac.to/wp-content/uploads/2019/01/Catalog-Templates.png","title":"Catalog Templates – DesiGN 2.0.1 – Collection of beautiful catalog designs for Pages","content":"Present your craft like a professional! Catalog Templates – DesiGN for Pages by Graphic Node is a rich collection of more than 40 beautiful catalog designs to showcase virtually anything! Educate your customers, present, advertise, and sell your goods or services with these amazingly easy-to-use catalog templates!   All catalogs are designed to be highly […]"},{"link":"https://nmac.to/blog/media-player/","image":"https://nmac.to/wp-content/uploads/2017/10/Media-Player.png","title":"iFunia Media Player 3.3.0 – Multi-format Video and Audio Player","content":"iFunia Media Player is a totally FREE video and audio player let you watch movies, play videos and listen music with high definition. It will play almost any video and audio files you throw into it like AVI, MKV, FLV, MP4, F4V, DAT, MOV, MP3, WMA, M4A, 5K/1080p/720p HD videos and more. Just playing your […]"},{"link":"https://nmac.to/blog/publisher-lab/","image":"https://nmac.to/wp-content/uploads/2018/03/Template-Lab.png","title":"Publisher Lab 4.4.4 – Unique page-template designs for Apple Pages","content":"Publisher Lab for Pages (was Templates for Pages, then was Template Lab for Pages) includes a large range of templates, providing a wide selection of documents, from business cards and jewel case covers to brochures and books.   Some templates contain up to 28 different sections, so the package provides an ample array of layouts […]"},{"link":"https://nmac.to/blog/photo-collage-maker-pro/","image":"https://nmac.to/wp-content/uploads/2017/10/Photo.Collage.Maker_.png","title":"Photo Collage-Photo Poster HD 3.4.2 – Easy-to-use photo collage maker","content":"Allows you to create photo collages, scrapbooks, greeting cards, photo calendars, and posters quickly. With an intuitive interface, create stunning picture collages on your mac. You can sharing these self-made collages with your friends and families.   Function Support all photo formats. Add exquisite text to collage. Create collage in any custom size. Pan and […]"}]