[{"link":"https://nmac.to/blog/the-banner-saga-2/","image":"https://nmac.to/wp-content/uploads/2020/07/The-Banner-Saga-2.png","title":"The Banner Saga 2 2.61.02 – Turn-Based Tactics, Strategy & RPG Game","content":"The award-winning adventure continues in Banner Saga 2! This epic, story-based, role-playing game continues its emotional journey across a breaking world. Bold leadership decisions, wise use of resources, and skillful battle tactics are vital to ensure your viking clans make it through alive. Experience what took the indie gaming world by storm in Banner Saga […]"},{"link":"https://nmac.to/blog/the-banner-saga/","image":"https://nmac.to/wp-content/uploads/2020/07/The-Banner-Saga1.png","title":"The Banner Saga 2.60.02 – Turn-Based Tactics, Strategy & RPG Game","content":"Live through an epic role-playing Viking saga where your strategic choices directly affect your personal journey. Make allies as you travel with your caravan across this stunning yet harsh landscape. Carefully choose those who will help fight a new threat that jeopardizes an entire civilization. Every decision you make in travel, conversation and combat has […]"},{"link":"https://nmac.to/blog/battletech/","image":"https://nmac.to/wp-content/uploads/2018/04/BATTLETECH.png","title":"BATTLETECH 1.9.1 – Turn-Based Tactics & Strategy Game","content":"The year is 3025 and the galaxy is trapped in a cycle of perpetual war, fought by noble houses with enormous, mechanized combat vehicles called BattleMechs. Take command of your own mercenary outfit of ‘Mechs and the MechWarriors that pilot them, struggling to stay afloat as you find yourself drawn into a brutal interstellar civil […]"},{"link":"https://nmac.to/blog/the-banner-saga-3/","image":"https://nmac.to/wp-content/uploads/2015/02/The.Banner.Saga_.3.png","title":"The Banner Saga 3 2.60.22 – Turn-Based Tactics, Strategy & RPG Game","content":"Banner Saga 3 is the epic conclusion to a sweeping viking saga six years in the making. This strategic RPG, acclaimed for its strong story and compelling characters has has won over 20 awards and been nominated for 4 BAFTA awards.   As the world crumbles around you, how will you survive when the Darkness […]"},{"link":"https://nmac.to/blog/crusader-kings-ii/","image":"https://nmac.to/wp-content/uploads/2018/07/Crusader-Kings-II.png","title":"Crusader Kings II Include DLCs 3.3.3 – Medieval Strategy & Historical Game","content":"The Dark Ages might be drawing to a close, but Europe is still in turmoil. Petty lords vie against beleaguered kings who struggle to assert control over their fragmented realms. The Pope calls for a Crusade to protect the Christians in the Holy Land even as he refuses to relinquish control over the investiture of […]"},{"link":"https://nmac.to/blog/pdf-plus/","image":"https://nmac.to/wp-content/uploads/2018/04/PDF-Plus.png","title":"PDF Plus 1.3.1 – Merge, split, crop, and watermark PDFs","content":"PDF Plus is a powerful PDF processor that will help you merge, split, watermark and crop PDF documents in just three easy steps. For example, if you want to watermark a set of PDF documents with your company’s logo, PDF Plus will do the job in just a few seconds. Just select the files you […]"},{"link":"https://nmac.to/blog/breaks-for-eyes/","image":"https://nmac.to/wp-content/uploads/2020/07/Breaks-for-Eyes.png","title":"Breaks for Eyes 2.0.0 – Break reminder","content":"Breaks for Eyes is a Mac app that reminds you to take short breaks every 20 minutes. It’s a proven way to avoid eye strain & computer vision syndrome (CVS)   Version 2.0.0: Minor fix   Intel, 64-bit processor macOS 10.13 or later    "},{"link":"https://nmac.to/blog/without-escape/","image":"https://nmac.to/wp-content/uploads/2020/07/Without-Escape.png","title":"Without Escape 1.0 – Point & Click Horror Puzzle Game","content":"Without Escape harkens back to first-person graphic adventures of the early ‘90s, which relied on pre-rendered backgrounds and full-motion video to tell interactive stories. Explore the confines of your own home as you flip between a mundane existence and a horrifying otherworld. Can you escape the nightmare and find the answers you’re looking for?   […]"},{"link":"https://nmac.to/blog/bitmedic-pro/","image":"https://nmac.to/wp-content/uploads/2018/05/BitMedic2.png","title":"BitMedic Pro 3.1.3 – Protection against viruses, adware, and malware","content":"BitMedic Pro was designed specifically for the Mac, and offers a full suite of protection. It gives you simple 3-step protection for the utmost security, keeping your Mac safe from attacks.   3-Step Anti-Virus Protection Full Mac Scan – The Full Mac Scan offers 2 options. Quick Scan will quickly and efficiently scan the most […]"},{"link":"https://nmac.to/blog/pricewatcher/","image":"https://nmac.to/wp-content/uploads/2017/05/PriceWatcher.png","title":"PriceWatcher 1.2.37 – Monitor price changes online","content":"PriceWatcher monitors price changes of items (on Amazon, etc.), and notifies you when the price drops.   Features Supported stores: Amazon, iTunes Send alert by email when prices drop Languages: French, English   Version 1.2.37: Bug fixes   Intel, 64-bit processor macOS 10.13 or later    "}]