[{"link":"https://nmac.to/blog/royal-tsx-1-4-6/","image":"https://nmac.to/wp-content/uploads/2015/01/Royal.TSX_.png","title":"Royal TSX 1.4.6 – Easily access your remote systems","content":"Royal TSX provides easy and secure access to your remote systems.   Royal TSX is the perfect tool for server admins, system engineers, developers, and IT-focused information workers using OS X, who constantly need to access remote systems with different protocols.   Features: Access and manage your connections Credential management Tabbed user interface Connection Plugins […]"},{"link":"https://nmac.to/blog/markdown-life-1-5-1/","image":"https://nmac.to/wp-content/uploads/2015/01/Markdown-Life.png","title":"Markdown Life 1.5.1 – Easy-to-use Markdown editor","content":"Markdown Life is an elegant and easy to use editor with simplicity for the Markdown markup language.   Features: Two columns: the text and the live HTML preview. Syntax highlight. 4 stylish themes. 10 wonderful HTML templates. Code-assist that simplifies your tagging work. Word/character/byte counter. Auto-completion. Line number display with highlight on current line. Large […]"},{"link":"https://nmac.to/blog/instalicious-1-1-1/","image":"https://nmac.to/wp-content/uploads/2015/01/Instalicious.png","title":"Instalicious 1.1.1 – Experience Instagram with elegance","content":"Instalicious is the elegant way to experience Instagram on your Mac. With its clean interface you’ll enjoy browsing your Instagram feed, photos, popular photos, photos you’ve liked, and more. Instalicious is Retina ready and supports a rich gesture based interface that allows you to easily maneuver within the app. A rich set of keyboard shortcuts […]"},{"link":"https://nmac.to/blog/take-five-1-2-2/","image":"https://nmac.to/wp-content/uploads/2015/01/Take-Five-.png","title":"Take Five 1.2.2 – Automatically fade your music back in after a break","content":"Take Five is a simple utility that automatically fades your music back in after 5 minutes after being paused. Life is full of interruptions. How many times have you realized that your headphones are silent because you’d forgotten to un-pause iTunes?   Never again let a call from your Mom, lolcat videos or visits from […]"},{"link":"https://nmac.to/blog/simplekeys-2-5-5/","image":"https://nmac.to/wp-content/uploads/2014/01/SimpleKeys.png","title":"SimpleKeys 2.5.5 – Create keyboard shortcuts for your common tasks","content":"SimpleKeys is a complete rewrite of the popular f-key shortcut program. Now in addition to programing your function keys, SimpleKeys allows you to:   Execute an action with any key combination Now types as fast as the recieving application can accept keystrokes Create Macros by combining multiple actions under a single KeyStroke Import and Export […]"},{"link":"https://nmac.to/blog/tangerine-1-4-3/","image":"https://nmac.to/wp-content/uploads/2015/01/Tangerine.png","title":"Tangerine! 1.4.3 – Creates playlists by analyzing the BPM of your music","content":"Tangerine! lets you easily create playlists of upbeat music, or playlists for relaxing. It works by analyzing the BPM and the beat intensity of your music. Spend your time listening to music, not making playlists.   Version 1.4.3: Fixes a bug where saving a playlist to iTunes 12.0.1 would fail OS X Yosemite compatibility improvements […]"},{"link":"https://nmac.to/blog/menutab-pro-for-facebook-6-4/","image":"https://nmac.to/wp-content/uploads/2015/01/MenuTab.Pro_.for_.Facebook.png","title":"MenuTab Pro for Facebook 6.4 – The Ultimate Facebook App for you MAC","content":"MenuTab Pro for Facebook is the Pro version of the best Mac app for Facebook with these amazing extra features: Color-coded menubar alerts, Desktop mode with chat, Popup notifications, Stealth mode, Full screen support and much more!   MenuTab Pro for Facebook is an incredibly slick and gorgeous app for quickly accessing your Facebook account […]"},{"link":"https://nmac.to/blog/idraw-2-5/","image":"https://nmac.to/wp-content/uploads/2014/01/iDraw.png","title":"iDraw 2.5 – Powerful vector drawing and illustration tool","content":"iDraw is a powerful, feature-packed vector-drawing and illustration application for OS X. It has all the tools you need to create everything from detailed technical illustrations to beautiful works of art. Create intricate designs quickly and easily, and continue working on the go with iDraw for the iPad.   Create resolution-independent illustrations that can be […]"},{"link":"https://nmac.to/blog/hopper-disassembler-3-6-10/","image":"https://nmac.to/wp-content/uploads/2014/02/Hopper.Disassembler.png","title":"Hopper Disassembler 3.6.10 – Binary disassembler, decompiler, and debugger","content":"Hopper Disassembler is a binary disassembler, decompiler, and debugger for 32-bit and 64-bit executables.    This tool will let you disassemble any binary you want, and provide you all the information about its content, like imported symbols, or the control flow graph! Hopper can retrieve procedural information about the disassembled code like the stack variables, […]"},{"link":"https://nmac.to/blog/dragonframe-3-6-1/","image":"https://nmac.to/wp-content/uploads/2015/01/Dragonframe.png","title":"Dragonframe 3.6.1 – Stop motion animation software for creative professionals","content":"Dragonframe is professional-grade software for stop-motion animation, motion design, and visual effects.   Version 3.6.1: Improved camera connectivity on Windows Fixed depth of field preview with Canon DSLRs Fixed Canon EOS 1000D live view magnification Fix RAW conversion on Windows Fix DNG export   Intel OS X 10.6.8 or later QuickTime 7.2 or later   […]"}]