[{"link":"https://nmac.to/blog/camera-lock/","image":"https://nmac.to/wp-content/uploads/2016/07/Camera-Lock.png","title":"Camera Lock 1.6 – Lock your camera and refuse access by any app","content":"Am I being watched? Is my camera on but did I somehow miss the green LED? Thanks to click-jacking, trojan horses and malware, hackers have found ways to turn on your camera without your consent. Camera Lock enables you to lock your camera and refuse access by any app. If a camera was already in […]"},{"link":"https://nmac.to/blog/optimusb/","image":"https://nmac.to/wp-content/uploads/2013/03/OptimUSB.png","title":"OptimUSB 7.2 – Remove temporary files from flash drives and memory cards","content":"OptimUSB is an application that keeps your USB and memory cards optimized. You just need to run OptimUSB before ejecting your USB drive. Any Mac or Windows temporary files get deleted (.DS_Store, .Trashes, .Spotlight-V100, Thumbs.db, etc.). OptimUSB then automatically ejects your drive. Now, your USB drive is clean, optimized and ready to be removed safely. […]"},{"link":"https://nmac.to/blog/shredd-r/","image":"https://nmac.to/wp-content/uploads/2017/09/Shredd-R.png","title":"Shredd-R 1.0 – Shredding beyond Recovery","content":"Shredd-R is recommended application for shredding (destroying) private files beyond recovery   As you may or may not know, deleting a file just hides it from the operating system. It isn’t really gone until that same space is overwritten by something else. And it is easy to recovered using some Recovery tools.   Shredd-R is […]"},{"link":"https://nmac.to/blog/nicecast/","image":"https://nmac.to/wp-content/uploads/2014/01/Nicecast.png","title":"Nicecast 1.11.12 – Create an Internet radio station on your Mac","content":"Nicecast allows you to broadcast your music by creating an Internet radio station or by allowing access to your iTunes Music Library from anywhere in the world.   Version 1.11.12: [Major Enhancement] Instant On has been updated to version 8.4.4, with important crash fixes for macOS 10.13 and many other improvements. [Enhancement] The audio capture […]"},{"link":"https://nmac.to/blog/stream-to-chromecast/","image":"https://nmac.to/wp-content/uploads/2017/09/Stream-to-Chromecast.png","title":"Stream to Chromecast 2.3.0 – Cast All Video Music Formats","content":"Regardless of format limits, wirelessly cast any local video & music files (not web content) to Chromecast, Chromecast Audio, Android TV, and all other Google Cast-enabled devices.   No longer you have to spend hours converting the files to “right” formats beforehand. This app allows you to beam any movie directly from your Mac to […]"},{"link":"https://nmac.to/blog/planner-studio-pro/","image":"https://nmac.to/wp-content/uploads/2017/02/Planner-Studio-Pro.png","title":"Planner Studio Pro 1.4.0 – Manage multiple calendars","content":"Planner Studio Pro is multi-platform calendar-management app which allows you to manage multiple calendars at once by dividing them per user, keeping everything under control. You can connect more Planner Studio workstations on the same database so you can share calendars with other users of other workstations.   Planner Studio is really very flexible and […]"},{"link":"https://nmac.to/blog/parrot/","image":"https://nmac.to/wp-content/uploads/2017/09/Parrot.png","title":"Parrot 2.0.1 – Improve development efficiency","content":"Parrot is a developer tool designed to improve development efficiency. List all available iOS simulators, watchOS simulators, and tvOS simulators with their status Quick access to the app’s Sandbox container, app group directory which installed on the simulators for debug information Quick access to the simulator’s media directory. List all Xcode derived data, module cache, […]"},{"link":"https://nmac.to/blog/ilove-quick-copy/","image":"https://nmac.to/wp-content/uploads/2017/09/iLove-Quick-Copy.png","title":"iLove Quick Copy 1.1.0 – Save and manage all kinds of accounts and their passwords","content":"Having trouble to remember all kinds of accounts and their passwords? Want a tool to help you save and manage your credit card number?   iLove Quick Copy helps Mac users to save and manage those hard to remember but frequently used information efficiently. With this small tool, you can: Write down or paste the […]"},{"link":"https://nmac.to/blog/viewer-for-periscope/","image":"https://nmac.to/wp-content/uploads/2016/07/Viewer-for-Periscope.png","title":"Viewer for Periscope 1.2.3 – Simple viewer for Periscope","content":"Viewer for Periscope allows you to watch streams from Periscope, Twitter’s broadcasting app. Just use File > Open Stream (Cmd+O), and type or paste a URL or nickname in the window that appears. Or you can watch a random stream (Cmd+N)   Version 1.2.3: Crashing fixed   Intel, 64-bit processor OS X 10.11 or later […]"},{"link":"https://nmac.to/blog/portfolio-bar/","image":"https://nmac.to/wp-content/uploads/2017/09/Portfolio-Bar.png","title":"Portfolio Bar 1.2.4 – Stay updated on stocks","content":"Portfolio Bar makes it easy to stay up-to-date on the stocks, ETFs, and investments you care most about. With a highly customizable menu-bar display, you can track up to 20 of your favorite securities and get automatic background updates of their performance throughout the day. Portfolio Bar also makes it easy to view performance of […]"}]