[{"link":"https://nmac.to/blog/record-it/","image":"https://nmac.to/wp-content/uploads/2021/01/Record-It.png","title":"Record It 1.5.4 – Record Screen with Audio","content":"Record It is a light, practical and professional application that performs well in recording screen and sound activity. The tool enables you to capture everything that happens on your screen as video with great quality. It provides all the elements needed to create professional-looking product demonstrations of software application, record online video, capture amazing game […]"},{"link":"https://nmac.to/blog/ableton-live/","image":"https://nmac.to/wp-content/uploads/2020/10/Ableton.Live_.Suite_11.png","title":"Ableton Live Suite 11.0.0 – Record music using digital instruments, loops, and more","content":"Ableton Live lets you create and record music on your Mac. Use digital instruments, pre-recorded sounds, and sampled loops to arrange, produce, and perform your music like never before. Ableton Live is an all-in-one production suite.   Find your sound Start in Arrangement View. Create and edit multitrack recordings in a straightforward linear view. Go […]"},{"link":"https://nmac.to/blog/endnote/","image":"https://nmac.to/wp-content/uploads/2020/06/EndNote_20.png","title":"EndNote 20 Build 16480 – Bibliographic management app","content":"EndNote is used by millions of researchers, scholarly writers, students, and librarians to search online bibliographic databases, organize their references, images and PDFs in any language, and create bibliographies and figure lists instantly. Instead of spending hours typing bibliographies, or using index cards to organize their references, they do it the easy way-by using EndNote! […]"},{"link":"https://nmac.to/blog/ghostreader/","image":"https://nmac.to/wp-content/uploads/2018/10/GhostReader_Plus_2.png","title":"GhostReader Plus 2.4 – Easy to use Text to Speech","content":"GhostReader Plus provides the ultimate Text to Speech authoring solution allowing you to quickly and easily write, edit and markup your text with speech Tags. Create beautiful audiobooks, lively podcasts or proofread your screenplay with all characters having their own voice. You can get full control over which language and voice to use at any […]"},{"link":"https://nmac.to/blog/fontbook/","image":"https://nmac.to/wp-content/uploads/2018/06/FontBook.png","title":"FontBook 5.2.2 – Keeps track of the key codes for font characters","content":"FontBook is the ultimate font utility for all macOSusers who require a quick, easy and comprehensive overview of all their fonts.   Let FontBook display uninstalled fonts on the screen in various layouts. You can print reference pages with selected fonts to assess the typeface, sizes and impression. Or you can find keyboard shortcuts for […]"},{"link":"https://nmac.to/blog/dreamfall-chapters-tfc/","image":"https://nmac.to/wp-content/uploads/2016/06/Dreamfall-Chapters1.png","title":"Dreamfall Chapters: The Final Cut 5.7.8 – A story-driven adventure game","content":"The Final Cut is the ultimate remastered special edition of Dreamfall Chapters — an award-winning episodic adventure spanning multiple worlds and playable characters. Dreamfall Chapters: The Final Cut edition combines all five episodes of the original game into one complete and continuous story, with reworked character designs, an expanded soundtrack, remastered audio and new dialogue, […]"},{"link":"https://nmac.to/blog/mutropolis/","image":"https://nmac.to/wp-content/uploads/2021/02/Mutropolis.png","title":"Mutropolis 1.0.1 – A lovely sci-fi adventure game","content":"It is the year 5000, and the greatest achievements in human history are forgotten. The pyramids, the Mona Lisa, The Fresh Prince of Bel Air – forgotten.   Forgotten by everyone except Henry Dijon and his ragtag team of archaeologists. They left Mars to dig up lost treasures on the wild and inhospitable Planet Earth. […]"},{"link":"https://nmac.to/blog/wrise/","image":"https://nmac.to/wp-content/uploads/2018/10/Wrise_1.png","title":"Wrise 1.5 – Word processor that makes reading and writing accessible for everyone","content":"Wrise is a word processor that makes reading and writing accessible for everyone. Designed to support reading comprehension and text composition it can also be beneficial for individuals with dyslexia. With Text to Speech, word and sentence highlighting, zoom and EasyReading mode texts become more comprehensible and easier on the eyes. With Speak as You […]"},{"link":"https://nmac.to/blog/type-fu/","image":"https://nmac.to/wp-content/uploads/2019/04/Type-Fu.png","title":"Type Fu 4.8.0 – Learn how to type faster without looking at the keyboard","content":"Type Fu is an app that will teach you how to type fast. The right way. On your Mac.   TYPE FU FEATURES UNIVERSAL. The app is suitable for all age groups and skill levels. You can be a beginner, intermediate or advanced typist. Even if you took typing classes before, but it never sank […]"},{"link":"https://nmac.to/blog/gifox/","image":"https://nmac.to/wp-content/uploads/2016/09/Gifox1.png","title":"Gifox 2.2.5 – Record your screen as an animated GIF","content":"Gifox is a beautifully designed and masterfully crafted app that records your screen into animated GIF’s — the great compromise between static images and full-size videos. It’s your best companion for: Micro-screencasts and product demos Animated instructions and bug reporting Selective on-screen video capturing   Version 2.2.5: Improvements: Add import media main menu item. Fixes: […]"}]