[{"link":"https://nmac.to/blog/law-order/","image":"https://nmac.to/wp-content/uploads/2019/06/Law-Order.png","title":"Law & Order: Legacies 1.0.5 – An episodic graphic adventure based on the Law & Order franchise","content":"Gain access to the full season [7 episodes] of Law & Order: Legacies by purchasing the series from the start, which will act as your gateway to obtaining all of the episodes in a season long saga that puts the outcome in your hands.   All 7 Episodes are now available immediately upon purchasing the […]"},{"link":"https://nmac.to/blog/total-war-three-kingdoms/","image":"https://nmac.to/wp-content/uploads/2019/05/Total-War-THREE-KINGDOMS.png","title":"Total War: THREE KINGDOMS 1.0 – Turn-Based Strategy & Historical War Game","content":"Total War: THREE KINGDOMS is the first in the multi award-winning strategy series to recreate epic conflict across ancient China. Combining a gripping turn-based campaign game of empire-building, statecraft and conquest with stunning real-time battles, Total War: THREE KINGDOMS redefines the series in an age of heroes and legends.   China in 190CE   Welcome […]"},{"link":"https://nmac.to/blog/moneydance/","image":"https://nmac.to/wp-content/uploads/2017/10/Moneydance2017.png","title":"Moneydance 2019.2 – Personal finance manager","content":"Moneydance is a full-featured personal financial management application that includes features such as online banking, online bill payment, investment management, budget tracking, scheduled transactions, check printing, detailed graphs, reports and much more. Moneydance’s easy-to-use interface sets it apart from other financial software.   Online Banking. Moneydance can automatically download transactions and send payments online from […]"},{"link":"https://nmac.to/blog/translator/","image":"https://nmac.to/wp-content/uploads/2016/07/Translator.png","title":"Translator 1.2.1 – Translate from English to around sixty world languages","content":"With Translator, you can translate any text between 58 world languages. All you have to do is select your source and target languages, type your text and click on the translation button. It’s as simple as that.   If you need to communicate in a foreign language you don’t speak, then this app IS DEFINITELY […]"},{"link":"https://nmac.to/blog/dead-island/","image":"https://nmac.to/wp-content/uploads/2019/05/Dead-Island.png","title":"Dead Island 1.3.0 – Open World Zombies Action & Survival Game","content":"Terror. Violence. Madness. Bedlam. A holiday paradise gone mad. A tropical island turns into total chaos after a mysterious zombie outbreak. Cut off from the rest of the world, the player’s only chance to survive is to fight to the death and find a way to escape from the island.   Dead Island combines first-person […]"},{"link":"https://nmac.to/blog/dead-effect/","image":"https://nmac.to/wp-content/uploads/2019/05/Dead-Effect.png","title":"Dead Effect 1.0 – Zombies Action & Horror Shooter Game","content":"Fight for your life in the INDIE SCI-FI FPS game fit for both casual and hard-core gamers with a passion for hunting down hordes of zombies. Prepare yourselves for the incoming nightmare!   The ESS Meridian starship is travelling through space with a new FTL technology, heading towards its destination – Tau Ceti f, the […]"},{"link":"https://nmac.to/blog/monosnap/","image":"https://nmac.to/wp-content/uploads/2016/11/Monosnap.png","title":"Monosnap 3.5.8 – Versatile screenshot utility with easy sharing features","content":"Monosnap lets you capture screenshots, share files, and record video and .gifs!   Capture Capture full screen, just part of the screen, or a selected window Make your crop area pixel perfect with our 8x magnifier Customize hotkeys Make timed screenshot Record screencasts Highlight details while recording a video   Annotate and Edit Highlight important […]"},{"link":"https://nmac.to/blog/live-home-3d/","image":"https://nmac.to/wp-content/uploads/2017/08/Live-Home-3D.png","title":"Live Home 3D 3.6.2 – Powerful interior design app","content":"Live Home 3D, a successor to Live Interior 3D, is the powerful yet intuitive home design software that lets you build the house of your dreams right on your Mac. It doesn’t matter whether you’re a homeowner who is planning some upcoming home improvements or a professional interior designer trying to bridge the gap between […]"},{"link":"https://nmac.to/blog/spellarium-4/","image":"https://nmac.to/wp-content/uploads/2019/05/Spellarium-4.png","title":"Spellarium 4 2.0 – Magical Puzzle Game","content":"Your favorite wizard is back but this could be the final adventure. You see, Eric has spent the last 400 years in service to the Gods, but his time is running out and the Gods don’t seem interested in prolonging his life! Join your favorite wizard on his quest to grow the Tree of Life […]"},{"link":"https://nmac.to/blog/securecrt/","image":"https://nmac.to/wp-content/uploads/2016/06/SecureCRT8.png","title":"SecureCRT 8.5.3 – Terminal emulation for IT professionals","content":"SecureCRT provides rock-solid terminal emulation for computing professionals, raising productivity with advanced session management and a host of ways to save time and streamline repetitive tasks. SecureCRT provides secure remote access, file transfer, and data tunneling for everyone in your organization.   Version 8.5.3: Change: Treat the [email protected] key-exchange algorithm as synonymous to the curve25519-sha256 […]"}]