[{"link":"https://nmac.to/blog/phonetrans/","image":"https://nmac.to/wp-content/uploads/2020/12/PhoneTrans.png","title":"PhoneTrans 5.1.0 – 1-Click Phone to Phone Transfer Software","content":"PhoneTrans bridges the gap, and makes it one-click easy to migrate everything you need freely across iOS and Android phones & tablets, in any way you want.   PhoneTrans offers 3 device-to-device migration options for you to transfer data directly from phone to phone. No matter you want to move everything in one click or […]"},{"link":"https://nmac.to/blog/metaimage/","image":"https://nmac.to/wp-content/uploads/2020/11/MetaImage_1.png","title":"MetaImage 1.9.7 – Edit images’ metadata","content":"MetaImage is a tool to read, write and edit images metadata. This editor allows you to edit EXIF, IPTC and XMP tags as well as MakerNotes in a beautiful and familiar interface.   The application has been designed to improve your workflow. Users can create and manage presets. Moreover, a special support is provided for […]"},{"link":"https://nmac.to/blog/snow-daze/","image":"https://nmac.to/wp-content/uploads/2020/01/Snow-Daze.png","title":"Snow Daze 1.27 – Create a snowy day memory with your picture","content":"We all love a snow day. Whether you enjoy being let out of school, sitting by a fire drinking hot chocolate, staring out the window and watching the flakes fall, kids yelling and screaming as they play, or just standing and listening to the serene quit that snow brings. A snow day is a day […]"},{"link":"https://nmac.to/blog/romantic-photo/","image":"https://nmac.to/wp-content/uploads/2014/01/Romantic-Photo.png","title":"Romantic Photo 2.3.5 – Create a romantic mood in your photo","content":"Romantic Photo creates a romantic mood or setting automatically from any picture. Using exquisite lighting and design, your photos will look like they were taken using the highest professional techniques & filters.   Romantic Photo gives you 30+ combinations of award-winning photography effect filters. With just one click this time saving app gives the look […]"},{"link":"https://nmac.to/blog/grabit/","image":"https://nmac.to/wp-content/uploads/2014/06/GrabIt.png","title":"GrabIt 4.930 – Screen capture utility","content":"GrabIt grabs anywhere on the screen as an image and shows you instantly.   Features: Cmd+Option+B: Grab It! Drag: Move images Double Clicks: Make images small Right-Click Drag: Drag as a file Cmd + w with mouse on the image: Close the image   Version 4.930: Supports Apple silicon macs Renewed app icon No longer […]"},{"link":"https://nmac.to/blog/task-calendar/","image":"https://nmac.to/wp-content/uploads/2020/12/Task-Calendar.png","title":"Task Calendar 1.4 – Calendars, Events & Reminders","content":"Task Calendar is a reliable calendar app for macOS. It includes calendar, integrated to dos, travel time schedule, reminders which syncs with App calendar events.   Features Display calendar in Day, Week, Month, Year and List views To Dos are integrated into your calendar, display on the date or time they are due, and carry […]"},{"link":"https://nmac.to/blog/sonic-racing/","image":"https://nmac.to/wp-content/uploads/2020/12/Sonic-Racing.png","title":"Sonic Racing 1.3.0 – Super Speed Racing","content":"The world’s fastest hedgehog is back in SONIC RACING! Take control of one of 15 playable characters from the Sonic universe and compete in the ultimate multiplayer racing experience. COLLECT power-ups, SET traps and ATTACK competitors all while driving at high speed. Ready, Set, RACE!   DECIDE HOW YOU WANT TO PLAY! Enjoy single-player mode, play with your friends or […]"},{"link":"https://nmac.to/blog/warp-drive/","image":"https://nmac.to/wp-content/uploads/2020/12/Warp-Drive.png","title":"Warp Drive 1.031 – Teleportation Racing Game","content":"WARP DRIVE is a fast-paced, arcade style racing game with a brand new way to drive: instantly TELEPORT around the track to find shortcuts and hidden routes! Take control of your QUAD ROTOR RACER, equip a Warp Module, and enter a series of high-speed tournaments to test your skills and creative driving abilities. Drive on […]"},{"link":"https://nmac.to/blog/claires-cruisin-cafe-collectors-edition/","image":"https://nmac.to/wp-content/uploads/2020/12/Claires-Cruisin.png","title":"Claire’s Cruisin’ Cafe Collector’s Edition 1.0 – Time Management Game","content":"Set off on a cross-country journey to feed the famished masses!   Guide an aspiring super chef named Claire as she serves her customers a variety of haute cuisine from her suped up food truck. As you help Claire and her crew race to keep up with demand, you’ll perform tasks ranging from prepping dishes […]"},{"link":"https://nmac.to/blog/atom-rpg/","image":"https://nmac.to/wp-content/uploads/2017/05/ATOM.RPG_.Post_.apocalyptic.png","title":"ATOM RPG 1.75 – A post-apocalyptic indie game","content":"ATOM RPG is a post-apocalyptic indie game, inspired by classic CRPGs: Fallout, Wasteland, System Shock, Deus Ex, Baldur’s Gate and many others.   In 1986 both the Soviet Union and the Western Bloc were destroyed in mutual nuclear bombings. You are one of the survivors of the nuclear Holocaust. Your mission – to explore the […]"}]