[{"link":"https://nmac.to/blog/mind-dead-1-0/","image":"https://nmac.to/wp-content/uploads/2016/08/Mind-Dead.png","title":"Mind Dead 1.0 – Action & Survival Game","content":"Play as Max Cooper, an SSF agent whose journey to a deserted oil producing community with a group of scientists has led to an outbreak of infection back at their research facility.   Fight hard for survival as you battle the hordes of fierce infectees in this action survival game.   Key Game Features  A […]"},{"link":"https://nmac.to/blog/mafia-ii-1-1/","image":"https://nmac.to/wp-content/uploads/2016/08/Mafia-II.png","title":"Mafia II 1.1 – Rise through the ranks of a mob family","content":"Vito Scaletta has started to make a name for himself on the streets of Empire Bay as someone who can be trusted to get a job done. Together with his buddy Joe, he is working to prove himself to the Mafia, quickly escalating up the family ladder with crimes of larger reward, status and consequence… […]"},{"link":"https://nmac.to/blog/memory-doctor-pro-1-0-1/","image":"https://nmac.to/wp-content/uploads/2016/08/Memory-Doctor.png","title":"Memory Doctor Pro 1.0.1 – Boost & Free Memory – Cleaner, Optimizer & Diagnose","content":"Memory Doctor is the fastest way to clean memory (ram) on your Mac. With a powerful & Yosemite inspired interface, your Mac will be optimized especially when cleaning after using an intensive app or game. Fastest memory cleaner for Mac Menu bar tab with free memory displayed Auto-clean memory at a certain level HotKey to […]"},{"link":"https://nmac.to/blog/command-center-1-0-6/","image":"https://nmac.to/wp-content/uploads/2016/07/Command.Center.png","title":"Command Center 1.0.6 – Minimalist multi-utility app","content":"Command Center (was Control Center) is a new utility app for macOS, inspired by Control Center. We’ve created a beautiful tool designed to let you control and monitor most aspects of your Mac. It is a panel that auto-hides on the side of the screen, and is activated by mouse (like the Dock). The panel […]"},{"link":"https://nmac.to/blog/browser-care-3-1-3/","image":"https://nmac.to/wp-content/uploads/2016/07/Browser-Care3.png","title":"Browser Care 3.1.3 – Browser maintenance app","content":"Browser Care is a powerful application that allows you to keep your browsers clean and under control since navigating accumulates files on your Mac.   Features Care. A button for everything. Take Care of your browser to recover space on your Mac. Simple presets. Convenient presets that are fast and easy (even for beginners). Items […]"},{"link":"https://nmac.to/blog/weather-calculator-1-0/","image":"https://nmac.to/wp-content/uploads/2016/08/Weather.Calculator.png","title":"Weather Calculator 1.0 – Perform meteorological calculations","content":"Weather Calculator comprises a selection of 6 different calculators that will simplify calculations which have given you headaches so far. Complex calculations, such as Cyclone Radial Velocity, Cloud Base, and others will be handled easily with this app. Cyclone radial velocity Cloud base Rain water harvest Saturated / actual water vapour pressure Heat index Wind […]"},{"link":"https://nmac.to/blog/smilebook-1-1-0/","image":"https://nmac.to/wp-content/uploads/2016/08/SmileBook.png","title":"SmileBook 1.1.0 – Easy drag and drop images collector","content":"SmileBook – Images collector. collect images from web or QQ conversation easily by drag and drop.   You can use the images collected when you writing your blog or have a QQ conversation with your friends easily by double click one of them or just drag and drop.   The saved images have a colored […]"},{"link":"https://nmac.to/blog/imagemaker-1-0/","image":"https://nmac.to/wp-content/uploads/2016/08/ImageMaker.png","title":"ImageMaker 1.0 – DMG and ISO image files maker","content":"ImageMaker is a tool for making image files of DMG and ISO. It is easy to use and has been localized into 31 languages.   Version 1.0: initial release   OS X 10.8 or later, 64-bit processor    "},{"link":"https://nmac.to/blog/video-editor-enhancer-1-0-25/","image":"https://nmac.to/wp-content/uploads/2016/08/Video.Editor.Enhancer.png","title":"Video Editor Enhancer 1.0.25 – Video editing/video quality enhancer","content":"Video Editor Enhancer does everything to supply you a visual feast by improving video quality better and better. It is the best video editing software to edit your video, enhance the video quality and the viewing experience. It is capable of increasing video resolution, automatically adjusting video brightness and contrast ratio, and removing video noise. […]"},{"link":"https://nmac.to/blog/phototangler-1-1/","image":"https://nmac.to/wp-content/uploads/2016/08/PhotoTangler.png","title":"PhotoTangler 1.1 – Turn your favorite photos into beautiful collages","content":"PhotoTangler is a simple yet powerful tool for turning your favorite photos into beautiful collages! Simply import your images or add text captions, and PhotoTangler will instantly blend them together as you work with them.   Version 1.1: Bug fixes, interface and improvements.   OS X 10.6.6 or later    "}]