[{"link":"https://nmac.to/blog/mindnode-pro-1-10-6-1/","image":"https://nmac.to/wp-content/uploads/2014/09/MindNode.png","title":"MindNode Pro 1.10.6.1 – Elegant mindmapping application","content":"MindNode Pro is a powerful and intuitive mind mapping application. Its focus and flexibility make it the perfect tool for brainstorming and organizing your life – and iCloud sharing means you always have your mind maps with you. MindNode lets you lay out your notes and tasks visually so you can get a bird’s-eye view […]"},{"link":"https://nmac.to/blog/data-rescue-4-0/","image":"https://nmac.to/wp-content/uploads/2014/03/Data.Rescue.png","title":"Data Rescue 4.0 – Powerful hard drive data recovery solution","content":"Data Rescue is a robust and reliable data recovery solution for your Mac. Data Rescue has a 5-star average rating on the Mac App Store a 4.5 star rating on Amazon, in addition to over 150 industry awards for best-in-class Mac recovery since it’s debut in 2002. Works on all Mac hard drives even if […]"},{"link":"https://nmac.to/blog/dragon-dictate-4-0-4/","image":"https://nmac.to/wp-content/uploads/2014/09/Dragon.Dictate.png","title":"Dragon Dictate 4.0.4 – Premium voice recognition solution","content":"With Dragon Dictate speech recognition software, you can use your voice to create and edit text or interact with your favorite Mac applications. Far more than just speech-to-text, Dragon Dictate lets you create and edit documents, manage email, surf the Web, update social networks, and more – quickly, easily and accurately, all by voice. Open […]"},{"link":"https://nmac.to/blog/reference-tracker-2-2/","image":"https://nmac.to/wp-content/uploads/2014/09/Reference-Tracker.png","title":"Reference Tracker 2.2 – Create documents to store citations and references","content":"Reference Tracker is an indispensable tool for writers, researchers or students. Reference Tracker helps you keep track of publications you cite or make reference to in an essay or research project, and creates formatted reference lists and bibliographies.   Create Full References In A Single Step With Reference Tracker’s Publication Lookup, all you need is […]"},{"link":"https://nmac.to/blog/tab-launcher-2-6/","image":"https://nmac.to/wp-content/uploads/2013/12/Tab-Launcher.png","title":"Tab Launcher 2.6 – Clean up and organize the Dock","content":"The idea of Tab Launcher is not to replace the system’s dock, but to help keep it clean, with only the applications that are currently running.   By removing all the application from the dock and organizing them on tabs, you can quickly find and run any application you want.   Apart from that, you […]"},{"link":"https://nmac.to/blog/receiptbox-2-2/","image":"https://nmac.to/wp-content/uploads/2014/03/receiptbox.png","title":"ReceiptBox 2.2 – Keep track of your receipts","content":"ReceiptBox is a very easy to use application designed to help you keep track of your receipts.   Features: Organize your receipts into multiple accounts. Import-export to file Receipts templates Autocompletes receipt data Search into records Print report Total amount per expenses category   Version 2.2: Fix crash on export to excel when category is […]"},{"link":"https://nmac.to/blog/radium-3-0-9/","image":"https://nmac.to/wp-content/uploads/2014/03/Radium.png","title":"Radium 3.0.9 – Multi-network radio player","content":"Radium is an Internet radio player that’s designed from the ground up to be simple, intuitive, and lightweight. With its powerful search, thousands of supported stations (including Sirius/XM and DI.fm/Sky.fm Premium), and the ability to add your own streams, Radium will change the way you listen to Internet radio.   Version 3.0.9: Reduced energy usage […]"},{"link":"https://nmac.to/blog/iclipboard-5-0/","image":"https://nmac.to/wp-content/uploads/2014/03/iClipboard.png","title":"iClipboard 5.0 – A flexible clipboard manager","content":"iClipboard automatically keeps a history of everything you copy to the clipboard from any application. You can then paste any clipping from the history five different ways:   the Shelf on the side of the screen; the special menu in the menu bar; the Rapid-Fire hot key; the Services menu; or the ALL-NEW Paste Blaster. […]"},{"link":"https://nmac.to/blog/condense-1-5/","image":"https://nmac.to/wp-content/uploads/2014/09/Condense.png","title":"Condense 1.5 – Optical character recognition (OCR) application","content":"Typing out has come to an end. Say ‚Hello‘ to Condense. Your easy to use optical character recognition (OCR) application.   Imagine one of the following scenarios:   You’re writing an essay for University and you’ve to quote from a PDF, an EBook or one of your professor’s presentations? That’s a huge amount of text […]"},{"link":"https://nmac.to/blog/timing-1-4-2/","image":"https://nmac.to/wp-content/uploads/2014/09/Timing.png","title":"Timing 1.4.2 – Discover how you spend time on your Mac","content":"Timing is the best way to keep track of the time you spend with your Mac. Find out where your time goes — without ever having to start a timer again!   Timing automatically tracks which documents you are editing, which applications you use, and the domains of the websites you visit. You’ll never have […]"}]