[{"link":"https://nmac.to/blog/sunless-skies/","image":"https://nmac.to/wp-content/uploads/2019/02/Sunless-Skies.png","title":"Sunless Skies: Sovereign Edition 2.0.3 – A Horror roleplay game with a focus on exploration","content":"Sunless Skies is a Gothic Horror roleplay game with a focus on exploration and exquisite storytelling.   Command a flying steam locomotive The only thing between you and the waste-winds, storms and cosmic lightning is your engine. Tend and upgrade it, buy weaponry and exotic equipment, and keep her hull in good shape to hold […]"},{"link":"https://nmac.to/blog/extra-voice-recorder/","image":"https://nmac.to/wp-content/uploads/2015/02/eXtra-Voice-Recorder3.png","title":"eXtra Voice Recorder 3.3 – Record, edit, and sync with Dropbox","content":"eXtra Voice Recorder is a combination of a powerful, high-quality audio recorder and an easy-to-use audio-file manager. This handy tool is always with you, so all you need to do to start recording is to hit a hotkey. You can add notes and photos to each recording, bookmark important parts for ease of navigation, continue […]"},{"link":"https://nmac.to/blog/speakeramp/","image":"https://nmac.to/wp-content/uploads/2021/09/SpeakerAmp.png","title":"SpeakerAmp 2.6 – Boost & Enhance System Volume","content":"Equalize and boost your system audio with 31 band equalizer, up to 10x volume booster and 3-D surround.   The app has 2 modes: Free and Pro. The Free mode covers most of the functionality, incl. equalizer and volume booster. The Pro has a 20-hour trial period and is for one non-recurring fee.   FREE […]"},{"link":"https://nmac.to/blog/wifi-wireless-signal-strength-explorer/","image":"https://nmac.to/wp-content/uploads/2017/03/Wifi-Status.png","title":"WiFi Wireless Signal Strength Explorer 2.2 – See wireless signal strength in the menu bar","content":"WiFi Wireless Signal Strength Explorer (was WiFi Signal Strength Status) allows you to see wireless signal strength right on the menu bar. See the status of your wifi signal strength right from the menu bar. This utility adds network name, signal strength with “neat icon”, “percentage” on the menu bar. It also which lets you […]"},{"link":"https://nmac.to/blog/adobe-lightroom-classic-cc/","image":"https://nmac.to/wp-content/uploads/2020/04/Adobe-Lightroom-Classic9.png","title":"Adobe Lightroom Classic 10.4 – Import, develop, and showcase volumes of digital images","content":"Adobe Lightroom Classic (was Adobe Lightroom) software helps you bring out the best in your photographs, whether you’re perfecting one image, searching for ten, processing hundreds, or organizing thousands.   Create incredible images that move your audience. Experiment fearlessly with state-of-the-art nondestructive editing tools. Easily manage all your images. And showcase your work in elegant print […]"},{"link":"https://nmac.to/blog/adobe-bridge-cc/","image":"https://nmac.to/wp-content/uploads/2020/06/Adobe-Bridge-CC-2020.png","title":"Adobe Bridge 2021 11.1.1 – Powerful media manager for Creative Suite","content":"Adobe Bridge provides you with centralized access to all the media assets you need for your creative projects. Batch edit with ease, add watermarks, and even set centralized color preference — Bridge simplifies your workflow and keeps you organized.   Version 11.1.1: Bridge hangs intermittently while generating PDF previews. Bridge crashes while clicking the Apply button […]"},{"link":"https://nmac.to/blog/adobe-premiere-pro-cc/","image":"https://nmac.to/wp-content/uploads/2020/06/Adobe-Premiere-Pro-2020.png","title":"Adobe Premiere Pro CC 2021 15.4.1 – Digital video editing tool","content":"Adobe Premiere Pro CC lets you edit video faster than ever before. Dozens of brand-new features include a redesigned timeline, improved media management, and streamlined color grading. And it’s just the beginning: You’ll get access to new features the moment they’re released. Your entire creative world, together in one place. Only in Creative Cloud.   Version […]"},{"link":"https://nmac.to/blog/divinity-original-sin/","image":"https://nmac.to/wp-content/uploads/2015/12/Divinity.Original.Sin2_.png","title":"Divinity: Original Sin 2 – Definitive Edition 3.6.117.3735 – Top-down fantasy RPG Game","content":"The Divine is dead. The Void approaches. And the powers lying dormant within you are soon to awaken. The battle for Divinity has begun. Choose wisely and trust sparingly; darkness lurks within every heart.   Who will you be? A flesh-eating Elf, an Imperial Lizard or an Undead, risen from the grave? Discover how the […]"},{"link":"https://nmac.to/blog/tuneskit-video-repair/","image":"https://nmac.to/wp-content/uploads/2020/10/TunesKit-Video-Repair.png","title":"TunesKit Video Repair 1.1.0 – Fix Various Corrupted Videos","content":"Top-notch video repair software to fix up to 25+ types of corrupted or unplayable video and audio files in one click, including sluggish videos, out of sync, no sound, choppy or blurry videos, etc.   Effectively repair corrupt, broken, damaged or unplayable videos in 3 quick steps How can I fix corrupted video files? No […]"},{"link":"https://nmac.to/blog/klipped/","image":"https://nmac.to/wp-content/uploads/2018/10/Klipped_1.png","title":"Klipped 1.15 – Text editor with an extremely simple feature set","content":"Klipped is a text editor with an extremely simple feature set. Write ideas down. Paste text and use as a clipboard, Delete when you’re done. No files, no spell checker, no syntax highlighting. Dictate ideas. Paste code snippets. Take notes.   Version 1.15: Resolves an issue where the app was showing on all Desktops   […]"}]