[{"link":"https://nmac.to/blog/exporter-for-contacts/","image":"https://nmac.to/wp-content/uploads/2017/08/Exporter-for-Contacts.png","title":"Exporter for Contacts 1.13 – Export data from Apple Address Book","content":"Exporter for Contacts (was Export Address Book) is a popular Mac app to export contact data from Apple’s Contacts into various formats, capable of organizing export setups in customizable templates to make repeated exports a lot easier. The app lets you export selected contacts, groups, and whole address books to a CSV or a native […]"},{"link":"https://nmac.to/blog/scapple/","image":"https://nmac.to/wp-content/uploads/2014/10/Scapple1.png","title":"Scapple 1.4 – Free-form mind mapping tool","content":"Scapple is the software equivalent of how I work out my rough ideas on paper. (If I didn’t hate the word “brainstorming” so much, I’d probably call it brainstorming software.) When I’m in the early stages of any project, whether that’s a writing project or a software project, I tend to throw a bunch of […]"},{"link":"https://nmac.to/blog/simpleplanes/","image":"https://nmac.to/wp-content/uploads/2019/03/SimplePlanes.png","title":"SimplePlanes 1.10.106 – Flight Building & Simulation Game","content":"You have the tools you’ll need to bring any airplane to life. Snap parts together to build your airplane’s body. Place engines to add thrust. Design and attach wings and then strap yourself into the cockpit and see how it flies.    DOWNLOAD AIRPLANES Over 100,000 airplanes are available to download for free from SimplePlanes.com […]"},{"link":"https://nmac.to/blog/jenny-leclue-detectivu/","image":"https://nmac.to/wp-content/uploads/2019/09/Jenny-LeClue-Detectivu.png","title":"Jenny LeClue – Detectivu 2.1.1 – A thrilling mystery adventure game","content":"Jenny LeClue is a thrilling story of mystery, adventure and growing up. Set in the sleepy town of Arthurton, the game is filled with memorable, complex characters and rendered in a unique aesthetic.    Embrace the choosiness and shape the metanarrative. You are not the only guiding hand shaping Jenny’s destiny, but your choices will […]"},{"link":"https://nmac.to/blog/where-cards-fall/","image":"https://nmac.to/wp-content/uploads/2020/11/Where-Cards-Fall.png","title":"Where Cards Fall 1.4.2 – A Slice Adventure & Puzzles Game","content":"Where Cards Fall is a slice of life story where you build houses of cards to bring formative memories to life. Create pathways through dreamlike spatial puzzles to navigate the insecurities and emotions of high school and beyond.   50 challenging spacial puzzles that exercise your imagination and strategic thinking skills A captivating coming-of-age story […]"},{"link":"https://nmac.to/blog/aquarium-4k/","image":"https://nmac.to/wp-content/uploads/2018/09/Aquarium_4K_1.png","title":"Aquarium 4K 1.0.4 – UltraHD wallpaper and screensaver","content":"Introducing Aquarium 4K, an innovative and insanely beautiful wallpaper application. Aquarium 4K features more than twenty stunning themes, with each theme featuring breathtaking 4K video and beautiful, cutting-edge widgets. 4K videos include a huge variety of exotic fish; including: stingrays, jellyfish, catfish, clown fish, lion fish, sea horses, alligators, and much more! Also visit a […]"},{"link":"https://nmac.to/blog/this-war-of-mine/","image":"https://nmac.to/wp-content/uploads/2014/11/This.War_.of_.Mine_.png","title":"This War of Mine 6.0.8 – Take control of your soldier and manage the survival","content":"In This War Of Mine you do not play as an elite soldier, rather a group of civilians trying to survive in a besieged city; struggling with lack of food, medicine and constant danger from snipers and hostile scavengers. The game provides an experience of war seen from an entirely new angle.   The pace […]"},{"link":"https://nmac.to/blog/djvu-to-pdf-converter/","image":"https://nmac.to/wp-content/uploads/2020/11/DjVu-To-PDF-Converter.png","title":"DjVu To PDF Converter 2.0 – Simplest way to read DjVu","content":"DjVu To PDF Converter is an app that lets you easily convert any DjVu file to PDF document. After conversion document can be opened with any reader supporting PDF (even mobile or portable).   Why use converter instead of reader? Most of the readers are actually converters with integrated PDF viewer. And lets say it, […]"},{"link":"https://nmac.to/blog/typinator/","image":"https://nmac.to/wp-content/uploads/2017/09/Typinator7.png","title":"Typinator 8.5 – Speedy and reliable text expansion solution","content":"Typinator turbo-charges your typing productivity.   Type a little. Typinator does the rest.   We’ve all faced projects that require repetitive typing tasks. With Typinator, you can store commonly used text and images in quick keywords and abbreviations. From email templates to code snippets to website URLs, there’s no easier way to recreate repetitive text […]"},{"link":"https://nmac.to/blog/jixii/","image":"https://nmac.to/wp-content/uploads/2020/11/JiXii.png","title":"JiXii 3.7 – Jigsaw puzzle, use your own picture","content":"JiXii is a jigsaw puzzle game that allows you to use your own images to break apart and put back together again. You can change settings (such as image size, number of pieces, piece patterns), game sounds and appearance (background colors, highlight method, option for piece outlines, seamless pieces). Timer is available to keep your […]"}]