[{"link":"https://nmac.to/blog/pure-music-3-0-6/","image":"https://nmac.to/wp-content/uploads/2016/07/Pure-Music.png","title":"Pure Music 3.0.6 – High resolution music server software","content":"Pure Music is a high resolution music server software that is based on the acclaimed Pure Vinyl playback engine and can dock with iTunes, which it uses as a database and playlist organizer.   Features: Automatically docks with iTunes window Up to 384 kHz sample rate DSD (2.8 and 5.6 MHz) file playback on any […]"},{"link":"https://nmac.to/blog/easybatchphoto-3-3/","image":"https://nmac.to/wp-content/uploads/2016/07/EasyBatchPhoto.png","title":"EasyBatchPhoto 3.3 – Batch compress, resize and convert photos","content":"EasyBatchPhoto allows you to batch-compress, resize, and convert photos.   Photographers and webmasters often find themselves spending too much time converting, resizing and watermarking (with copyright, for example) images.   EasyBatchPhoto frees you from these repetitive tasks by processing hundreds, or even thousands, of images with a single drag-and-drop. EasyBatchPhoto performs many other common functions […]"},{"link":"https://nmac.to/blog/brainwave-studio-1-5/","image":"https://nmac.to/wp-content/uploads/2016/07/Brainwave-Studio.png","title":"Brainwave Studio 1.5 – Ambient sound system with isochronic tones","content":"Brainwave Studio is a professionally designed relaxation, stress-relief, sleep-support, meditation, and mind-training system, with 40 sessions of carefully selected nature sounds and superb quality ambient music.   How does it work? Brainwave Studio uses isochronic tones, widely regarded as the superior brainwave tone. Isochronic tones pulse at specific frequencies, and stimulate the brain to help […]"},{"link":"https://nmac.to/blog/home-scan-1-04/","image":"https://nmac.to/wp-content/uploads/2016/07/Home-Scan.png","title":"Home Scan 1.04 – Connected Home Security Scanner","content":"Are your home network and connected devices secure? Use Home Scan to find your network security risks and monitor what is connected to your network. This simple to use app includes professional features but allows even the inexperienced user to get an understandable overview of the network and running services. A simple and intuitive interface […]"},{"link":"https://nmac.to/blog/vault-password-manager-plus-2-6-0/","image":"https://nmac.to/wp-content/uploads/2016/07/Vault.Password.Manager.Plus_.png","title":"Vault Password Manager Plus 2.6.0 – Menu-bar password manager with browser extensions","content":"Vault Password Manager Plus is an easy to use menu bar password manager including browser extensions for Safari, Chrome, and Firefox. You can access all features in one window with just a single click. Find your logins easily via a search field. Unlock and copy your login data within a second. Auto-lock will protect your […]"},{"link":"https://nmac.to/blog/vault-101-1-4-5/","image":"https://nmac.to/wp-content/uploads/2015/08/Vault.101.png","title":"Vault 101 1.4.5 – Protect critical data with AES-256 encryption. Optionally share online","content":"Vault 101 will help you keep your data protected via strong AES-256 encryption, 256-bit Advanced Encryption Standard. Password-protect files and folders in 3 easy steps: choose the source folder; set capsule name and password; click “Create”.   Easy Access to Your Encrypted Data Since your capsule is encrypted, it’s not possible for others to read […]"},{"link":"https://nmac.to/blog/ssh-tunnel-16-07/","image":"https://nmac.to/wp-content/uploads/2015/03/SSH.Tunnel.png","title":"SSH Tunnel 16.07 – Easily manage and control ssh tunnels","content":"SSH Tunnel allows you to easily manage and precisely control your ssh tunnels.   SSH Tunnel is able to remember the ssh login password and save it to OS X’s keychain. Furthermore, SSH Tunnel is designed to automatically reconnect when your Mac is waking up from sleep.   Notable Features: Auto launch when log in […]"},{"link":"https://nmac.to/blog/pinegrow-web-designer-2-91/","image":"https://nmac.to/wp-content/uploads/2015/04/Pinegrow.Web_.Designer.png","title":"Pinegrow Web Designer 2.91 – Mockup and design webpages faster","content":"Pinegrow Web Designer is desktop app that lets you mockup and design webpages faster with multi-page editing, CSS and LESS styling, and smart components for Bootstrap, Foundation, Angular JS, and WordPress.   Version 2.91: WordPress Starter Theme 1.2 has lots of useful improvements like new LIB components, bbPress support, automatic plugin installation, custom backgrounds and […]"},{"link":"https://nmac.to/blog/home-scan-1-03/","image":"https://nmac.to/wp-content/uploads/2016/07/Home-Scan.png","title":"Home Scan 1.03 – Connected Home Security Scanner","content":"Are your home network and connected devices secure? Use Home Scan to find your network security risks and monitor what is connected to your network. This simple to use app includes professional features but allows even the inexperienced user to get an understandable overview of the network and running services. A simple and intuitive interface […]"},{"link":"https://nmac.to/blog/gif-recorder-1-0/","image":"https://nmac.to/wp-content/uploads/2016/07/Gif-Recorder.png","title":"Gif Recorder 1.0 – Record Your Screen","content":"Gif Recorder makes it easy to capture screen recordings on your Mac. Simply select the area on your screen you want to capture/record, then save and share the recording with others.   Gif Recorder is ideal for: Capturing how to reproduce software bugs Demonstrating usage/functionality of an app Creating tutorials A/B testing Design prototypes   […]"}]