[{"link":"https://nmac.to/blog/cryptoedit/","image":"https://nmac.to/wp-content/uploads/2016/05/CryptoEdit.png","title":"CryptoEdit 2.4 – Create and protect word processing files","content":"CryptoEdit is a simple, powerful, and secure application to create and edit documents which are encrypted by default. It can manage TEXT, RTF, and RTFD (with images) format. Documents saved to disk are always encrypted, and it is the ideal solution to manage reserved documents with formatted text and images.   CryptoEdit works as a […]"},{"link":"https://nmac.to/blog/ts-calc/","image":"https://nmac.to/wp-content/uploads/2021/04/TS-Calc.png","title":"TS Calc 1.7.2 – Mathematical calculation for technical fields","content":"TS Calc is an application entirely written in Cocoa and Objective-C dedicated to mathematical calculation for technical fields. Its purpose is to provide an application able to offer an ideal platform to solve mathematical models applied to technical problems of various type.   TS Calc is a document based application and its document can be […]"},{"link":"https://nmac.to/blog/contacts-to-qr-codes/","image":"https://nmac.to/wp-content/uploads/2021/04/Contacts-to-QR-Codes.png","title":"Contacts to QR Codes 1.6.1 – Create QR codes from address-book contacts","content":"Contacts to QR Cards Pro lets you create many conference / meetup cards with QR codes, or just many QR codes for your business cards.   Creating several QR codes for business cards / name badges can be a pain in the neck. With this application, you can add/import contacts and create conference cards or QR […]"},{"link":"https://nmac.to/blog/bitcoin-bar/","image":"https://nmac.to/wp-content/uploads/2017/12/Bitcoin-Bar.png","title":"Bitcoin Bar 1.3.1 – Menu bar Bitcoin currency tracker","content":"Bitcoin Bar is a menu bar application that will keep you up to date on bitcoin prices in 22 different currencies. Bitcoin Bar allows you to choose from several different update intervals and add your wallet holdings to keep track of your personal value in any supported currency.   Version 1.3.1: Fixed an issue where […]"},{"link":"https://nmac.to/blog/luminar-3/","image":"https://nmac.to/wp-content/uploads/2018/12/Luminar-3.png","title":"Luminar 4.3.3 – Powerful, adaptive, configurable image editing","content":"Luminar is the world’s first photo editor that adapts to your style and skill level. It is the supercharged photo software that makes complex editing easy and enjoyable–and it is as responsive and beautiful as your Mac.   Luminar is powered by the latest photo-processing tech handcrafted by a Macphun team with over 10 years of development […]"},{"link":"https://nmac.to/blog/cozy-grove/","image":"https://nmac.to/wp-content/uploads/2021/04/Cozy-Grove.png","title":"Cozy Grov‪e 1.4.0 – A life-sim game about camping on a haunted, ever-changing island","content":"Welcome to Cozy Grove, a life-sim game about camping on a haunted, ever-changing island. As a Spirit Scout, you’ll wander the island’s forest each day, finding new hidden secrets and helping soothe the local ghosts. With a little time and a lot of crafting, you’ll bring colour and joy back to Cozy Grove!   Features: […]"},{"link":"https://nmac.to/blog/deckset/","image":"https://nmac.to/wp-content/uploads/2017/09/Deckset2.png","title":"Deckset 2.0.20 – Turn your notes into beautiful presentations","content":"Deckset is a new, simple way to create presentations. Open your favourite text editor, write down your thoughts and Deckset will turn them into beautiful presentations. Focus on your ideas, not on designing slides.   Deckset comes with seven amazing-looking themes that are designed to work for any audience, whether it’s a business meeting or […]"},{"link":"https://nmac.to/blog/templates-for-pages/","image":"https://nmac.to/wp-content/uploads/2020/07/Templates_for_Pages_6.png","title":"Templates for Pages 7.4 – Over 2,800 templates for Pages","content":"The Templates for Pages set gives a large selection of templates from books and invitations to posters and brochures. Some templates consist of up to 6 different pages, so the package provides a variety of around 2000 layouts to meet your most diverse needs. Each and every layout – from the quintessential elegance of text-only […]"},{"link":"https://nmac.to/blog/eventscripts/","image":"https://nmac.to/wp-content/uploads/2020/04/EventScripts.png","title":"EventScripts 1.32 – Trigger AppleScripts based on specific activities","content":"EventScripts is a simple application for triggering AppleScripts or shell scripts whenever certain events occur. Perhaps you would like to execute a script every time the track changes in iTunes, or whenever your Internet connection drops? Maybe you’d like to trigger a script every time the location of your computer changes? Or maybe you’d like […]"},{"link":"https://nmac.to/blog/password-repository/","image":"https://nmac.to/wp-content/uploads/2018/07/Password-Repository.png","title":"Password Repository 4.2.1 – Password management app","content":"Password Repository is the OS X native app to manage all your passwords and all the related data in a safe way on your Mac. It’s a document-based app, and allows you to manage an unlimited numbers of documents, any containing how many password records (records + related data) you like. Any document you create […]"}]